{"id":"/qna/4124dfd7-c07f-4173-b657-11ab1cc943b9.json", "creationDate":"2014-01-02T03:13:23.613", "body":"\n\nI am trying to use regular expression in Jmeter where in I need to unmatch a particular string. Here is my input test string : <activationCode>insvn</activationCode>\n\nI need to extract the code insvn from it. I tried using the expression :\n[^/<activationCode>]\\w+, but does not yield the required code. I am a newbie to regular expression and i need help with this.", "lastActivityDate":"2014-01-02T03:36:20.137", "title":"Regular Expression to unmatch a particular string", "tags":["regex", "jmeter"], "docScore":0, "comments":[], "answers":[{"id":"/answer/20875780.json", "creationDate":"2014-01-02T03:16:53.707", "body":"\n\nCan you use look-behind assertion in jmeter? If so, you can use thatr regex which will give you a word that follows `<activationCode>`\n\n\t(?<=\\<activationCode\\>)\\w+\n\t\n\nIf your input string is encoded (e.g for HTML), use:\n\n\t(?<=\\&lt;activationCode\\&gt;)\\w+\n\t", "accepted":true, "comments":[{"id":"31326048", "text":"There's plenty of resources but I'm afraid I don't know any particular one that's good for beginners.", "creationDate":"2014-01-02T03:45:24.073", "commenter":null}, {"id":"31325940", "text":"See me edit for an encoded regex", "creationDate":"2014-01-02T03:36:33.043", "commenter":null}, {"id":"31326032", "text":"thanks szymon.. it helped a lot.. i need to explore regex extensively.. i just started to use it yesterday.. do u wish to refer me to some bookd or sites which are good at regex for a beginner and then move onto complex ones?? Thanks in advance :)", "creationDate":"2014-01-02T03:44:00.653", "commenter":null}, {"id":"31325906", "text":"Actually the input test string is somewhat odd like this : &lt;activationCode&gt;ybwg1f&lt;/activationCode&gt;  from which i need to get that code.. when i typed it in the question field it converted itself to a html tag", "creationDate":"2014-01-02T03:33:42.513", "commenter":null}], "itemTally":0, "owner":null}, {"id":"/answer/20875799.json", "creationDate":"2014-01-02T03:19:11.587", "body":"\n\nWhen designing a regular expression in any language for something like this you can match your input string as three groups: (the opening tag, the content, and the closing tag) then select the content from the second group.", "accepted":false, "comments":[], "itemTally":0, "owner":null}], "itemTally":0, "owner":null}