{"UpVotes":"0", "WebsiteUrl":"http://www.phasesofsputnik.com", "Id":"1629", "AccountId":"2194174", "CreationDate":"2013-01-02T04:14:35.237", "AboutMe":"<p><strong>Who, me?</strong><br />\nI'm a MPS candidate at NYU's Interactive Telecommunication Program, and also getting an MA in Russian. I make what I want to see in the world. I studied linguistics and a few languages as an undergrad after changing my mind about majoring in graphic design. I am an amateur lots of things and I love programming, writing (blogs, songs), conceptual art, painting, information design, photography, writing systems, sequential art, film making, animation, logic, all kinds of automata, mathematical cognition, gesture, number systems, fractals, symmetry, and cooking. What else? I'm bipedal, drink coffee, have teeth, am roughly symmetrical, am literate, wish I could fly, and am passionately interested in cognitive scaffolding. My perfect man is some combination of Joseph Brodsky, Carl Sagan, Douglas Hofstadter, and, hey, Ada Lovelace and Frida Khalo, why not?</p>\n\n<hr>\n\n<p><strong>Lists of abstractions relevant to me:</strong></p>\n\n<p><strong>Human languages I work on (which in no way implies fluency):</strong> American Sign Language, Russian, French, Spanish, Mandarin, Latin</p>\n\n<p><strong>Programming languages I work on (which also in no way implies fluency and not including formatting languages like HTML):</strong> Processing, Python, JavaScript, R, Mathematica </p>\n\n<hr>\n\n<p><strong>Quotes I like:</strong></p>\n\n<p>\"In a time of great change, fiction can sometimes provide better understanding than facts alone.\"\n<br />- L. Gordon Crovitz</p>\n\n<p>\"I want to be with those who know secret things. Or else alone.\" \n<br />- Rainer Maria Rilke</p>\n\n<p>\"Computers don’t introduce order anywhere as much as they expose opportunities.\"\n<br />- Alan J. Perlis</p>\n\n<p>\"We are all shaped by the tools we use, in particular: the formalisms we use shape our thinking habits, for better or for worse, and that means that we have to be very careful in the choice of what we learn and teach, for unlearning is not really possible.\"\n<br />- Edsger W. Dijkstra</p>\n\n<p>“Look after goodness and truth, beauty will look after herself.” \n<br />- Eric Gill</p>\n\n<p>\"Any intelligent fool can make things bigger, more complex, and more violent. It takes a touch of genius- and a lot of courage- to move in the opposite direction.\" \n<br />- Albert Einstein</p>\n\n<p>\"A person starts to live when he can live outside himself.\" \n<br />- Albert Einstein</p>\n\n<p>“Do I not destroy my enemies when I make them my friends?” \n<br />- Abraham Lincoln</p>\n", "Age":"25", "Location":"Brooklyn, NY", "DownVotes":"0", "Views":"0", "Reputation":"1", "DisplayName":"Caitlin Weaver", "LastAccessDate":"2013-01-02T04:14:35.237"}