{"OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "comments":[], "Body":"<p>These pronouns are one of the arguments offered in support of the <a href=\"http://en.wikipedia.org/wiki/Indo-Uralic_languages\">Indo-Uralic hypothesis</a>.  But that hypothesis is considered pretty shaky by most linguists: either because they disagree with it or because they think there's just too little evidence to tell.</p>\n\n<p>Anyway, there's other possibilities.  It could also be that PIE and Proto-Uralic weren't especially closely related, but that one borrowed pronouns from the other.  Pronoun borrowing is rare but not impossible.  It could also be that the whole thing is a coincidence.  There are dozens of function words and morphemes in any given language.  Between two neighboring languages, you'd expect a few tempting matches like this purely by chance.</p>\n\n<p>Part of the trouble is, Proto-Uralic is harder to reconstruct than PIE, because the written record for Uralic languages is a lot shallower.  The oldest Uralic writing, from medieval Hungary, is less than a thousand years old.  (By comparison, the oldest IE writing goes back <a href=\"http://en.wikipedia.org/wiki/Hittite_language\">over 3,000 years</a>.)  So it's hard to be very confident about what Proto-Uralic looked like, and harder still to be very confident about its history going further back.  We may just never have enough data to say anything certain about the Uralic/IE connection.</p>\n", "Id":"1006", "ParentId":"1005", "CreationDate":"2011-11-10T18:19:24.747", "Score":"12", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2011-11-10T18:19:24.747", "CommentCount":"1"}