{"comments":[], "Body":"<p>I think another way of getting at the same kind answer is to ask what can be done in morphology that can't be done in syntax. There are approaches to morphology where much of what is traditionally considered with morphology is handled with the same kind of formalism as is used in syntax, and morphology may be referred to as \"word syntax\" on occasion. However, I do not know of approaches to syntax that strive to account for most common syntactic phenomena using the language of morphology. </p>\n\n<p>When word derivations have hierarchical structures, and affixes are given the status of functional heads, it may seem like it's syntax all the way down. There are some facts about inflectional morphology, however, which make syntax-like accounts difficult to pursue to their logical end. (See Ch.1 of Stump 2001 \"Inflectional morphology\" for discussion) One of these is non-concatenative morphology. In affixal morphology, it is not a real problem to treat the stem and affix as constituents of a tree: [[dog]N.root [-z]PL]N -> dogs. When the morphology is non-affixal, there is a dilemma. But how is \"men\" derived? In <a href=\"http://www.ling.upenn.edu/~rnoyer/dm/bib.html\">Distributed Morphology</a>, stem-changes are handled in the following way: a zero affix triggers a \"readjustment rule\" which changes the stem vowel: men = [[man]N.root [zero]PL] -> /man-zero/ -> men. Stump considers this a resort to \"extraordinary means\", since it seems like quite a large coincidence that so many languages should have an identical (zero) affix triggering stem changes. Non-concatenative morphology is a challenge for syntax-like approaches to morphology because the basic units of syntax are considered to have a strict precedence relationship: for two constituents X and Y, X must either precede Y or follow it; tertium non datur.</p>\n\n<p>Another issue is morphologically-conditioned phonological rules. Particular morphemes often trigger specific types of phonological alternations in a language (e.g. changes induced by suffixation of -ity on English nouns), but comparable syntactic phenomena, where, say, a particular type of category triggered an idiosyncratic phonological process in a sister constituent, seem very rare.</p>\n\n<p>A third issue is variable exponence. A given property, when realized morphologically, may have a wide range of unrelated exponents. In a single language, plural on nouns may be realized by either a prefix, a change in the stem vowel, or a change in the tone, depending on the word. Parallel phenomena are hard to find in syntax. </p>\n\n<p>If the issue is whether there should be a distinction at all, I suspect that it is in theory possible to remodel our theory of language structure so that syntax and morphology are modeled in the same way, but at the moment there are quite a few details of morphology which do not lend themselves to a syntactic explanation. </p>\n", "Id":"1021", "ParentId":"836", "CreationDate":"2011-11-14T03:20:05.307", "Score":"5", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2011-11-14T03:20:05.307", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}