{"Body":"<p>In addition to your examples of Italian and Russian, Greek also distinguishes between light blues (γαλάζιο) and dark blues (μπλε)<sup>1</sup>. Several sources<sup>2, 3</sup> also claim that Hungarian distinguishes between light reds (piros) and dark reds (vörös), but it is questionable whether these are actually BCTs.</p>\n\n<p>As far as I'm aware, that is about the extent of 12th BCTs in languages that have been identified.</p>\n\n<p><sup>1</sup> <a href=\"http://www.kennycoventry.org/pdfs/greek.pdf\" rel=\"nofollow\">Basic colour terms in Modern Greek: Twelve terms including two blues</a><br>\n<sup>2</sup> <a href=\"http://en.wikipedia.org/wiki/Hungarian_language#Two_words_for_.22red.22\" rel=\"nofollow\">Wikipedia entry on \"Hungarian language\"</a><br>\n<sup>3</sup> <a href=\"http://www.starchamber.com/colors/colors-and-language.html\" rel=\"nofollow\">Alan Kennedy's Color Language Project</a></p>\n", "Id":"1026", "ParentId":"1025", "LastEditorUserId":"306", "CreationDate":"2011-11-15T18:20:26.207", "OwnerUserId":"30", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-02-27T14:34:49.943", "LastEditedUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "LastActivityDate":"2012-02-27T14:34:49.943", "Score":"4", "CommentCount":"1", "OwnerUser":{"UpVotes":"25", "WebsiteUrl":"http://rintaun.tumblr.com", "Id":"30", "AccountId":"221520", "CreationDate":"2011-09-13T20:56:36.397", "AboutMe":"<p>I graduated from Ohio University in 2011 with a B.A. in Linguistics with a minor in Japanese. Nearly half of my time enrolled at Ohio was spent studying at Chubu University near Nagoya, Japan. I plan eventually to go to graduate school for foreign language education, to become certified to teach Japanese at the secondary level.</p>\n\n<p>In the mean time, however, I program (primarily in PHP and SQL). I also recently began working as a freelance Japanese-to-English translator, though I've translated anime and manga as a hobby in the past.</p>\n", "Age":"27", "Location":"Pittsburgh, PA", "DownVotes":"3", "Views":"10", "Reputation":"486", "DisplayName":"rintaun", "LastAccessDate":"2013-12-04T21:12:24.253"}}