{"OwnerUser":{"UpVotes":"126", "WebsiteUrl":"http://www.superlinguo.com", "Id":"64", "AccountId":"900445", "CreationDate":"2011-09-13T21:45:12.903", "AboutMe":"<p>I have a PhD in linguistics. My areas of interest include language documentation, Tibeto-Burman linguistics, gesture, language play, LOLspeak, evidentiality and making bad puns. I blog about language and linguistics at www.superlinguo.com</p>\n", "Age":"29", "Location":"Australia", "DownVotes":"6", "Views":"40", "Reputation":"2016", "DisplayName":"LaurenG", "LastAccessDate":"2013-10-26T00:28:12.653"}, "comments":[], "Body":"<p>When you ask '[i]s the 12th Basic Color Term (BCT) always light blue' I assume you're referring to work from Berlin and Kay's 1969 book \"Basic Color Terms: Their Universality and Evolution\" (U Cal Press). This book and subsequent work argued that languages acquire colours in a systematic order, so a language with only 2 terms would have a light/dark or warm/cold distinction, and then the next addition would be red, followed by green or yellow, then the other, then blue, etc.</p>\n\n<p>Although Berlin and Kay's work was a real innovation, it has not stood up to scrutiny over the years. Not only have Berlin and Kay relaxed their finding, but they've been challenged by others. Some of the better reads on this topic are:</p>\n\n<ul>\n<li>Saunders, Barbara (2000) Revisiting basic color terms. Journal of the Royal Anthropological Institute 6, 81-99.</li>\n<li>Levinson, Stephen C. (2000). Yélî Dnye and the theory of basic color terms. Journal of Linguistic Anthropology 10(1):3-55.</li>\n</ul>\n\n<p>Figuring out what is a 'basic colour term' (as opposed to a historical compound) is incredibly difficult, as is figuring out the order in which languages acquire them. Figuring out the order of colour term inclusion in a language is incredibly hard once you include more languages than Berlin and Kay original looked at. Even in their original data set they are incredibly flexible once they get beyond the basic few terms. This is a summary of chapter 2 of their book (of which they have a not-very readable summary on page 17):</p>\n\n<ol>\n<li>All languages contain terms for black and white.</li>\n<li>If a language contains three terms, then it contains a term for red.</li>\n<li>If a language contains four terms, then it contains a term for either green or yellow    (but not both).</li>\n<li>If a language contains five terms, then it contains terms for both green and yellow.</li>\n<li>If a language contains six terms, then it contains a term for blue.</li>\n<li>If a language contains seven terms, then it contains a term for brown.</li>\n<li>If a language contains eight or more terms, then it contains a term for purple, pink, orange, and/or grey.</li>\n</ol>\n\n<p>So by the seventh colour term they basically concede that there is no way to predict order of inclusion in a language. Given that their constraints have been even further relaxed since this analysis I would not find it surprising if there were a language where a separate lexical item for 'light blue' were found before others in rule 7 above.</p>\n", "Id":"1027", "ParentId":"1025", "CreationDate":"2011-11-15T20:43:41.397", "Score":"14", "PostTypeId":"2", "OwnerUserId":"64", "LastActivityDate":"2011-11-15T20:43:41.397", "CommentCount":"3"}