{"OwnerUser":{"UpVotes":"30", "WebsiteUrl":"http://www.drangle.com/~james", "Id":"511", "AccountId":"513739", "CreationDate":"2011-11-16T02:03:12.387", "AboutMe":"<p>I’m a PhD student in linguistics at the University of British Columbia. I work on Tlingit, a critically endangered language of northern British Columbia, the Yukon, and southeast Alaska. I also have extensive interests in the related Athabaskan languages, language documentation theory and practice, orthography design, morphological theory, phonological theory, and the syntax of noun phrases and relativization.</p>\n\n<p>I’ve been using TeX and friends for more than a decade. I use Xe(La)TeX, fontspec, memoir, and BibLaTeX extensively, and I am working on a BibLaTeX style for linguistics publications. Other packages I use frequently include pst-jtree, expex, and booktabs. I’m learning PGF/TikZ and considering developing a library to produce autosegmental representation diagrams. I do my writing in TeXShop, and my TeX programming in MacVim, having abandoned FSF Emacs and XEmacs due to their perpetually disappointing Unicode rendering.</p>\n", "Age":"35", "Location":"Vancouver, Canada", "DownVotes":"5", "Views":"13", "Reputation":"866", "DisplayName":"James C.", "LastAccessDate":"2013-11-03T19:13:48.097"}, "comments":[], "Body":"<p>Obviation is a little hard to grasp for Indo-European language speakers, and confounding this is the problem that it is not necessarily exactly the same phenomenon from language family to language family where it is described. It was first described in Algonquian languages, and this is the “canonical” obviation system. The basic idea is that it is a <em>discourse-sensitive</em> morphosyntactic mechanism that is used to distinguish different third person elements in a sentence. (Note that “obviative” ≡ “obviate” generally.)</p>\n\n<p>The following info is abstracted from my notes on obviation in an interface syntax seminar by Rose-Marie Déchaine &amp; Martina Wiltschko.</p>\n\n<blockquote>In any context, there is a distinction, among animate third persons, between proximate and obviative. Only one animate third person, be it singular or plural, is proximate; all others are in obviative form. The proximate third person represents the topic of discourse, the person nearest the speaker’s point of view, or the person ealier spoken of and already known.” (Bloomfield 1962: 38)</blockquote>\n\n<p>If there is more than one 3rd person argument then one is proximate and all others are obviate (Plains Cree, Algonquian):</p>\n\n<pre><code>miyê-w   misatim-wa ôhô  kiwêyni-wa  êwakô\ngive-3SG horse-OBV  that old.man-OBV this\n‘He(PROX) gave a horse(OBV) to the old man(OBV)’\n</code></pre>\n\n<p>Contrast:</p>\n\n<pre><code>*miyê-w   misatim ôhô  kiwêyniw êwakô\n give-3SG horse   that old.man  this\n</code></pre>\n\n<p>Proximate marking indicates a salient element of the discourse and continuity with the topic. Obviate marking indicates that the marked discourse referent ≠ the proximate topic.</p>\n\n<p>Obviation contrasts with switch-reference:</p>\n\n<pre><code>Condition   Description                             Switch-Ref. Plains Cree Obv.\n----------- --------------------------------------- ----------- ----------------\nlocality    restricted to linearly adjacent clauses yes         no\ndependency  syntactically or semantically dependent yes         yes\nrealization contrastive suffixation on dependent V  yes         yes\nsubject     both referents must be subjects         yes         no\nfunction    codes co-/dis-joint reference           yes         yes\n</code></pre>\n\n<p>So there are the following parallels between obviation and switch-reference:</p>\n\n<pre><code>Obviation                   Switch-Reference\n--------------------------- -----------------------------\nobviate                     different-subject\nproximate                   same-subject\n(dis)anaphoric w.r.t. Topic (dis)anaphoric w.r.t. Subject\n</code></pre>\n\n<p>We also have to note “logophoricity”, where there are marked differences between a “weak” and “strong” pronominal form, and the strong or possessive pronoun is embedded under a certain class of verbs (usually quotative verbs) where it is obligatorily coreferent with an argument in the matrix clause.</p>\n\n<blockquote>\nIn argument positions of certain complement sentences, many Kwa languages contrast a third person pronominal clitic with a distinct third person form: a clitic or a nonclitic, depending on the language. For one item of this contrast set, the antecedent is the ‘Source’ of subject argument of a matrix clause which selects the embedded sentence either locally or at long distance. Hagège (1974) and Clements (1979) call this morpheme a logophoric pronoun. The other item lacks this reading, and it thus a non­ or anti­logophor. (Manfredi 1995: 91)</blockquote>\n\n<p>This has to be distinguished from obviation just as switch-reference is distinct. They all have similar underlying properties, but this is a largely theoretical issue that I won’t go into here.</p>\n\n<p>Overt DPs (determiner phrases, encompassing NPs) are the primary locus of obviate marking.\nWith (direct-form) transitive verbs, the verb agrees only with the subject or object, and obviation of object is only marked on the overt DP (Plains Cree).</p>\n\n<pre><code>...êkota kâ-wâpamâ-cik iyâhciyiniw-ak ôhi   nêhiyaw-*a*\n   there COMP-see-3PL  Blackfoot-PL   these Cree-OBV\n‘...there the Blackfoot(PROX) caught sight of the Cree(OBV)’\n</code></pre>\n\n<p>The problem is that obviation, although it generally seems to be a discourse-related phenomenon, is not actually conditioned only by discourse. Instead, there are other things that can trigger obviate marking. For example, possessed nouns have obligatory obviate marking because they involve the presence of two DPs.</p>\n\n<pre><code>aw   îskwêw     o-nâpem-a\nthis woman.PROX 3.POSS-husband-OBV\n‘this woman(PROX)’s husband(OBV)’\n</code></pre>\n\n<p>Obviate marking is incompatible with quantifier binding. Proximate marked DPs can be quantifier-bound (Swampy Cree).</p>\n\n<pre><code>kahkinaw iskwêw₁ kî-itwê-w₁   ê-wê-sipwêhtê-t₁\nevery    woman   PAST-say-3SG COMP-FUT-leave-3SG\n‘Every woman(PROX) said that she₁(PROX) would leave’\n</code></pre>\n\n<p>But obviate marked DPs can’t be quantifier bound.</p>\n\n<pre><code>*cân itênihtam-∅₁ kahkinaw iskwêw ê-kî-itwê-*ni*-t ê-wî-sipwêht-ê-*ni*-t\n John think-3SG   every    woman  C-PREV-say-D-3  C-FUT-leave-D-3\n‘John(PROX) thinks that every woman(OBV) said she would leave’\n\ncân  itênihtan-∅ kahkinaw iskwêw ê-kî-itwê-t  ê-wî-sipwêht-ê-t\nJohn think-3SG   every    woman  C-PREV-say-3 C-FUT-leave-3\n‘John(PROX) thinks that every woman said she would leave’\n</code></pre>\n\n<p>(This involves some verb morphology that I don’t quite grok, so I’ll stick it up hoping that someone knowing Algonquian languages can explain it.)</p>\n\n<p>Also, proximate marked arguments must precede (c-command) obviate arguments. So:</p>\n\n<ul>\n<li>V S(PROX) > O(OBV) okay</li>\n<li>V O(PROX) > S(OBV) weird</li>\n<li>O(PROX) V S(OBV) bad</li>\n</ul>\n\n<p>Muehlbauer (2009: 335) goes through a set of similar sentences to demonstrate these ordering restrictions.</p>\n\n<p>Bibliography (a random sampling):</p>\n\n<ul>\n<li>Adesola, O.P. 2006. A-bar dependencies in the Yoruba reference-tracking system. <i>Lingua</i> 116.12: 2068–2106.</li>\n<li>Aissen, J. 1997. On the syntax of obviation. <i>Language</i> 73.4: 705–750.</li>\n<li>Austin, P. 1981. Switch‐Reference in Australia. <i>Language</i> 57.2: 309–334.</li>\n<li>Bloomfield, L. 1962. <i>The Menomini language</i>. Charles F. Hockett (ed). New Haven, CT: Yale University Press.</li>\n<li>Cook, C. 2008. <i>The syntax and semantics of clause‐typing in Plains Cree</i>. Vancouver: UBC, PhD dissertation.</li>\n<li>Davis, H. 2009. Cross‐linguistic variation in anaphoric dependencies: evidence from the Pacific Northwest. <i>Natural Language and Linguistic Theory</i> 27.1: 1–43.</li>\n<li>Finer, D. L. 1985. The syntax of switch‐reference. <i>Linguistic Inquiry</i> 16.1: 35–55.</li>\n<li>Grafstein, A. 1988. The Algonquian obviative and the Binding Theory. <i>NELS</i> 18.</li>\n<li>Grafstein, A. 1989. Disjoint reference in a free word order language. In D. Gerdts\n&amp; K. Michelson (eds.), <i>Native American Languages in Theoretical Perspective</i>. Albany, NY: SUNY Press.</li>\n<li>Huang, Y. 2000. <i>Anaphora: A cross‐linguistic study</i>. Oxford: OUP.</li>\n<li>Junker, M.-O. 2004. Focus, obviation and word order in East Cree. <i>Lingua</i> 114.3: 345–365.</li>\n<li>Kiparsky, P. 2002. Disjoint reference and the typology of pronouns. Pp. 179–225 in I. Kaufman &amp; B. Stiebels (eds.), <i>More than Words: A Festschrift for Dieter Wunderlich</i>. Berlin: Akademie Verlag.</li>\n<li>Mithun, M. 2008. The extension of dependency beyond the sentence. <i>Language</i> 84.1: 69–119.</li>\n<li>Muehlbauer, J. 2009. Logophoricity in Plains Cree: From, content, and context. (Oxford studies in endangered languages). Oxford: OUP.</li>\n<li>Oshima, D. Y. 2007. Syntactic direction and obviation as empathy‐based phenomenon: A typological approach. <i>Linguistics</i> 45.4: 727–763.</li>\n<li>Willie, M. 1991. <i>Navajo Pronouns and Obviation</i>. University of Arizona, PhD dissertation.</li>\n<li>Zavala, R. 2007. Inversion and obviation in Mesoamerica. Pp. 267–306 in P. K. Austin and A. Simpson (eds.), <i>Endangered Languages</i> 14. Hamburg: Helmult Buske.</li>\n</ul>\n", "Id":"1056", "ParentId":"1054", "CreationDate":"2011-11-21T21:09:17.713", "Score":"12", "PostTypeId":"2", "OwnerUserId":"511", "LastActivityDate":"2011-11-21T21:09:17.713", "CommentCount":"1"}