{"Body":"<p>No, because German has <a href=\"http://en.wikipedia.org/wiki/V2_word_order\">V2</a> basic constituent order, not SOV.</p>\n\n<p>V2 word order is observed when the the finite verb must be the second constituent of the clause. In many German sentences, the auxiliary verb is the one that is finite, and so it must be in second position. The main meaning-conveying verb appears in a non-finite form, and is flexible with respect to which position it occurs in, and typically occurs in final position. For this reason, German can be mistaken as an SOV language. The German translation of \"Peter wants to give the boy the book\" is usually rendered as:</p>\n\n<pre><code>Peter wollte   dem     Jungen  das     Buch schenken.\nPeter want.PST the.DAT boy.DAT the.ACC book give.INF\n</code></pre>\n\n<p>But beyond the requirement that the finite verb be second, the word order is flexible. The following versions are also all acceptable.</p>\n\n<pre><code>Dem Jungen wollte Peter das Buch schenken.\nDas Buch wollte Peter dem Jungen schenken.\nSchenken wollte Peter dem Jungen das Buch.\n</code></pre>\n\n<p>(data is from <a href=\"http://depts.washington.edu/hpsg2011/pp/Wetta.pdf\">Wetta 2011</a>)</p>\n\n<p>In the sentence \"Ich bin ein Berliner\" there is only one verb, which is inflected, and so it must be in second position, after \"Ich\". </p>\n\n<p>In a true SOV language, either the finite verb must be clause final, or all of the verbs must appear at the end of the clause if there is more than one. Here is an example of a serial verb construction in Barai (Olson 1981, qtd, in Foley 2010), which is a strict verb-final language.</p>\n\n<pre><code>namot    tau             da-gwe-r    witki-r     am-ta\nman      sugarcane       foc-bite-r  tear-r      eat-pres\n‘The man is biting the sugarcane off and eating it.’\n</code></pre>\n\n<p>Although languages are often referred to as having V2 word order, it is more correct to say that V2 word order is a property of clausal constructions. Not all clause types in German, for example, have V2 word order; subordinate and question clauses do not, but main declarative clauses do.</p>\n\n<p>Foley, W A 2010, Events and serial verb constructions, Complex Predicates: Cross-Linguistic Perspectives on Event Structure, Cambridge University Press, Cambridge, 1, 79-109</p>\n", "Id":"1058", "ParentId":"1057", "LastEditorUserId":"483", "CreationDate":"2011-11-21T23:06:40.030", "OwnerUserId":"483", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-11-22T00:24:58.840", "LastEditedUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "LastActivityDate":"2011-11-22T00:24:58.840", "Score":"27", "CommentCount":"3", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}