{"OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "comments":[], "Body":"<p>Since the question is about determining the morphological profile of a language, the issue of determining word boundaries is quite central. However, I don't agree with @Dan Milway that native speaker intuitions are relevant here. </p>\n\n<p>Briefly, two arguments against native speaker intuition data on assessing wordhood: first, in practice morphologists do not support claims about wordhood on native speaker intuitions; instead, they offer language-internal evidence. Wordhood judgments have never served as a significant evidential base for morphological theory in the way grammaticality judgments have for syntactic theory. Second, (and not unrelated) native speaker judgments might somehow fail to reflect genuine linguistic intuitions (i.e. they may reflect spurious judgments) or may be inconsistent.</p>\n\n<p>In agglutinative languages, the grammatical word typically has a templatic structure: there is a fixed order of morphemes in the word, such that the word grammar can be described by a fininte state grammar. For example, the verbal word in Athabaskan languages can be schematized according to the following template (Hoijer 1971, qtd. in Good 2011)</p>\n\n<pre><code>1 Zero, one or more adverbial prefixes\n2 The prefix for the iterative paradigm (lacking in some languages)\n3 A pluralizing prefix\n4 An object pronoun prefix, found only in transitive verbs and some passives\n5 A deictic subject prefix\n6 Zero, one, or two adverbial prefixes\n7 A prefix marking mode, tense, or aspect\n8 A subject pronoun prefix\n9 A classifier prefix\n10 A stem\n</code></pre>\n\n<p>On the other hand, there are good reasons for treating FOR, THE, and CATS as separate grammatical words in the English \"for the cats\". There is no strict constraint on the sequencing and adjacency of the preposition, determiner and head noun in this phrase. It is possible to add words between FOR and THE, e.g. \"for the majority of the cats\", and it is possible to add words between THE and CATS, e.g. \"for the seven most unexpectedly agressive cats\". There are even constructions where it is possible to disrupt the usual linear order of FOR, THE, and CATS, e.g. \"The cats I bought the food for...\"; These kinds of things should be very restricted or completely impossible in a language where the equivalent of \"for the cats\" is a single grammatical word. </p>\n\n<p>As for the Basque case, I am understanding that the Basque comitative postposition does not have a specific position with respect to a head noun, (i.e. it is at the end of the NP) so it not be considered an affix by the criterion I named above. One possibility is that it's a clitic (its linear position is not fixed, but it forms a phonological word with the adjacent material). Since the shape of =(re)kin is depend on the adjacent element, that is probably a good reason for writing it without a space. See <a href=\"https://netfiles.uiuc.edu/jihualde/www/objects/pubs/Hualde%20Postpositions.pdf\">Hualde 2002</a> on Basque postpositions.</p>\n\n<p>Good, J. (2011) The typology of Templates. Language and Linguistics Compass\nVolume 5, Issue 10, pages 731–747, October 2011</p>\n\n<p>Hualde, J.I. (2002) Regarding Basque postpositions and related matters\nin Erramu Boneta: A Festschrift for Rudolf P.G. de Rijk, ed. by Xabier Artiagoitia, Patxi\nGoenaga &amp; Joseba Lakarra, 325-339. Bilbao:Univ. del PaísVasco/Euskal Herriko Unib. Supplements of ASJU 44</p>\n", "Id":"1075", "ParentId":"1069", "CreationDate":"2011-11-25T23:40:39.067", "Score":"24", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2011-11-25T23:40:39.067", "CommentCount":"2"}