{"Body":"<p>A partial solution proposed by Comrie (1989:42--52) is to break the traditional scale up into two orthogonal scales, an index of fusion and an index of synthesis. The index of fusion relates to the extent to which morphemes are segmentable within a word, and the index of synthesis relates to the number of morphemes on average in a word. Polysynthetic languages would have a low index of fusion and a high index of synthesis. Agglutinating languages would have a low index of fusion, and an intermediate index of synthesis. Comrie notes labels associated with morphological typology have been around for a long time, \"...and it is to be hoped that general linguistics textbooks will not continue indefinitely to give the impression that this is the only, or most insightful, way of classifying languages typologically.\" (1989:52)</p>\n\n<p>I might add that another useful pair of distinctions in doing morphological comparison is that between segmental and non-segmental morphology, and between concatenative and non-concatenative morphology.</p>\n\n<p>However, the interesting discussion that came up in the context of the related question concerns a more general issue which has provoked much discussion lately. The issues is whether descriptive labels used by linguists, e.g. \"word\", \"subject\", \"dative case\", \"[+voice]\", \"noun\" can be recognized as being instantiated in individual languages. Some representative works are Dryer (1997), Croft (2000), and especially Haspelmath (2010). These authors suggest that the answer to this question is no (though their position is considered controversial). These labels do not mean the same thing in different languages, but instead refer to comparative concepts that tend to be useful in comparing languages. In other words, inconsistencies are bound to result when we try to apply the same set of tests for, say, wordhood, to different languages. This finding doesn't mean that the concept of word is not useful in any given language, it just means that the notion will mean different things in different languages, and may be more or less useful in describing grammatical patterns in different languages.</p>\n\n<p>Comrie, B. (1989) Language universals and linguistic typology. 2nd ed.</p>\n\n<p><a href=\"http://www.reference-global.com/doi/abs/10.1515/9783110806120.65\">Croft, W. (2000)</a> Parts of speech as typological universals and as language particular categories. Approaches to the typology of word classes, ed. Petra Maria Vogel and Bernard Comrie, 65-102. Berlin: Mouton de Gruyter.</p>\n\n<p>Dryer, Matthew S. 1997 \"<a href=\"http://linguistics.buffalo.edu/people/faculty/dryer/dryer/DryerAreGRsUniversal.PDF\">Are Grammatical Relations Universal?</a>\" In Essays on Language Function and Language Type: Dedicated to T. Givon, edited by Joan Bybee, John Haiman, and Sandra Thompson, pp. 115 - 143. Amsterdam: John Benjamins.</p>\n\n<p>Haspelmath, M. (2010) <a href=\"http://www.eva.mpg.de/lingua/staff/haspelmath/pdf/ComparativeConcepts.pdf\">Comparative concepts and descriptive categories in cross-linguistic studies</a>. Language 86(3). 663-687</p>\n", "Id":"1085", "ParentId":"1083", "LastEditorUserId":"483", "CreationDate":"2011-11-28T20:32:41.697", "OwnerUserId":"483", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-11-28T23:13:33.127", "LastEditedUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "LastActivityDate":"2011-11-28T23:13:33.127", "Score":"6", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}