{"Body":"<p>I'm not entirely sure what exactly you're interested in: </p>\n\n<ol>\n<li>differences in the Adj+N order between English vs. French;</li>\n<li>differences in French between Adj+N (less common) vs. N+Adj (predominant);</li>\n<li>differences in French involving homonymous adjectives (grand, ancien, pauvre etc.)</li>\n</ol>\n\n<p>In the GB framework, at its late stage, variation in the Adj+N order was explained by the strength of the Num-head. In English, Num is a weak head and, thus, no movement occurs. In some/all (?) Romance languages, Num is a strong head and it makes N move to Num. Some evidence that might support that analysis: in some Romance languages, adjectives express number (unlike in English). Also <a href=\"http://lear.unive.it/bitstream/10278/408/1/3.2.pdf\">Cinque 1994</a> proposed that \"different types of adjectives serve as specifiers to different types of head\" (Radford 2004: 179). So, that's the GB framework.</p>\n\n<p>Denis Bouchard has consistently argued that in French there is a difference in semantics between Adj+N and N+Adj (e.g. homonymous \"grand\" as in ce grand homme 'this great man' vs. \"grand\" as in cet homme grand 'this tall man'); see, for example, <a href=\"http://www.reference-global.com/doi/abs/10.1515/prbs.1998.10.2.139\">Bouchard 1998</a> or <a href=\"http://books.google.com/books?id=khSizvUe0jgC&amp;lpg=PP1&amp;dq=denis%20bouchard&amp;pg=PP8#v=onepage&amp;q=denis%20bouchard&amp;f=false\">Bouchard 2002</a>. His proposal is that variation in the Adj+N order is caused by \"choices\" languages employ to express Number (D or N). <a href=\"http://www.unige.ch/lettres/linge/syntaxe/journal/pdf_volume_one/article3_laenzlinger.pdf\">Laenzlinger 2000</a> is also a very good paper. By the way, I would read Baker's book with a degree of healthy scepticism; see, for example, Larry Trask's <a href=\"http://human-nature.com/nibbs/02/trask.html\">review</a></p>\n\n<p>I would like to post a very important quote re: parameters and Minimalist Program from Gallego 2011 (The Oxford Handbook of Linguistic Minimalism): \"<strong>Minimalism is probably not the best framework to investigate parameters</strong> [...]. <strong>The early P&amp;P thesis that variation is encoded in the syntax</strong> [...] <strong>must be abandoned</strong> [...].\" I'm afraid that <em>The atoms of language</em> reflects old-fashioned ideas of the P&amp;P framework, popular in the 1980s-early 90s.</p>\n\n<p><strong>NB</strong>: A reply to Mitch's last question</p>\n\n<p>(too long for posting as a comment)</p>\n\n<p>Ok, I'll try to explain it in a simpler way. Since the question was about parameters, the implication is that the answer should be couched in generative syntax (its version popular in the 1980s). The basic tenet of generative syntax is that constituents are organized hierarchically. If you take A and B and put them together (Merge), one of them will be the head and the other its dependent . The head determines the morphosyntactic properties of the whole phrase {AB}; in other words, if A is the head and it is a noun, then the whole phrase {AB} will be a noun. In generative syntax functional heads are posited, too (besides obvious lexical heads). Functional heads may express tense (T), finiteness, mood,  senternce function (interrogative, affirmative - C), negation (Neg) etc- there is a lot of variation there. They may be overtly expressed (like the past tense in English -ed) or covertly expressed (e.g., accusative on object NPs). Heads can be strong (trigger movement) or weak (don't trigger movement). Since they wanted to explain why adjectives can be used before as well as after nouns in some languages, they suggested there should be some functional head (between prenominal and postnominal adjectives) where a noun moves to. I don't remember who proposed it was the Num-head (Andrew Radford says it's Picallo 1991 and Ritter 1991). There is a really nice picture (74) on page 179 in Radford's textbook (2004) that explains it nicely. I'll try to upload it tomorrow.</p>\n", "Id":"1165", "ParentId":"1163", "LastEditorUserId":"445", "CreationDate":"2011-12-16T19:36:55.733", "OwnerUserId":"445", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-12-18T03:46:28.983", "LastEditedUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}, "LastActivityDate":"2011-12-18T03:46:28.983", "Score":"6", "CommentCount":"7", "OwnerUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}}