{"OwnerUser":{"UpVotes":"432", "WebsiteUrl":"", "Location":"United States", "Id":"4", "DownVotes":"2", "AccountId":"167219", "Views":"42", "Reputation":"1906", "CreationDate":"2011-09-13T20:24:01.087", "DisplayName":"Mitch", "LastAccessDate":"2014-01-15T11:56:51.610", "AboutMe":"<p>Native speaker of American English (AmE) with touches of Southern AmE.\nProficient in French and German. Elementary knowledge of Mandarin. Basic knowledge of linguistics.</p>\n"}, "comments":[], "Body":"<p>There are qualitative and quantitative measures for 'distance'.</p>\n\n<p>Qualitatively, many languages are easier to compare simply by know something about their family tree, which is implicitly recognizable (if one is lucky enough to know so many languages so well), by comparing vocabulary lists, syntax rules/systems, and phonology. The more common elements the closer they are. Mandarin and Cantonese are not mutually intelligible, but both have rich tonal systems, similar isolating grammars, and fairly simple phonological rules to map cognate words. Likewise French and Italian have a set of comparisons (similar conjugation/gender rules) and fairly regular rules mapping cognates. And the two sets of differences, those between Mandarin/Cantonese, and those between French/Spanish are of the same scale. The difference between French and German is so much larger than between Mandarin/Cantonese that one would be hard pressed to say they are of similar distance. </p>\n\n<p>Quantitatively, one can define distance mathematically, by collecting a set of quantitative features in each language, and then defining a <a href=\"http://en.wikipedia.org/wiki/Distance_function\">distance function</a> that calculates an exact positive real number out of a combination of all the differences of these features. Then one can do a simple numerical comparison, the distance between X and Y and the distance between Z and W. One can go further and use a <a href=\"http://en.wikipedia.org/wiki/Cluster_analysis\">clustering algorithm</a> to create a formal family tree of all languages of concern.</p>\n\n<p>Presumably, the utility of a distance function would be to predict the difficulty in language learning or translation (machine or human); the further the distance, the more changes would need to be navigated. At some point, a distance will be meaningless; the difference between French and Swahili is just too much to settle qualitatively or quantitatively to then bother comparing with some other distance.</p>\n", "Id":"1207", "ParentId":"1206", "CreationDate":"2011-12-28T03:32:27.280", "Score":"6", "PostTypeId":"2", "OwnerUserId":"4", "LastActivityDate":"2011-12-28T03:32:27.280", "CommentCount":"1"}