{"Body":"<p>As you can probably guess, there are several ways to determine the etymology of words. Probably the most reliable is to look at the genetic relationships between languages - i.e. we know that a word comes from Latin or Greek because it is preserved in a similar form across several modern languages, and we have historical documents in the original language that also use this word (or a very similar form). </p>\n\n<p>Often, a historical phonological process such as <a href=\"http://en.wikipedia.org/wiki/I-mutation\" rel=\"nofollow\">I-mutation (umlaut)</a> is observed for a group of words, which can help to prove that they came from the same language.</p>\n\n<p>The etymology of a word becomes more speculative the further back we go - we can be pretty sure that a word came from Sanskrit, Arabic, Latin, or Greek, because these languages are (relatively) modern and well-documented. However, determining which <a href=\"http://en.wikipedia.org/wiki/Proto-language\" rel=\"nofollow\">proto-language</a> a word is descended from can be more controversial. </p>\n\n<p>In summary, historical documentation and phonological similarity are the two main ways to determine a word's etymology. </p>\n", "Id":"1279", "ParentId":"1277", "LastEditorUserId":"51", "CreationDate":"2012-01-14T16:41:31.063", "OwnerUserId":"550", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-01-17T18:48:24.760", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2012-01-17T18:48:24.760", "Score":"7", "CommentCount":"1", "OwnerUser":{"UpVotes":"4", "DownVotes":"0", "Id":"550", "AccountId":"1076951", "Views":"3", "Reputation":"116", "CreationDate":"2011-12-01T07:09:16.767", "DisplayName":"chokamp", "LastAccessDate":"2012-03-28T16:55:28.947", "AboutMe":"<p>I'm a graduate student in linguistics at the University of North Texas. I'm trying to improve my programming skills; currently hacking fun things together in perl, python, and java. always open to learning new stuff...</p>\n"}}