{"OwnerUser":{"UpVotes":"127", "WebsiteUrl":"", "Location":"Netherlands", "Id":"444", "DownVotes":"2", "AccountId":"902812", "Views":"19", "Reputation":"934", "CreationDate":"2011-10-23T14:14:27.380", "DisplayName":"arjan", "LastAccessDate":"2014-01-14T14:07:55.473", "AboutMe":""}, "comments":[], "Body":"<p>Beeman writes \"<em>Within the same linguistic family it is expected that a large proportion of linguistic material will be recognizably related due to the derivation of that material from a common linguistic ancestor.</em>\", and presents a list where he assumes this process did not take place: \"<em>These words seem to be coined anew by each \npopulation group.</em>\" (1) The list presented in the article shows some interesting patterns, but let's take a look the words from the Indo-European languages:</p>\n\n<p>Albanian: flutur<br>\nBulgarian: peperuda<br>\nIcelandic: fithrildi<br>\nSwedish: fjril<br>\nDutch: vlinder (?)<br>\nGreek petalou'da<br>\nIrish: feileacan<br>\nLatin: papilio<br>\nFrench papillon<br>\nItalian: farfalla<br>\nRumanian: fluturi<br>\nPortuguese: borboleta<br>\nPersian: parvaneh  </p>\n\n<p>It seems these could all be plausibly demonstrated to have a common origin. Compare this entry of Latin \"pāpiliō\" (2):</p>\n\n<blockquote>\n  <p>Indo-European cognates: OPr. penpalo 'quail', OPr. pepelis , [pl.]\n  pippalins 'bird', Lith. píepala , Latv. paîpala , Ru. pérepel , Cz.\n  přepel , křepel 'quail', OIc. fífrildi , OE fīfealde , OHG fīfaltra ,\n  MHG fīfalter 'butterfly' &lt; PGm.*fīfalðrōn-.<br>\n  <strong>Etymology</strong><br>\n  Pā -piliō can reflect reduplication of a root *pl- 'to\n  fly, flutter', which has also served to build the word for 'quail' in\n  BSl. and 'butterfly' in Gm. It seems unlikely that this root *pl- is a\n  very early variant of PIE roots such as *pleu- 'to swim, wander',\n  *pleh3- 'to swim, float', *pelh1- 'to swing'.</p>\n</blockquote>\n\n<p>Some forms that are conspicuously not cognates are butterfly, sommerfugl, Schmetterling, mariposa, but most of these languages used to have related forms (Old English, Old Norse, Middle High German, ...).</p>\n\n<p>A statement like \"<em>The explanation for this phenomenon defies analysis using the traditional techniques of historical linguistics</em>\" seem untenable in light of the IE languages. Why would sound symbolism be incompatible with regular sound change?\nMy guess is \"repetitious sound symbolism\" may well have been going on, but the more recent innovations would seem to indicate that this is not so productive anymore (given forms like sommerfugl, Schmetterling, butterfly), at least in European languages. It's certainly not supportive of the idea that \"<em>the linguistic realization for butterfly might be something welling up from the most basic cognitive creative processes</em>\". (I mean, sound symbolism is a valid field, but I don't see how 'butterfly' constitutes a special case, or that it's not amenable to historical-linguistic investigation).</p>\n\n<p>P.S. But, adding to the list he presents, I have some more forms for 'butterfly' containing a labial and a liquid:\nQuechua (most variants, including Cuzco, Ayacucho, Wanka, Bolivian, Imbabura, Ecuadorian): pillpintu or pilpintu. Also: chabul, kapila (Imbabura Quechua, Quichua); pillpash (Ancash Quechua).<br>\nAymara: taparaku.</p>\n\n<p>(1) The author's use of the term 'borrowing' here is confusing, since in linguistics this is used to refer to horizontal, rather than vertical transmission.</p>\n\n<p>(2) Michiel de Vaan. \"pāpiliō\" in: Etymological Dictionary of Latin and the other Italic Languages. Indo-European Etymological Dictionaries Online. Edited by Alexander Lubotsky. Brill, 2012.</p>\n", "Id":"1287", "ParentId":"1282", "CreationDate":"2012-01-16T17:13:41.650", "Score":"1", "PostTypeId":"2", "OwnerUserId":"444", "LastActivityDate":"2012-01-16T17:13:41.650", "CommentCount":"4"}