{"OwnerDisplayName":"user325", "Body":"<p>I'm going to try to answer the spirit of the title question, although I have no formal training semantics and thus cannot answer some of the more specific questions you pose in the body of the answer (I'm more interested in morphology).</p>\n\n<p>Simply put, there is often a disconnect between semantics and morphology, and it is something of a quixotic endeavor to try to fully reconcile them.</p>\n\n<p>However you define plurality, there are cases in which the usual markers to denote it do not correspond to a concept of plural, as you've pointed out. For example, \"scissors\" is morphologically plural (this is evidenced by verb agreement:  the scissors <em>are</em> ...) but semantically refers only to one object (a case of plurale tantum). This is probably also what is happening with <em>vacances</em>: the use of <em>vacance</em> in the plural took on a specialized meaning which then became fossilized as a plurale tantum. These cases are problematic even if one accepts that there is a morphological \"zero\" plural in English which accounts for pairs of ambiguous plurality like deer-deer, fish-fish. Add in <a href=\"http://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=3&amp;ved=0CDkQFjAC&amp;url=http://www.sfu.ca/~jeffpell/Ling480.08/WisniewskiReallyFinal.doc&amp;ei=dkkXT9CqLIXn0QG8sIz1Ag&amp;usg=AFQjCNHBIGfxzChLHsQ97a-BmQBypa3TrA&amp;sig2=BaTu2L1JBiYeFg6a3Ukfhg\" rel=\"nofollow\">collective nouns</a>, which are morphologically singular though they may be considered \"plurally\" semantically or even in other parts of the morphosyntax (e.g. \"My family is/are happy to see you\") and what seems to be a (relatively) straightforward semantic notion of plurality becomes quite muddled in the morphology indeed! (Also, there is the phenomena of <a href=\"http://internal.psychology.illinois.edu/~kbock/bockpubs/Bock%20Eberhard%20Cutting%20Meyer%20Schriefers%202001.pdf\" rel=\"nofollow\">plural attraction</a>, in which a nearby plural noun can trigger plural agreement with the verb even though the full subject is singular, for example before proof-reading I had written: \"...there are cases in which the usual marker<b>s</b> to denote <b>it</b> do<b>es</b>...\".)</p>\n\n<p>These facts all point to the idea that plurality as a morphosyntactic relation is distinct from semantic plurality. There is usually a relationship between a semantically plural referent and plural verbal agreement or nominal morphology, but not always: morphological plurality can combine with semantic singularity (pluralia tantum) and morphological singularity of the noun can combine with plural semantics and even plural agreement (e.g. the case of \"family\"). How speakers mentally reconcile this, I do not know.</p>\n\n<p>It would be nice if every discrete piece of morphology had only one semantic or syntactic meaning. In fact, analyzing words and then breaking them down into parts based on shared semantic contribution is, roughly speaking, how morphemes are analyzed. But the mapping is hardly one to one. As handy as semantics can be in analyzing morphemes, it has been a problem knowing how to reconcile cases in which the semantics and morphology don't match up. A great case are \"Priscianic\" or parasitic formations, in which one member of a paradigm seems to be formed not on the lexical root of the paradigm but instead on the stem of another member of the paradigm. In Latin, the future active participle in the vast majority of cases is based off of a stem identical to the stem of the supine and past (usually passive) participle. Obviously, future and active ≠ past and passive participle, and so how do you analyze the semantic status of the stem?</p>\n", "Id":"1300", "ParentId":"1296", "CreationDate":"2012-01-18T23:11:48.463", "Score":"3", "PostTypeId":"2", "LastActivityDate":"2012-01-18T23:11:48.463", "comments":[]}