{"Body":"<p>Regarding top-down vs. bottom up, I am afraid there is no one answer here. Every theory has its own preference. One scholar <a href=\"http://www.aare.edu.au/05pap/kus05042.pdf\" rel=\"nofollow\">writes</a>: </p>\n\n<blockquote>\n  <p>Despite the widely accepted claim that listening requires an active process \n  on the part of the learners, there are still intense debates as to how the oral input is processed. Some argue that the processing operates in purely bottom-up fashion, while others tend to the top-down one. To mediate these polarized claims, some scholars suggest that both are necessary so the cognitive processing works interactively.</p>\n</blockquote>\n\n<p>It is important to distinguish between theoretical linguistics models and psycholinguistic models (not to mention computational models). They have different motivations. For example, linguists may be motivated by language change (sociological), while psycholinguists may be motivated by sentence processing strategies. These may suggest different top-down vs. bottom-up theories.</p>\n\n<p>My favorite book on linguistic theory and sentence processing is \"Syntactic Carpentry: An Emergentist Approach to Syntax\", William O'Grady. It attempts to reduce the theory of grammar to the theory of sentence processing and how working memory stores information.\n<a href=\"http://www.ling.hawaii.edu/faculty/ogrady/EmergSynt.pdf\" rel=\"nofollow\">O'Grady (2001)</a>:</p>\n\n<blockquote>\n  <p>Traditional syntactic theory focuses its attention on the architecture of sentence structure, which is claimed to comply with a complex grammatical blueprint. In Principles and Parameters theory, for instance, well-formed sentences have a Deep Structure that satisfies the X-bar Schema and the \n  Theta Criterion, a Surface Structure that complies with the Case Filter and the Binding \n  Principles, a Logical Form that satisfies the Empty Category Principle, and so on. The \n  question of how sentences with these properties are actually built in the course of \n  language use is left to a theory of ‘carpentry’ that includes a different set of mechanisms \n  and principles (parsing strategies, for instance).</p>\n  \n  <p>I propose a different view. Put simply, there are no architects; there are only \n  carpenters.  They design as they build, limited only by the materials available to them and \n  by the need to complete their work as quickly and efficiently as possible. Indeed, drawing \n  on the much more detailed proposals put forward in O’Grady (2005), I suggest that \n  efficiency is  THE driving force behind the design and operation of the computational \n  system for language.</p>\n</blockquote>\n", "Id":"1318", "ParentId":"1313", "LastEditorUserId":"435", "CreationDate":"2012-01-23T01:23:32.463", "OwnerUserId":"435", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-01-24T20:12:12.327", "LastEditedUser":{"UpVotes":"6", "DownVotes":"0", "Id":"435", "AccountId":"539661", "Views":"0", "Reputation":"281", "CreationDate":"2011-10-19T09:36:07.603", "DisplayName":"cyborg", "LastAccessDate":"2013-12-09T14:47:13.907"}, "LastActivityDate":"2012-01-24T20:12:12.327", "Score":"3", "OwnerUser":{"UpVotes":"6", "DownVotes":"0", "Id":"435", "AccountId":"539661", "Views":"0", "Reputation":"281", "CreationDate":"2011-10-19T09:36:07.603", "DisplayName":"cyborg", "LastAccessDate":"2013-12-09T14:47:13.907"}}