{"OwnerUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}, "comments":[], "Body":"<p>As a matter of fact, <strong>the count vs. mass distinction is too simplistic</strong> - see <a href=\"http://dx.doi.org/10.1075/fol.16.2.02god\" rel=\"nofollow\">Goddard 2009</a>, who has eighteen types of just concrete nouns, such as plural mass nouns (guts), plural names of dual objects (scissors), singular words for classes of unlike things (furniture) etc.</p>\n\n<p>I like Jackendoff's Conceptual Semantics approach. He used two semantic features, [bounded] and [internal structure]. An entity is bounded iff it is indivisible (like a boy) and not additive (unlike water). If an entity is made up of separate individuals, then it has [+internal structure].</p>\n\n<p>Thus, you end up having four possible combinations of those two features (please feel free to format it into a table):</p>\n\n<p>+bounded, +i: groups (a team, a committee)</p>\n\n<p>+bounded, -i: individuals (a person)</p>\n\n<p>-bounded, +i: aggregates (committees)</p>\n\n<p>-bounded, -i: substances (water)</p>\n\n<p>I also like Anna Wierzbicka's Natural Semantic Metalanguage approach. The main tenet of that approach is that in different languages (and cultures) the boundaries for countability are different. For example, Russian 'gorox\" (pea) is a mass noun whereas English \"peas\" is countable.</p>\n", "Id":"1326", "ParentId":"224", "CreationDate":"2012-01-23T22:43:16.647", "Score":"1", "PostTypeId":"2", "OwnerUserId":"445", "LastActivityDate":"2012-01-23T22:43:16.647", "CommentCount":"5"}