{"OwnerUser":{"UpVotes":"72", "WebsiteUrl":"http://suburbandestiny.com/conlang", "Id":"20", "AccountId":"15651", "CreationDate":"2011-09-13T20:53:42.550", "AboutMe":"<p>I'm a programmer by day and an amateur linguist by night.</p>\n\n<p>I organize the Arlington Linguistics Book Club, where we read a wide variety of books that make the science of linguistic accessible to a popular audience.</p>\n", "Age":"41", "Location":"United States", "DownVotes":"6", "Views":"39", "Reputation":"1657", "DisplayName":"MatthewMartin", "LastAccessDate":"2014-01-08T19:46:09.130"}, "comments":[], "Body":"<p>Well, I'm re-reading your question. If you're trying to help your Anthropology Prof friend, then I don't understand what his goal is.  Conlangs are either used for recreational or fiction writing goals.  There is some overlap with science, but not a lot. Now the intersection of anthropology and PIE is interesting-- the gist is that culture affects language (which is less controversial than the idea that language affects culture), so a society with a word for sheep, probably at least has seen a sheep and maybe considers it important enough to have a simple word for it.</p>\n\n<p>The Horse, The Wheel and Language is a reasonably accessible book on this approach of linking the evidence of PIE with the archeological record in trying to say something about Old Europe.\n<a href=\"http://rads.stackoverflow.com/amzn/click/0691058873\" rel=\"nofollow\">http://www.amazon.com/Horse-Wheel-Language-Bronze-Age-Eurasian/dp/0691058873</a></p>\n\n<p>Here is a dictionary to proto-indo european: \n<a href=\"http://www.utexas.edu/cola/centers/lrc/ielex/\" rel=\"nofollow\">http://www.utexas.edu/cola/centers/lrc/ielex/</a></p>\n\n<p>The words in \"Quest for Fire\" have no relationship to PIE except that Burgess may have been influenced by modern IE languages in picking his words (\"vir\" and \"bratt\" especially).  Anatomically modern humans arrived in Europe 50,000 years ago and either arrived right after the collapse of Neanderthal life or helped finish it off. Your 80,000 number is solidly in the time of Neanderthals in Europe-- you'll get different estimates from different archaeologists and the time line has been evolving rapidly over the last few decades.  In the movie, the language for which you provide the wordlist is the Neanderthal langauge. At best, it appears that a small number of Neanderthals bred with modern humans (as there appear to be Neanderthal genes in modern Europeans), but I doubt any substrate language would have persisted.  We aren't even sure if Neanderthals could talk (I think they did, but there aren't a lot of slam dunk pieces of evidence for it). In any case, PIE wasn't spoken in Europe until ~6000 years ago (tops!) before that, according to Anthony, PIE was a language spoken in the south of the Ukraine.</p>\n\n<blockquote>\n  <p>\"...overlay it with a plausible and constructed syntax...\"</p>\n</blockquote>\n\n<p>This is the realm of pure fiction and art. There are several attempts in the origin of language to speculate on what plausibly could have come first-- for example, in <a href=\"http://rads.stackoverflow.com/amzn/click/0809016478\" rel=\"nofollow\">Adam's Tongue</a>, there is a discussion about if the earliest syntax was non-recursive \"beads on a string\" or if it used recursion and would be diagrammed with tree diagrams that look something like the sentence diagrams you saw in English class.  But that is a long way from putting together a specific list of rules and saying, this is how they would have formed sentences.</p>\n", "Id":"1333", "ParentId":"1329", "CreationDate":"2012-01-24T21:38:34.523", "Score":"2", "PostTypeId":"2", "OwnerUserId":"20", "LastActivityDate":"2012-01-24T21:38:34.523", "CommentCount":"6"}