{"Body":"<p>Belarusian \"добры дзень\" produces 181,000 hits, \"дзень добры\" only 38,000. I do not speak Belarusian fluently, but it seems to me that \"добры дзень\" is rather unmarked. For Polish, though, <strike>the pattern you spotted holds: over 16 million ghits for \"dzień dobry\", and only 3 million for \"dobry dzień\"</strike> the greeting is indeed invariably \"dzień dobry\". \"Dobry dzień\", on the other hand, will almost always be the order chosen when the phrase is not a greeting, as in \"to był dobry dzień,\" which means \"this was a good day.\"</p>\n\n<p>Honestly, I do not think the reason for such an inversion is known. Slavic languages have free word order, and inversion would indeed be grammatical. I am a native speaker of Russian, and I can tell that, while \"добрый день\" is unmarked, \"день добрый\" would be marked only slightly, if at all. It sounds a bit more cheerful to me, but the difference is indeed marginal. Google produces 41 mil hits for \"добрый день\" and 2.7 mil hits for \"день добрый\", indicating that the former wording is customary.</p>\n\n<p>It is also notable that Polish expression for good afternoon is invariably \"dobry wieczór\". Google search also reveals same huge skew (more than ×100 times!) towards \"добрый вечер\" versus \"вечер добрый\" for Russian, but again, if someone would say the latter to me I would not perceive that as ungrammatical or particularly strange at all.</p>\n\n<p>Also note that Ukrainian form that you list is not exactly parallel to others. You can say \"добрый динь\" which, as with other expressions in your list, is in the nominative case. You can also say \"доброго дня\" in both Russian and Ukrainian. This is in the genitive form, taken by the  object to verbs of wishing, and therefore implies a missing verb: <em>[I wish you] good day</em>. I think that the genitive form is more customary for Ukrainian, while it is uncommon in Russian, and much more likely to be used when bidding farewell than greeting someone. So you may think Ukrainian is also \"atypical\" in this regard. </p>\n", "Id":"1345", "ParentId":"1340", "LastEditorUserId":"119", "CreationDate":"2012-01-29T10:33:07.940", "OwnerUserId":"674", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-02-16T10:08:11.087", "LastEditedUser":{"UpVotes":"302", "DownVotes":"1", "Id":"119", "AccountId":"14652", "Views":"52", "Reputation":"3065", "CreationDate":"2011-09-14T14:24:24.227", "DisplayName":"kaleissin", "LastAccessDate":"2014-01-18T22:21:33.313", "AboutMe":"<p>Sysadmin/programmer by day, linguist by night.</p>\n"}, "LastActivityDate":"2013-02-16T10:08:11.087", "Score":"12", "CommentCount":"15", "OwnerUser":{"UpVotes":"7", "Location":"California, USA", "DownVotes":"0", "Id":"674", "AccountId":"1173274", "Views":"5", "Reputation":"244", "CreationDate":"2012-01-15T07:42:07.683", "DisplayName":"kkm", "LastAccessDate":"2012-02-16T11:12:50.717"}}