{"Body":"<p>The short answer is no, there is no \"universal\" question intonation.</p>\n\n<p>I think a few points in your question need to be addressed, though... </p>\n\n<p>First, the intonation to which you are referring is most likely the intonation for <strong>yes-no questions</strong> in English, or possibly <strong>echo questions</strong>, but not other types of questions like wh-questions (questions that start with <em>who</em>, <em>what</em>, <em>when</em>, <em>where</em>, <em>why</em>, and <em>how</em>), which don't rise at the end. Just the fact that not all questions in English have the same intonation is a hint that it is an acquired behavior.</p>\n\n<p>Second, stress is a grammatical construct (not an acoustic one) that does not even play a role in all languages (Japanese, e.g.). In English, the stress pattern of a sentence is independent of whether the intonation (i.e. \"tune\") of the sentence goes up or down on any given word or syllable. <strong>Generally, yes-no and echo questions in English can be characterized by a final rising pitch contour starting on the last stressed syllable in the sentence (not the very last word)</strong>. For example, in, \"You got me a BIRTHDAY gift?\" the rise starts on the first syllable of \"birthday\", which is the last emphasized word in the sentence, but not the last word.</p>\n\n<p>Finally, <strong>although typologically there does seem to be a <em>tendency</em> across languages for yes-no and/or echo questions to end with a rising pitch--see Ladd (1981)--there are many counterexamples.</strong> Lee (2008) lists some: varieties of Hungarian and Romanian, Bengali, Greek, Basque, and many African languages. Also, in many languages with lexical tone, including Mandarin and North Kyeongsang Korean, if the tone on the final syllable is falling, the pitch falls at the end even in yes-no and echo questions.</p>\n\n<p>Ladd, D. R., 1981. On Intonational Universals. In T. Myers et al. (eds.), The Cognitive Representation of Speech. Amsterdam: North Holland Publishing.</p>\n\n<p>Lee, Hye-Sook, 2008. Non-rising questions in North Kyeonsang Korean. In P.A. Barbosa, S. Madureira, and C. Reis (eds.), Proceedings of Speech Prosody 2008 Conference, Campinas, Brazil, 241-244. </p>\n", "Id":"1372", "ParentId":"1370", "LastEditorUserId":"385", "CreationDate":"2012-02-05T15:14:49.590", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-02-07T13:49:11.303", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2012-02-07T13:49:11.303", "Score":"3", "CommentCount":"1", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}