{"OwnerUser":{"UpVotes":"2", "WebsiteUrl":"", "Location":"United Kingdom", "Id":"720", "DownVotes":"0", "AccountId":"1203845", "Views":"4", "Reputation":"181", "CreationDate":"2012-01-27T16:56:12.873", "DisplayName":"Alxmrphi", "LastAccessDate":"2012-05-27T16:07:01.423", "AboutMe":""}, "comments":[], "Body":"<p>Romanian is a language that's been well established in the Balkan Sprachbund (which is a German term linguists use to talk about a collection of languages that have shared features over a certain period of time).</p>\n\n<p>Alongside Romanian in this Sprachbund are languages like Greek, Albanian and Macedonian (among others) and they have each played some influence in altering the other, and this is in all sorts of linguistic domains such as Phonology / Morphology / Syntax.</p>\n\n<p>An interesting thing to note about Romanian is that, although deriving from Latin which had no articles, as East/West-Latin were still splitting up, Proto-Romance had started the grammaticalisation process resulting in the determiners observable today in Modern Romance. As Italian and Romanian both share the East-Latin branch they both originally had determiners that PRE-modified the elements they were attached to and over the course of time, due to influences from languages like Bulgarian (another Slavic language) and Albanian, these have their determiners AFTER the noun.</p>\n\n<p>So to quote the oft-cited example here, look at the Italian word for 'the men', which is '<strong>il uomo</strong>' and then compare it with the Romanian word '<strong>om</strong>' (man; notice the similarity) then after developing in this Sprachbund around other languages that put their word for the word 'the' AFTER the noun, Romanian also took this on and has 'the man' as '<strong>om-ul</strong>'</p>\n\n<p>So, as much as you do cross-linguistic comparison among the Romance languages, you will find out time and time again that Romanian is often the black sheep of the family due to its development in this language area where linguistic features are shared and different characteristics can be shown to have spread around to neighbouring languages after a long period of bi- and multi-lingualism throughout the history.</p>\n\n<p>To swing this back to your point, this is exactly the reason why not just the Phonology, but also the word-stock (vocabulary) of Romanian is often very different from its sister languages in Western Europe. The same reasons for the sharing of features at a level of linguistic structure only happen in a very sort of 'linguistically intimate' setting and when two or more languages are close, the first thing to cross over are words into the other languages. So, if you see that structure has been shared, you'd be wise to make an educated guess that the level of vocabulary-absorption is considerably higher, and in this case you'd be right. </p>\n\n<p>Romanian's history after splitting off and developing in a co-evolutative zone meant that it has slowly been moving further and further away from its core features in the Italic family, in not just words (but very much so), but also in many other aspects of structure (as I mentioned before).</p>\n\n<p>I hope this helps you with your query.</p>\n", "Id":"1373", "ParentId":"375", "CreationDate":"2012-02-06T02:12:21.767", "Score":"9", "PostTypeId":"2", "OwnerUserId":"720", "LastActivityDate":"2012-02-06T02:12:21.767", "CommentCount":"3"}