{"OwnerUser":{"UpVotes":"308", "DownVotes":"10", "Id":"111", "AccountId":"514008", "Views":"172", "Reputation":"5430", "CreationDate":"2011-09-14T09:33:29.710", "DisplayName":"Alenanno", "LastAccessDate":"2014-01-19T00:38:35.883", "AboutMe":"<p>I'm a student majoring in Languages (branch: Linguistics), currently working as a freelance translator. I've recently discovered <a href=\"http://db.tt/WpiKeReH\" rel=\"nofollow\">Dropbox</a> and I'm going to use it for my needs! :)</p>\n\n<p><em><strong>I love</em></strong><br>\nLanguages, Movies (Fantasy, Sci-Fi, Tarantino, etc.), Music, 3D Graphics, books and so on. </p>\n\n<p>Appointed ♦ Moderator Pro Tempore on <a href=\"http://area51.stackexchange.com/proposals/6673/linguistics?referrer=GlDGLdkDYNxMg1X13CJ1vg2\">Linguistics SE</a>, <a href=\"http://area51.stackexchange.com/proposals/6388/chinese-language-usage?referrer=XzTG1Nz01tc01sJEhak_6g2\">Chinese SE</a> and the <a href=\"http://area51.stackexchange.com/proposals/10848/russian-language-usage?referrer=J7IYS3ZUomUDvVVb-6SmDQ2\">Russian SE</a> site. If you're interested in other Stack Exchanges, try the <a href=\"http://area51.stackexchange.com/proposals/42949/italian-language-usage?referrer=ALVtGpK0tjLp1Lw15QCaUA2\">Italian SE</a> site.</p>\n\n<p>I like to lurk on other sites' Metas. <em>Meta is fun!</em> </p>\n\n<p><strong>My feature requests</strong>:</p>\n\n<ol>\n<li><a href=\"http://meta.stackoverflow.com/q/135786/176533\">Alert a moderator when an answer is improved after a post notice</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/138273/176533\">Automatically add chat event to the community bulletin (or make it easier)</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/121363/176533\">Give 10k users the ability to see the total count of flags they've handled</a></li>\n</ol>\n\n<p><strong>Moderator issues</strong>: If you have concerns or want to contact me about my moderation, you can find/ping me either in the <a href=\"http://chat.stackexchange.com/rooms/1336/linguistics\">Linguistics SE chat room</a> or <a href=\"http://chat.stackexchange.com/rooms/1984/chinese-language-and-usage\">CL&amp;U chat room</a>; if I'm not there or I'm \"idle\", just ping me! Please <em>avoid</em> using my personal email for such things. Use the chat rooms.</p>\n\n<hr>\n\n<p><strong>Languages List</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <sup>Languages with  * = learning on my own</sup></p>\n\n<p><strong>Mother Tongue:</strong> Italian, Sardinian;<br>\n<strong>Fluent:</strong> English, Spanish;<br>\n<strong>Less Fluent:</strong> French, German, Russian;<br>\n<strong>Learning:</strong> Japanese*, Chinese*, Swedish*, Greek*, Finnish*;<br>\n<strong>Willing to learn:</strong> Welsh, Korean, Dutch, Arabic, Hebrew, Hindi [to be continued]</p>\n\n<p>Me gusta el Español.<br>\nJ'aime le Français.<br>\nDeutsch gefällt mir.<br>\nМне нравится Русский язык.<br>\n私は日本語が好きです。<br>\n我爱中文。<br>\nJag älskar Svenska.</p>\n"}, "comments":[], "Body":"<p>First of all, note that <em>being a pro-drop language</em> doesn't necessarily mean that a given language lacks pronouns. They just avoid using them because they <em>are not required</em> in all situations.</p>\n\n<p><em>Japanese is not a pro-drop because its personal pronouns have a particular etymology</em>. It's pro-drop because when people speak Japanese, they omit these pronouns, since they can be understood from the context, or for a matter of \"polite/casual speech\". In other languages they are avoided because the morphology of that language already brings that information.</p>\n\n<p>Let's take as an example the verb <strong>parlare</strong> which means \"to speak\" in Italian. The first person would be \"io parlo\". But usually people say \"parlo\", as there is no need for us to use the personal pronouns. If I say <em>\"parlo\"</em>, everyone will understand who I'm referring to without ambiguity at all. But it would be also wrong to say that Italian lacks personal pronouns, since they do exist but they're simply not always required, as they are in English. </p>\n\n<p>I'm not aware of any language that lacks pronouns <em>completely</em>. Probably it'd be easier to find languages that have less than others. But languages tend to \"economize\", so pronouns are one of the logical consequences. Regarding your second question, I think it'd deserve a question by itself. Anyway, even if languages lose a certain personal pronoun, it's not granted that they will just lose it, as they can simply replace it. Let me re-take Italian again: </p>\n\n<p>We have <strong>egli/ella</strong> (he/she) and <strong>lui/lei</strong> (him/her). The second ones have almost totally replaced the first ones. I'd never say <em>\"egli mi ha detto che...\"</em> which means <em>he told me that...</em>, but rather <em>\"lui mi ha detto che...\"</em> and theoretically this would be wrong, because it would be like saying *<em>him told me that...</em> but now it's the common form being used by native speakers. This would deserve itself research on its own, but as you can see even if \"we're losing\" a pronoun, instead of being without one, we replaced it.</p>\n", "Id":"1427", "ParentId":"1424", "CreationDate":"2012-02-14T18:52:23.673", "Score":"5", "PostTypeId":"2", "OwnerUserId":"111", "LastActivityDate":"2012-02-14T18:52:23.673", "CommentCount":"4"}