{"Body":"<p>I agree with jlovegren. that it probably has to do with definitions — in fact, I <em>have</em> seen <em>aru</em> called an irregular verb. On the other hand, I hazily remember reading something by <a href=\"http://en.wikipedia.org/wiki/Haruhiko_Kindaichi\" rel=\"nofollow\">Kindaichi Haruhiko</a> which contrasted the behavior of <em>aru</em> with \"the adjective <em>nai</em>\", so, clearly, there are mainstream voices on the \"not irregular\" side too.</p>\n\n<p>To judge from Alex B.'s response, there is no \"sharp line\", so the question is, which explanation seems more probable?</p>\n\n<p>Let's say we declare <em>nai</em> part of the <em>aru</em> paradigm. This leaves us with the problem of what to do about the independent adjective <em>nai</em>. If our argument is that it no longer exists, we are left with the difficulty of proving this. For example, <em>nai</em> clearly existed independently of <em>aru</em> in old expressions like (1) below.</p>\n\n<blockquote>\n  <p>1) <strong>Naki</strong> ni shi mo <strong>arazu</strong></p>\n</blockquote>\n\n<p>Now consider a fairly direct modern translation of (1):</p>\n\n<blockquote>\n  <p>2) <strong>Nai</strong> (wake) de wa <strong>nai</strong></p>\n</blockquote>\n\n<p>What can we offer as proof that the first <em>nai</em> in (2) <em>must</em> be considered a conjugation of <em>aru</em>? I can't think of anything. (I'm sure if I am wrong someone will let me know in comments.)</p>\n\n<p>So let's say that <em>nai</em> still exists as an independent adjective. In that case, we have the opposite problem. What is our proof that the <em>final</em> word of (2) <em>must</em> be considered a conjugation of <em>aru</em>? We can offer the polite form (3):</p>\n\n<blockquote>\n  <p>3) <strong>Nai</strong> (wake) de wa <strong>arimasen</strong></p>\n</blockquote>\n\n<p>... where the link to <em>aru</em> is clear -- but in fact, the following is also acceptable:</p>\n\n<blockquote>\n  <p>4) <strong>Nai</strong> (wake) de wa <strong>nai</strong> desu</p>\n</blockquote>\n\n<p>... which is what we would expect to see if the final word　in (2) is \"adjective <em>nai</em>\" rather than \"conjugation-of-<em>aru</em> *nai*\": if we have no reason to go back to an <em>aru</em>-related form, we create a polite form just like any other adjective.</p>\n\n<p>I'm sure some people would argue that (4) is not grammatical, but then we are back to definitions. It is undeniable that <em>nai desu</em> is very common in casual speech. It cannot be ruled unacceptable except by fiat. And note that we are also seeing forms like <em>nakatta desu</em> encroach on what \"should\" be <em>arimasen deshita</em>, another example of <em>nai</em> acting more like an independent adjective than something that is \"underlyingly\" a form of <em>aru</em>.</p>\n\n<p>It seems to me that the most logical explanation is to view <em>aru</em> as a defective verb, or at least a verb with a nonpolite negative form that is \"suppressed\" by the use of independent-adjective <em>nai</em> instead, because:</p>\n\n<ul>\n<li>It frees us of the need to make the weak, apparently arbitrary distinction between adjective and negative-of-verb required by examples like (2)</li>\n<li>It explains why <em>nai</em>-like forms are also encroaching on the <em>polite</em> negative form of <em>aru</em> as seen in (4): because the word is increasingly not perceived as being part of <em>aru</em></li>\n</ul>\n\n<p>One argument against my second point is that we see forms like <em>ikanakatta desu</em> (instead of <em>ikimasen deshita</em>) as well. Maybe <em>desu</em> is just turning into a non-conjugating \"politeness particle\", and so the encroachment on <em>arimas-</em> is part of a bigger change involving the loss of <em>-mas-</em> forms, rather than something specific to <em>aru</em>. (Counterarguments to <em>that</em> might include \"Yeah, but this is itself driven by the influence of the adjective <em>nai</em> on the negative verb ending (or \"auxiliary\", etc.) <em>-nai</em>, so ultimately it comes down to the triumph of adjective <em>nai</em> anyway\".)</p>\n", "Id":"1432", "ParentId":"1421", "LastEditorUserId":"111", "CreationDate":"2012-02-15T05:45:05.763", "OwnerUserId":"755", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-02-16T14:45:58.367", "LastEditedUser":{"UpVotes":"308", "DownVotes":"10", "Id":"111", "AccountId":"514008", "Views":"172", "Reputation":"5430", "CreationDate":"2011-09-14T09:33:29.710", "DisplayName":"Alenanno", "LastAccessDate":"2014-01-19T00:38:35.883", "AboutMe":"<p>I'm a student majoring in Languages (branch: Linguistics), currently working as a freelance translator. I've recently discovered <a href=\"http://db.tt/WpiKeReH\" rel=\"nofollow\">Dropbox</a> and I'm going to use it for my needs! :)</p>\n\n<p><em><strong>I love</em></strong><br>\nLanguages, Movies (Fantasy, Sci-Fi, Tarantino, etc.), Music, 3D Graphics, books and so on. </p>\n\n<p>Appointed ♦ Moderator Pro Tempore on <a href=\"http://area51.stackexchange.com/proposals/6673/linguistics?referrer=GlDGLdkDYNxMg1X13CJ1vg2\">Linguistics SE</a>, <a href=\"http://area51.stackexchange.com/proposals/6388/chinese-language-usage?referrer=XzTG1Nz01tc01sJEhak_6g2\">Chinese SE</a> and the <a href=\"http://area51.stackexchange.com/proposals/10848/russian-language-usage?referrer=J7IYS3ZUomUDvVVb-6SmDQ2\">Russian SE</a> site. If you're interested in other Stack Exchanges, try the <a href=\"http://area51.stackexchange.com/proposals/42949/italian-language-usage?referrer=ALVtGpK0tjLp1Lw15QCaUA2\">Italian SE</a> site.</p>\n\n<p>I like to lurk on other sites' Metas. <em>Meta is fun!</em> </p>\n\n<p><strong>My feature requests</strong>:</p>\n\n<ol>\n<li><a href=\"http://meta.stackoverflow.com/q/135786/176533\">Alert a moderator when an answer is improved after a post notice</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/138273/176533\">Automatically add chat event to the community bulletin (or make it easier)</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/121363/176533\">Give 10k users the ability to see the total count of flags they've handled</a></li>\n</ol>\n\n<p><strong>Moderator issues</strong>: If you have concerns or want to contact me about my moderation, you can find/ping me either in the <a href=\"http://chat.stackexchange.com/rooms/1336/linguistics\">Linguistics SE chat room</a> or <a href=\"http://chat.stackexchange.com/rooms/1984/chinese-language-and-usage\">CL&amp;U chat room</a>; if I'm not there or I'm \"idle\", just ping me! Please <em>avoid</em> using my personal email for such things. Use the chat rooms.</p>\n\n<hr>\n\n<p><strong>Languages List</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <sup>Languages with  * = learning on my own</sup></p>\n\n<p><strong>Mother Tongue:</strong> Italian, Sardinian;<br>\n<strong>Fluent:</strong> English, Spanish;<br>\n<strong>Less Fluent:</strong> French, German, Russian;<br>\n<strong>Learning:</strong> Japanese*, Chinese*, Swedish*, Greek*, Finnish*;<br>\n<strong>Willing to learn:</strong> Welsh, Korean, Dutch, Arabic, Hebrew, Hindi [to be continued]</p>\n\n<p>Me gusta el Español.<br>\nJ'aime le Français.<br>\nDeutsch gefällt mir.<br>\nМне нравится Русский язык.<br>\n私は日本語が好きです。<br>\n我爱中文。<br>\nJag älskar Svenska.</p>\n"}, "LastActivityDate":"2012-02-16T14:45:58.367", "Score":"3", "CommentCount":"6", "OwnerUser":{"UpVotes":"45", "WebsiteUrl":"http://no-sword.jp/blog/", "DownVotes":"0", "Id":"755", "AccountId":"531588", "Views":"3", "Reputation":"241", "CreationDate":"2012-02-09T01:38:23.797", "DisplayName":"Matt", "LastAccessDate":"2012-11-16T02:07:45.490", "AboutMe":""}}