{"Body":"<p>As for the view of the linguistics community on the likelihood of the Dene-Yeniseian hypothesis, the hypothesis has first of all attracted the attention of \"serious\" linguistics in the field. As <a href=\"http://search.ebscohost.com.gate.lib.buffalo.edu/login.aspx?direct=true&amp;db=ufh&amp;AN=62012314&amp;site=ehost-live&amp;scope=site\">Rice (2011)</a> writes in her review, a similar proposal has been made in the past by other linguists, including Merritt Ruhlen <a href=\"http://www.merrittruhlen.com/files/1998c.pdf\">(1998)</a> and Sergei Starostin (1995), but these earlier proposals did not have much impact in the general linguistics community. What is different about Vajda's proposal, aside from the evidence he adduces for it, is that Vajda is a \"a serious scholar trying to use appropriate procedures.\" (<a href=\"http://www2.hawaii.edu/~lylecamp/Campbell%20Yeniseian%20NaDene%20review%2011-2-10.pdf\">Campbell 2011</a>) As Campbell also notes, scholars with impressive reputations in the area of general linguistics (Nichols, Comrie) and specialists (Fortescue) have voiced support for the hypothesis. Rice, one of the leading experts on Athabaskan, appears to be studiously neutral in her review (2011), and Campbell, a well-known historical linguist and author of the most widely-used textbook on the subject (<a href=\"http://books.google.com/books?id=EjXrrOJhex8C&amp;dq=campbell%20historical%20linguistics&amp;source=gbs_navlinks_s\">Campbell 1998</a>), finds the hypothesis inadequately supported (though his reputation as a conservative in this regard is pretty well-established).</p>\n\n<p>What is interesting about the proposal is that it combines traditional lexical evidence with morphological data. An idea which has been gaining support in recent years is that templatic morphology (cf. <a href=\"http://www.acsu.buffalo.edu/~jcgood/jcgood_Diss.pdf\">Good 2003</a>), when sufficiently complex, may be especially stable over time. This theme was discussed in a workshop at the recent annual meeting of the LSA entitled \"The Diachronic Stability of Complex Templatic Morphology,\" at which Vajda presented a paper.</p>\n\n<p>As for whether the research is being built on by other groups, my sense is that relatively few people have sufficient knowledge of all of the different data sources, so there are unlikely to be serious contributors to the debate who come out of nowhere. It seems that Vajda is still devoting a large portion of his time to the topic.</p>\n", "Id":"1435", "ParentId":"1434", "LastEditorUserId":"483", "CreationDate":"2012-02-16T07:49:22.727", "OwnerUserId":"483", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-02-17T21:50:24.503", "LastEditedUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "LastActivityDate":"2012-02-17T21:50:24.503", "Score":"15", "CommentCount":"6", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}