{"Body":"<p>Actually, there is at least one more possibility: [3] the similarities might result from intensive influence of one on the other.</p>\n\n<p>Now, to the answer:</p>\n\n<ol>\n<li><p>Genetic (or genealogical, as I prefer to call it) affinity is quite difficult to prove beyond doubt. Perhaps the best way is to find a large number of regular sound correspondences in the most basic parts of the vocabulary, such as affixes, pronouns, low numerals, etc. No one can really tell what <em>large</em> exactly means in this context (see point 3), but if you can do that, the two languages will be considered related. Most Indo-European languages belong here.</p></li>\n<li><p>An older version is only possible if at least one of the two languages is already dead. So, for at least one of them we only have a limited number of texts. If definite statements are to be made on this basis, these texts must either be rather long, or very obviously related, i.e. the great majority of affixes and basic words used in them must demonstrably and regularly correspond to the respective forms in the other language. For example, Latin has a large base of texts and they can be shown to regularly correspond to Italian.</p></li>\n<li><p>Intensive influence is what is suspected when <em>large</em> from point 1 is not large enough for everyone, i.e. there remains a considerable number of affixes, etc, which do not correspond between the two languages. The Altaic \"family\" (Turkic + Mongolic + Manchu-Tungus + Korean + Japanese) is a good example of that. Linguists have argued for around a century now whether they are a family in the genealogical sense, or just have influenced one another very deeply in prehistoric times.</p></li>\n</ol>\n\n<p>So, the main problem is the quantitative proportion. You might think that it would be enough to count the number of correspondences between the cases we are already certain about, and see if the appropriate numbers are higher or lower in the unclear cases. Unfortunately, no. Linguistics does not live in a void and in practice linguists always take historic, geographical, archeological, etc, evidence into account. Sometimes a relatively low number of correspondences is enough to pronounce affinity because the other pieces of the puzzle are very clear, but at other times the other pieces are few and so harder evidence is required on the linguistic side.</p>\n\n<p>To sum up, linguistics alone can determine how two languages are related but not in every case is the conclusion certain. Sometimes, it is merely more likely than the alternative possibilities.</p>\n", "Id":"1481", "ParentId":"1430", "LastEditorUserId":"794", "CreationDate":"2012-02-24T08:20:24.280", "OwnerUserId":"794", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-02-25T01:04:16.540", "LastEditedUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}, "LastActivityDate":"2012-02-25T01:04:16.540", "Score":"5", "CommentCount":"1", "OwnerUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}}