{"Body":"<p>As a native speaker of Polish (and a linguist), I can say this: in Polish, word order is almost absolutely free; the only constraint I can think of is that prepositions (e.g. <em>w</em> 'in', <em>z</em> 'from') can't be placed after the word they refer to. Apart from that, pretty much any ordering is always understandable. It is true, however, that in some sentences some orders will sound more natural, while others will be considered emotional or emphatic, as Aspinea explained above for Latin. An example:</p>\n\n<pre><code>Jaś poszedł do kina.\nJohnny went to cinema.\nThe first association: natural, affirmative, simply stating a fact.\nBut could be a question if so intoned, or perhaps anything else, too.\n\nPoszedł Jaś do kina.\nThe first association: half a sentence, expecting the second part (e.g. ... and he saw a ghost there.)\nBut could as well be a confirmation that he did indeed go, a question, or perhaps anything else, too.\n\nJaś do kina poszedł.\nThe first association: answer to the question \"Where did John go?\".\nBut again, could be used in plenty of other contexts, too.\n\nPoszedł do kina Jaś.\nA tiny bit odd. The first association is that \"Jaś\" was added as an afterthought (could have been without the tiniest pause, though).\n\nDo kina Jaś poszedł.\nThe first association: answer to the question \"Who went to the cinema?\"\nBut again...\n\nDo kina poszedł Jaś.\nThe first association: expect an enumeration who else went to the cinema.\nBut again...\n</code></pre>\n\n<p>That's all the possibilities, right? You might think SVO would be the most frequent one. Well, that's the first thing that comes to one's mind when they hear the English sentence \"Johnny went to the cinema\", but I really don't think that in real life it is so much more frequent.</p>\n\n<p>At any rate, take a look at the above examples and imagine that essentially any sentence in Polish can be reordered in an equally free way, with next to no consequences at all. In more complex sentences with subordinate clauses and such, certain orders will be more natural as easier to understand, but that's it: more natural, definitely not the only ones. I think this goes a long way to explain why the majority of linguists who work with languages with more inflection than English, do not share the Anglo-Saxon obsession with syntax and object to using 'syntax' and 'morphology' interchangeably. This includes generativism. I'm quite convinced the only reason it won any following at all in continental Europe is the power of the US and anything coming from there being automatically fashionable.</p>\n\n<p><strong>PS.</strong> A very distant afterthought: a mediaeval Polish shibboleth to distinguish Germans was <em>miele młyn</em> [ḿjεlε mwɨn] lit. ‘grinds mill’. In theory, it could be SV just as well but somehow this sounds just fine in modern Polish, too.</p>\n", "Id":"1482", "ParentId":"1476", "LastEditorUserId":"794", "CreationDate":"2012-02-24T10:21:40.683", "OwnerUserId":"794", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-07-29T10:39:36.660", "LastEditedUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}, "LastActivityDate":"2012-07-29T10:39:36.660", "Score":"17", "CommentCount":"4", "OwnerUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}}