{"Body":"<p>Actually, the traditional distinction between morphology and syntax is pretty clear. Morphology studies how words are inflected and new forms created, while syntax studies how they are combined into phrases and sentences. So, for example, <em>do</em> > <em>does</em> would be an issue in morphology while <em>dog barks</em> : <em>does dog bark?</em> would be an issue in syntax.</p>\n\n<p>The whole confusion arose in the Anglo-Saxon world because English expresses with syntax most of what non-analytic languages express with morphology. As long as the main objects of study for linguistis were Latin and Greek, I don't think anyone mixed the two terms. But after WW2 English became the dominant language and with it, the confusion spread.</p>\n\n<p>Linguists who are under weaker influence of American linguistics, however, i.e. those who did not study in an Anglo-Saxon country, or who do not specialize in theoretical linguistics, usually make a very clear distinction between syntax and morphology, often combined with looking down on those who don't.</p>\n\n<p>You ask if the distinction is meaningful. Absolutely. It is only in a purely analytic language that syntax can tackle the issues of morphology. But not even English is purely analytic, so if you stick to the traditional understanding, even in English there are problems (e.g. the formation of plural) that syntax can't deal with. It is only because there is so little morphology in English that the term <em>syntax</em> came to mean for Anglo-Saxons both syntax <em>and</em> morphology simultaneously.</p>\n", "Id":"1497", "ParentId":"836", "LastEditorUserId":"794", "CreationDate":"2012-02-26T16:54:33.500", "OwnerUserId":"794", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-02-26T20:52:39.713", "LastEditedUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}, "LastActivityDate":"2012-02-26T20:52:39.713", "Score":"1", "OwnerUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}}