{"Body":"<p>There were other periods of rapid language changes in Western Europe besides the Renaissance. \"Faster\" is hard to measure.</p>\n\n<p>First, I think you need to specify your point of comparison. There have only been about 300 years since the end of the Renaissance. Of course people have lived in Western Europe for <em>at least</em> 40,000 years, but for this question I suppose we should limit our scope to Indoeuropean languages. IE speakers were certainly in Western Europe by the second millennium BC, 4000 years ago.</p>\n\n<p>So did the languages of Western Europe change at a greater rate during 1400-1700 than at any other 300 year period from 2000 BC- present? We just don't have evidence for most of that period. </p>\n\n<p>So let me suggest: what about the rise of the Romance languages from Vulgar Latin? That happened sometime between the breakup of the Roman Empire and the 9th century. Langue d'oïl is known since the 9th century, Old Spanish since the 10th, and Common Romanian since the 9th.</p>\n\n<p>I don't know how you propose to compare the rate of change. I would certainly say, though, that the rise of the Romance languages within 400 years is as significant as the changes due to the Renaissance. </p>\n\n<p><strong>EDIT</strong>: Since you mention English above: Middle English arose out of Anglo-Saxon starting in 1066 and the transition was rather abrupt, complete by about 1154, the time of the Plantegenets. Invasions have long been a mechanism for rapid language change.</p>\n", "Id":"1512", "ParentId":"1317", "LastEditorUserId":"537", "CreationDate":"2012-02-28T19:33:39.767", "OwnerUserId":"537", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-02-28T19:40:45.343", "LastEditedUser":{"UpVotes":"556", "WebsiteUrl":"http://www.markbeadles.com/", "Id":"537", "AccountId":"297827", "CreationDate":"2011-11-27T02:50:39.717", "AboutMe":"<p>Polymathic renaissance redneck</p>\n", "Age":"47", "Location":"Columbus, OH", "DownVotes":"22", "Views":"30", "Reputation":"3876", "DisplayName":"Mark Beadles", "LastAccessDate":"2013-02-02T04:23:30.703"}, "LastActivityDate":"2012-02-28T19:40:45.343", "Score":"3", "CommentCount":"2", "OwnerUser":{"UpVotes":"556", "WebsiteUrl":"http://www.markbeadles.com/", "Id":"537", "AccountId":"297827", "CreationDate":"2011-11-27T02:50:39.717", "AboutMe":"<p>Polymathic renaissance redneck</p>\n", "Age":"47", "Location":"Columbus, OH", "DownVotes":"22", "Views":"30", "Reputation":"3876", "DisplayName":"Mark Beadles", "LastAccessDate":"2013-02-02T04:23:30.703"}}