{"Body":"<p>I thought the following two passages nicely summarize current thinking on the phoneme in phonology:</p>\n\n<p>\"The most conspicuously unresolved issue in phonology, in my view, is the debate over the classical phoneme that began in the late 1950s. The critiques by Halle (1959) and Chomsky (1964) deprived the traditional phoneme concept of its theoretical legitimacy, but it has nevertheless survived more or less intact in practical applications (such as speech therapy, reading and literacy training, and speech technology),  in linguistic fieldwork, and -revealingly - in beginning linguistics courses. Schane's contention (<a href=\"http://www.jstor.org/stable/412375\" rel=\"nofollow\">1971</a>) that generative phonology had only superficially done away with the phoneme has never been refuted (see further <a href=\"http://cunyphonologyforum.net/papers/LaddDistinctivePhones.pdf\" rel=\"nofollow\">Ladd 2006</a>).\"</p>\n\n<p>Ladd, D. R. 2011. Phonetics in phonology. In John A. Goldsmith, Jason Riggle, and Alan C. L. Yu. 2011. <a href=\"http://www.wiley.com/WileyCDA/WileyTitle/productCd-1444343041.html\" rel=\"nofollow\">Handbook of phonological theory</a>. Oxford: Wiley-Blackwell. </p>\n\n<p>The final draft is available <a href=\"http://www.lel.ed.ac.uk/~bob/gs.ss.pdf\" rel=\"nofollow\">here</a> </p>\n\n<p>Dresher, Elan. 2011. <a href=\"http://www.companiontophonology.com/fragr_image/phoneme\" rel=\"nofollow\">Phoneme</a>. In Marc van Oostendorp, Colin J. Ewen, Elizabeth Hume &amp; Keren Rice, eds., <a href=\"http://www.companiontophonology.com/public/\" rel=\"nofollow\">The Blackwell companion to phonology</a>. Malden, MA: Wiley-Blackwell. (a monumental work on phonology, in 5 volumes, a must-read!)</p>\n\n<p>\"The concept of the phoneme was central to the development of phonological theory. In the early twentieth century, phonological theory was all about the phoneme: how to deﬁne it, how to recognize it, how to discover it (see, for  example, the articles selected for inclusion in Joos 1957 and Makkai 1972). The American structuralist term for phonology, phonemics, indicates to what extent the ﬁeld was considered to be about the phoneme.</p>\n\n<p>Things have now changed. The phoneme, to all appearances, no longer holds a central place in phonological theory. Two recent and voluminous handbooks devoted to phonology, edited by Goldsmith (1995) and by de Lacy (2007), have no chapter on the phoneme. It is barely mentioned in the indexes. <strong>This does not mean that the phoneme plays no role in modern phonology; closer inspection reveals that the phoneme is far from dead</strong> [emphasis mine - Alex B.]. However, it is not much talked about, and when it is, it is more often to dispute its existence than to afﬁrm it.</p>\n\n<p>[...]</p>\n\n<p>As the above survey shows, the phoneme has not disappeared from phonological theory. <strong>The fact that recent handbooks of phonology have no chapters devoted to it is not a sign of its demise; rather, it is a function of the development of phonological theory</strong> [emphasis mine - Alex B.]. The time is past when one can attempt to provide an exhaustive deﬁnition of the phoneme and its properties apart from elaborating a complete theory of phonology. Many current topics in phonology can be viewed as being about aspects of the phoneme, even though the phoneme is not invoked.\"</p>\n\n<p>On the phoneme in psycholinguistics: <a href=\"http://www.springerlink.com/content/x0h17720p9278114/\" rel=\"nofollow\">Uppstad and Tønnessen 2010</a></p>\n", "Id":"1513", "ParentId":"1502", "LastEditorUserId":"445", "CreationDate":"2012-02-28T20:38:53.383", "OwnerUserId":"445", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-02-28T21:34:05.530", "LastEditedUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}, "LastActivityDate":"2012-02-28T21:34:05.530", "Score":"5", "CommentCount":"4", "OwnerUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}}