{"Body":"<p>Sigh, not this again.</p>\n\n<ol>\n<li><p>jlawler notwithstanding, Universal Grammar is not \"merely a claim\", nor is it even a claim.  It is just a name suggested by Chomsky (reviving terminology from French philosophy of the Enlightenment) for <em>whatever aspects of language turn out to be universal across the species</em>.  (Have a look at his 1965 Aspects of the Theory of Syntax, page 5 ff, where he introduced the concept.) The real discussion concerns the <em>content</em> of Universal Grammar - what does it look like, how is it embodied in our genes and in our brain, how does a child's experience alter and mold what UG supplies, and so on.</p></li>\n<li><p>If Nevins, Pesetsky and Rodrigues are correct, Everett's claims about Piraha are irrelevant to this discussion, because (1) they do not contradict any proposals that have been made by anyone about UG (and certainly not by Chomsky, whose views Everett misrepresents), and (2) the data presented by Everett himself fail to support his own claims.  Jlawler says \"evidence first, claims later\", and the NPR paper is all about the evidence.</p></li>\n</ol>\n\n<p>You can find links to all the papers here: <a href=\"http://ling.auf.net/lingBuzz/000411\">http://ling.auf.net/lingBuzz/000411</a></p>\n\n<p>And yes, go read the stuff for yourself and make up your own mind. But watch out for folks who use phrases like \"card-carrying Chomskyan linguists\" or make blanket assertions that a huge field full of evidence, data and hotly contested proposals about UG boils down to \"no actual evidence\".  Read the papers, think, and make up your own mind.</p>\n", "Id":"1525", "ParentId":"1515", "LastEditorUserId":"807", "CreationDate":"2012-03-01T04:55:11.433", "OwnerUserId":"807", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-03-01T05:25:34.437", "LastEditedUser":{"UpVotes":"2", "DownVotes":"0", "Id":"807", "AccountId":"1289485", "Views":"18", "Reputation":"153", "CreationDate":"2012-03-01T04:55:11.433", "DisplayName":"pensator", "LastAccessDate":"2012-03-13T03:32:26.530"}, "LastActivityDate":"2012-03-01T05:25:34.437", "Score":"12", "CommentCount":"28", "OwnerUser":{"UpVotes":"2", "DownVotes":"0", "Id":"807", "AccountId":"1289485", "Views":"18", "Reputation":"153", "CreationDate":"2012-03-01T04:55:11.433", "DisplayName":"pensator", "LastAccessDate":"2012-03-13T03:32:26.530"}}