{"OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "comments":[], "Body":"<p>I think the best way to figure out \"why\" a construction  has to be a certain way \nis to see how it got to be that way, or whether it is usual or not for a language to do things this way. There are three issues:</p>\n\n<ol>\n<li>How does a verb meaning \"to possess\" develop a meaning where it expresses obligation</li>\n<li>Why does the following verb of the embedded clause appear in the infinitive?</li>\n<li>Why is <em>que</em> rather than <em>de</em> or something else used as a subordinator?</li>\n</ol>\n\n<p>As for (1), Heine &amp; Kuteva (2002: 333) name seven frequent grammaticalization sources for the concept of OBLIGATION. These are COPULA, DO, GET, NEED, OWE, H-POSSESSIVE, SUITABLE.\n(An H-possessive is \"a marker of predicative possession expressed, for example, in English by <em>have</em>\". (ibid.: 163)). So let's take it on their authority that it is frequent cross-linguistically for <em>have</em>-like verbs to end up expressing obligation. The fact that <em>ter</em> is, or is related to, a verb helps us to explain why this particular construction has to involved two linked clauses: a matrix clause containing the verb <em>ter</em>, and an embedded clause describing the obliged action.</p>\n\n<p>On a side note, use of Latin <em>habere</em> does actually show up in this sense. (See towards the bottom of the <a href=\"http://www.cnrtl.fr/etymologie/avoir\" rel=\"nofollow\">CNRTL entry for</a> <em>avoir</em>). The quote from Varro that is cited is \"rogas ut id mihi habeam curare\" </p>\n\n<p>So, why is an infinitive used in the embedded clause? Here we can note that cross-linguistically, constructions involving two linked clauses often have a <em>pivot-controller relation</em> (see Van Valin 2005: ch.4) holding between arguments of the two clauses. An argument of one clause which is expressed (the \"controller\") is understood to be coreferential with an unexpressed argument (the \"pivot\") of another clause. Since the person who is obliged to do an action is normally the one who is doing the action, it makes sense for this construction to have a pivot--controller relation where the subject of the matrix clause will be the same as the subject of the embedded clause. The relevant property of the infinitive is that it is not marked for its subject; this is fine since it is unnecessary to indicate the subject. (I don't speak Portuguese, but I am guessing that you couldn't use one of the personal infinitives in place of the regular infinitive in this construction)</p>\n\n<p>Why <em>que</em> instead of some other subordinator? My partial guess is that because the construction probably developed from one with similar meaning, but where <em>ter</em> has an object, e.g. \"Tenho trabalho que fazer\", it will just take the subordinator from that construction.  Note that in French, for example, which has a similar construction <em>avoir à + INF</em>, the relevant form with an object for <em>avoir</em> uses <em>à</em> to introduce the infinitive: \"j'ai ce travaille à faire\".</p>\n\n<p>Heine, B.; Kuteva, T. (2002). World Lexicon of Grammaticalization. CUP [please do not illegally consult the copy posted on scribd.com by some unscrupulous person]</p>\n\n<p>Van Valin, R. (2005). Exploring the syntax-semantics interface. CUP.</p>\n", "Id":"1556", "ParentId":"1522", "CreationDate":"2012-03-03T15:32:41.710", "Score":"3", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2012-03-03T15:32:41.710", "CommentCount":"3"}