{"OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "comments":[], "Body":"<p>The question deals with two ideas: the possibility of recursive embedding of clauses, and the use of case systems. We are asked to entertain a hypothesis that has the following basic parts: </p>\n\n<ol>\n<li>There was some kind of early state in prehistory at which no language had embedding, and where all languages had elaborate case systems. </li>\n<li>The advent of writing encouraged the development of embedding.</li>\n<li>Embedding developed at the expense of case-marking.</li>\n<li>All languages in the world are at some point in the continuum between having an elaborate case system and having recursive embedding.</li>\n</ol>\n\n<p>To be able to begin to entertain this idea, we need to show that case marking and embedding are strategies which can serve the same purpose. I think that this is false.</p>\n\n<p>Case-marking is a strategy for marking dependency relations between heads and dependents, where the marking falls on the dependent. \nAlternate ways of indicating these relations are by marking the head, or by marking neither, but using certain word order patterns to indicate different types of grammatical relations. So if a language lacks case-marking, then it would be reasonable to suppose that it is either a head-marking language, or it has relatively rigid constituent order. We could also suppose that case-marking languages will have more flexible constituent order, and will be less likely to mark grammatical relations. The choice between case-marking and some parallel strategy affects the organization of the language at the clause level.</p>\n\n<p>Clause embedding, however, is a strategy that is reflected primarily at the level above the basic clause. When two clauses are linked, the linking strategy could involve coordination (no embedding), subordination (one clause is embedded in the other), or cosubordination (both clauses are embedded in some higher structure).</p>\n\n<p>Basically, I can't see now how this theory has any <em>a priori</em> plausibility right now. I don't think it should be explored further until we can get an explanation for why, on linguistic grounds, case-marking as an organizational strategy in grammar should <strong>compete with</strong>, rather than work in conjunction with, clause embedding.</p>\n", "Id":"1562", "ParentId":"1548", "CreationDate":"2012-03-03T19:57:13.230", "Score":"7", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2012-03-03T19:57:13.230", "CommentCount":"28"}