{"Body":"<p>Newmeyer and Emonds (1971: 301) mention that a</p>\n\n<blockquote>\n  <p>\"...result of the reliance on outside funding agencies is the occasional\n  deliberate falsification of the nature of linguistic work.\"</p>\n</blockquote>\n\n<p>Probably a bit <em>too</em> cynical, but it comes close to the present situation. The endangered languages cause has captured the imagination of the public, and it is the best shot the field has had at making its work recognized as worthwhile since the idea of automatic translation. Even though language preservation falls more within the bounds of applied linguistics, it is something that professional linguists have found themselves involved in, partly because it is a good selling point for government funding agencies, and partly because they would like to find a way of giving back to the communities that they work in (in the case of field linguists).</p>\n\n<p>For those interested in how language endangerment has been approached by traditional linguists, a \"classic\" publication is a collection of essays published in 1992 in <em>Language</em> (Hale et al 1992). The previous year the French journal <em>Diogène</em> (no.153) dedicated an issue to the topic (though with much less exposure). A good and very recent report on language vitality by family can be found in <em>Language 88(1):155--173</em> (<a href=\"http://scholarspace.manoa.hawaii.edu/handle/10125/5017\">similar open access material here</a>). The contributors to the 1992 article stressed the following points:</p>\n\n<ol>\n<li>Linguists should be concerned about the rapid loss of their data sources.</li>\n<li>Language extinction is progressing at a very rapid rate.</li>\n<li>Speaker communities must be empowered to save their languages.</li>\n<li>Loss of linguistic diversity is as serious a threat to the world's natural resources as is the loss of biological diversity.</li>\n</ol>\n\n<p>The first two points are generally uncontroversial, though linguists tend to take different stances as to the last two. Peter Ladefoged, for example, published <a href=\"http://www.ling.ohio-state.edu/~bjoseph/Ling311/Ladefoged.pdf\">a reply</a> to the Hale et al paper, where he noted that:</p>\n\n<ol>\n<li>Communities should have the right to choose the fate of their languages. In some cases, the best policy for a young country, to produce national unity, is to <em>discourage</em> multilingualism, since it is thought to reinforce tribalism.</li>\n<li>Cultural diversity does not necessarily require that different languages be spoken.</li>\n</ol>\n\n<p>On the first point, consider this statement attributed to a Cameroonian government official upon learning that the most recent version of the Ethnoloque included more languages for Cameroon than the previous version:</p>\n\n<blockquote>\n  <p>Vous voyez ce que je vous dis à propos des linguistes Camerounaises\n  là? Leurs langues là se marie maintenant et cette fois ci, elles ont\n  produit 17 nouveaux langues pendant cinq ans.   [You see what I'm saying about these Cameroonian linguists? Their languages are getting married and now they've produced 17 new languages in five years.]</p>\n</blockquote>\n\n<p>Anyways, to discuss the endangered language issue with more sophistication, it is nowadays common to distinguish between <strong>Language Documentation</strong> and <strong>Language Conservation.</strong> An <a href=\"http://nflrc.hawaii.edu/ldc/\">open access journal</a> has recently been founded for academic studies devoted to both of these topics. Language documentation concerns making transparent records of languages which can be used for research even after the language ceases to be spoken. Language conservation refers to activism by or on behalf of communities speaking endangered languages to either protect the language from endangerment, or to try to revitalize the language before it falls into complete disuse.</p>\n\n<p>So, linguists do not necessarily have an interest in language preservation (though many do), but most have an interest in language documentation. The <a href=\"http://www.nysun.com/opinion/dying-languages/45847/\">comments by John McWhorter</a> are not very far from the approach some linguists take:</p>\n\n<blockquote>\n  <p>I hope that dying languages can be recorded and described. I hope\n  that many persist as hobbies, taught in schools and given space in the\n  press, as Irish, Welsh, and Hawaiian have.</p>\n  \n  <p>However, the prospect we are taught to dread — that one day all the\n  world's people will speak one language — is one I would welcome.\n  Surely easier communication, while no cure-all, would be a good thing\n  worldwide.</p>\n</blockquote>\n\n<p>on the opposite side, there is this often-repeated quote attributed to Ken Hale:</p>\n\n<blockquote>\n  <p>The death of a language is a disaster. It’s as if someone had dropped\n  a bomb on the Louvre.</p>\n</blockquote>\n\n<p>Hale, Kenneth; Krauss, Michael; Watahomigie, Lucille J.; Yamamoto, Akira Y.; Craig, Colette; Jeanne, LaVerne M. et al. (1992). Endangered languages. Language, 68 (1), 1-42.</p>\n\n<p>Newmeyer and Emonds. 1971. \"The Linguist in American Society.\"\nPapers from the Seventh Meeting of the Chicago Linguistic Society,\n285-303. Chicago: Chicago Linguistic Society.</p>\n", "Id":"1574", "ParentId":"1549", "LastEditorUserId":"483", "CreationDate":"2012-03-05T23:54:01.787", "OwnerUserId":"483", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-03-10T21:03:15.153", "LastEditedUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "LastActivityDate":"2012-03-10T21:03:15.153", "Score":"19", "CommentCount":"1", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}