{"Body":"<p>This is a very important question, I think. It's central to digitization of linguistic materials on the web. I've been working on some (open source) software tools for doing this sort of thing for a while now, and while it's in too much of a messy state to be of immediate use to you, I hope it's okay if I write at some length about the approach to marking up glosses that I've found most useful, after a lot of experimentation.</p>\n\n<p>I've found that the most important thing to get right in marking up glosses is to make sure that the structure makes sense. Usually, the goal of glossing is to annotate words (and sometimes morphemes) with translations for the semantics and labels for the grammatical categories. So let's take a simple example Spanish <strong>hablo</strong> as in <strong>Yo hablo español.</strong> This might be glossed:</p>\n\n<blockquote>\n  <p><strong>yo habl-o español</strong>\n  <br> I speak-1sg.PRES Spanish</p>\n</blockquote>\n\n<p>Note that there lots of variations of how one might gloss this sentence, depending on the linguistic topic at hand and the level of specificity. For instance, there might be a citation tier, an orthographic tier, a phonetic tier, a morphological tier, and a free translation:</p>\n\n<blockquote>\n  <p>(1) Snifty 2012\n  <br> <strong>Yo hablo español.</strong>\n  <br> jo ˈaβl-o espaˈɲol\n  <br> I speak-1sg.PRES Spanish\n  <br> \"I speak Spanish.\"</p>\n</blockquote>\n\n<p>Some linguists work with far more tiers -- multiple orthographies, tone, whatever. But for the purposes of discussion let's stick with something simple -- morphologically delimited orthography, morphological analysis, and a free translation. </p>\n\n<p>Now the first thought in my mind when I set out to start digitizing such thing was \"well, it's <em>interlinear</em> glossing, so I'm going to be <em>inter</em>-calating <em>lines</em>.\" So, something like:</p>\n\n<pre><code>&lt;div class=gloss&gt;\n  &lt;p class=sentence lang=es&gt;yo habl-o español&lt;/p&gt;\n  &lt;p class=morphological&gt;I speak-1sg.PRES Spanish&lt;/p&gt;\n  &lt;p class=free lang=en&gt;I speak Spanish.&lt;/p&gt;\n&lt;/div&gt;\n</code></pre>\n\n<p>This seems reasonable enough at first. (And in fact some online projects have used quite a similar form of markup, check out the source of this <a href=\"http://www.wulfila.be/gothic/browse/text/?book=1&amp;chapter=10\">Gothic text</a>.) But there are difficulties in glossing if we get beyond a short, simple example sentence. The most glaring problem is that things don't line up right. What if the example sentence isn't <em>Yo hablo español</em>, but rather <a href=\"http://qu.wikipedia.org/wiki/Qhichwa_simi\"><em>Qhichwa Simi Hamut'ana Kuraq Sunturtaq ninmi, huklla simi, Qusqu llaqtap rimayninmi huklla allin qhichwa simi, nispa.</em></a></p>\n\n<p>The fact of the matter is that things will get ugly fast. Consider:</p>\n\n<ul>\n<li>What do we do to make sure words and their tiered annotations align vertically across the various lines? </li>\n<li>How do we handle line wraps? </li>\n</ul>\n\n<p>One horrid thought was to use tables -- one could argue that a gloss is ''kind of'' tabular, I guess. At least vertical alignment could be handled. So:</p>\n\n<pre><code>&lt;table&gt;\n  &lt;tr&gt;\n    &lt;td&gt;yo&lt;/td&gt;    &lt;td&gt;habl-o&lt;/td&gt;    &lt;td&gt;español&lt;/td&gt;\n  &lt;/tr&gt;\n  &lt;tr&gt;\n    &lt;td&gt;I&lt;/td&gt;    &lt;td&gt;speak-1sg.PRES&lt;/td&gt;    &lt;td&gt;Spanish&lt;/td&gt;\n  &lt;/tr&gt;\n  &lt;tr&gt;\n    &lt;td&gt;I speak Spanish.&lt;/td&gt;\n  &lt;/tr&gt;\n&lt;/table&gt;\n</code></pre>\n\n<p>All this for a three-word sentence? This is just awful. You have to keep track of which <code>td</code> corresponds to each of the other <code>td</code>s in all of the other <code>tr</code>s... and the free translation \"row\" isn't really a row at all. Imagine trying to set that Runasimi sentence from above... Blech! </p>\n\n<p>And it's this sort of problem that I think motivates the key insight about marking up glosses: </p>\n\n<blockquote>\n  <p><strong>A word and its annotations should be siblings in the markup, and anything above the level of a word should be represented as a list of word-level items.</strong></p>\n</blockquote>\n\n<p>We can view such a structure, as a nested HTML list:</p>\n\n<ol>\n<li>\n<ol>\n<li>yo</li>\n<li>I</li>\n</ol></li>\n<li>\n<ol>\n<li>habl-o</li>\n<li>speak-1sg.PRES</li>\n</ol></li>\n<li>\n<ol>\n<li>español</li>\n<li>Spanish</li>\n</ol></li>\n</ol>\n\n<p>Although it looks quite weird in this format (especially with this site's default CSS), this is actually, I think, the \"right\" structure for capturing what's really going on in a so-called interlinear gloss. Here's how markup for that might look:</p>\n\n<pre><code>&lt;ol class=sentence&gt;\n  &lt;li&gt;\n    &lt;ol class=word&gt;\n      &lt;li lang=es&gt;yo&lt;/li&gt;\n      &lt;li lang=en_MORPH&gt;I&lt;/li&gt;\n    &lt;/ol&gt;\n  &lt;/li&gt;\n\n  &lt;li&gt;\n    &lt;ol class=word&gt;\n      &lt;li lang=es&gt;habl-o&lt;/li&gt;\n      &lt;li lang=en_MORPH&gt;speak-1sg.PRES&lt;/li&gt;\n    &lt;/ol&gt;\n  &lt;/li&gt;\n\n  &lt;li&gt;\n    &lt;ol class=word&gt;\n      &lt;li lang=es&gt;español&lt;/li&gt; \n      &lt;li lang=en_MORPH&gt;Spanish&lt;/li&gt;\n    &lt;/ol&gt;\n  &lt;/li&gt;\n\n&lt;/ol&gt;\n</code></pre>\n\n<p>Now, this might not intuitively look much like a gloss at first blush, at least not visually. But the structure is right. And in fact, with a little CSS, we can render these nested lists in a way that looks exactly like a traditional gloss, and which behaves correctly.</p>\n\n<p>We can't mess with CSS in the posts within this site itself, but you can check out this <a href=\"http://jsfiddle.net/snifty/Ty8Vp/2/\">jsfiddle</a> to see what I'm talking about.</p>\n\n<p>You'll notice that the very same markup of that three-word sentence wraps correctly if we place it inside a wrapper with a fixed width. </p>\n\n<p>There's a lot more that could be said about this topic. Specifically, I haven't answered the OP's question with regard a tool for generating such markup, but I think something along the lines of the nifty tool that Nat put together above could solve the problem. </p>\n\n<p>I think it would be worth having a discussion about more generic tools for editing, saving, searching, and otherwise manipulating and sharing glosses on the web. (I've been trying to wrap my head around <a href=\"http://documentcloud.github.com/backbone/\">backbone.js</a> as a tool to do just this sort of thing, but the learning curve is pretty steep.)</p>\n", "Id":"159", "ParentId":"3", "LastEditorUserId":"136", "CreationDate":"2011-09-15T03:46:31.607", "OwnerUserId":"136", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-01-15T20:26:39.420", "LastEditedUser":{"UpVotes":"44", "Location":"United States", "DownVotes":"2", "Id":"136", "AccountId":"9694", "Views":"5", "Reputation":"296", "CreationDate":"2011-09-15T00:29:20.830", "DisplayName":"pat", "LastAccessDate":"2013-12-16T02:10:37.907", "AboutMe":"<p>I'm a linguist, so all of the programming that I slog may way through has to do with language or linguistics in one way or another. </p>\n\n<p>I've been programming for a long time but I still feel like I've got a long way to go. But maybe that's how I <em>should</em> feel. :)</p>\n\n<p>I'm a big believer in the idea that just a little technical skill can be very useful for people in many fields. So I spend a fair amount of time trying to explain things like HTML and CSS and perhaps a little Python or something to other people. </p>\n\n<p>If anyone out there is interested in working on open source projects for linguistics, please get in touch.</p>\n\n<p>I have a Github account but it's a bewildering pile of crap right now, I'll try to get around to cleaning that up and then I'll post it here.</p>\n"}, "LastActivityDate":"2012-01-15T20:26:39.420", "Score":"10", "OwnerUser":{"UpVotes":"44", "Location":"United States", "DownVotes":"2", "Id":"136", "AccountId":"9694", "Views":"5", "Reputation":"296", "CreationDate":"2011-09-15T00:29:20.830", "DisplayName":"pat", "LastAccessDate":"2013-12-16T02:10:37.907", "AboutMe":"<p>I'm a linguist, so all of the programming that I slog may way through has to do with language or linguistics in one way or another. </p>\n\n<p>I've been programming for a long time but I still feel like I've got a long way to go. But maybe that's how I <em>should</em> feel. :)</p>\n\n<p>I'm a big believer in the idea that just a little technical skill can be very useful for people in many fields. So I spend a fair amount of time trying to explain things like HTML and CSS and perhaps a little Python or something to other people. </p>\n\n<p>If anyone out there is interested in working on open source projects for linguistics, please get in touch.</p>\n\n<p>I have a Github account but it's a bewildering pile of crap right now, I'll try to get around to cleaning that up and then I'll post it here.</p>\n"}}