{"comments":[], "Body":"<p>I'll tell you how I handle these kinds of issues when I am doing fieldwork.</p>\n\n<p>To make sure that you will not have problems with dialectal differences, go to the town where the language is spoken and do some preliminary surveying, asking people whether everyone around generally speaks in the same way, and if more than one language or dialect is spoken in the area, get the names of all the different speech varieties.</p>\n\n<p>When you meet a linguistic informant for the first time, find out where they were born, where they have lived, and the native languages of both of their parents. If differences between informants arise, try to see which of these factors may be responsible. If somebody tells you that a sentence is acceptable, ask them to repeat it out loud to make sure it sounds right when they say it. On another day, ask a different person about it to make sure that they accept it too. If you find that people with similar life stories reliably disagree about the status of a particular construction, or the same person keeps changing their mind just accept that there is variability, and don't let any important generalizations you want to make be supported only by a contested variant.</p>\n\n<p>If you have no corpora or other documentation, start making them. Ask people if you can record them conversing in their language, or if they can tell you a story in the language, then sit down with someone and write it down and translate it word for word as best as you can with their help. You should be collecting, as well, a list of a few hundred different different words of the major word classes, and an as complete as possible list of the words in minor word classes. </p>\n\n<p>When you notice a new construction, and do not know if it is lexically idiosyncratic, try replacing some of the words with other words from your wordlist and see if the informants accept those sentences as well. A lexically idiosyncratic construction will quickly be discovered this way. You may also determine that certain constructions are only acceptable for verbs of a certain transitivity or aspectual class. Try to put the sentence in the negative, make it a question, change the tense, etc., to see how productive the construction is.</p>\n\n<p>If you notice a new construction, but aren't sure what it means, try to change out the words you know with other words, see if the informant finds it acceptable, and then ask them to describe in detail in what kind of situation it would be most appropriate to say this thing.\nRepeat this a few times until you get an idea about what the construction is used for. This will help you gain intuitions about the acceptability of variations on it.</p>\n\n<p>So there are not really any special tricks, just work hard.</p>\n", "Id":"1630", "ParentId":"1628", "CreationDate":"2012-03-13T22:50:02.230", "Score":"11", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2012-03-13T22:50:02.230", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}