{"comments":[], "Body":"<p>You ask, \"How can the linguist be sure that grammaticality is not just the test subject's dialect?\"  </p>\n\n<p>It sounds like you're making an unwarranted assumption in that question.  You <em>can't</em> be sure that you're not just learning about the test subject's dialect.  In fact, it's just the opposite: no matter what you do, you <em>are</em> just learning about the test subject's dialect &mdash; or about <em>one of</em> their dialects, if they're fluent in several.  And the way to do good fieldwork is just to accept that fact and work with it.  You start with the speech of a single town (or family, or person), you note down variation when you run across it, and you gradually widen your sights from there.</p>\n\n<p>It's important to remember here that <em>everyone speaks a dialect.</em>  For instance, there is no such thing as \"pure,\" non-dialectal English.  And this means that, strictly speaking, \"grammaticality\" <em>is</em> always just \"grammaticality in a particular dialect.\"  When a linguist says a construction is \"grammatical in English,\" what they really mean is, \"It's grammatical in the American and British dialects that are culturally dominant right now in the anglophone world.\"  And in fact, to be really pedantically correct, they'd have to say  \"It's grammatical in the personal idiolects of most or all of the people we've surveyed who belong to the American and British dialect groups that are culturally dominant right now in the anglophone world.\"  Which is a bit of a mouthful &mdash; you can see why someone might just say \"It's grammatical in English\" instead.</p>\n\n<p>Also, as jlovegren points out, there <em>are</em> ways of getting a decent idea of how widespread a construction is.  You talk to different people, from different regions.  You take advantage of your consultants' metalinguistic awareness: someone in Philadelphia will tell you \"Oh, yeah, they talk funny in Pittsburgh,\" and then you know to be on the lookout for especially big dialect differences between the two cities.  Sometimes you can pick a particular construction and ask \"Do people in other towns say this too?\" and someone will say \"No, actually, whenever I say this outside my home town, I get funny looks,\" and that's an even stronger indication that you're looking at a construction that's limited to certain dialects.  Even better, some people are bi- or tri-dialectal, and can tell you things like \"Where I was born they say <em>this,</em> but where I grew up we say <em>this,</em> and on TV what they say is <em>this.</em>\"</p>\n\n<p>Ultimately, though, you can never be absolutely certain you haven't missed some bit of variation.  If I can elicit a construction from a thousand different people, covering all the major dialect regions I'm aware of, there's still a miniscule sliver of a chance that the thousand-and-first person will say \"No, I would never say that, that's totally wrong.\"  The only consolation here is that <em>any</em> natural science has the same problem.  All the terrestrial life forms we've found so far are carbon-based, but it's still logically possible that someday we'll turn over a rock and find a bunch of silicon-based ones.  The strongest conclusion we can ever draw about anything outside of mathematics is \"That hasn't happened yet, and we'd be incredibly surprised if it ever did.\"  I'd be incredibly surprised to find a monolingual English speaker from a major American city who didn't say \"S + [be] + VERBing,\" but you know, it's still technically possible that someday I will.</p>\n", "Id":"1635", "ParentId":"1628", "CreationDate":"2012-03-14T17:06:17.957", "Score":"6", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2012-03-14T17:06:17.957", "OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}}