{"OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "comments":[], "Body":"<p>I too would like a link to the paper: a Google search for <code>anand hacquard \"witness world\"</code> turns up this thread and nothing else.  But I can take a stab at a general answer.  </p>\n\n<p>The notions of possibility and necessity in modal logic are commonly treated as involving quantification over possible worlds.  So \"It's possible that <em>P</em>\" is taken to mean that there exists a world where <em>P</em> is true, and \"Necessarily <em>P</em>\" is taken to mean that in <em>all</em> worlds, <em>P</em> is true.  We can get different sorts of possibility and necessity by restricting the set of worlds we quantify over.  So for instance, for deontic modals, we quantify over worlds that are in accordance with the rules.  (\"John is permitted to do <em>x</em>\" means roughly the same thing as \"there exists a world in which no rules are being broken, in which John does <em>x</em>\")  For epistemic modals, we quantify over worlds that are consistent with our current knowledge.  (\"For all I know, maybe <em>P</em>\" means, roughly, \"there exists a world that's consistent with what I know, in which <em>P</em> is true.\")  </p>\n\n<p>The semantics of modal expressions in <em>natural</em> language can be modeled this way too, though there are some additional complications.  Kratzer's 1991 paper \"Modality\" is the classic reference here, but unfortunately I can't find a copy online.  </p>\n\n<p>In this context, a \"witness world for <em>P</em>\" is just a world in which <em>P</em> is true.  So for instance, we can say that for \"possibly <em>P</em>\" to be true, there must be at least one witness world for <em>P</em> within our domain of quantification.  This is indeed similar to the way the word \"witness\" is used in talking about nominal quantification &mdash; it's just that here we're quantifying over worlds instead of entities.  </p>\n", "Id":"1646", "ParentId":"1638", "CreationDate":"2012-03-15T15:47:06.347", "Score":"1", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2012-03-15T15:47:06.347", "CommentCount":"1"}