{"Body":"<p>In traditional grammar, the word <em>doing</em> is a <strong>participle</strong> in all your examples. It modifies the subject, <em>I</em>. This can be made more visible by reversing the word order, which results in a somewhat artificial but transparent sentence with identical meaning:</p>\n\n<blockquote>\n  <p>Doing my homework, I spent the whole evening.</p>\n</blockquote>\n\n<p>Your construction is the same as in these sentences:</p>\n\n<blockquote>\n  <p>I hurt my hand repairing the car.</p>\n  \n  <p>I left the house running.</p>\n</blockquote>\n\n<p>A participle often expresses the circumstances in which the subject performs the action of the finite verb; that is why you can often replace it with a <em>while</em> or <em>because</em> clause, an adverbial constituent of time or cause:</p>\n\n<blockquote>\n  <p>I spent the whole evening <em>because/while I was</em> doing my homework.</p>\n</blockquote>\n\n<p>A feature of English (<a href=\"http://en.wikipedia.org/wiki/Ellipsis_%28linguistics%29\" rel=\"nofollow\">ellipsis</a>) is that we can sometimes leave out the subject and the form of <em>to be</em>. In this case, that is possible with <em>while</em> if the subject is the same as that of the main clause and the finite verb is a form of <em>to be</em>. Then we get this:</p>\n\n<blockquote>\n  <p>I spent the whole evening <em>while</em> doing my homework.</p>\n</blockquote>\n\n<p>But this elliptic clause is still quite different from the participial construction in your examples; notice how the ellipsis is not possible with <em>because</em>.</p>\n\n<hr>\n\n<p>Now let's consider your first example:</p>\n\n<blockquote>\n  <p>I felt good doing my homework.</p>\n</blockquote>\n\n<p>The fact that <em>my homework</em> is also felt to be identical to the thing you feel good about is accidental, it is a red herring: the construction is exactly the same as in <em>I hurt my hand repairing the car</em>, where <em>repairing the car</em> is in no way the thing you hurt your hand about/in/whatever.</p>\n\n<hr>\n\n<p>One could add a preposition in your first example:</p>\n\n<blockquote>\n  <p>I felt good <em>about</em> doing my homework.</p>\n</blockquote>\n\n<p>But that doesn't prove anything: the word <em>about</em> cannot normally be left out in English, so this is an entirely different construction. The fact that there is little change in meaning is, again, a coincidence rather than a structural feature.\nIn this construction, <em>doing</em> is a gerund (not a participle), because it functions as a noun. Only things that function as nouns can be the object of a preposition. You can see that it is not possible in other instances of the same construction, which shows that <em>doing</em> is no gerund here:</p>\n\n<blockquote>\n  <p>*I spent the whole evening <em>about</em> doing my homework.</p>\n</blockquote>\n", "Id":"1651", "ParentId":"1648", "LastEditorUserId":"82", "CreationDate":"2012-03-15T22:30:12.020", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-03-15T23:43:46.983", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2012-03-15T23:43:46.983", "Score":"1", "CommentCount":"1", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}