{"Body":"<p>This question is pretty old now, and the answers have demonstrated that the consensus (in the English- and Japanese-speaking world at least) is strongly in favor of the particle explanation, but here is something that might interest you from Alexander Vovin's Descriptive and Comparative Grammar of Western Old Japanese (volume I, pp 109-102):</p>\n\n<blockquote>\n  <p>Case markers are traditionally defined in both Japanese and Western traditions as particles (Jp. <em>kakujoshi</em> 格助詞) [<em>long list of references</em>]. However, in another major school of Japanese studies, the Russian school, three conflicting points of view have been debated over a long period of time. According to one, Japanese case markers are <strong>agglutinative suffixes</strong> (Konrad 1937: 81-83), (Fel'dman 1979: 60-61), (Syromiatnikov 1972: 96); the supporters of the second point of view consider them to be <strong>postpositions</strong> (Vardul' 1964: 33-36), (Golovnin 1970: 18; 1986: 227); while according to the third point of view, they are classified neither as suffixes, nor as postpositions, but as <strong>agglutinative case markers</strong> (Pashkovskii 1957: 117), (Alpatov 1981; 34-41). The last point of view is exactly the one I adhere to [...]</p>\n</blockquote>\n\n<p>(Bold emphasis mine.) The reasons Vovin gives for adhering to the \"agglutinative case marker\" theory are, in summary:</p>\n\n<p>A) Old Japanese case markers are not \"flective\": there is \"one and only one\" grammatical meaning per case markers, and no fusion with the stem. This is unlike the situation in, say, Indo-European, where a noun ending might contain the meanings \"plural\" and \"dative\" without being (synchronically) divisible into a \"plural\" morpheme and a \"dative\" morpheme.</p>\n\n<p>B) On the other hand, \"it is impossible to insert anything between the stem and the case marker except plural markers, restrictive particles <em>Npakari</em>, <em>sapey</em>, and <em>dani</em>, or, in some cases, another case marker. These limitations would be unlikely if these were pure particles or postpositions, because the latter are less bound with the stem.\"</p>\n\n<p>He doesn't specify whether he believes that \"agglutinative case marker\" remains the best explanation through to Modern Japanese, incidentally, but it seems fair to at least tentatively assume that he does. </p>\n\n<p>I checked the bibliography of the book for the references above, and here's what I found:</p>\n\n<ul>\n<li>Konrad 1937: Not listed</li>\n<li>Fel'dman 1979: Not listed, but there is this: \"Fel'dman, Nataliia I. 1960. Iaponskii iazyk [The Japanese Language], Moskva: Nauka\"</li>\n<li>Syromiatnikov, Nikolai A. 1972. Drevneiaponskii iazyk [The Old Japanese language]. Moscow: Nauka.</li>\n<li>Vardul' 1964: Not listed, but there is this: \"Vardul', Igor' F. 1965. 'O prirode iaponskikh <em>ganio</em> [On the nature of Japanese <em>ganio</em>],' Morfologicheskaia tipologiia i problema klassifikatsii iazykov. [The morphological typology and the problem of language classification], Moscow-Leningrad: Nauka, pp. 35-61\" (I assume that \"ganio\" means \"が、に、を\")</li>\n<li>Golovnin, Ivan V. 1970. \"K voprosu o klassifikatsii leksiki iaponskogo iazyka [To the problem of the classification of parts of speech in the Japanese language]', Voprosy iaponskoi filologii 1:14-29.</li>\n<li>Pashkovskii, A.A. 1957. 'K kharakteristike iaponskikh sintaksem [On the characteristic of one of the Japanese syntagmatic units]', Sovetskoe Vostokovedenie 2:89-123.</li>\n<li>Alpatov, Vladimir M. 1981. 'Eshche raz o kharaktere <em>ganio</em> v sovremennom iaponskom iazyke [Once again on the nature of <em>ganio</em> in the modern Japanese language],' Voprosy iaponskoi filologii 5.34-41.</li>\n</ul>\n\n<p><em>UPDATE</em></p>\n\n<p>You can see the same argument, slightly expanded and put into a post-OJ context, in Vovin's A Reference Grammar of Classical Japanese Prose, <a href=\"http://books.google.co.jp/books?id=24GTVscUCX0C&amp;pg=PA47&amp;lpg=PA47&amp;source=bl&amp;ots=r1iKIlqwaB&amp;sig=zPdG2hb5VZYzQ4N8m3uwCfqbq1c&amp;hl=ja&amp;sa=X&amp;ei=FnRmT92dKuTY0QGroZi9CA&amp;ved=0CCUQ6AEwAA#v=onepage&amp;q&amp;f=false\" rel=\"nofollow\">here</a>. Points of interest:</p>\n\n<ul>\n<li>Vovin explicitly says that \"the character of these case markers joining to the stem is not different from that of, let us say, Turkish\". (He does this in the first book I cited, too, but I left it out for brevity; this was probably unwise.)</li>\n</ul>\n\n<p>This:</p>\n\n<blockquote>\n  <p>However, contrary to Modern Japanese and Turkish, in the Heian period most case markers had their own accent, independent of a preceding noun (Wenck 1959: 403; Martin 1987: 169-170); they therefore cannot be defined as agglutinative suffixes. <strong>I prefer to use the term 'agglutinative case marker', which is meant to show that these elements occupy an intermediate position between agglutinative suffixes and particles.</strong></p>\n</blockquote>\n\n<p>Also note that Vovin is talking about what he calls \"case markers\", and his list of same is: ga, no, ni, o, to, yori, kara, e, made. \"Wa\" is not on the list, and in fact on the next page he calls this \"the topic particle\" and uses it as an example of what \"pure particles\" are like.</p>\n", "Id":"1662", "ParentId":"39", "LastEditorUserId":"755", "CreationDate":"2012-03-18T05:40:44.647", "OwnerUserId":"755", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-03-19T00:09:39.590", "LastEditedUser":{"UpVotes":"45", "WebsiteUrl":"http://no-sword.jp/blog/", "DownVotes":"0", "Id":"755", "AccountId":"531588", "Views":"3", "Reputation":"241", "CreationDate":"2012-02-09T01:38:23.797", "DisplayName":"Matt", "LastAccessDate":"2012-11-16T02:07:45.490", "AboutMe":""}, "LastActivityDate":"2012-03-19T00:09:39.590", "Score":"5", "CommentCount":"2", "OwnerUser":{"UpVotes":"45", "WebsiteUrl":"http://no-sword.jp/blog/", "DownVotes":"0", "Id":"755", "AccountId":"531588", "Views":"3", "Reputation":"241", "CreationDate":"2012-02-09T01:38:23.797", "DisplayName":"Matt", "LastAccessDate":"2012-11-16T02:07:45.490", "AboutMe":""}}