{"comments":[], "Body":"<p>Let's say that you are talking about head-marking languages, and by \"overt marking for embedding\" you mean that dependent clauses must be modified by some kind of subordinating particles. Let me give an example and assume that this is what you are talking about. The example is from Classical Nahuatl, Anderson &amp; Dibble's edition of the <em>Florentine Codex</em>.</p>\n\n<pre><code>notza-lo      in   tlamacazque huehuetque, in  in-toca        cuacuacuiltin: yehuantin caqui-ti-lo\nsummon-NONACT the  spirit      old.men     the 3pl.poss-name  C.             they      hear-APPL-NONACT\n\"...the old priests, whose names were quaquacuiltin, were summoned; these were informed...\"\n</code></pre>\n\n<p>The English translation contains a relative clause, but there is no kind of subordinate marking in the Nahuatl version. A more or less literal translation will be: \"[They] are called. They are priests. Their names are Quaquacuiltin. They are summoned.\" The verbs can appear by themselves and be a full clause. So can the nouns. The particle I've glossed \"the\" is itself optional. There is just not much \"glue\" holding the words of the sentence together. </p>\n\n<p>I can't think of a very reason why dependent clauses in head-marking languages should lack particles which mark them as dependents. A not too thoughtful reason is that since dependents at the sub-clause level receive no marking (that is what makes it a head-marking language) the same phenomenon just applies to dependents at the clause- and higher level.</p>\n\n<p>It could be on the other hand that clause subordination is a language specific issue that does not fully apply to head-marking languages. I'll conclude with two quotes:</p>\n\n<p><a href=\"http://http://faculty.washington.edu/bcitko/LING%20480/nichols.pdf\" rel=\"nofollow\">Nichols (1986: 114)</a> [this paper is worth reading in its entirety if you haven't already]</p>\n\n<blockquote>\n  <p>Head-marked patterns contribute to a flat syntax which minimizes\n  intra-clause and inter-clause structure, freeing a language to\n  concentrate on the grammaticalization of discource prominence and\n  cohesion. In fact it turns out that it is precisely for head-marking\n  languages that a number of traditional grammatical questions prove to\n  be somewhat moot, because pragmatic and discourse relations (rather\n  than strictly syntactic relations) are being grammaticalized.</p>\n</blockquote>\n\n<p><a href=\"http://elanguage.net/journals/index.php/bls/article/download/2347/2309\" rel=\"nofollow\">Haiman &amp; Thompson (1984: 510)</a> </p>\n\n<blockquote>\n  <p>...the term \"subordination\" seems to be at best a negative term which\n  lumps together all deviations from some \"main clause\" norm, and thus\n  treats as unified a set of facts which we think is not a single\n  phenomenon...</p>\n</blockquote>\n\n<p>For a cross-linguistically-informed approach to clause linkage, consider perusing some of th e literature in the Role and Reference Grammar framework. (<a href=\"http://linguistics.buffalo.edu/people/faculty/vanvalin/rrg.html\" rel=\"nofollow\">website</a>)</p>\n", "Id":"1665", "ParentId":"1661", "CreationDate":"2012-03-18T23:12:38.393", "Score":"2", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2012-03-18T23:12:38.393", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}