{"OwnerUser":{"UpVotes":"432", "WebsiteUrl":"", "Location":"United States", "Id":"4", "DownVotes":"2", "AccountId":"167219", "Views":"42", "Reputation":"1906", "CreationDate":"2011-09-13T20:24:01.087", "DisplayName":"Mitch", "LastAccessDate":"2014-01-15T11:56:51.610", "AboutMe":"<p>Native speaker of American English (AmE) with touches of Southern AmE.\nProficient in French and German. Elementary knowledge of Mandarin. Basic knowledge of linguistics.</p>\n"}, "comments":[], "Body":"<p>Short answer: It's a matter of taste: prescriptivism has a tendency to authoritarianism against non-standard varieties, and there is a quasi-hypocritical tendency to to make up rules that are either arbitrary or just wrong.</p>\n\n<p>Longer Answer: Linguistics is a science which takes basic data (how people speak) and tries to organize it and systematize it. It naturally attempts to make predictive rules out of the data. It turns out there are natural categories; groups of people tend to talk like one another, and there are fairly sharp demarcations between them (English and French say). So linguists are very rule based, coming up with rules that say 'in situation X, you say \"A B C\" and not \"A C B\"'.</p>\n\n<p>These rules are very useful when learning a foreign language because, as it turns out, the rules are different from language to language. You should say \"A B C\" if you want to sound like you're from a particular community. That is both prescriptive and descriptive ('you should' and 'that's what people say').</p>\n\n<p>But as categorical as languages might seem, there's more than you think. There's not just a single formal exact \"English', there are different registers, different dialects, and choosing between one and another is purely a sociological problem (who is admired? who is forced to do what?). So in some sense, what kids learn in school is this 'formal' language which may or may not be different from their home language (where double negatives might be perfectly everyday). 'That ain't no difference to me' is perfectly grammatical -in certain registers of speech (and certain regions). It is ungrammatical in -standard English- but perfectly grammatical in others. ('That are not no difference to me' is ungrammatical in all the varieties of English I can think of). When people (teachers) say that the double negative is bad or incorrect English, they are correct for -standard- English. When they say 'you use bad (or incorrect) grammar' because you used a double negative, they are making a sociological statement that your language (however rule based it may be) is not -socially- acceptable.</p>\n\n<p>Another problem with prescriptivism (that gives it a somewhat bad name) is that some of the rules it puts forth are just not actually descriptive rules for any variety, like the 'split infinitive' or 'don't end a sentence with a preposition'. People really do use those things when they speak; they've just been deprecated artificially by some arbitrary style choice. School teachers propagate them because in the course of correcting performance or attention errors with actual rules, it is difficult to distinguish real rules from made-up ones.</p>\n\n<p>Prescriptivists (and school teachers) are normative to a single standard (which is a good thing for students who tend to the lazy and incoherent, or very separately, foreign). Descriptivists tend to notice the varieties (but will still know the rules for variations). Descriptivists can be just as dogmatic as prescriptivists.</p>\n\n<p>Another short summary: Prescriptivists are criticized by descriptivists because some of the prescriptive rules are made up (split infinitive) and because some of them apply only to one particular variety (double negative). Also, prescriptivists are kinda annoyingly nit-picky.</p>\n", "Id":"168", "ParentId":"155", "CreationDate":"2011-09-15T13:53:38.990", "Score":"4", "PostTypeId":"2", "OwnerUserId":"4", "LastActivityDate":"2011-09-15T13:53:38.990", "CommentCount":"5"}