{"OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "comments":[], "Body":"<p>I don't think this is the same phenomenon, no.</p>\n\n<p>My understanding is that написа- is <em>always</em> perfective in meaning, and that писа- is <em>always</em> imperfective.  That is, it would actually be ungrammatical to use написа- in a context that calls for an imperfective form, or vice versa.</p>\n\n<p>Whereas putting <em>durar</em> in the preterite, or <em>tardar</em> in the imperfect, would still be perfectly grammatical in Spanish.  It might be less common, but it does happen &mdash; as your corpus data shows!  So in Russian you're looking at a hard grammatical rule, whereas in Spanish you're looking at a mere statistical tendency.</p>\n\n<p>You might be interested in learning about <a href=\"http://en.wikipedia.org/wiki/Grammaticalization\">grammaticalization</a>, the process by which statistical preferences (like you have in Spanish) gradually turn into hard grammatical rules (like you have in Russian).  It would be possible for Spanish to grammaticalize the link between <em>durar</em> and the imperfect, so that, in a few decades or a few centuries, people would start feeling that forms like <em>duraron</em> were actually ungrammatical and not just unusual.  But the link hasn't been grammaticalized yet, and it may well never be.  </p>\n", "Id":"1694", "ParentId":"1663", "CreationDate":"2012-03-24T18:02:59.577", "Score":"9", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2012-03-24T18:02:59.577", "CommentCount":"1"}