{"Body":"<p>A good question, but I'm afraid there's no good answer to it.</p>\n\n<p>The phenomenon has been noticed by linguists some time ago, and we have two terms: <strong><em>loan words</em></strong> and <strong><em>foreign words</em></strong>. For the latter also the German term is sometimes used, <em>Fremdwort</em> (pl. <em>Fremdwörter</em>) -- incidentally, itself a good example of its own meaning. There is at least one more like that in English, namely <em>menu</em>. I don't know why it hasn't been adapted better. Maybe because it's a 'vocabulary word', maybe because there aren't many more like it, and maybe both.</p>\n\n<p>But the second possibility is key here: the feeling of nativeness of a phoneme/word/anything is a function of its <strong>frequency</strong>. English native speakers don't perceive [œ] as native because it's only there in very few (possily just one) words, and not a very frequent one to that. As it is, it's a foreign word. If there were many more like it, they would become loan words.</p>\n\n<p>Two examples:</p>\n\n<ol>\n<li><p>Polish originally did not have /f/. When the Latin name <em>Stephanus</em> was borrowed, it was adapted to <em>Szczepan</em> [ščepan]. But later many other words with /f/ have been borrowed and Poles began to perceive it as a native sound. The connection between <em>Stephanus</em> and <em>Szczepan</em> became obscure, and the name was borrowed again, yielding <em>Stefan</em> [stefan] this time. (Both exist in modern Polish and are seen as two separate names.)</p></li>\n<li><p>Turkish originally did not have either /f/ or /ž/. Since the 10th century, however, it has borrowed a large number of words with /f/ but only relatively few with /ž/. As a result, the former is now seen as a native sound much more than the latter.</p></li>\n</ol>\n\n<p>So you can see that the distinction is a <strong>gradient</strong> and comes down eventually to the <strong>proportion</strong>. Unfortunately, no scale or mathematical formula seems to exist which would allow to specify the feeling.</p>\n\n<p>The process is not limited to phonemes. I wrote \"phoneme/word/anything\" above. It's because this is how we perceive familiarity in general. In the 19th c., English purists attempted to convince the society to abandon French, Latin &amp;c. loan words and thus 'purify' the language. The slogan they came up with was <em>Use exclusively Anglo-Saxon monosyllables</em>. In case you wondered, <em>use</em> is a borrowing from French.</p>\n", "Id":"1699", "ParentId":"1698", "LastEditorUserId":"794", "CreationDate":"2012-03-25T08:37:01.873", "OwnerUserId":"794", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-03-25T09:55:42.430", "LastEditedUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}, "LastActivityDate":"2012-03-25T09:55:42.430", "Score":"5", "CommentCount":"1", "OwnerUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}}