{"Body":"<p>First, concerning how some of these data will be analyzed in OT. In \"classical\" OT, markedness constraints were only evaluated on surface representations, and faithfulness constraints were only evaluated on pairs of input/output representations. As it turns out, the analysis of reduplication is one area that led to the development of different types of faithfulness constraints. Correspondence Theory (<a href=\"http://scholarworks.umass.edu/cgi/viewcontent.cgi?article=1009&amp;context=linguist_faculty_pubs\" rel=\"nofollow\">McCarthy &amp; Prince 1995</a>) generalizes the notion of faithfulness constraints, so that they can apply to other types of pairing, including Base/Reduplicant. In <a href=\"http://people.umass.edu/jjmccart/fixed.pdf\" rel=\"nofollow\">Alderete et al (1999)</a> you can find a discussion of how IO and BR faithfulness constraints can interact to account for differing phonotactic characteristics in Reduplicants versus in other parts of the language.</p>\n\n<p>I suppose the key to handling the examples you have provided is to note that Faith(BR) compares <em>either</em> the Underlying Representation of the base or the surface Representation of the base with the surface form of the reduplicant (thanks to @Aerlinthe for pointing this out). In the Manam examples Faith(UR of base/Reduplicant) would be outranked by a gemeral markedness constraint banning non-homorganic nasal-obstruent sequences.\nThis doesn't appear to be a real problem for OT. Tellingly, in <a href=\"http://rci.rutgers.edu/~phonolab/handbook/chapters.php?chapter=20\" rel=\"nofollow\">Urbanczyk's (2007)</a> chapter on Reduplication, she discusses the Manam data but doesn't bother to remark on the nasal assimilation in the base.</p>\n\n<p>Now to the main part of the question: are there processes which tend towards being surface true? Probably the more fruitful way of asking the question is: which types of processes will tend to result in opacity? (you will get more hits if you search for opacity in google) When you have opacity, there are two interacting processes, such that one of them covers up the conditioning environment of the other (see <a href=\"http://udel.edu/~heinz/classes/2011/607/materials/Bakovic-2010-Opacity-and-Ordering.pdf\" rel=\"nofollow\">Bakovic 2011</a>'s citation of Kiparsky 1973 (which is notoriously difficult to find) for a clearer definition). If one of these was nasal place assimilation, then we would find rule-conditioned homorganic nasal-obstruent sequences alongside non-homorganic nasal-obstruent sequences.</p>\n\n<p>This situation is probably rare because it just happens to be difficult to produce a nonhomorganic nasal-obstruent sequence. A process like vowel harmony, on the other hand, is different, since it is not especially difficult to produce, say, a [+ATR] vowel and a [-ATR] vowel in consecutive syllables (see <a href=\"http://rci.rutgers.edu/~phonolab/handbook/chapters.php?chapter=15\" rel=\"nofollow\">Archangeli &amp; Pulleyblank 2007</a> for discussion of some examples of opacity in vowel harmony. There would be no strong articulatory pressure against an opaque rule interaction involving vowel harmony like there would with nasal place assimilation.</p>\n\n<p>I think that your initial intuition is correct: by \"surfacy\" you mean strongly motivated by non-mentalistic physical factors (articulatory, aerodynamic, acoustic). While most phonological rules have some kind of physical basis, some rules have a stronger basis than others.</p>\n", "Id":"1722", "ParentId":"1717", "LastEditorUserId":"483", "CreationDate":"2012-03-29T01:43:14.033", "OwnerUserId":"483", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-03-29T19:28:40.037", "LastEditedUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "LastActivityDate":"2012-03-29T19:28:40.037", "Score":"1", "CommentCount":"5", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}