{"Body":"<p>One idea that's been going around at least since the 80s is that you can distinguish between <em>Holds</em> and <em>Moves.</em>  For instance, many signs have a Hold-Move-Hold structure -- you start with one handshape at one spot in the signing space, move your hand along a designated path, and end up with another handshape in another spot.  It's been suggested that a Hold-Move-Hold sign is akin to a Consonant-Vowel-Consonant syllable in spoken language.  </p>\n\n<p>Holds and Moves can also be described using sets of distinctive features, just as consonants and vowels are in spoken languages.  For instance, every Hold has a handshape component.  A signed language has a fixed inventory of handshapes (<a href=\"http://jonathanfleming.wordpress.com/2010/03/22/asl-handshapes/\">here's the set for ASL</a>), and you can find minimal pairs for handshape in signed languages just like you can find minimal pairs for voicing or point-of-articulation in spoken languages.  For signs where the active hand touches your other hand or your body, there's an inventory of possible <em>points of contact</em>.  And so on.  </p>\n\n<p>Just like in spoken languages, different signed languages make use of different feature combinations. F'rinstance, a friend of mine who works on this stuff tells me that in Ban Khor Sign Language, spoken in Thailand, there are signs in which you touch your face with the pinky side of a flat hand (what's called the <a href=\"http://www.lifeprint.com/asl101/signjpegs/f/flat.jpg\">B handshape</a>).  In ASL, the B hand only ever makes contact with your face on the thumb-and-index-finger side.  So there are phonological patterns that are possible in Ban Khor Sign Language and not in ASL, and probably vice versa.</p>\n\n<p>You might be interested in Liddell and Johnson's \"ASL: The Phonological Base\" (you can read some good chunks of it <a href=\"http://books.google.com/books?hl=en&amp;lr=&amp;id=mfS3GlTLAUMC&amp;oi=fnd&amp;pg=PA267&amp;dq=liddell+sign+language+hold+move&amp;ots=QqPiMC4aDz&amp;sig=j4_CziEsCm2nie8BQ4FfXBWZFHI#v=onepage&amp;q=liddell%20sign%20language%20hold%20move&amp;f=false\">here</a> at Google Books), which goes into some detail on this stuff: the Hold/Move structure of signs, the features that constitute Holds and Moves, etc.  I don't think it's the state of the art anymore -- if there are any experts out there reading this, I hope they'll suggest something more current -- but it's a pretty cool, very readable article, and it gives you a feel for what a careful description of signed phonology might look like.</p>\n", "Id":"1739", "ParentId":"1737", "LastEditorUserId":"306", "CreationDate":"2012-04-02T21:37:47.590", "OwnerUserId":"306", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-04-02T21:49:07.200", "LastEditedUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "LastActivityDate":"2012-04-02T21:49:07.200", "Score":"10", "CommentCount":"1", "OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}}