{"comments":[], "Body":"<p>This is a very interesting question, but there are two reasons it is very difficult to answer. First, there's a simple problem independent of any specific theory: there is no clear way to define the size of the trees in question. Also, if we believe the generative research of the past 20 years, there's reason to doubt there's such a thing as \"slots\" in the sense you speak of.</p>\n\n<p>First, the size: simply following orthographic conventions regarding \"sentences\" doesn't necessarily tell us about the maximal relevant size of syntactic representations. If I utter two long sentences, loaded with adjuncts, and joined together by a conjunction, are they part of the same tree for our purposes? I have no idea, frankly.</p>\n\n<p>We're probably interested in some very large structure, because the question becomes trivial once the tree is small, and I don't think that trivial question is what you were aiming at. In other words, if the relevant unit to look at is the XP of minimalist generative syntax, meaning any structure composed of a lexical item and whatever other lexical items its selection features require, then by hypothesis the same XP structure is (recursively) used to construct any and all syntactically-structure utterances, and then, indeed, no utterance is syntactically novel.</p>\n\n<p>So presumably, to make the question interesting, we want to look at units up to some very big size, probably up to the biggest XPs uttered in normal life. But to the best of my knowledge, there's no clearly defined maximum.</p>\n\n<p>The second problem is that, as I kind of already indicated, the concept of syntactic slots as such isn't really relevant in much of the current research in syntax. \"Slots\" are essentially created by lexical items (\"heads\") which carry selectional features that need to be satisfied in order for the structure to be well-formed (and interpretable at the interfaces to sound and meaning). They are filled by XPs, which are in turn also formed around the requirements of some head.</p>\n\n<p>It is, however, assumed that the real structure-building selectional features are those selecting major content and functional categories (V,N,A,P,D,C,T,v,...). So if we assume these can be seen as \"slots\", we might be able to start to answer the question.</p>\n\n<p>I've been trying to formulate some kind of attempt at an answer in terms of a thought experiment – the empirical side is not my forte – but without much result, because I keep bumping into the problems I outlined above. I guess this isn't strictly an answer, but hopefully it'll help someone understand the assumptions and implications of the question, and maybe work towards a real answer.</p>\n", "Id":"1822", "ParentId":"1734", "CreationDate":"2012-04-19T11:59:52.230", "Score":"1", "PostTypeId":"2", "OwnerUserId":"941", "LastActivityDate":"2012-04-19T11:59:52.230", "OwnerUser":{"UpVotes":"9", "WebsiteUrl":"http://www.didyoulearnanything.net", "Location":"Germany", "Id":"941", "DownVotes":"1", "AccountId":"522746", "Views":"1", "Reputation":"317", "CreationDate":"2012-04-19T09:51:50.690", "DisplayName":"michaelsappir", "LastAccessDate":"2013-10-14T14:20:51.253", "Age":"26"}}