{"Body":"<p>The difference is not in the case itself, but in how it gets there. As I understand it, structural case comes from the functional structure of the clause, inherent case comes from the specific position or role of the argument (not from the structure around it), and lexical case comes from the specific verb's lexical entry. As a result, structural case is the most regular/predictable, followed by inherent and then lexical case. It looks like Woolford explains the details much better than I can.</p>\n\n<p>As for whether they are real, that seems like the wrong question to ask; they are technical theoretical categories, and as such only make sense and have any status within a certain set of hypotheses. The purpose of theory is not to tell us what's real (that's a question for philosophers), but to construct a model that explains the data as well as possible.</p>\n\n<p>The only possibly relevant notion of \"real\" is <em>psychologically real</em>, but then still theory can only point in the right direction, and quantitative psychological research would be needed to verify psychological reality of an object or category, but that kind of research is not necessarily possible for every theoretical concept in and of itself.</p>\n", "Id":"1823", "ParentId":"1641", "LastEditorUserId":"941", "CreationDate":"2012-04-19T13:09:09.383", "OwnerUserId":"941", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-04-19T14:44:57.440", "LastEditedUser":{"UpVotes":"9", "WebsiteUrl":"http://www.didyoulearnanything.net", "Location":"Germany", "Id":"941", "DownVotes":"1", "AccountId":"522746", "Views":"1", "Reputation":"317", "CreationDate":"2012-04-19T09:51:50.690", "DisplayName":"michaelsappir", "LastAccessDate":"2013-10-14T14:20:51.253", "Age":"26"}, "LastActivityDate":"2012-04-19T14:44:57.440", "Score":"4", "OwnerUser":{"UpVotes":"9", "WebsiteUrl":"http://www.didyoulearnanything.net", "Location":"Germany", "Id":"941", "DownVotes":"1", "AccountId":"522746", "Views":"1", "Reputation":"317", "CreationDate":"2012-04-19T09:51:50.690", "DisplayName":"michaelsappir", "LastAccessDate":"2013-10-14T14:20:51.253", "Age":"26"}}