{"OwnerUser":{"UpVotes":"167", "WebsiteUrl":"http://web.mit.edu/~dbriggs/www", "Id":"84", "AccountId":"511555", "CreationDate":"2011-09-14T00:18:36.197", "AboutMe":"<p>At UMass Amherst in the Ph.D. program in math.<br>\n</p>\n\n<p>\nCurrently taking:<br>\nAnalysis (Measure theory & integration)<br>\nGeometry (Theory of manifolds)<br>\nModular Forms</p>\n", "Age":"29", "Location":"Cambridge, MA", "DownVotes":"0", "Views":"23", "Reputation":"1163", "DisplayName":"Daniel Briggs", "LastAccessDate":"2013-08-10T16:57:15.060"}, "comments":[], "Body":"<p>Direction words arise from the need to coordinate direction. Thus, their nature and usage can vary widely from one language to another. To start, here are a few aspects of a people and their land that can influence the form that direction words / direction morphemes end up taking:</p>\n\n<ol>\n<li><p>The types of activities requiring coordination (migration, herding, hunting, fishing, gathering, farming, trade relations, war, etc.)</p></li>\n<li><p>The geographical features of the area (coastline, a central river, tributaries, woods, islands, steppe, mountains).</p></li>\n<li><p>The current state of inherited cultural knowledge about direction (including mythology; this may largely go back to (1) and (2) from prior states of the language).</p></li>\n</ol>\n\n<p>The systems that thus arise may be influenced to be similar to the common cardinal directions in English, or instead make the primary distinction \"upstream\" vs. \"downstream,\" \"inland\" vs. \"toward the coast,\" or \"direction towards\" vs. \"away from a certain very distant landmark.\" Taken beyond that landmark, a person might not be as effective at communicating navigation. (Although, technically, the same thing can happen in English: explain which way to go from the North Pole!)</p>\n\n<p>In <a href=\"http://books.google.com/books?id=kzGfdeK9za4C\">Orientation Systems of the North Pacific Rim</a> by Michael Fortescue, a close examination of the orientation systems of Wakashan, Tsimshianic, Haida, Tlingit, Eyak, Athabaskan, Eskimo-Aleut, Tungusic, Nivkh, and Ainu leads to the enticing conclusion that by conceiving of a language's orientation system diachronically, looking at etymologies of direction words and inspecting any inherently paradoxical methods of expressing direction, we can evidence a hypothesis as to whether a language is relatively new to a region (say, having arried within the past 2000 years), as well as perhaps find out where they came from!</p>\n\n<p>For example, if people in a dialect continuum settle a turning peninsula, the meaning of a direction word at the source may be different from at the tip. Similarly, whereas most IE languages use the PIE root *<em>aus-</em> \"to shine, dawn\" for \"east,\" the Latin word <em>australis</em> \"south\" may be from the same root. This is \"perhaps is based on a false assumption about the orientation of the Italian peninsula, 'with shift through \"southeast\" explained by the diagonal position of the axis of Italy'...Or perhaps the connection is more ancient, and [directly] from PIE root *<em>aus-</em> 'to shine,' source of <em>aurora,</em> which also produces words for 'burning,' with reference to the 'hot' south wind that blows into Italy.\" <a href=\"http://www.etymonline.com/index.php?term=Australia&amp;allowed_in_frame=0\">OE</a></p>\n\n<p>To address your question about English (all quotations from the Online Etymology Dictionary, <a href=\"http://www.etymonline.com/\">OE</a>):</p>\n\n<ul>\n<li><p>north &lt; <em>norð</em> &lt; *<em>nurtha</em> possibly derives from PIE *<em>ner-</em> \"left, below\" \"as north is to the left when one faces the rising sun (cf. Skt. <em>narakah</em> 'hell,' Gk. <em>enerthen</em> 'from beneath,' Oscan-Umbrian <em>nertrak</em> 'left').\" <a href=\"http://www.etymonline.com/index.php?allowed_in_frame=0&amp;search=north&amp;searchmode=none\">OE</a></p></li>\n<li><p>south &lt; <em>suð</em> &lt; *<em>sunthaz</em> is \"perhaps related to base of *<em>sunnon</em> 'sun,' with sense of \"the region of the sun.\" <a href=\"http://www.etymonline.com/index.php?allowed_in_frame=0&amp;search=south&amp;searchmode=none\">OE</a></p></li>\n<li><p>east &lt; <em>east</em> &lt; *<em>aus-to-,</em> *<em>austra-,</em> \"from PIE *<em>aus-</em> 'to shine,' especially 'dawn' (cf. Skt. <em>ushas</em> 'dawn,' Gk. <em>aurion</em> 'morning,' O.Ir. <em>usah,</em> Lith. <em>auszra</em> 'dawn,' L. <em>aurora</em> 'dawn,' <em>auster</em> 'south'), lit. 'to shine.'\" <a href=\"http://www.etymonline.com/index.php?allowed_in_frame=0&amp;search=east&amp;searchmode=none\">OE</a></p></li>\n<li><p>west &lt; <em>west</em> &lt; *<em>wes-t-</em> \"from PIE *<em>wes-</em> (source of Gk. <em>hesperos,</em> L. <em>vesper</em> 'evening, west'), perhaps an enlarged form of root *<em>we-</em> 'to go down' (cf. Skt. <em>avah</em> 'downward'), and thus lit. 'direction in which the sun sets.'\" <a href=\"http://www.etymonline.com/index.php?allowed_in_frame=0&amp;search=west&amp;searchmode=none\">OE</a></p></li>\n</ul>\n\n<p>Some languages use non-compound words for the ordinal (secondary) directions. For example, Finnish (with help from <a href=\"http://en.wiktionary.org/wiki/luode\">Wiktionary</a> and <a href=\"http://fi.wikipedia.org/wiki/Ilmansuunta\">Finnish Wikipedia</a>):</p>\n\n<ul>\n<li><p><em>luode</em> \"northwest,\" possibly the same etymology as identical <em>luode</em> meaning \"ebb / low tide,\" loan from a Germanic language, cognate of German <em>Flut,</em> Swedish <em>flod</em>.</p></li>\n<li><p><em>pohjoinen</em> \"north,\" from <em>pohja</em> \"bottom,\" is because the sun is in the north when it's underneath the horizon, possibly also because the back of a dwelling should be facing the north so as to maximize warmth.</p></li>\n<li><p><em>koillinen</em> \"northeast,\" from <em>koi</em> \"dawn.\"</p></li>\n<li><p><em>itä</em> \"east,\" possibly related to <em>itää</em> \"to germinate,\" that the sun grows in the east.</p></li>\n<li><p><em>kaakko</em> \"southeast,\" equated with <em>kaakkuri</em> \"red-throated diver (loon)\" and <em>kuikka</em> \"black-throated diver (loon).\" Compare Latin <em>ornithias</em> \"bird-wind,\" the spring wind that brings the birds.</p></li>\n<li><p><em>etelä</em> \"south,\" antonymously to <em>pohjois,</em> is the direction in which the front of the house should face. Compare <em>eteen</em> \"to the front.\" The Estonian cognate <em>edel</em> means \"southwest.\"</p></li>\n<li><p><em>lounas</em> \"southwest, lunch\" indicates the direction the sun is in at lunchtime. The Estonian cognate <em>lõuna</em> means \"south.\"</p></li>\n<li><p><em>länsi</em> \"west\" may have to do with the day being \"flattened\" (<em>läntätään</em> ~ <em>litistetään</em>) as the evening arrives.</p></li>\n</ul>\n", "Id":"1855", "ParentId":"1077", "CreationDate":"2012-04-29T07:29:01.713", "Score":"14", "PostTypeId":"2", "OwnerUserId":"84", "LastActivityDate":"2012-04-29T07:29:01.713", "CommentCount":"9"}