{"Body":"<p>Firstly it should be pointed out that there is some overlap between these two subdisciplines of linguistics, just as there is overlap between, say, syntax and morphology. But you're not far from the right track when you say:</p>\n\n<blockquote>\n  <p>\"the difference is that phonology deals with language sounds and phonetics deals with human speech sounds...\"</p>\n</blockquote>\n\n<p>This is close, but it doesn't encapsulate the distinction memorably. I suggest the following approximation:</p>\n\n<ul>\n<li><strong>Phonology</strong>: how sounds pattern within a given language (stated in terms of \"phonemes\") </li>\n<li><strong>Phonetics</strong>: the characteristics of speech sounds (stated with descriptions of speech those sounds, sometimes referred to as \"phones\") themselves</li>\n</ul>\n\n<p>Crucially, a phoneme consists of a set of phones, <em>plus</em> a set of rules describing how those phones are distributed within a particular language. </p>\n\n<p>So, if we refer to a \"voiced palatal affricate\" [dʒ] without context, we are describing a \"phone\" -- a speech sound which is produced through a particular combination of articulations. </p>\n\n<p>However, if we make a statement like \"In Japanese, the phoneme /d/ has the allophone [dʒ] before the vowel /i/,\" then we are describing the patterning of phones in Japanese. Thus, this is a phonological description.  </p>\n\n<p>Note that how a particular phone patterns may be different in another language. </p>\n\n<p>In English, for instance, \"deep\" [diːp] and \"Jeep\" [dʒiːp] are distinct terms, so while the phones in question here are comparable (roughly) to those in the Japanese case, the patterning is different.</p>\n\n<p>However, and this is where it gets a bit messy, it's usually the case that there are purely phonetic (articulatory or auditory) influences that \"motivate\" particular phonological distributions. In fact the example from Japanese above is of a sort that's quite common cross-linguistically, so much so that it's been given its own name, \"palatalization.\" So, phonology can often be \"explained\" in terms of phonetics. </p>\n\n<p>Both of these subdisciplines have huge literatures and of course I'm grossly oversimplifying, but hopefully that is a useful start.</p>\n", "Id":"186", "ParentId":"180", "LastEditorUserId":"136", "CreationDate":"2011-09-15T23:17:28.317", "OwnerUserId":"136", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-15T23:40:46.233", "LastEditedUser":{"UpVotes":"44", "Location":"United States", "DownVotes":"2", "Id":"136", "AccountId":"9694", "Views":"5", "Reputation":"296", "CreationDate":"2011-09-15T00:29:20.830", "DisplayName":"pat", "LastAccessDate":"2013-12-16T02:10:37.907", "AboutMe":"<p>I'm a linguist, so all of the programming that I slog may way through has to do with language or linguistics in one way or another. </p>\n\n<p>I've been programming for a long time but I still feel like I've got a long way to go. But maybe that's how I <em>should</em> feel. :)</p>\n\n<p>I'm a big believer in the idea that just a little technical skill can be very useful for people in many fields. So I spend a fair amount of time trying to explain things like HTML and CSS and perhaps a little Python or something to other people. </p>\n\n<p>If anyone out there is interested in working on open source projects for linguistics, please get in touch.</p>\n\n<p>I have a Github account but it's a bewildering pile of crap right now, I'll try to get around to cleaning that up and then I'll post it here.</p>\n"}, "CommunityOwnedDate":"2011-09-15T23:17:28.317", "LastActivityDate":"2011-09-15T23:40:46.233", "Score":"8", "CommentCount":"1", "OwnerUser":{"UpVotes":"44", "Location":"United States", "DownVotes":"2", "Id":"136", "AccountId":"9694", "Views":"5", "Reputation":"296", "CreationDate":"2011-09-15T00:29:20.830", "DisplayName":"pat", "LastAccessDate":"2013-12-16T02:10:37.907", "AboutMe":"<p>I'm a linguist, so all of the programming that I slog may way through has to do with language or linguistics in one way or another. </p>\n\n<p>I've been programming for a long time but I still feel like I've got a long way to go. But maybe that's how I <em>should</em> feel. :)</p>\n\n<p>I'm a big believer in the idea that just a little technical skill can be very useful for people in many fields. So I spend a fair amount of time trying to explain things like HTML and CSS and perhaps a little Python or something to other people. </p>\n\n<p>If anyone out there is interested in working on open source projects for linguistics, please get in touch.</p>\n\n<p>I have a Github account but it's a bewildering pile of crap right now, I'll try to get around to cleaning that up and then I'll post it here.</p>\n"}}