{"Body":"<p>I just spent one month in the United States with my two daughters, neither of which spoke English before. I will answer with anecdotal evidence in regard to the older of the two, she is five years old.</p>\n\n<p>It seems to me that children have less rigidly established ideas about the world around them, and are willing to accept new names and new thought paradigms more readily than adults. For instance, when I look at a table it is for me \"שולחן\" and I have to translate that into \"table\". After one week in the US I was still translating \"שולחן\" to \"table\" every time I had to use the word. However, only in the last few days did the idea that the object with a flat surface and four legs is called \"table\" really sink in and come out naturally. Contrast with my daughter, who learned the word \"bed\" the first day in the US. The next day, speaking in our native language, she used the word \"bed\". For her, giving the object a new title was less an exercise in replacing an existing title but more an exercise in establishing a title - any title - for the object even though she already had a title for it. I noticed a similar phenomenon for grammar. She was not translating sentences, but rather learning them anew. Her idea of what a sentence \"should be\" was obviously less firmly established than my own.</p>\n\n<p>Also, you might be interested in <a href=\"http://linguistics.stackexchange.com/questions/1861/linguistics-studies-related-to-elderly\">a related answer in reference to the elderly</a> that I recently answered.</p>\n", "Id":"1864", "ParentId":"1860", "LastEditorUserId":"536", "CreationDate":"2012-05-01T08:59:28.503", "OwnerUserId":"536", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-05-01T14:48:39.077", "LastEditedUser":{"UpVotes":"41", "WebsiteUrl":"http://dotancohen.com", "DownVotes":"2", "Id":"536", "AccountId":"138391", "Views":"7", "Reputation":"334", "CreationDate":"2011-11-26T22:40:44.440", "DisplayName":"dotancohen", "LastAccessDate":"2014-01-09T13:42:03.957", "Age":"37"}, "LastActivityDate":"2012-05-01T14:48:39.077", "Score":"1", "OwnerUser":{"UpVotes":"41", "WebsiteUrl":"http://dotancohen.com", "DownVotes":"2", "Id":"536", "AccountId":"138391", "Views":"7", "Reputation":"334", "CreationDate":"2011-11-26T22:40:44.440", "DisplayName":"dotancohen", "LastAccessDate":"2014-01-09T13:42:03.957", "Age":"37"}}