{"OwnerUser":{"UpVotes":"167", "WebsiteUrl":"http://web.mit.edu/~dbriggs/www", "Id":"84", "AccountId":"511555", "CreationDate":"2011-09-14T00:18:36.197", "AboutMe":"<p>At UMass Amherst in the Ph.D. program in math.<br>\n</p>\n\n<p>\nCurrently taking:<br>\nAnalysis (Measure theory & integration)<br>\nGeometry (Theory of manifolds)<br>\nModular Forms</p>\n", "Age":"29", "Location":"Cambridge, MA", "DownVotes":"0", "Views":"23", "Reputation":"1163", "DisplayName":"Daniel Briggs", "LastAccessDate":"2013-08-10T16:57:15.060"}, "comments":[], "Body":"<p>My bet is on another Turkic language, Uighur, especially if we use it to mean both modern Uighur and its ancestor Old Turkic, which was the official language of the Uighur Khaganate (begun in 742) and later the predominant language of Turfan / Turpan, East Turkestan (Xinjiang province, China), where Uighurs settled in 840 and have remained to the present day.</p>\n\n<p>According to the <a href=\"http://www.lmp.ucla.edu/Profile.aspx?menu=004&amp;LangID=69\">UCLA Language Materials Project</a>, the earliest Uighur texts are written in three scripts: the Old Turkic runes (also called Orkhon-Yenisei runes), the Manichean script and the Uighur script. All three types probably ultimately go back to Aramaic script. (The Aramaic script derives from Phoenician, as do a plurality of the world's orthographies eventually.)</p>\n\n<ul>\n<li><p>The <strong>Uighur script</strong> derived from the Sogdian alphabet (<a href=\"http://www.omniglot.com/writing/sogdian.htm\">Ancientscripts</a>). Sogdian was a Middle Iranian language related to Pahlavi. By the seventh century, Sogdian merchants had a strong presence along the Silk Road (<a href=\"http://www.upf.edu/materials/huma/central/abast/sogdian.pdf\">Jonathan Skaff</a>), from their origin in Samarkand all the way to the oasis state of Turfan, where many of them came to settle. In 840 the Uighurs came here too, and they eventually adopted the script.</p></li>\n<li><p>The oldest Uighur inscription known, from 732, is from the Orkhon river basin, central Mongolia, in <strong>Old Turkic runes</strong>, which were possibly based on the Sogdian script or the Chinese script, but there is a powerful argument for a <a href=\"http://www.s155239215.onlinehome.us/turkic/31Alphabet/Amanjolov/AmanjolovGenesisEn.htm\">tamga origin</a> too. Tamga is Mongolian for \"stamp\" or \"seal,\" and the use of Tamgas throughout Eastern Eurasia to differentiate clans from each other, for marking property, for official correspondence and for graves goes back to prehistory.</p></li>\n<li><p>The <strong>Manichean script</strong> coexisted along the Silk Road with the Sogdian; it is so called because adherents of the Manichean religion seemed to prefer it, and it is said that Mani himself may have devised it. Uighur documents in the Manichean script were found at Turfan by German excavators in the late nineteenth century.</p></li>\n<li><p>Excavations at Turfan have found Uighur documents written in the <strong>Syriac, Tibetan, Brahmi, Nestorian,</strong> and <strong>Estrangelo</strong> <a href=\"http://staatsbibliothek-berlin.de/die-staatsbibliothek/abteilungen/orient/aufgaben-profil/veroeffentlichungen/berlin-turfan-collection/\">scripts</a>; <strong>'Phags-pa</strong> may have been used as well. Assumedly, writing Uighur in these scripts was an at least somewhat regular occurrence throughout the Tarim basin at various times, the preferences changing from 840 to the 1300s and beyond. <a href=\"http://sino-platonic.org/complete/spp198_aramaic_script.pdf\">This document by Doug Hitch</a> outlines the basic features dozens of variants of writing systems used in Central Eurasia, not all for Uighur.</p></li>\n<li><p>Uighur gradually came to be written predominantly in the <strong>Chagatai</strong> script, a variant of the Arabic script used originally for the extinct Turkic language Chagatai, which was then widely spoken throughout Central Eurasia.</p></li>\n<li><p>In the 1920s, some Uighur-speaking regions became part of the Soviet Union, and others came under its influence, and at first the Soviet Union tried to Romanize the Uighur script, but then decided to use a Cyrillic-derived alphabet known as <strong>Uyghur Siril Yëziqi</strong> instead.</p></li>\n<li><p>In the 1950s, the Chinese promoted the use of <strong>Yëngi Yëziqi</strong>, a mixture of Pinyin (Latin-derived) and Cyrillic, for Uighur. Its predominant usage lasted about ten years.</p></li>\n<li><p>The most commonly used, and official, Uighur script today is <strong>Uyghur Ereb Yëziqi</strong>, a newer Arabic-derived script.</p></li>\n<li><p>Some of the Uighur people have pressed for a change to a Latin-based script known as <strong>Uyghur Latin Yëziqi</strong> instead, for ease of use with information technology. Many Uighurs know both this script and the Ereb Yëziqi.</p></li>\n</ul>\n", "Id":"1887", "ParentId":"1883", "CreationDate":"2012-05-06T07:05:28.250", "Score":"10", "PostTypeId":"2", "OwnerUserId":"84", "LastActivityDate":"2012-05-06T07:05:28.250", "CommentCount":"8"}