{"Body":"<p>The <a href=\"https://en.wikipedia.org/wiki/Critical_period_hypothesis\" rel=\"nofollow\">critical period hypothesis</a> is important in understanding what it means to be a native speaker of a language.  Newborn babies are equally capable of learning to speak any language, but as they develop to certain ages they lose the ability to learn new linguistic patterns that they have not previously been exposed to.  The age at which this happens varies depending on the linguistic system involved — it can be as young as 4-6 years old for learning phonetics (how to speak a language \"without an accent\") up to early teens for some subtler syntactic patterns.  There is a qualitative difference in the language skills of a person who has learned to speak a language after this age — although many adult language learners are quite skilled and it might require subtle investigation to detect these differences.</p>\n\n<p>With respect to the scenario presented of parents who speak a language that they themselves are not native speakers of to their children, precisely such a situation arose in Papua New Guinea in the latter half of the 20<sup>th</sup> century, where an English-based pidgin language (i.e. one lacking native speakers) became the native language of a generation of children growing up on army bases, where their parents were from many different linguistic backgrounds.  The changes in the grammatical system of the language that the transition wrought were studied by (among others) <a href=\"http://www.ling.upenn.edu/~gillian/\" rel=\"nofollow\">Gillian Sankoff</a>, whose publications would serve as a point of reference for further study of the question.</p>\n", "Id":"1914", "ParentId":"1913", "LastEditorUserId":"51", "CreationDate":"2012-05-12T13:59:59.383", "OwnerUserId":"46", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-05-12T18:40:32.287", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2012-05-12T18:40:32.287", "Score":"6", "CommentCount":"6", "OwnerUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}}