{"Body":"<p>Good question. The answer is going to depend hugely on several factors:</p>\n\n<p>1a. <strong>Are we texting textspeak, or is it grammatically correct, punctuated, capitalized (and for foreign languages, accented) sentences</strong> (which imply lots of extra keystrokes, modifier keys, possible error and correction keystrokes)? Or something &lt;100% proper spelling? What character error rate is considered acceptable? Is this an email to the boss, or just chat or directions? Must German nouns be capitalized or French past tenses accented? (We can predictively learn and add those, from a lexicon. We can also learn the proper nouns you use and add them to lexicon. We could even infer the first and last name of the message recipient - how much use of message 'context' is allowed, exactly?)</p>\n\n<p>1b. <strong>Can we use predictive text</strong>? like the <a href=\"http://mobilitydigest.com/world-text-record-gets-crushed-by-android-swiftkey-x-user/\" rel=\"nofollow\">world-record-smashing Swiftkey X</a> (And are there yet any speaker-specific-entrained predictive text systems?) For textspeak, we could expand hlo, l8r, LMAO, BRB, 'I &lt;3 U' (or the French textspeak mentioned below). Do those common abbreviations give English o romanized languages an unfair advantage?\nThe <a href=\"http://www.swiftkey.net/swiftkey-x-user-smashes-world-texting-record\" rel=\"nofollow\">current world record (and English-language) is 160 characters/26 words in 10.7 sec, without errors, by Rachael Loncar</a>, as of 10/2011. Predictive text can make you >2x faster.</p>\n\n<p>2 <strong>Is there one language that is best adapted to \"the keyboard\"</strong></p>\n\n<p>2a. You know that there are <a href=\"http://en.wikipedia.org/wiki/QWERTY#Alternatives_to_QWERTY\" rel=\"nofollow\">alternatives to QWERTY</a>, right? And most of these improve the typing speed for both English- and non-English-language users. QWERTY is only fast because we grew up with it, no other reason. QWERTY discriminates against non-English users.</p>\n\n<p>2b. Did you mean 'thumb keyboard' as distinct to 'touchscreen'?</p>\n\n<p>2c. Texting speed will depend on the size ratio between your fingers and the keyboard. There are gender and racial differences on this.</p>\n\n<p>2d. My friend points out that Europeans and Asians are in general faster at texting than Americans, simply because they get more practise, since in the US cellphone calls are free (assuming a monthly contract). Whereas many Americans, if they text at all, only text when they're in a meeting or unable to pick up, or e.g. if they know you are / or are driving.</p>\n\n<p>My point is, all these factors will prevent you from making a language-neutral comparison.</p>\n", "Id":"1933", "ParentId":"1154", "LastEditorUserId":"1006", "CreationDate":"2012-05-14T11:16:00.087", "OwnerUserId":"1006", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-05-14T11:27:54.737", "LastEditedUser":{"UpVotes":"12", "Location":"Mountain View, CA", "DownVotes":"0", "Id":"1006", "AccountId":"69533", "Views":"1", "Reputation":"165", "CreationDate":"2012-05-13T23:25:54.840", "DisplayName":"smci", "LastAccessDate":"2013-06-17T19:58:29.890"}, "LastActivityDate":"2012-05-14T11:27:54.737", "Score":"4", "CommentCount":"1", "OwnerUser":{"UpVotes":"12", "Location":"Mountain View, CA", "DownVotes":"0", "Id":"1006", "AccountId":"69533", "Views":"1", "Reputation":"165", "CreationDate":"2012-05-13T23:25:54.840", "DisplayName":"smci", "LastAccessDate":"2013-06-17T19:58:29.890"}}