{"comments":[], "Body":"<p>I can't give any real answer of the kind you want, but I can tell you what I know about about this topic being an undergraduate 40 years after the event, hoping that it will be of any help, even though I am certainly wrong to some degree.</p>\n\n<p>As far as I can see the idea originated with Zellig Harris, who is now taken to be one of few American strucuralists who was concerned with syntax in a serious manner. Harris even dealt with structures bigger than sentences, and since substitution tests were central to structuralism, he had the idea of establishing equivalence relations for sentences by checking which sentences could replace each other in a longer text, which for instance connected corresponding active/passive sentences. It seems that he continued from there by assuming that one member of such a relations is basic and the others derived, and consequently invented transformations to do that derivation.</p>\n\n<p>In Chomsky's later transformational grammar, the notion of kernel sentece seems to have just been carried over without much deep consideration. I can't remember that he discussed the matter any more than saying that it allows for a more simple grammar. Later work by Katz and Fodor and Katz and Postal then introduced some form of deep structure, which led to the model in Aspects, which repurposed transformations to not deal with inter-sentence equivalences, but instead to map between deep-structures and surface-structures. As far as I know this was when kernel sentences were given up.</p>\n\n<p>My best guess is that that notion was, at least in generative grammar, seen as mostly accidental and a matter of tradition from the start, and that there was no interest in defending it against what was intuitively seen as a more interesting model in Aspects. </p>\n", "Id":"1941", "ParentId":"1820", "CreationDate":"2012-05-16T10:36:49.193", "Score":"4", "PostTypeId":"2", "OwnerUserId":"1014", "LastActivityDate":"2012-05-16T10:36:49.193", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1014", "AccountId":"1490003", "Views":"1", "Reputation":"56", "CreationDate":"2012-05-15T22:22:56.747", "DisplayName":"user1014", "LastAccessDate":"2012-12-21T11:58:17.357"}}