{"OwnerUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "comments":[], "Body":"<p>Steven Pinker (in <a href=\"http://rads.stackoverflow.com/amzn/click/0060976519\">The Language Instinct</a>, 1995) suggested a name for the language that people \"think in\": <strong>mentalese</strong>. This language, of course, is not a real language and it only vaguely resembles the actual languages that people speak or sign. On the other hand, it is universal; every human being is born with it. His argument is that no natural language could possibly serve as a good medium for reasoning, for several reasons: ambiguity, lack of logical explicitness, co-reference, deixis and synonymy. </p>\n\n<p>In his own words:</p>\n\n<blockquote>\n  <p>People do not think in\n  English or Chinese or Apache; they think in a language of thought.\n  This language of thought probably looks a bit like all these languages;\n  presumably it has symbols for concepts, and arrangements of symbols\n  that correspond to who did what to whom, as in the paint-spraying\n  representation shown above. But compared with any given language,\n  mentalese must be richer in some ways and simpler in others. It\n  must be richer, for example, in that several concept symbols must\n  correspond to a given English word like <em>stool</em> or <em>stud</em>. [...]. On the other hand, mentalese must\n  be simpler than spoken languages; conversation-specific words and\n  constructions (like <em>a</em> and <em>the</em>) are absent, and information about\n  pronouncing words, or even ordering them, is unnecessary. Now, it\n  could be that English speakers think in some kind of simplified and\n  annotated quasi-English, with the design I have just described, and\n  that Apache speakers think in a simplified and annotated quasi-\n  Apache. But to get these languages of thought to subserve reasoning\n  properly, they would have to look much more like each other than\n  either one does to its spoken counterpart, and it is likely that they\n  are the same: a universal mentalese.</p>\n  \n  <p>Knowing a language, then, is knowing how to translate mentalese\n  into strings of words and vice versa.</p>\n</blockquote>\n\n<p>The same argument can, of course, be applied to deaf-mute people, even to those who have never learned any language at all. He presents a few compelling examples of people with serious disabilities who are nevertheless capable of the same kinds of complex reasoning that speaking and signing people are. </p>\n\n<p>This is what cognitive psychologists and neuroscientists call \"computational\" or \"representational\" theory of mind, according to which, what takes place in the mind is a mere manipulation of symbols, much like a computer, hence the name. Thus, the so called mentalese would be a very complex system of symbols used to represent the world inside people's minds. The \"computer processor\", in this case, would the brain, storing and manipulating these symbols by means of physico-chemical processes. </p>\n\n<p>To sum up: there is no reason (according to this theory) to posit a natural language that people use for their thoughts. Languages would play, at best, an auxiliary role in the reasoning process.</p>\n", "Id":"1946", "ParentId":"1943", "CreationDate":"2012-05-17T01:12:29.363", "Score":"8", "PostTypeId":"2", "OwnerUserId":"22", "LastActivityDate":"2012-05-17T01:12:29.363", "CommentCount":"2"}