{"OwnerUser":{"UpVotes":"21", "WebsiteUrl":"http://evincarofautumn.blogspot.com/", "Id":"197", "AccountId":"89496", "CreationDate":"2011-09-20T20:09:00.233", "AboutMe":"<p>I like programming, language, and collecting hobbies.</p>\n\n<ul>\n<li><p><a href=\"http://evincarofautumn.blogspot.com/\" rel=\"nofollow\">My blog</a> is a pretty good blog.</p></li>\n<li><p>I am working on <a href=\"https://github.com/evincarofautumn/kitten\" rel=\"nofollow\">a programming language called Kitten</a> which you may like.</p></li>\n</ul>\n", "Age":"23", "Location":"United States", "DownVotes":"0", "Views":"6", "Reputation":"146", "DisplayName":"Jon Purdy", "LastAccessDate":"2013-08-12T05:59:04.847"}, "comments":[], "Body":"<p>I recall <a href=\"http://lsadc.org/info/documents/2011/press-releases/pellegrino-et-al.pdf\" rel=\"nofollow\">a recent study</a> at the Université de Lyon. It shows how, in order to maintain a roughly fixed information rate, languages make tradeoffs in any of a number of areas—but predominantly in syllable structure. Essentially, phonemes can be readily omitted in fast speech to increase information density, but syllables are dropped much more rarely.</p>\n\n<p>The study compares English, French, German, Italian, Japanese, Mandarin, and Spanish, and uses Vietnamese as a point of reference for normalisation purposes. The two tonal languages (Mandarin and Vietnamese) were found to have the highest relative information density.</p>\n\n<p>They also found that information density is not strictly fixed—there are outliers. In particular, Japanese has a small phonemic inventory <em>and</em> very simple syllable structure. So even though the syllable rate of Japanese (7.84±0.09&nbsp;Hz) was comparable to that of Spanish (7.82±0.16&nbsp;Hz) and French (7.18±0.12&nbsp;Hz), Japanese was given an information density of 0.49±0.02—next to a more typical density such as 0.91±0.04 in the case of English.</p>\n\n<p>So the effect is by no means negligible; anecdotally, English subtitles for Japanese dialogue go by noticeably slowlier than English subtitles for dialogue in other languages. Bugs me to no end. ;)</p>\n", "Id":"1962", "ParentId":"1955", "CreationDate":"2012-05-19T19:21:08.823", "Score":"2", "PostTypeId":"2", "OwnerUserId":"197", "LastActivityDate":"2012-05-19T19:21:08.823", "CommentCount":"1"}