{"Body":"<p>Generally, I distinguish between \"first language\" (which I also refer to as \"mother tongue\") and \"native language.\" The meaning of \"first language\" should be obvious---in your case, Portuguese. But because you grew up in the US, I would list your \"native language\" as English. It's very difficult to have two native languages, because part of what makes a native speaker goes beyond grammar to include idioms, etc. Because you didn't grow up in a Portuguese-majority country, there were a lot of things that you didn't pick up in Portuguese. I consider a \"native speaker\" to have grown up surrounded by speakers of the language in question, hence the difficulty in acquiring two native languages. I think having a first language that is different from your native language is generally something that happens mostly with second-generation (or 1.5-generation, like yourself) immigrants.</p>\n\n<p>My situation is similar, by the way. My first language was Hindi, even though I was born in Canada, and I didn't know English when I started daycare. But now, I'm <em>much</em> more proficient in English. I could talk in-depth on a variety of technical topics in English, which I really can't do in Hindi. Although it sounds like your Portuguese is a lot better than my Hindi, in my case I think it's clear to call my native language English (but first language Hindi).</p>\n\n<p>There is also the practical consideration. Linguistics aside, what do you think the form is asking? Is it a form written by a linguist? In all likelihood they want to know which is your most proficient language. (Mind you, I've put Hindi on a form that asked for my first language, because that was technically true, but in hindsight I should have said English given what the underlying information was that they probably wanted.)</p>\n", "Id":"2000", "ParentId":"1994", "LastEditorUserId":"1052", "CreationDate":"2012-05-27T21:03:57.837", "OwnerUserId":"1052", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-05-28T00:30:59.513", "LastEditedUser":{"UpVotes":"0", "WebsiteUrl":"http://www.cs.toronto.edu/~aditya/", "Id":"1052", "AccountId":"1520917", "CreationDate":"2012-05-27T20:51:08.260", "AboutMe":"", "Age":"27", "Location":"Toronto, Canada", "DownVotes":"0", "Views":"0", "Reputation":"51", "DisplayName":"Aditya Bhargava", "LastAccessDate":"2013-03-30T03:45:31.637"}, "LastActivityDate":"2012-05-28T00:30:59.513", "Score":"4", "CommentCount":"5", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://www.cs.toronto.edu/~aditya/", "Id":"1052", "AccountId":"1520917", "CreationDate":"2012-05-27T20:51:08.260", "AboutMe":"", "Age":"27", "Location":"Toronto, Canada", "DownVotes":"0", "Views":"0", "Reputation":"51", "DisplayName":"Aditya Bhargava", "LastAccessDate":"2013-03-30T03:45:31.637"}}