{"Body":"<p>I'm generally skeptical of any claim of a perfectly ideally phonemic script for any natural non-engineered in-use language. I don't know very much about the potential languages suggested as answers (except Hindi), but even if there <em>were</em> such a language I wouldn't imagine that the ideally phonemic status would last very long as dialects develop and as the language changes over time.</p>\n\n<p>If a language has few speakers, then they start actively trying to preserve it. In this case, you might expect to see less (natural) change and variation. So if this language had a commonly-used ideally phonemic script, it might stay that way until the language finally died out...</p>\n\n<p>By the way, I'd also be skeptical of any claims of an ideally phonemic script coming from native speakers of that language. Not to say that the claim is necessarily false, but there's clearly potential for a huge bias to be a confounding factor. On the other hand, I would imagine that languages/scripts for which this claim is made might have <em>more</em> transparent orthographies than, say, English; native speakers of other languages tend to come to English and (rightfully) complain about how obtuse the grapheme-to-phoneme mapping is, but then somehow imagine that theirs is perfect.</p>\n\n<p>In actuality, they've just become accustomed to the idiosyncrasies of their own language script and don't see them anymore. (This happens in English too, but the orthography is so obviously opaque that you'd be hard-pressed to find a native English speaker who thinks it's a perfect mapping.) For example, I've often heard the claim that Hindi has a perfectly transparent orthography, but this is plainly false (and yes, I speak it, but not as a native speaker). Schwa deletion is the biggest and most obvious example of a mismatch between the spoken and written counterparts of a word or name.</p>\n\n<p>If you'd like something empirical, take a look at <a href=\"http://aclweb.org/anthology-new/N/N06/N06-1030.pdf\" rel=\"nofollow\">Learning Pronunciation Dictionaries: Language Complexity and Word Selection Strategies</a>. They look at, among other things, the number of letter-to-sound rules required for a language and how it changes with vocabulary size.</p>\n", "Id":"2001", "ParentId":"1960", "LastEditorUserId":"111", "CreationDate":"2012-05-27T22:45:38.663", "OwnerUserId":"1052", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-05-27T23:29:00.433", "LastEditedUser":{"UpVotes":"308", "DownVotes":"10", "Id":"111", "AccountId":"514008", "Views":"172", "Reputation":"5430", "CreationDate":"2011-09-14T09:33:29.710", "DisplayName":"Alenanno", "LastAccessDate":"2014-01-19T00:38:35.883", "AboutMe":"<p>I'm a student majoring in Languages (branch: Linguistics), currently working as a freelance translator. I've recently discovered <a href=\"http://db.tt/WpiKeReH\" rel=\"nofollow\">Dropbox</a> and I'm going to use it for my needs! :)</p>\n\n<p><em><strong>I love</em></strong><br>\nLanguages, Movies (Fantasy, Sci-Fi, Tarantino, etc.), Music, 3D Graphics, books and so on. </p>\n\n<p>Appointed ♦ Moderator Pro Tempore on <a href=\"http://area51.stackexchange.com/proposals/6673/linguistics?referrer=GlDGLdkDYNxMg1X13CJ1vg2\">Linguistics SE</a>, <a href=\"http://area51.stackexchange.com/proposals/6388/chinese-language-usage?referrer=XzTG1Nz01tc01sJEhak_6g2\">Chinese SE</a> and the <a href=\"http://area51.stackexchange.com/proposals/10848/russian-language-usage?referrer=J7IYS3ZUomUDvVVb-6SmDQ2\">Russian SE</a> site. If you're interested in other Stack Exchanges, try the <a href=\"http://area51.stackexchange.com/proposals/42949/italian-language-usage?referrer=ALVtGpK0tjLp1Lw15QCaUA2\">Italian SE</a> site.</p>\n\n<p>I like to lurk on other sites' Metas. <em>Meta is fun!</em> </p>\n\n<p><strong>My feature requests</strong>:</p>\n\n<ol>\n<li><a href=\"http://meta.stackoverflow.com/q/135786/176533\">Alert a moderator when an answer is improved after a post notice</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/138273/176533\">Automatically add chat event to the community bulletin (or make it easier)</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/121363/176533\">Give 10k users the ability to see the total count of flags they've handled</a></li>\n</ol>\n\n<p><strong>Moderator issues</strong>: If you have concerns or want to contact me about my moderation, you can find/ping me either in the <a href=\"http://chat.stackexchange.com/rooms/1336/linguistics\">Linguistics SE chat room</a> or <a href=\"http://chat.stackexchange.com/rooms/1984/chinese-language-and-usage\">CL&amp;U chat room</a>; if I'm not there or I'm \"idle\", just ping me! Please <em>avoid</em> using my personal email for such things. Use the chat rooms.</p>\n\n<hr>\n\n<p><strong>Languages List</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <sup>Languages with  * = learning on my own</sup></p>\n\n<p><strong>Mother Tongue:</strong> Italian, Sardinian;<br>\n<strong>Fluent:</strong> English, Spanish;<br>\n<strong>Less Fluent:</strong> French, German, Russian;<br>\n<strong>Learning:</strong> Japanese*, Chinese*, Swedish*, Greek*, Finnish*;<br>\n<strong>Willing to learn:</strong> Welsh, Korean, Dutch, Arabic, Hebrew, Hindi [to be continued]</p>\n\n<p>Me gusta el Español.<br>\nJ'aime le Français.<br>\nDeutsch gefällt mir.<br>\nМне нравится Русский язык.<br>\n私は日本語が好きです。<br>\n我爱中文。<br>\nJag älskar Svenska.</p>\n"}, "LastActivityDate":"2012-05-27T23:29:00.433", "Score":"1", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://www.cs.toronto.edu/~aditya/", "Id":"1052", "AccountId":"1520917", "CreationDate":"2012-05-27T20:51:08.260", "AboutMe":"", "Age":"27", "Location":"Toronto, Canada", "DownVotes":"0", "Views":"0", "Reputation":"51", "DisplayName":"Aditya Bhargava", "LastAccessDate":"2013-03-30T03:45:31.637"}}