{"Body":"<p>Good points have been made in other answers, but I feel that the notion of <strong><em>phonological word</em></strong> needs to be clarified.  This term refers to a prosodic constituent, not a lexical one, so something that is a phonological word in one context might not be one in another.  For example, the English word <em>the</em> can stand alone as a phonological word if it is spoken in isolation:</p>\n\n<blockquote>\n  <p><em><strong>the</em></strong></p>\n</blockquote>\n\n<p>or if is under focus within a longer phrase:</p>\n\n<blockquote>\n  <p><em>Say \"<strong>the</strong>\" for me.</em></p>\n</blockquote>\n\n<p>But in other contexts it might cliticize to a neighboring word, like a noun that follows it (as @jogloran mentions in a comment under the original question):</p>\n\n<blockquote>\n  <p><em>Eat <strong>the eggplant</strong>.</em></p>\n</blockquote>\n\n<p>The fact that English orthography dictates that we put a space between the determiner <em>the</em> and the noun that follows it is just a convention that has no bearing on phonological word boundaries.</p>\n\n<p>Since Japanese allows CV and a restricted set of CVC but not CCV syllables, it is not directly relevant to the OP's question (i.e. if one encounters a ...CCV... sequence, one can be confident that the first C is in the coda of the previous syllable).  That being said, here's an attempt to address @Mechanical snail's question about Japanese:</p>\n\n<p>The concept of the phonological word does not play a huge role in Japanese prosody. <a href=\"http://mitpress.mit.edu/catalog/item/default.asp?ttype=2&amp;tid=4405\" rel=\"nofollow\">Pierrehumbert and Beckman (1988)</a> note that there is some \"segmental allophony\" that can take place at the edges of the phonological word, but these phenomena are dependent on the combination of phonemes at those edges and may often not come into play. The accentual phrase is a much more crucial constituent when it comes to the domain of the lexical pitch accent and accentual phrase tones, so tonal information would help a Japanese speaker differentiate between syllables grouped into a single accentual phrase and those falling into two adjacent accentual phrases.  Often an accentual phrase can consist of a single phonological word, in which case the two domains demarcate the same lexical material.  A noun plus a particle can form such a constituent:</p>\n\n<blockquote>\n  <p><em><strong>nasu-o</em></strong></p>\n  \n  <p>eggplant-ACCUSATIVE</p>\n</blockquote>\n\n<p>This grouping of a noun and its particle into a single prosodic constituent is analogous to the determiner-noun grouping in English.  </p>\n\n<p>To bring everything back around to the OP's hypothetical language, if <em>li</em> is a definite article, and it behaves like the determiner <em>the</em> in English or the particle <em>-o</em> in Japanese, it will form a single prosodic constituent together with <em>stulu</em> whether it is a prefix or a standalone morpheme.</p>\n", "Id":"2009", "ParentId":"1536", "LastEditorUserId":"385", "CreationDate":"2012-05-28T23:15:43.827", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-05-28T23:21:15.910", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2012-05-28T23:21:15.910", "Score":"1", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}