{"Body":"<p>The Georgian verb has a complex templatic structure which includes a slot that may optionally be occupied by one of a set of morphemes known (within Kartvelian studies) as \"versions\". These \"versions\" consist of a single vowel and serve primarily to indicate valence or grammatical voice. Their precise function and syntactic scope results from their interaction with the larger syntactic and semantic context within which they are used. On many verbs the version morphemes are merely agreement markers. In some cases their effect is lexically specific (ie idiosyncratic to that verb). It should be noted that other parts of the Georgian verb may also affect verb valency.</p>\n\n<p>These \"version\" morphemes are found, in very similar form, in other languages of the Kartvelian family. Similar morphology, <a href=\"http://www.livingtongues.org/docs/CLSpaper%20copy.pdf\">also described as version systems</a>, is also found in some Turkic languages of Siberia, in the isolate Burushaski, and in South Munda Gorum, an Austroasiatic language of India; these systems are functionally similar to version but formally very different. It has been suggested that the focus systems of Austronesian languages, and the viewpoint aspect systems found in some Trans-New Guinea languages have similar functions to version.</p>\n\n<p>While the term \"version\" originated in Kartvelian studies (being a translation of the Georgian term <em>kceva</em>, lit. `change') <a href=\"http://www.livingtongues.org/docs/CLSpaper%20copy.pdf\">some authors</a> are using it to describe similar systems occuring in other languages.</p>\n\n<p>The structure and functions of the Georgian \"versions\" are described in <a href=\"http://cslipublications.stanford.edu/TLS/TLS9-2005/TLS9_Gurevich_Olga.pdf\">\"<em>Steal Me an Apple</em>: Version in Georgian\"</a>. The PhD thesis by <a href=\"http://mapageweb.umontreal.ca/tuitekj/publications/TuiteThesis.pdf\">Tuite, (1998)</a> \"Kartvelian Morphosyntax\" provides a description of versions (amongst many other things) across the Kartvelian languages generally.</p>\n", "Id":"2025", "ParentId":"2011", "LastEditorUserId":"363", "CreationDate":"2012-05-31T08:31:39.850", "OwnerUserId":"363", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-05-31T22:44:52.010", "LastEditedUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}, "LastActivityDate":"2012-05-31T22:44:52.010", "Score":"8", "CommentCount":"2", "OwnerUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}}