{"comments":[], "Body":"<p>Native or fluent speakers enjoy greater license in producing inaccurate pronunciations than do non-native non-fluent speakers. Native and fluent speakers and listeners have tacit command of the relative frequencies of different words and combinations thereof, so expressions which are, given the context, of relatively high frequency, will be understood even when pronounced carelessly, because they are more expected. Native and fluent speakers speak more carefully when they are delivering a less predictable message.</p>\n\n<p>Non-native speakers who nevertheless speak fluently are able to make themselves understood because they know the usual things to say in a given context, and their inaccurate productions will be correctly interpreted because they only try to say things which people normally say in a given situation. I can, for example, understand Vietnamese speakers who are speaking English badly (e.g., pronouncing coda /s/, /t/, /k/, /tS/ all as unreleased [k]) as long as they are saying something that is expected in the situation.</p>\n\n<p>The language-learning situation is very unforgiving for a non-native speaker who has little experience with the language and wishes to to express him/herself, only attending to what is a grammatical sentence, and not to what is customarily said in a given situation. A patient or sympathetic listener and accurate pronunciation is needed.</p>\n\n<p>If you are learning a new language, and pronunciation is not your strong suit, practice saying the same things in very predictable situations so that you will have a better chance of being understood. The level of muscular-auditory coordination needed to pronounce in a standard way, whether it is a novel or mundane expression, is the same, so this will be good practice for obtaining the skill level needed to become more expressive.</p>\n", "Id":"2033", "ParentId":"882", "CreationDate":"2012-06-01T01:05:40.583", "Score":"0", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2012-06-01T01:05:40.583", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}