{"OwnerUser":{"UpVotes":"0", "WebsiteUrl":"", "DownVotes":"0", "Id":"138", "AccountId":"903239", "Views":"3", "Reputation":"89", "CreationDate":"2011-09-15T03:29:19.557", "DisplayName":"Doug C.", "LastAccessDate":"2013-01-12T16:58:35.027", "AboutMe":"<p>I received my Ph.D. in linguistics, specialization in syntax, minor in computer and information sciences (1982).  I also did coursework in teaching English as a second language (TESL).  I have taught linguistics and ESL in the US, China, and Poland.  I was concerned for quite a few years about the shakiness of the \"scientific\" status of linguistics and eventually was convinced during the 1990's of its status as a branch of philosophy, not science, by Victor H. Yngve (see, e.g., Yngve's 1996 book <em>From Grammar to Science: New Foundations for General Linguistics</em>).  Linguistics as it is usually conducted is fraught with internal contradiction and unprovable assumptions.  Yngve has presented a way out, a framework called \"human linguistics\" or \"hard-science linguistics.\"  It is from that perspective that I now work.</p>\n"}, "comments":[], "Body":"<p>The answers so far have been the usual answers that can be found in most introductory linguistics textbooks.  They do not attempt to look beyond the usual, unproven assumptions.  Let's try to.  Prescriptive grammarians who write style guides are not scientists.  They do not claim to be scientists.  Therefore, it is worthwhile to ask why linguists criticize prescriptive grammarians for being \"unscientific.\"  A nutritionist does not criticize a chef for being unscientific, a botanist does not criticize a florist for being unscientific, and so on.  Thus there is something missing from the standard answer that simply contrasts prescriptivism and descriptivism.</p>\n\n<p>To understand why linguists criticize prescriptive grammarians for being unscientific, it may help if we look at assumptions behind the common claim that linguistics works like a science.  Supposedly, linguistics is descriptive, rather than prescriptive.  But consider.  Noam Chomsky, the highly influential linguist from MIT, created two idealizations that are at the center of modern theoretical linguistics.  These are the ideal native speaker, whose linguistic competence is assumed to be flawless, and the ideal speech community, assumed to be composed of individuals with perfectly identical linguistic knowledge.  Since neither of these ideals exists in the real world, how does the linguist decide which language forms are in the competence of an ideal native speaker?</p>\n\n<p>Chomsky (in Miller &amp; Lenneberg's <em>Psychology and Biology of Language and Thought</em>, 1978) has tried to rationalize the decisions, saying, \"A corpus may contain examples of deviant or ungrammatical sentences, and any rational linguist will recognize the problem and try to assign to observed examples their proper status.\"  However, the Finnish linguist Esa Itkonnen (in Thomas Perry's <em>Argumentation and Evidence in Linguistics</em>, 1980) has a reply: \"In natural science the situation is different: everything that happens in the natural course of events is 'correct.'  Therefore the notion of <strong>correctness of data</strong> does not apply here at all.\"</p>\n\n<p>The majority of linguists who accept Chomsky's idealizations may claim they attribute no \"value\" to the choice.  But call it what they will, they choose to \"describe\" some language forms and not to \"describe\" others that cause difficulty for their theories.  Prescriptivism?  No.  Philosophical idealism?  Yes.</p>\n\n<p>So why do many linguists criticize prescriptive grammarians for being \"unscientific\"?  It is an interesting question, considering the criticism comes from a group whose philosophical idealism runs counter to a scientific approach.</p>\n", "Id":"208", "ParentId":"155", "CreationDate":"2011-09-16T05:53:20.707", "Score":"8", "PostTypeId":"2", "OwnerUserId":"138", "LastActivityDate":"2011-09-16T05:53:20.707", "CommentCount":"4"}