{"OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "comments":[], "Body":"<p>Currently taking a Sociolinguistics course so I am, obviously, an expert on this subject (please note the sarcasm).</p>\n\n<p>@Gaston Ümlaut did a very good job describing why there's less variation in written form but I wanted to bring up a few more points.</p>\n\n<p>First, the reason there's less [observable] variation in written forms compared to spoken forms is simply that there is greater societal pressure to conform to the \"standard dialect\" in written form, as opposed to spoken. Think of writing as akin to making a presentation for a crowd of people. In formal situations like that, most people will make a concious effort to better conform to the standard dialect to be more easily understood. It also helps that since written form has an editting process, people can take more time to think and craft their words and go back and fix \"mistakes\" (i.e. deviations from standard dialect).</p>\n\n<p>Second, you need to think about the context. <a href=\"http://www.stanford.edu/~eckert/PDF/bell1984.pdf\" rel=\"nofollow\">Language Style as Audience Design</a> by Allan Bell (from 1984) shows that people adjust their speech patterns based on the audience. I see no reason why this won't apply to writting as well. In emails, IM, and facebooking between friends slang, varient spellings, and sentence structures which reflect the speaker's (writer's) native accent are extremely common. Then you have the issue of emoticons, slang, and the fact that spelling errors and typos are more easily accepted than, for example, in a newspaper.</p>\n\n<p>I do have anecdotal evidence to support this view cross-linguistically. I currently live in Seoul, South Korea and I have observed that my friend's IMs and text messages frequently use slang and short forms they would not use in more formal situations. It should be noted though that Korean spell adheres quite closesly to pronunciation (not 100%, but maybe 90% identical. Mostly because they occassionally revise their dictionaries to conform to modern pronunciation) so these spellings are rather consistent across writers (but still vary from standard form).</p>\n", "Id":"2082", "ParentId":"2077", "CreationDate":"2012-06-11T00:40:04.547", "Score":"2", "PostTypeId":"2", "OwnerUserId":"1055", "LastActivityDate":"2012-06-11T00:40:04.547", "CommentCount":"1"}