{"Body":"<p>A lot of the ambiguity is mitigated by Korean phonological rules. For example, \"aki\" could be either 아기 (a.ki) or 악이(ak.i) but since Korean phonology avoids codas wherever possible they would both be pronounced as \"a.ki\". Similarly, \"akhi\" could be 아키 (a.khi), 앜이 (akh.i), or 악히 (ak.hi) but they would all be pronounced as \"a.khi\". 아키 and 앜이 for the same reason as above and 악히 because Korean phonology tends to prefer aspirations over plosive-glottal chains.</p>\n\n<p>Additionally, complex consonents can only appear in the coda position. Thus, \"ilka\" could be interpretted as 읽아 (ilk.a) or 일가 (il.ka) but <strong>not</strong> \"i.lka\" since complex onsets are banned. If a complex coda is followed by a null onset, as with 읽아 (ilk.a), the complex consonent splits and the last part of the coda becomes an onset as above, resulting in a pronunciation of \"il.ka\".</p>\n\n<p>So basically what I'm trying to say is that although the lack of syllable markings is ambiguous in terms of spelling, but it is no more ambiguous than Korean pronunciation. In fact, spoken Korean is even more ambiguous than Yale Romanized text as Korean only allows k, p, t, n, m, and ng sounds in SR (surface representation, i.e. after the coda-to-onset shifts mentioned above) coda positions. Aspiration and glottalization features are lost, s and c become t, and h is silent (remembering that \"h\" can only be a coda in SR if the following onset is not null and is not a plosive). Thus 밭 (path), 밧 (pas), 밪 (pac), and 받 (pat) are all pronounced identically, despite different romanized forms. So really, Yale Romanization is more ambigious than Korean spelling but less ambiguous than Korean pronunciation.</p>\n\n<p>Where you do get true ambiguity is with glottalized consonents like ㄸ (tt), ㄲ (kk), ㅃ (pp), ㅆ (ss), and ㅉ (cc). Without marking syllables 악기 and 아끼 would share the same romanization (\"akki\") despite having different pronunciations (\"ak.ki\" and \"a.kki\", respectively). I should note for people who aren't familiar with Hangul (Korean writing system) that although these glottalized consonents may look like complex consonents (ㄲ looks like two ㄱs, ㅃ looks like two ㅂs, etc.), they are not and, unlike complex consonents, they never split.</p>\n\n<p>Diphthong vowels show a similar ambiguity. 에어 (ey.e) and 어여 (e.ye) would both be written as \"eye\" despite, as with glottalized consonents, having different pronunciations.</p>\n\n<p>From my experience, in literature people tend not to make syllables at all. This is because in practice these ambiguities don't come up too often and the inclusion of an English gloss solves any ambiguities that do occur. You need to remember the context of Yale Romanization; it is used in academic papers because it is the only romanization system with a 1:1 character conversion. Typically these papers must be written for an audience that does not speak Korean at all. In fact, Yale Romanization would be a very bad system to use to teach Hangul if only because Korean consonent/vowel pronunciations are not 100% compatible with English phonology.</p>\n\n<p>In the end, it comes down to your style, the style guide of the journal or conference you're writing for, and what exactly you're trying to convey. If you're doing a paper on syllabification or Korean morphological rules then marking syllables would be important. In a syntax or semantics paper, not so much.</p>\n\n<p>On a personaly note, I too find Yale Romanization frustrating. I once read 6 pages of a paper about NPI licensing in Korean BEFORE clauses before I realized \"ceney\" was \"전에\" (cen.ey), which probably says more about my low Korean proficency than Yale Romanization. Also, how is ㅈ, pronounced as a voiceless \"j\" or unaspirated \"ch\", romanized as \"c\"? Yes, I know it's so ㅊ can be romanized as \"ch\" (which it does actually sound like) much like the aspirated \"k\", ㅋ, is romanized as \"kh\". I don't care!</p>\n", "Id":"2094", "ParentId":"2091", "LastEditorUserId":"1055", "CreationDate":"2012-06-13T02:18:55.627", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-06-14T06:00:01.440", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2012-06-14T06:00:01.440", "Score":"2", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}