{"OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "comments":[], "Body":"<p>Every language seems to distinguish between the same basic syntactic <em>functions</em>. For instance, we can distinguish between <em>predicates</em> and <em>arguments</em> within a sentence, or between a <em>head</em> and its <em>modifiers</em> in a smaller phrase.  </p>\n\n<p>Now, in English, most words are limited as to which function they can play.  Nouns like \"boy\" make good arguments, but they don't make good predicates on their own: you have to tack on a copula (e.g. \"be a boy\").  Verbs like \"ate\" make good predicates but they don't make good arguments on their own: you have to build a relative clause around them first (e.g. \"the one who ate\").  So we can say this:</p>\n\n<blockquote>\n  <p>[The boy]<sub>Arg</sub> [ate]<sub>Pred</sub></p>\n</blockquote>\n\n<p>But sentences like these, intended to mean something like \"The one who ate is a boy,\" are ungrammatical:</p>\n\n<blockquote>\n  <p>[The ate]<sub>Arg</sub> [boy]<sub>Pred</sub></p>\n  \n  <p>[The ate]<sub>Arg</sub> [boy-s]<sub>Pred</sub> </p>\n</blockquote>\n\n<p>This limitation is clear evidence for a morphosyntactic noun/verb distinction in English.  </p>\n\n<p>Okay.  So there are <em>claimed</em> to be languages without this limitation: languages, that is, in which any word can take any syntactic function. The Salishan language family is the classic source for examples of this.  Here's one example from St'át'imcets: in <em>this</em> sentence, <em>t'ak</em> 'go' is the predicate...</p>\n\n<blockquote>\n  <p>[T'ak]<sub>Pred</sub> [ti=nk'yáp=a]<sub>Arg</sub></p>\n  \n  <p>[go]<sub>Pred</sub> [DET=coyote=DET]<sub>Arg</sub></p>\n  \n  <p>\"Coyote goes along\"</p>\n</blockquote>\n\n<p>...and in <em>this</em> one, <em>nk'yap</em> '[be a] coyote' is the predicate:</p>\n\n<blockquote>\n  <p>[nk'yáp]<sub>Pred</sub> [ti=t'ak=a]<sub>Arg</sub></p>\n  \n  <p>[coyote]<sub>Pred</sub> [DET=go=DET]<sub>Arg</sub></p>\n  \n  <p>\"The one going along is Coyote\"</p>\n</blockquote>\n\n<p>(Note that the word order is backwards from English: Salishan predicates come at the start of the clause, before their subjects.)</p>\n\n<p>So people have <em>claimed</em>, based on data like these, that there is no noun/verb distinction in Salishan languages.</p>\n\n<p>The trouble is, in all the Salish languages where people have checked, it turns out that there are other morphosyntactic asymmetries between nouns and verbs.  For instance, in St'át'imcets, only nouns can be the head of a relative clause.  You can say this...</p>\n\n<blockquote>\n  <p>[ti=tupun-táli=ha]<sub>Modifier</sub> [sqaycw]<sub>Head</sub></p>\n  \n  <p>[DET=hit-3sg=DET]<sub>Modifier</sub> [man]<sub>Head</sub></p>\n  \n  <p>\"The man who hit him\"</p>\n</blockquote>\n\n<p>but <em>not</em> this...</p>\n\n<blockquote>\n  <p>[ti=sqaycw=a]<sub>Modifier</sub> [tupun-as]<sub>Head</sub></p>\n  \n  <p>[DET=man=DET]<sub>Modifier</sub> [hit-3sg]<sub>Head</sub></p>\n  \n  <p>lit. \"The him-hitter who mans\"</p>\n</blockquote>\n\n<p>(Once again, the St'át'imcets word order is the reverse of the English word order: the modifier comes first, before the head.)</p>\n\n<p>So if you want to describe the syntax of relative clauses in St'át'imcets, you <em>do</em> need a noun/verb distinction after all.  And this seems to be the case for the other Salishan languages as well, though the jury is still out on some of them.  <a href=\"http://people.umass.edu/scable/PNWSeminar/handouts/Lex/Lexical-Categories.pdf\">This handout by Seth Cable is a good place to start for information on the noun/verb distinction in Salishan (and also Wakashan) languages</a>, and the references in it go into more detail.  (The St'át'imcets examples here are all from Cable's handout.)</p>\n\n<p>So okay, the Salishan languages have a noun/verb distinction.  What about other language families?  I'm less familiar with the literature here.  Some people have made similar claims about Austronesian languages.  David Gil, for instance, claims that Riau Indonesian has no noun/verb distinction.  But <a href=\"http://www.und.nodak.edu/dept/linguistics/wp/2010Yoder.pdf\">here's a paper by Brendon Yoder arguing against Gil's conclusions</a>, claiming that Riau Indonesian does have a noun/verb distinction after all.</p>\n\n<p>Long story short: In the cases I'm familiar with where someone has said \"Language X lacks a noun/verb distinction,\" further study has suggested that their claim was dubious our outright wrong.  We still can't be dead certain that all languages have the distinction.  But it would be a big surprise at this point to find a language that really and truly lacked it.</p>\n", "Id":"2115", "ParentId":"2099", "CreationDate":"2012-06-15T20:04:25.137", "Score":"6", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2012-06-15T20:04:25.137", "CommentCount":"3"}