{"Body":"<p>I'm not sure what aspect of the Wikipedia explanation you find unclear, but here's an analogy:</p>\n\n<p>Imagine the government asks a research group to figure out \"how much the Lincoln Tunnel gets used by people to enter Manhattan from New Jersey in a 24-hour period\". There are two obvious ways to obtain this measurement; one could count the <strong>number of vehicles</strong> that enter the tunnel in a 24-hour period, or one could count the <strong>number of <em>people</em></strong> riding in the vehicles that enter the tunnel during a 24-hour period. Either metric could be relevant, depending on what the government is trying to focus on. If they care about factors that contribute to street traffic, then the vehicle-counting metric might be more appropriate. If they are more concerned with the actual population density of Manhattan during the day and how much of it is affected by out-of-towners, the person-counting metric might be more appropriate.</p>\n\n<p>In phonology, <strong>syllables are like cars and morae are like people</strong>. Every car on the road must contain at least one person (the driver), but a car can also contain multiple people. Likewise, every syllable contains minimally one mora, but it may contain two or even three. Certain phonological processes are dependent on syllable count and some are dependent on mora count; some are dependent on both. </p>\n\n<p>Studying Japanese is a great way to become familiar with the concept of a mora. As the section on Japanese in the Wikipedia article mentions, most hiragana symbols correspond to a single mora (an exception is when one symbol is followed by one of the \"little\" gliding kana ゃ,　ゅ and　ょ--in this case the two symbols together correspond to a single mora), so that <em>Nippon</em>, which is written with the four hiragana symbols にっぽん, contains four morae. Basically, because the hiragana system gives syllable-final consonants their own symbols (ん for a syllable-final nasal and っ for a geminate consonant that anticipates the initial consonant of a following syllable) but syllable-initial consonants are just encoded as part of a CV syllable represented by a single symbol (な for <em>na</em>,　か for <em>ka</em>, etc.), the writing system encodes an asymmetry that is quite common cross-linguistically: nuclear vowels and coda consonants contribute to syllable weight in Japanese but not onset consonants. So <em>na</em>, <em>a</em>, and <em>ka</em> are \"light\"/monomoraic syllables, and <em>nai</em>, <em>an</em>, <em>kan</em>, and <em>kat</em> (as in the geminated <em>katta</em>) are \"heavy\"/bimoraic syllables. (At the risk of stretching the analogy too far, onset consonants, when they are present, are kind of like pets that are riding in the car. They don't get counted as people entering the tunnel!)</p>\n\n<p>For an example of a process that is sensitive to both the syllable and the mora in Japanese, consider pitch accent assignment. In the \"standard\" Japanese dialect, a pitch accent is associated with the initial mora of a syllable. So with three-syllable words, there are three possible accent patterns for accented words--initial, medial, and final accent (of course words can be unaccented as well). It doesn't matter if the syllables are light or heavy. But if the accented syllable is heavy, the high \"tone\" (trying to stay pre-theoretical here) of the accent is constrained to associate with the initial mora of the accented syllable.</p>\n\n<p>I hope at least part of this explanation clears things up for you a bit! Let me know if there is anything in particular that is still unclear and I will try to improve my answer.</p>\n\n<p>*<strong>*UPDATE TO ORIGINAL ANSWER:</strong></p>\n\n<p>Just a point of clarification--the system described above for Japanese is a language-specific one. For example, in some languages that count morae, coda consonants do <em>not</em> get counted as being moraic. And, as @jlawler points out in his comment under @acattle's answer, the phonetic realizations of syllable weight contrasts are not the same in all languages (i.e. a heavier syllable--one with more morae--may <em>not</em> take longer to pronounce than a lighter one), so the <em>definition</em> of a mora cannot be dependent on its phonetic behavior. Below is a list of possible moraic segments (in the rime of the syllable) and some example languages that use those criteria for moraicity (taken from <a href=\"http://roa.rutgers.edu/files/346-0999/346-0999-MOREN-0-0.PDF\" rel=\"nofollow\">Morén's 1999 dissertation</a>, p.16):</p>\n\n<blockquote>\n  <p>Vowels (Khalkha Mongolian, Yidiɲ)</p>\n  \n  <p>Vowels + Glides (Gumbaynggir)</p>\n  \n  <p>Vowels + Non-glottal Sonorants (Kwakwala)</p>\n  \n  <p>Vowels + All Sonorants (Lithuanian, Tiv)</p>\n  \n  <p>Vowels + All Consonants except Plain Stops (Metropolitan New York\n  English)</p>\n  \n  <p>Vowels + All Consonants except Aspirated Stops (Icelandic)</p>\n  \n  <p>All Segments (Latin, Arabic dialects, Aklan, Koya, Imdlawn Tashlhiyt\n  Berber)</p>\n</blockquote>\n", "Id":"2152", "ParentId":"2148", "LastEditorUserId":"385", "CreationDate":"2012-06-20T13:30:49.767", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-07-20T15:15:52.863", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2012-07-20T15:15:52.863", "Score":"8", "CommentCount":"5", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}