{"Body":"<p>At first, a couple of words on the origin of “said” in the sense of “above-mentioned”.\nThe OED gives the following.</p>\n\n<p>†8. To speak of, mention, enumerate, describe.</p>\n\n<blockquote>\n  <p>?c1225  (1200)    Ancrene Riwle (Cleo. C.vi) (1972) 256   <em>Lichte gultes beteð þus ananrich [read richt] bi ow seoluen. &amp; þach seggeð ham inschrift.</em></p>\n  \n  <p>c1390  (1350)    Joseph of Arimathie (1871) l. 70,   <em>I am not worþi to seyn moni of his werkes.</em></p>\n  \n  <p>a1400–50   Alexander 5551   <em>And oþir sellis he saȝe at sai wald he neuir.</em></p>\n  \n  <p>c1540  (1400)    Destr. Troy 5204   <em>The same yle I said you, Cicill is calt.</em></p>\n</blockquote>\n\n<p>As you can see from the examples above, the verb “say” in this sense is used transitively, i.e. it takes a direct object. All dictionaries of Modern English mark this dated use as  legalese or used humorously.</p>\n\n<p>This agrees with data on “said” – the earliest quote in the OED is this one (by the way, note “þe” before “said”):</p>\n\n<blockquote>\n  <p>a1300   Cursor M. 14978 (Cott.) ,   <em>Son þar went disciplis tua Vnto þe said [Gött. þis said] castel.</em></p>\n</blockquote>\n\n<p>Incidentally, all of the nine examples in the OED do have a determiner before “said”. The tenth example is the absolutive use of “said”, as in </p>\n\n<p>“<em>... the said were sometimes lurking about the Islands of St. John.</em>” (1648)</p>\n\n<p>There is one important thing to remember about legalese. As Garner argues, “<strong>It is a convention in legal writing to omit both definite and indefinite articles</strong> [emphasis mine - Alex B.] before words such as plaintiff, defendant, petitioner, respondent, appellant, and appellee. It is almost as if these designations in legal writing become names, or proper nouns, that denote the person or persons referred to. The convention is a useful one because cutting even such slight words can lead to leaner, more readable sentences” (Garner 2011 :79).</p>\n\n<p>Also, “There is a contagious tendency to in legal writing to omit articles before nouns, perhaps on the analogy of the special legal convention for party names. … There is a tendency, for example, in tax cases to refer to taxpayer without an article, as if it were a proper name” (p. 79)</p>\n\n<p>Garner gives the following examples:</p>\n\n<p>“Federal law also required that taxpayer [read <em>the taxpayer</em>] make contributions ….”</p>\n\n<p>“In approaching solution [read <em>the solution</em>] to this problem we must look ….”</p>\n\n<p>“We conclude that although the award as remitted by trial judge [read <em>the trial judge</em>] was generous ….”</p>\n\n<p>Now about “said” used in legalese. Garner does mention that it is used as a substitute for <em>the</em>, <em>that</em>, <em>this</em>, or any other deictic or “pointing” word. Used for such a word, <em>said</em> typifies legalese and is often parodied by non-lawyers. And lawyers occasionally fall into self-parody” (p. 793). Here’s one of his examples:</p>\n\n<blockquote>\n  <p>“A considerable number of persons were attracted to <em>said square</em> by <em>said meeting</em>, and <em>said bombs</em> and other fireworks which were being exploded there. A portion of the center of the square about 40 to 60 feet was roped off by the police of <em>said Chelsea</em>, and <em>said bombs</em> or shells were fired off within the space so inclosed [sic!], and no spectators were allowed to be within said inclosure [sic!]. The plaintiffs were lawfully in <em>said highway</em> at the time of the explosion of <em>said mortar</em>, and near <em>said ropes</em>, and were in the exercise of due care” (1892).</p>\n</blockquote>\n\n<p>Now, I asked you earlier about your theory/definition of the determiner. It is important to know such things because some linguists understand determiners as a lexical category (determiner1 in Chalker and Weiner 1998). There are linguists who understand determiners as a functional category (e.g. the authors of CGEL, determiner2 in Chalker and Weiner 1998), and that is why they also have determinatives. Under the latter proposal, which I happen to agree with, a determiner is not necessarily a determinative.</p>\n\n<p>The authors of CGEL give the following three tests that help us distinguish between adjectives and determinatives in English (note that these tests may not work in other languages, esp. the first test).</p>\n\n<ol>\n<li>Determinatives cannot combine with articles (*<em>a this book</em>).</li>\n<li>Determinatives can be used with a single count NP (<em>one book</em>).</li>\n<li>Determinatives can be used in a partitive construction (<em>one of them</em>).</li>\n</ol>\n\n<p>Note that a word doesn’t need to pass all of those three tests to be considered a determinative – e.g. “one” doesn’t pass the first test (<em>the one problem that remains</em>).</p>\n\n<p>Quite often the same word can belong to both word classes, adjectives and determinatives, e.g. “sufficient”.</p>\n\n<p>sufficient as a determinative:</p>\n\n<p>?<em>the sufficient helpers</em></p>\n\n<p><em>sufficient of helpers</em></p>\n\n<p>sufficient as an adjective:</p>\n\n<p><em>a sufficient reason</em></p>\n\n<p>I think that “said” may behave like a determinative in legalese in writings of certain people (in whose idiolect \"said note\" is fine but \"the said note\" is not) - if there are such writers. However, in this case you’d have to address the following two questions:</p>\n\n<p>How consistent are those writers in omitting articles before “said” followed by a singular count noun? Is \"the said\" followed by an NP ungrammatical in their idiolect?</p>\n\n<p>Do you want to have the same word belong to different word classes in different registers in your theory of syntax? I personally would say yes to the second question. As Walter Bisang argues, <strong>there are languages where “lexical items are not necessarily preclassified for syntactic categories”</strong> (Bisang 2011: 293).</p>\n", "Id":"2161", "ParentId":"2147", "LastEditorUserId":"445", "CreationDate":"2012-06-22T05:03:13.660", "OwnerUserId":"445", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-06-23T01:44:41.980", "LastEditedUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}, "LastActivityDate":"2012-06-23T01:44:41.980", "Score":"5", "CommentCount":"6", "OwnerUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}}