{"Body":"<p>I think you need to tease apart the concept of allophony from the concept of complementary distribution.  As people have mentioned in the comments, the two don't necessarily go hand in hand--i.e. it is not necessarily the case that two phones that are in complementary distribution can be assumed to be allophones of the same phoneme (as Alex B. mentioned), nor is it the case that the distribution of two phones--each of which is a possible realization of a single phoneme--will never overlap in their distribution.  It's the second assertion that is relevant for your Brazilian Portuguese example.</p>\n\n<p>The \"trick\" is that sometimes different phonemes can have allophones \"in common\", i.e. Phoneme A might sometimes be realized as Phone Y, but Phoneme B might also sometimes be realized as Phone Y:</p>\n\n<blockquote>\n  <p>/A/ --> [X] in some environment, [Y] in some other environment</p>\n  \n  <p>/B/ --> [Y] in some environment, [Z] in some other environment</p>\n</blockquote>\n\n<p>This happens a lot in <em>neutralizations</em> and <em>mergers</em>.  In languages with word-final devoicing, for example, maybe /d/ is realized as [t] word-finally but as [d] elsewhere.  But /t/ would also be realized as [t] word-finally.  If one encounters a [t] at the end of a word, one cannot be sure without additional information whether it is a realization of /t/ or /d/.</p>\n\n<p>In your example, [w] is probably an allophone of some phoneme that can sometimes be realized as [w] and sometimes [l] (in some sense the \"naming\" of phonemes is arbitrary, but I'd probably call it /l/ since that seems to be the clear \"elsewhere\" realization) and [w] is probably also an allophone of a different phoneme (one that I would call /w/).  </p>\n\n<p>Now, it is true that <em>allophones</em> of the same phoneme must be in complementary distribution, but the two [w]s and the [l] in your table are not actually all realizations of the same phoneme.  So, here is a revised assessment of their distribution, taking their underlying forms into account:</p>\n\n<blockquote>\n  <p>[l] (from /l/) not found at the end of a syllable, but found elsewhere</p>\n  \n  <p>[w] (from /l/) found at the end of a syllable, but <em>not</em> found elsewhere</p>\n  \n  <p>[w] (from /w/) found elsewhere (and perhaps also at the end of a syllable?)</p>\n</blockquote>\n\n<p>So, the [l] and the first [w] are in fact in complementary distribution.  I hope that makes sense!</p>\n", "Id":"2194", "ParentId":"2192", "LastEditorUserId":"385", "CreationDate":"2012-07-01T15:00:09.313", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-07-01T15:15:50.323", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2012-07-01T15:15:50.323", "Score":"6", "CommentCount":"2", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}