{"comments":[], "Body":"<p>Typical adjectives (or adjectival groups), indeed, precede nouns in Polish, as in many Slavic languages.</p>\n\n<p>However, there is a notable exception to that rule. <strong>If the purpose of adjective is to classify the denoted entity which belongs to a certain category or type</strong>, such adjective appears in postposition.</p>\n\n<p>Simply speaking, adjective in <code>green apple</code> goes in preposition: <code>zielone jabłko</code>, but in <code>Polish Kingdom</code> it's in postposition: <code>Królestwo Polskie</code>.</p>\n\n<p>Consider these two phrases: <code>good day</code> versus <code>waiting for a good day</code> (waiting for a good moment to do something). They would be <code>dzień dobry</code> and <code>czeka na dobry dzień</code>, respectively.</p>\n\n<hr>\n\n<p>As per similar appearances in Belarusian, Ukrainian, and even Russian, I would think that this has not been actually <em>invented</em> solely in Polish language. Instead, it was rather a common pattern for many languages and dialects, most likely borrowed from sacral texts.</p>\n\n<p>There's is an interesting parallel with Sanskrit that uses postpositions to emphasize sacral meaning.</p>\n\n<hr>\n\n<p>Further reading:</p>\n\n<ul>\n<li><strong>Brajerski, Tadeusz</strong>. 1963. O szyku zaimka dzierżawczego w funkcji przydawki. Studia linguistica in honorem Thaddaei Lehr-Spławiński. Warszawa: Państwowe Wydawnictwo Naukowe</li>\n<li><strong>Warren, Beatrice</strong>. 1984. Classifying adjectives. Göteborg: Acta Universitatis Gothoburgensis.</li>\n</ul>\n", "Id":"2213", "ParentId":"1340", "CreationDate":"2012-07-04T13:50:36.130", "Score":"5", "PostTypeId":"2", "OwnerUserId":"1009", "LastActivityDate":"2012-07-04T13:50:36.130", "OwnerUser":{"UpVotes":"512", "WebsiteUrl":"http://weew-waaw.com", "Id":"1009", "AccountId":"947951", "CreationDate":"2012-05-15T02:50:16.013", "AboutMe":"<p><img src=\"http://i.stack.imgur.com/VxMqM.jpg\" alt=\"Weew-Waaw, Thai to English, Thai to Russian transcription\"><br>\nI'm working on a project of rule-based Thai transcription: (the link is temporarily unavailable)<br>\nTechnically, it is written in F# with a C# front-end.<br>\nI would be happy to get acquainted with those who are experienced with NLP (Natural Language Processing), just ping me in the SE chat. :-)</p>\n", "Age":"42", "Location":"Bangkok, Thailand", "DownVotes":"50", "Views":"36", "Reputation":"1656", "DisplayName":"bytebuster", "LastAccessDate":"2014-01-19T00:53:20.473"}}