{"Body":"<p>Just to put in my two cents here, I've always thought of phonemes as equivalence classes over the set of linguistically attested acoustic signals. With a given statistical model in place, membershiphood into a phonemic class is determined on statistical similarity. I would guess that the model is determined by a vector of real parameters, meaning that the signal space is a euclidean space and phonemic categories are a matter of euclidean clustering. Then statistical similarity becomes a question of euclidean distance, or some other metric on the signal space. Though I haven't yet read into the matter yet, this is the definition I am expecting going into acoustic phonetics. At least with this definition, idiolectual variation is accommodated and experimental error is easily overcome. I'm just speculating at this point, but I would guess that allophones are witnessed by further analysis of a given phonemic category, perhaps by dense euclidean subclusters.</p>\n\n<p>I really have no idea since I haven't read into the subject, but I don't like this definition because it appears at least to be model dependent; even if the signal space is assumed euclidean, a different probabilistic model may yield different clusters. At this point I should stop speculating, but I can't help think that, as convenient as this theory would be, it doesn't yet address the internal representation of what these clusters might represent. This approach does seem very intuitive though.</p>\n\n<p>There's a paper I just found <a href=\"http://www.ncbi.nlm.nih.gov/pubmed/8408965\" rel=\"nofollow\">A cross-linguistic investigation of locus equations as a phonetic descriptor for place of articulation. Sussman 1993</a> that apparently makes a \"100% classification rate for 3 places of articulation\" and the method involves using a regression relationship of F2 onset and F2 mid of a vowel V when it occurs after a stop C. So, CV for C=[b,d,ɡ]</p>\n\n<blockquote>Strong linear regression relationships were found for every stop category\nacross all speakers. Slopes and y intercepts systematically varied as a function of place of articulation.</blockquote>\n\n<p>I'm not sure what the significance of this is, but it seems relevant.</p>\n", "Id":"2214", "ParentId":"1502", "LastEditorUserId":"1162", "CreationDate":"2012-07-04T23:42:27.830", "OwnerUserId":"1162", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-07-14T19:22:03.277", "LastEditedUser":{"UpVotes":"23", "DownVotes":"0", "Id":"1162", "AccountId":"1586391", "Views":"2", "Reputation":"286", "CreationDate":"2012-07-04T22:46:56.807", "DisplayName":"taylor", "LastAccessDate":"2013-05-10T17:08:44.560"}, "LastActivityDate":"2012-07-14T19:22:03.277", "Score":"5", "CommentCount":"1", "OwnerUser":{"UpVotes":"23", "DownVotes":"0", "Id":"1162", "AccountId":"1586391", "Views":"2", "Reputation":"286", "CreationDate":"2012-07-04T22:46:56.807", "DisplayName":"taylor", "LastAccessDate":"2013-05-10T17:08:44.560"}}