{"Body":"<p>Theological issues aside, I can see several wrong assumptions in your question.</p>\n\n<p>\"The word God is a relatively new European invention, which was never used in any of the ancient Judaeo-Christian scripture manuscripts that were written in Hebrew, Aramaic, Greek or Latin.\"</p>\n\n<p>It's not entirely clear what you meant there. If you are talking about the English word \"god\", then why would you expect to come across an English word in a Latin or Greek text? If you are talking about the concept of \"god(s)\", then your assumption is inaccurate. It is a well-known fact that various Indo-European peoples had gods, attested by names of deities (Jupiter, Zeus, Perkunas etc.) and the word 'god', e.g. Latin 'deus', Vedic 'devas' etc. As a matter of fact, Father Sky is a very common deity in many IE cultures. A common motif is the main god fighting/killing some chthonic creature (a snake or a dragon). </p>\n\n<p>Now about \"Gad\" and English \"god\". The wrong assumption here is what Yuri Otkupschikov called \"chronological scissors\" (chronological disparity). You are comparing words that don't belong to the same time period. Yes, in OE the word was \"god\" but looking at other Germanic languages you can't help but notice that originally the root vowel was not \"o\" but rather \"u\", e.g. have a look at <a href=\"http://en.wiktionary.org/wiki/Appendix%3aProto-Germanic/gudan\">this</a>.</p>\n\n<p>I'm not a Hebraist (nor a Semitologist) but here's what I've been able to find about the origin of the Hebrew proper noun \"<a href=\"http://www.abarim-publications.com/Meaning/Gad.html\">Gad</a>\". I strongly recommend looking it up at least in <a href=\"https://www.eisenbrauns.com/ECOM/_3JO1FFR6W.HTM\">Klein 1987</a>:</p>\n\n<p><img src=\"http://i.stack.imgur.com/0Xgeo.png\" alt=\"enter image description here\"></p>\n\n<p>A general remark on etymology:</p>\n\n<blockquote>\n  <p>\"A generally accepted principle (advocated by Meillet) permits only comparisons which involve both sound and meaning together. <strong>Similarities in sound alone</strong> (for example, the presence of tonal systems in compared languages) <strong>or in meaning alone</strong> (for example, grammatical gender in the languages compared) <strong>are not reliable</strong>, since they often develop independently of genetic relationship, due to diffusion, accident and typological tendencies\" (Campbell 2004: 356, emphasis mine - Alex B.)</p>\n</blockquote>\n\n<p>Executive summary: I am very skeptical of your hypothesis/evidence and my answer is no.</p>\n", "Id":"2231", "ParentId":"2229", "LastEditorUserId":"445", "CreationDate":"2012-07-10T18:20:59.263", "OwnerUserId":"445", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-07-10T22:13:56.867", "LastEditedUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}, "LastActivityDate":"2012-07-10T22:13:56.867", "Score":"6", "CommentCount":"22", "OwnerUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}}