{"OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "comments":[], "Body":"<p>The <a href=\"ftp://ftp.cis.upenn.edu/pub/treebank/doc/tagguide.ps.gz\" rel=\"nofollow\">guide posted on the Penn Treebank website</a> describes determiners as follows:</p>\n\n<blockquote>\n  <p><em>Determiner---DT</em></p>\n  \n  <p>This category includes the articles <em>a(n), every, no</em> and <em>the</em>, the\n  indefinite determiners <em>another, any</em> and <em>some, each, either</em> (as in\n  <em>either way</em>), <em>neither</em> (as in <em>neither decision</em>), <em>that, these, this</em> and <em>those</em>, and instances of <em>all</em> and <em>both</em> when they do not\n  precede a determiner or possessive pronoun (as in <em>all roads</em> or <em>both\n  times</em>). (Instances of <em>all</em> or <em>both</em> that do precede a determiner or\n  possessive pronoun are tagged as predeterminers (PDT).) Since any noun\n  phrase can contain at most one determiner, the fact that <em>such</em> can\n  occur together with a determiner (as in <em>the only such case</em>) means\n  that it should be tagged as an adjective (JJ), unless it precedes a\n  determiner, as in <em>such a good time</em>, in which case it is a\n  predeterminer (PDT).</p>\n</blockquote>\n\n<p>In simple phrase structure grammars based on English a singular common noun phrase, or a plural definite noun phrase, must consist at least of a determiner, and a head nominal, in that order. Formalised gramars of the sort found in Treebank define word classes on a language-specific basis, by distributional criteria (i.e., which words can substitute for other words in comparable structures). In typology (and also school grammar), word classes are based on meanings, so there will be some words which might belong to different categories depending on the approach.</p>\n", "Id":"2253", "ParentId":"2252", "CreationDate":"2012-07-15T02:45:15.133", "Score":"2", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2012-07-15T02:45:15.133", "CommentCount":"1"}