{"OwnerUser":{"UpVotes":"42", "Location":"KiTTYLand", "DownVotes":"0", "Id":"1185", "AccountId":"559628", "Views":"3", "Reputation":"456", "CreationDate":"2012-07-13T00:21:32.883", "DisplayName":"ROBOKiTTY", "LastAccessDate":"2014-01-05T16:26:27.617", "AboutMe":"<p>Primarily work in LOLCODE, Java, C#, and C++.</p>\n"}, "comments":[], "Body":"<p>This response is personal opinion, since I think it would be difficult to find scientific evidence that addresses the full spectrum of what this question entails, and anecdotal evidence is even worse, since no one knows enough languages to give a consistent answer. So all you're gonna get is opinions of languages people have learnt, and likely-misinformed beliefs about languages they think they know enough to comment on.</p>\n\n<p>Consider different ways of and motivations for second language learning. Some learn in a classroom setting. Some learn naturalistically in environments where the target language is spoken. A few among those cut off contact with their native languages altogether. People learn a second language because it's expected of them (e.g. school); for business/work; to communicate with specific people (e.g. missionaries); out of sheer necessity (e.g. immigrants); or just as a hobby. Then people have differing standards on what counts as functional competence. All these variables also differ from one target language to the next.</p>\n\n<p>With that extended disclaimer out of the way, here's my actual response to the question.</p>\n\n<p>I don't think genetic closeness is really an important consideration in and of itself. I would consider similar sound inventories, shared vocabulary, social/cultural predispositions, and typological likeness to be far greater factors.</p>\n\n<p>Broadly speaking, I think the average Mandarin speaker would have more trouble learning Tibetan than Vietnamese on those grounds, despite genetics. Tibetan phonemic makeup is maybe slightly closer than Vietnamese to Mandarin, but Tibetan phonotactics (e.g. complex onsets and cross-morphosyllabic phonological effects) would probably pose a greater challenge than Vietnamese's much friendlier syllable structure. Most Tibetan cognates of Chinese words are probably not immediately recognizable as such, outside of the obvious numerals and kinship terms, which Vietnamese partly shares with Chinese anyway from extensive borrowing. The deciding factor is probably Tibetan's inflectional morphology, with case endings and verb conjugations, in stark contrast to the isolating nature of Chinese/Vietnamese. Vietnamese, on the other hand, shares significant typological features with Chinese, including SVO word order (cf. Tibetan SOV) and noun classifiers/measure words (cf. Tibetan classifiers, which are never used for counting).</p>\n\n<p>As for social/cultural predispositions, China has historically had closer ties with Vietnam than with Tibet, so there is perhaps a tendency for the average Chinese speaker to view Vietnamese more favourably (there'll naturally be great regional/individual variation).</p>\n\n<p>Anecdotally, I've heard that Arabic, German, French, and Russian are considered very difficult for Chinese speakers. Many also say that they find Chinese the most difficult, which might refer to the writing system, the continuum between literary and vernacular Chinese, and/or the internal diversity of Sinitic 'dialects'.</p>\n", "Id":"2266", "ParentId":"2183", "CreationDate":"2012-07-17T17:26:36.930", "Score":"2", "PostTypeId":"2", "OwnerUserId":"1185", "LastActivityDate":"2012-07-17T17:26:36.930", "CommentCount":"1"}