{"Body":"<p>Just because some combinations are prohibited, that doesn't mean that there aren't a whole lot left. If some of the positions in the sequence of agglutinating suffixes is inhabited by an open class, you end up with an upwards unbounded number.</p>\n\n<p>I don't know about Arabic, but it seems to me that it's possible to have a very complex morphology, and still end up with a finite number, if the part you consider a \"form\" has no open-class morphemes.</p>\n\n<p>This question is all about how you define \"form\". Do you consider verb root + suffixes (all the way to the last suffix) a \"form\"?</p>\n\n<p>Are 食べ始める (tabe-hajimeru, start to eat), 食べ終える (tabe-oeru, finish eating), 食べ慣れる (tabe-nareru, get used to eating) etc. forms of 食べる (taberu, eat)?</p>\n\n<p>If yes, then the number is upwards unbounded, since the agglutinated verb is an open class (Not in the sense that anything goes, but in the sense that there's a continuous spectrum from verbs that commonly occur in second position and are completely productive, to verbs which sound marked in the second position and/or are unproductive and only work in some combinations).</p>\n\n<p>If no, you might argue that 食べ (tabe) is the form in play here (the 連用形 ren'yokei of the verb). But then, is 食べます (tabemasu, polite form of eat) a \"form\"? Polite form is always created by attaching ます(masu) to the ren'yokei.</p>\n\n<p>To me, it seems that the whole exercise of counting verb forms really doesn't seem to make much sense for agglutinating verbs, or at least Japanese. It might make more sense for languages like IE langauges, where</p>\n\n<ol>\n<li>the concept of a word (and thereby a \"verb form\") is usually easier to agree upon. (With some exceptions: In spanish, are <em>comerme</em> (eat me), <em>comerte</em> (eat you) etc. forms of the verb comer, or are they written as one word as an orthographic convention?)</li>\n<li>the endings that a verb can take are a closed class.</li>\n</ol>\n\n<p>So it really comes down to the question of why you want to know. Is it</p>\n\n<ol>\n<li>because you want to know how machines parse Japanese verbs? If so, I don't know and would be interested in answers.</li>\n<li>because you are looking to master all forms of the verbs? If so, you could use tools like <a href=\"http://www.japaneseverbconjugator.com/\" rel=\"nofollow\">this one</a>, but the list of included forms will always depend on the creator's subjective choice.</li>\n<li>something else?</li>\n</ol>\n", "Id":"2322", "ParentId":"2319", "LastEditorUserId":"51", "CreationDate":"2012-07-31T02:23:41.577", "OwnerUserId":"724", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-07-31T06:07:53.863", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2012-07-31T06:07:53.863", "Score":"2", "CommentCount":"13", "OwnerUser":{"UpVotes":"33", "DownVotes":"8", "Id":"724", "AccountId":"482018", "Views":"10", "Reputation":"709", "CreationDate":"2012-01-29T05:39:01.393", "DisplayName":"dainichi", "LastAccessDate":"2014-01-16T02:01:24.110"}}