{"Body":"<p>You know I read this question a bit ago, and later while I was browsing the book <a href=\"http://www.cambridge.org/gb/knowledge/isbn/item1136638/?site_locale=en_GB\" rel=\"nofollow\">The Languages of Japan (Shibatani,1990)</a> I literally happened upon the section (11.4) \"The syntax of agglutinative morphology\" (chapter 11 grammatical structure). I looked through it a bit and it seems to discuss specifically causative and passive morphology too. To blatantly plagiarize (I don't understand all of it):</p>\n\n<blockquote>Due to the lack of agreement between the head and the dependent constituent, Japanese is not as highly agglutinative as Turkish, especially in the domain of nominal constituents. However, in the realm of verbal constituents, Japanese shows a high degree of agglutination involving a fair number of suffixes in a row. As in many other languages, the order of these verbal affixes is generally fixed, though alternative orders are infrequently observed. In Japanese the following is the typical order:<br/><br/>\n(1)　Vstem-causitive-passive-aspect-desiderative-NEG-tense<br/><br/>\nAll the possibilities are not, of course, exploited in each expression, but the following illustrates some of the lengthy but commonly observed forms:<br/><br/>\n<ul>\n<li>行かせられない　'go'-CAUS-POTEN-NEG-PRES</li>\n<li>行かせられたくない　'go'-CAUS-PASS-DESI-NEG-PRES</li>\n<li>歩かせ続けたい　'walk'-CAUS-CONT-DESI-PRES</li>\n</ul>\n</blockquote>\n\n<p>You might want to check that book out then. I don't know how the morpheme あげく (example 迷ったあげく、彼の誘いをことわってしまった) fits into this form. Are words like this あげく just derivational morphemes, whereas you're talking about inflectional paradigms? Well if (1) completely captures the structure of inflection, then the answer to your question would be counting the permutations by filling in the possible words, right? But I think there is some real complication to computing this maximal set.</p>\n\n<p>Consider how you might actually count the forms though. Say that the total number of causative morphemes is C, the total number of passive morphemes is P, the total number of aspect morphemes is A, the total number of desiderative morphemes is D, and the total number of NEG morphemes is N, and the total number of tense morphemes is T. Then the theoretical upper bound is obviously C*P*A*D*N*T. But obviously not all permutations will be accepted as grammatical by native speakers (for whatever reasons), so we should remove those deemed ungrammatical. We would check the grammaticality of a particular permutation by just asking a native speaker if its grammatical. If it is then we increment the count of forms, if not then we just continue on to the next permutation. However, if some specific permutation is only accepted by some speakers and rejected by others, then its state of grammaticality is manifestly not yes or no, but rather some number 0 to 1 (the proportion of speakers that accepted it). In other words inclusion of a particular inflected form into the set of all grammatical permutations of an inflectional paradigm is fuzzy.</p>\n\n<p>In ignoring the fuzziness, we could include only those forms which are deemed grammatical by a sufficient number of people. In other words we have to define an arbitrary numerical threshold for which we segregate nongrammatical forms from grammatical forms, that numerical threshold being the proportion of a number of speakers.</p>\n\n<p>I have an idea on how one might compute a number that captures the idea of \"the maximal number of forms\". The set of C*P*A*D*N*T permutations might be slimmed by removing certain permutations on semantic/pragmatic grounds. But then you would need a theory of semantics, and it might only allow us to remove a marginal number of permutations from C*P*A*D*N*T. The point is, that at some point you are going to have to look at real-world data to get this computation done. To keep the computation simple we should aim to minimize theoretical overhead.</p>\n\n<p>There might be a way to do this with data. Fix some verb V for investigation. The data to be collected then consists merely of observed inflected instances of V. For every instance, it will fall into one of C*P*A*D*N*T categories. In other words, you are just counting how many instances of a particular permutation you observe in the data. For example, \"行かせられない\" forms one of the C*P*A*D*N*T categories. If you happen to hear this exact permutation spoken, say, 5 times throughout an observation session, then the category \"行かせられない\" gets a tally of 5. We indeed have a large number of categories,  C*P*A*D*N*T categories to be exact. Then counting the maximum number of forms amounts to counting the total number of categories that receive a significant number of tallies, dismissing categories that have very low tallies as ungrammatical outliers. So, for example, if every category is filled uniformly, the we can say that C*P*A*D*N*T is the maximal number of forms. On the other hand, if 99% of the instances fall into only 3 categories while the other 1% falls into some other 4th category, then we might have grounds for dismissing the fourth category and concluding that 3 is the total number of forms.</p>\n\n<p>To formalize the procedure, we have C*P*A*D*N*T categories, each category is associated with a tally, and the only thing we have to do is eliminate those categories that have low tally counts. Each time we eliminate a category we subtract 1 from the \"maximal number of forms\" count, which starts out at C*P*A*D*N*T. But now we are charged with the task of defining exactly the tally threshold for which we will dismiss a category.</p>\n\n<p>And we have just gone full circle. To avoid a \"numerical threshold of grammaticality\" we circumvented ourselves all the way into a \"significance of a tally\". And I think this is the inherit problem of your question. To answer it, an arbitrary decision that has no precedence or justification must be made. In fact, this probably the plague of any scientific endeavour, at some point of analysis a decision with no precedence or justification must be unquestionably made. hhhhmmm.... Well, anyways, in summary, I have no idea how many legitimate forms exist for a given verb.</p>\n", "Id":"2342", "ParentId":"2319", "LastEditorUserId":"51", "CreationDate":"2012-08-03T08:19:23.467", "OwnerUserId":"1162", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-08-03T14:39:40.900", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2012-08-03T14:39:40.900", "Score":"4", "OwnerUser":{"UpVotes":"23", "DownVotes":"0", "Id":"1162", "AccountId":"1586391", "Views":"2", "Reputation":"286", "CreationDate":"2012-07-04T22:46:56.807", "DisplayName":"taylor", "LastAccessDate":"2013-05-10T17:08:44.560"}}