{"OwnerUser":{"UpVotes":"26", "WebsiteUrl":"http://www.perl.com/", "Id":"707", "AccountId":"216196", "CreationDate":"2012-01-24T16:28:35.700", "AboutMe":"<p><a href=\"http://stackexchange.com/users/216196\">\n<img src=\"http://stackexchange.com/users/flair/216196.png\" width=\"208\" height=\"58\" alt=\"profile for tchrist on Stack Exchange, a network of free, community-driven Q&amp;A sites\" title=\"profile for tchrist on Stack Exchange, a network of free, community-driven Q&amp;A sites\">\n</a></p>\n\n<p>I’m Tom Christiansen, author of <em>Programming Perl</em> and <em>Perl Cookbook</em> from O’Reilly. I’m a freelance instructor giving courses in Perl programming, including Unicode and regular expressions. I’ve been using BSD Unix for 30 years now; like your maid, I don’t do Windows.</p>\n\n<p>I’ve undergraduate degrees in Spanish and in Computer Science, and a graduate degree in compsci focusing on operating systems design and in natural language processing. I’ve studied Spanish, French, Italian, Portuguese, Latin, and German, with a smattering of other languages thrown in. For the last few years I’ve been dabbling in computational linguistics.</p>\n", "Age":"51", "Location":"Boulder, CO", "DownVotes":"1", "Views":"5", "Reputation":"206", "DisplayName":"tchrist", "LastAccessDate":"2013-12-24T16:58:31.240"}, "comments":[], "Body":"<p>Just as in French, in Italian a <strong><em>preceding</em></strong> direct object will cause the normally uninflected participle that goes with <em>avere</em> to agree with that already-seen object. This doesn’t happen in Spanish or Portuguese.</p>\n\n<ul>\n<li>Ho comprato i pantaloni. </li>\n<li>Li ho comprati.</li>\n</ul>\n\n<p>So the participle is thought to concord to the object with <em>avere</em>, but not with <em>essere</em>, where it  concords with the subject.  And the concordance only applies when the object is seen before the participle.</p>\n\n<p>To go further, you’ll have to look at how the perfect tenses came to be formed in Romance, synthesized using auxiliary verbs. </p>\n", "Id":"2352", "ParentId":"2136", "CreationDate":"2012-08-04T23:09:07.893", "Score":"1", "PostTypeId":"2", "OwnerUserId":"707", "LastActivityDate":"2012-08-04T23:09:07.893", "CommentCount":"5"}