{"Body":"<p>I suspect you're coming in from a false assumption. Accents are a combination of many factors, the most notable being vowel pronunciation but also including stress patterns, intonation, etc. However, in common usage \"accent\" also means dialect or vernacular which would include slang and colloquialisms, tag questions (as a Canadian, Americans often tell me that they love how my \"accent\" means I say \"eh?\" a lot), etc.</p>\n\n<p>Pretty much all of those disappear when singing. They're overwritten by the melody and time signature of the music. Slang and colloquialisms are less prevalent in music (especially pop music which sells to an international audience). As for vowel pronunciation, it's not uncommon to mangle pronunciation in service of the rhyming scheme.</p>\n\n<p>So what I am saying is that one could argue that when singing people have neutral accent allowing listeners to fill in the blanks with the accent they are most familiar with (their own).</p>\n\n<p>For an example of this, listen to pretty much any song by Adele (who is from Britain). Personally, while she's singing I'd agree that she sounds \"American\" (actually, I'm not American so I wouldn't say that. I'd actually say \"she sounds like me\") but if you actually listen, her vowels are very British.</p>\n\n<p>I found a <a href=\"http://www.lexiophiles.com/english/on-singing-accents\" rel=\"nofollow\">source</a> to back up my reasoning but it's hardly a peer reviewed academic paper.</p>\n\n<p>----EDIT----<br>\nAlso, as @Cerebus suggested, there is a certain amount of imitation of American accents to appeal to American audiences but I don't believe that's the whole story.</p>\n\n<p>----EDIT 2----<br>\nIt also strikes me that the mechanical act of singing is different from normal speaking. Specifically, trained singers focus on higher-than-normal volume, projection, and range. These all require precise control of the vocal tract which would also help mask the singer's accent.</p>\n\n<p>----EDIT 3----<br>\nEven though this question has been inactive for quite some time, a friend recently sent me <a href=\"http://umanoapp.com/clip/512c3dfebf334575c9eab8bb\" rel=\"nofollow\">this radio program</a> which addresses this issue. While it's light on new information, it is worth a listen for anyone stumbling across this question through a search engine, etc.</p>\n", "Id":"2407", "ParentId":"2405", "LastEditorUserId":"1055", "CreationDate":"2012-08-10T02:12:25.857", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-02-27T11:36:52.203", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2013-02-27T11:36:52.203", "Score":"6", "CommentCount":"3", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}