{"Body":"<p>The only theory I know is that prepositions were originally adverbial in nature, and unbound. My professor of historical grammar of Greek suggested this. The idea is that it went something like this:</p>\n\n<blockquote>\n  <p>There was the house. Mother was already <strong>in</strong>. (Adverbial 'prepositions' aren't even always bound in English.)</p>\n  \n  <p>Father came <strong>in</strong> through the front door.</p>\n  \n  <p>Mother noticed the <strong>incoming</strong> noise, and now they are both <strong>in</strong> the hall.</p>\n</blockquote>\n\n<p>The boundaries between regular adverb, adverb linked to a verb, particle, verbal prefix, and preposition are still fairly fluid in English. A few other suggestive features:</p>\n\n<p>In many languages, there exist separable verbs, where the prefix is sometimes severed from the verb and relocated to a different position, without change in meaning. This occurs in Dutch, German, and Ancient Greek, for example.</p>\n\n<blockquote>\n  <p>Er soll <strong>aufstehen</strong>. — \"He should stand up.\"</p>\n  \n  <p>Steh <strong>auf</strong>! — \"Stand up!\"</p>\n</blockquote>\n\n<p>In Ancient Greek, it is also possible to start a sentence with an adverbial preposition:</p>\n\n<blockquote>\n  <p><strong>meta</strong> ton polemon — \"after the war\" (regular preposition governing the accusative).</p>\n  \n  <p><strong>Meta</strong> d' ho basileus eis oikon apêlthen. — \"Afterwards, the kind went home.\" (Adverb used to introduce sentence.)</p>\n</blockquote>\n\n<p>All this suggests that words like \"in\" and \"after\" once were (and still are, to a considerable degree) very flexible words. Their behaviour is still far more diverse than just as prepositions. Another interesting thing is prepositions that can take two (or more) different cases:</p>\n\n<blockquote>\n  <p>In <strong>horto</strong> ambulat. — \"He walks in the garden.\" (garden is ablative)</p>\n  \n  <p>In <strong>hortum</strong> vadit. — \"He goes into the garden.\" (accusative)</p>\n  \n  <p>Ich bin in <strong>der</strong> Kirche. — \"I am in the church.\" (dative)</p>\n  \n  <p>Ich gehe in <strong>die</strong> Kirche. — \"I go into the church.\" (accusative)</p>\n</blockquote>\n\n<p>Whenever the preposition <em>in</em> indicates a static being-in-a-place, it goes with the ablative (Latin) and dative (German), which are also the cases normally used for statically being in a place (as partially replacing the older locative inherited from Proto-Indo-European); that is, in Latin, you could under certain circumstances use the bare ablative without <em>in</em> to express the same. This also applies to the accusative, which is the normal case for a moving-towards, where English would stick <em>-to</em> on the preposition.</p>\n\n<p>This suggests that the cases that are now commonly seen as determined by prepositions were probably <em>already there</em> when prepositions developed: it was perhaps once <em>horto ambulat in</em>, or something, where the ablative already suggested that one was walking within, not into the garden, and the preposition confirmed that, so to speak (the ablative can also be used to express \"out of\" without a preposition, and it is also the only possible case to be used with <em>ex</em>, \"out\").</p>\n\n<p>If my English were poor and I said <em>he came building out</em>, you would immediately understand that I meant that he was coming out of a building; this shows that a preposition doesn't depend on its position in front of its noun as much as one might think.</p>\n", "Id":"2507", "ParentId":"2504", "LastEditorUserId":"82", "CreationDate":"2012-09-01T14:25:41.637", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-09-03T01:03:20.593", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2012-09-03T01:03:20.593", "Score":"5", "CommentCount":"2", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}