{"OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://twitter.com/jamess362", "Id":"1339", "AccountId":"1857805", "CreationDate":"2012-09-19T13:35:54.527", "AboutMe":"<p>Linguist with a love of all things tech.</p>\n", "Age":"22", "Location":"Sydney, Australia", "DownVotes":"0", "Views":"1", "Reputation":"69", "DisplayName":"jimsug", "LastAccessDate":"2013-08-23T09:51:34.193"}, "comments":[], "Body":"<p>You make a number of assertions that appear to be unfounded/misguided:</p>\n\n<ul>\n<li>The only possible alternative to an Ergative SOV language is OSV.\n<ul>\n<li>This is a highly unlikely assertion considering that OSV, OVS, and VOS languages together are attested in &lt;5% of the world's languages.</li>\n<li>Also, the idea that Ergative/Nominative distinctions would be tied to constituent order is at the very least, confusing.</li>\n</ul></li>\n</ul>\n\n<p>So what you've asserted about the language is that:</p>\n\n<ol>\n<li>The verb is marked using prefixes (head-marking), and;</li>\n<li>These prefixes convey the role of the arguments to be Ergative/Absolutive.</li>\n<li>The clause constituent order would be either SOV or OSV.</li>\n<li>The affixes are reductions of grammatical pronouns which were, at some point in the past, realised by full lexical items.</li>\n</ol>\n\n<p>From this, I would draw the conclusions:</p>\n\n<ul>\n<li>The verb is so marked because the Subject argument is always obligatory (or a pro-drop, which you have not specified), whereas the Object argument is not always present, as in the case of single-argument predicates.</li>\n<li>If word order was important, then in this case, the fact that the verb is final would mean that the arguments of the verb would appear to its left. This means that the Subject would be said after the Object, resulting in the o-s-V construction.</li>\n<li>As for the language now becomeing SOV, I have no explanation (as well as very little familiarity with the language itself). However, I will say that the \"unmarked\" order in the world's languages (where word order is significant) appears to be one where the Subject precedes the Object: English (SVO), French (SOV), Irish (VSO).\n<ul>\n<li>This is probably, again, for pragmatic reasons; the Subject is the most <em>salient</em> argument in the predicate, it needs to be expressed, whereas the Object, and sometimes even the process, can be inferred from context.</li>\n</ul></li>\n</ul>\n", "Id":"2578", "ParentId":"366", "CreationDate":"2012-09-19T14:10:38.897", "Score":"1", "PostTypeId":"2", "OwnerUserId":"1339", "LastActivityDate":"2012-09-19T14:10:38.897", "CommentCount":"2"}