{"OwnerUser":{"UpVotes":"42", "Location":"KiTTYLand", "DownVotes":"0", "Id":"1185", "AccountId":"559628", "Views":"3", "Reputation":"456", "CreationDate":"2012-07-13T00:21:32.883", "DisplayName":"ROBOKiTTY", "LastAccessDate":"2014-01-05T16:26:27.617", "AboutMe":"<p>Primarily work in LOLCODE, Java, C#, and C++.</p>\n"}, "comments":[], "Body":"<p>The traditional categorization of conjugations in French is pretty messy, since it's modelled on the Latin paradigm but with many exceptions. The third conjugation is really a catch-all category for the messy verbs that evolved in distinct ways. Outside of those uniquely irregular verbs, there are groups of verbs you can discern patterns for, though.</p>\n\n<blockquote>\n  <p>-dre (except -indre, -oudre) > -du</p>\n</blockquote>\n\n<p>(This applies for battre too, although it otherwise conjugates more like mettre.)</p>\n\n<blockquote>\n  <p>battre -> battu</p>\n  \n  <p>-indre > -int</p>\n  \n  <p>-uire > ui(t)</p>\n  \n  <p>tenir/venir > tenu/venu</p>\n</blockquote>\n\n<p>Historical sound change from Vulgar Latin coupled with Celtic/Germanic influence made French stand out from other Romance languages. Factor in also paradigm levelling, often applied inconsistently. Stress was an important factor, culminating in a stress accent system that eventually disappeared. The various vowels are however a remnant of that.</p>\n\n<p>Many of the present alternations, which may seem more like exceptions, could be seen as remnants of much more extensive system of alternations in the past that evolved from conditioned sound changes. For example, all the -indre verbs in French are reflexes of or modelled on Latin Vngere (joindre &lt; iungere), whereas prendre/rendre were from prehendere/*rendere respectively.</p>\n\n<p>There have also been extensive dialectal differences in French, leading sometimes to lexical items being borrowed in fossilized form, occasionally levelled out by analogical change. Cf. oi ~ ai (François vs. français), VllV vs. VlVV (faillir vs. falloir).</p>\n", "Id":"2600", "ParentId":"2594", "CreationDate":"2012-09-22T20:15:13.373", "Score":"4", "PostTypeId":"2", "OwnerUserId":"1185", "LastActivityDate":"2012-09-22T20:15:13.373", "CommentCount":"6"}