{"OwnerDisplayName":"phoenixheart6", "Body":"<p>As far as I can surmise, written and spoken are not quite two distinct languages. A written language and a spoken language are, in general, two different media of communication. What keeps them from being distinct, however, is that a written language is a representation of a spoken languages. Each word in a written language corresponds to a word in a spoken language.</p>\n\n<p>The first paragraph of the <a href=\"http://en.wikipedia.org/wiki/Written_language\" rel=\"nofollow\">wiki article</a> on written language states this in detail:</p>\n\n<blockquote>\n  <p>A written language is the representation of a language by means of a writing system. Written language is an invention in that it must be taught to children; children will pick up spoken language (oral or sign) by exposure without being specifically taught.</p>\n  \n  <p>A written language exists only as a complement to a specific spoken language, and no natural language is purely written. However, extinct languages may be in effect purely written when only their writings survive.</p>\n</blockquote>\n\n<p>So in effect, a written and a spoken language are two separate representations of the same language. In theory a human language can exist with only one or the other--the Iroquois languages are among the most famous languages which historically have no written form. But because of the one-to-one correlation of words, they are best thought of as a pair, in effect constituent to what we call a single language.</p>\n\n<hr>\n\n<p>Sign language, on the other hand, does not have a one-to-one correlation to any spoken language. Moreover, American and British Sign Languages are two entirely different languages, even though they are both spoken in English speaking countries. A sign language is neither a written nor an orally spoken language. Each one is a language of its own.</p>\n", "Id":"2617", "ParentId":"2615", "CreationDate":"2012-09-24T21:22:16.763", "Score":"4", "PostTypeId":"2", "LastActivityDate":"2012-09-24T21:22:16.763", "comments":[]}