{"Body":"<p>The alphabet has only been invented a few times, so this is easier to describe than you'd think.</p>\n\n<p>The first lineage of alphabets is the <strong>Phoenician</strong> lineage, which includes the modern Latin, Greek, Cyrillic, Hebrew, and Arabic alphabets, as well as a number of less prominent scripts both living and dead. While I haven't checked every one of these scripts, the Phoenicians themselves named their letters, and the tradition of naming letters was passed down to every derived script that I know of. Some of them kept or adapted the Phoenician names (Hebrew, Greek, Arabic), while others created a simplified naming scheme of their own (Latin, Cyrillic), but they all have names.</p>\n\n<p>The second major lineage of alphabets is the <strong>Brahmic</strong> lineage, which includes Devanagari as its most prominent member, but includes all of the myriad scripts of India and Southeast Asia in its family tree. Here, too, the original script had named letters, and the tradition of named letters seems to have been kept in all of the daughter scripts.</p>\n\n<p>That covers all of the unambiguous alphabets in the world. There is a third, somewhat contentious example, however.</p>\n\n<p>Korean hangul are usually presented as a syllabary, but unlike most syllabaries every hangul syllabic glyph can be fully decomposed into a set of strokes that consistently and predictably represent individual segments in the syllable, with well-defined rules for placement. Therefore hangul arguably represents an <em>alphabet</em> with an unusual, syllabic arrangement system, in contrast with the simple linear arrangement used in the other major alphabets. And to the best of my knowledge the individual strokes that make up a hangul glyph do not have names--or if they do, their names are somewhat specialized terms that aren't commonly used by people describing how to spell something. This is as close as I think you're going to get to an alphabet without names for its letters.</p>\n\n<p><strong>Update</strong>: <a href=\"http://en.wikipedia.org/wiki/Hangul#Letter_names\">Hangul does have names for its letters,</a> as pointed out in the comments.</p>\n", "Id":"262", "ParentId":"246", "LastEditorUserId":"91", "CreationDate":"2011-09-18T00:52:12.927", "OwnerUserId":"91", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-18T10:46:51.087", "LastEditedUser":{"UpVotes":"132", "WebsiteUrl":"http://jsbangs.com", "Id":"91", "AccountId":"5121", "CreationDate":"2011-09-14T01:49:40.413", "AboutMe":"<p>I have a degree in Linguistics, but I work as a programmer. Most of my expertise about English is self-taught, plus lots of random trivia I've acquired here and there.</p>\n\n<p>This is my favorite EL&amp;U comment ever:</p>\n\n<blockquote>\n  <p>This isn't really a question about English so much as a question about hugs. <a href=\"http://english.stackexchange.com/questions/33121/whats-the-meaning-of-large-hug-in-definition-of-bearhug\">Source</a></p>\n</blockquote>\n", "Age":"32", "Location":"United States", "DownVotes":"16", "Views":"34", "Reputation":"1443", "DisplayName":"JSBձոգչ", "LastAccessDate":"2014-01-18T20:22:40.170"}, "LastActivityDate":"2011-09-18T10:46:51.087", "Score":"10", "CommentCount":"5", "OwnerUser":{"UpVotes":"132", "WebsiteUrl":"http://jsbangs.com", "Id":"91", "AccountId":"5121", "CreationDate":"2011-09-14T01:49:40.413", "AboutMe":"<p>I have a degree in Linguistics, but I work as a programmer. Most of my expertise about English is self-taught, plus lots of random trivia I've acquired here and there.</p>\n\n<p>This is my favorite EL&amp;U comment ever:</p>\n\n<blockquote>\n  <p>This isn't really a question about English so much as a question about hugs. <a href=\"http://english.stackexchange.com/questions/33121/whats-the-meaning-of-large-hug-in-definition-of-bearhug\">Source</a></p>\n</blockquote>\n", "Age":"32", "Location":"United States", "DownVotes":"16", "Views":"34", "Reputation":"1443", "DisplayName":"JSBձոգչ", "LastAccessDate":"2014-01-18T20:22:40.170"}}