{"OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "comments":[], "Body":"<p>I was going to continue the thread of my comment under the original question, but I figured I might as well turn it into an answer and not have to deal with the word limit!</p>\n\n<p>There are so-called \"rule-based\" speech synthesis systems out there that can yield output with any kind of desired F0, but it sounds like what you are really looking for is a commercial text-to-speech program that takes text as input and allows you to control the pitch of the output. The important distinction here is that in order to use the former you need to know how to do speech synthesis from \"scratch\" and manipulate all of the relevant parameters, which I'm assuming is not the case for you! As for the latter, I'm not aware of any such systems that are commercially available at this time.</p>\n\n<p>So, an alternative solution is to use the Praat Manipulation features. Here are a couple of tips to minimize distortion in the manipulated tokens:</p>\n\n<ul>\n<li>You'll want to avoid manipulating the F0 of segments that contain\nvoiced frication noise, like [z] and [v]. The problem with such\nsegments is that they contain voicing with an audible pitch that\nyou'd want to manipulate, but the manipulation doesn't work so well\nwhen there is frication noise mixed in and you get some weird\ndistortions as a result. I'm not sure if you have control over the\nsegmental makeup of the stimuli you are creating, but if you do it's\nbest to construct utterances that don't contain such segments.</li>\n<li>If possible, you should avoid manipulating speech that has extreme F0 excursions (i.e. a very wide pitch range) to begin with, as the more you \"stretch\" the pitch of speech, the less natural it will sound.</li>\n<li>You'll want the input recordings (if they are indeed recordings) to be as clean as possible, with minimal external noise.</li>\n</ul>\n\n<p>I hope this does the trick! If you have problems with unwanted distortions or noise, let me know some specifics (like what kind of noise and the context in which it is occurring) and I'll try to recommend ways of avoiding it or getting rid of it after-the-fact).</p>\n", "Id":"2631", "ParentId":"2627", "CreationDate":"2012-09-28T13:44:34.820", "Score":"3", "PostTypeId":"2", "OwnerUserId":"385", "LastActivityDate":"2012-09-28T13:44:34.820", "CommentCount":"2"}