{"comments":[], "Body":"<p>It's useful to think of phonology as more than just the individual sounds that are distinctive in a given language, and instead as the 'grammar' of those sounds. A phonological description should not just be 'here are the vowels and consonants I found forming contrasts in language X' - it should also tell you about the rules that govern these sounds, such as what sorts of combinations of sounds are possible (phonotactics), what the stress patterns are and/or what the patterns of tonal marking are, relevant prosodic characteristics (e.g. in many languages a question is marked by higher pitch utterance-finally), and of course, the allophonic variation that is permitted for each phoneme, and in what sorts of environments certain allophones occur. \nPhonetics, on the other hand, studies the acoustic and articulatory substance of speech data, and the techniques used by phoneticians offer a great deal of detail about the sounds of a language. This helps phonologists to back up their claims about different types of sounds (or maybe demonstrates that someone's impressionistic observations are not supported by the actual phonetic data, as is sometimes the case). Phonetic analysis also helps to explain why certain phonological patterns occur, because it is possible to analyse how and to what extent different sounds affect each other, and these phonetic effects are important factors in allophonic variation and language change.\nThe two are not mutually exclusive and there are many linguists who work in both phonetics and phonology, because these two sub-fields are, of course, closely related, but also dependent on each other.</p>\n", "Id":"265", "ParentId":"180", "CreationDate":"2011-09-18T06:38:35.770", "Score":"2", "PostTypeId":"2", "OwnerUserId":"153", "LastActivityDate":"2011-09-18T06:38:35.770", "OwnerUser":{"UpVotes":"47", "WebsiteUrl":"", "DownVotes":"1", "Id":"153", "AccountId":"871764", "Views":"33", "Reputation":"1445", "CreationDate":"2011-09-18T03:14:58.320", "DisplayName":"Floating Tone", "LastAccessDate":"2012-05-27T05:07:04.410", "AboutMe":"<p>I'm a PhD candidate in linguistics, with diverse interests including phonetics, phonology, morphology, language documentation, historical linguistics and sociolinguistics. I am particularly interested in the languages of Africa, Papua New Guinea and Australia. I'm also very interested in methods of making linguistic knowledge and materials more accessible and available to linguists and non-linguists alike.</p>\n"}}