{"OwnerDisplayName":"Cerberus", "Body":"<p>Creating a language is like writing a novel or creating a sculpture: it can be a fun exercise, and an object of art for people to admire. If you happen to not be into a certain genre, you will probably not be interested in studying it.</p>\n\n<p>I think the same thing applies to constructed languages. I personally do not find them very interesting, with some exceptions, such as Tolkien's languages—but even those I do not find interesting enough to study: I'm just glad they're there, because they make his books and stories all the more immersive and \"realistic\". (Many other constructed languages, on the other hand, I find crude or unimpressive for various reasons.)</p>\n\n<p>If certain works of art have some sort of physical, historical, or social significance, then that can be another reason to study them. But it can feel like a waste of time if they haven't. I don't like studying a language that I feel I can't learn anything from, as in nothing relevant for how real languages work. This is probably why studying them is normally not a significant part of academic curricula.</p>\n", "Id":"2671", "ParentId":"2670", "LastEditorUserId":"82", "CreationDate":"2012-10-08T00:08:30.153", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-10-13T21:55:32.750", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2012-10-13T21:55:32.750", "Score":"3", "CommentCount":"1", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}