{"comments":[], "Body":"<p>The choice in transcription will often depend on the analyst, and there may be cases where there is no clear evidence from the language to suggest why one convention is superior.</p>\n\n<p>Although tone is usually thought to be associated with syllables or morae rather than with individual segments, within a tonal domain such as a syllable or mora, the most sonorous segment is usually designated as being tone-bearing.</p>\n\n<p>If there was a hypothetical word /fws/ in a tonal language and that word was associated with a lexical tone, then the /w/, being the most sonorous segment, would be the one to get associated with a tone. However, there are some phonologists who would argue that because the segment in question bears a tone, it must be /u/ and not /w/. This means that, in order for the analysis to be uncontroversial, there should also be a word /fus/ associated with a tone which contrasts with /fws/. These kinds of biases have to be kept in mind when an analysis is developed. The main issue is the contentious nature of the <a href=\"http://en.wikipedia.org/wiki/Sonority_hierarchy\">sonority hierarchy</a> itself. There is no agreement about how the hierarchy should be defined, and so there is often a confusion between data which substantiates the hierarchy itself, and data for which the hierarchy should be invoked in interpreting.</p>\n\n<p>A simpler type type of case which is well-enough attested is for a syllabic non-vocoid, such as a nasal stop or a lateral consonant, to bear contrastive tone. In such a case, since there is only one identifiable segment in the syllable, that segment will be the one to bear the tone, even though it is not a vowel.</p>\n", "Id":"2734", "ParentId":"2732", "CreationDate":"2012-10-21T19:20:22.050", "Score":"7", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2012-10-21T19:20:22.050", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}