{"OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "comments":[], "Body":"<p>The answer has an air of reasonableness, but the only problem is that it is not exactly clear what it means for the phonatory organs to be \"loose.\" I think, however, a reasonable construal is that it is more difficult to achieve precision in vocalic gestures than in consonantal gestures. There are a couple of reasons why this might be a reasonable explanation: first, the main articulator responsible for vowel sounds, the tongue body, moves more slowly than does the tongue tip, which is more associated with consonant sounds. Second, proprioception is not as good a guide for vowel sounds as it is for consonant sounds; stop and obstruent articulations provide tactile (from direct contact or pressure-sensing) feedback which is not present in vowel articulations. </p>\n\n<p>Another perspective which I think may be just as valid is the auditory/acoustic perspective. According to this perspective, the issue is not that there is a difficulty in controlling gestures, but that there is a difficulty in hearing the difference between similar-sounding vowels. In other words, we are able to reproduce vowel gestures which are very faithful to an acoustic image, but it is the acoustic image which is difficult to recall with accuracy.</p>\n\n<p>An excellent discussion on these two competing explanations can be found in<br> LINDBLOM, B.- ENGSTRAND, O. (1989) \"In what sense speech is quantal?\", Journal of Phonetics 17: 107-121. (see also other contributions to that issue)</p>\n\n<p>A third possibility, which I don't think can be ruled out right away, is the sociolinguistic explanation. It might be that both auditory and articulatory precision are within our control, but that vowel sounds carry sociolinguistic information which needs to be adjusted depending on social forces (e.g., a cognate vowel in two dialects might diverge as the two groups try to emphasize their linguistic distinctness). </p>\n\n<p>See work by William Labov for this tradition of research.</p>\n", "Id":"2799", "ParentId":"2798", "CreationDate":"2012-11-05T13:27:56.510", "Score":"6", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2012-11-05T13:27:56.510", "CommentCount":"2"}