{"comments":[], "Body":"<p>Your question is very interesting and challenging.</p>\n\n<p>I dare to say that <strong>vowels are not more prone to change, generally</strong>.<br>\nAlthough it is the case in Germanic languages, this is not true in general.</p>\n\n<h1>What triggers languages to change</h1>\n\n<p><a href=\"http://en.wikipedia.org/wiki/August_Schleicher\" rel=\"nofollow\">Schleicher</a> is usually considered the first linguist who suggested that languages evolve in a similar manner to biological processes.<br>\nTherefore, it would be accurate to assume that language changes are similar to <strong>biological mutations</strong>.<br>\nAs all mutations, these changes are <strong>random</strong> by their nature. Randomness imply that there is no natural preference over vowels or consonants.</p>\n\n<h1>Why vowels, not consonants</h1>\n\n<p>English, likewise many other Germanic languages, have a very developed vowel set. Look at these maps. <strong>Note</strong>: only monophthongs are listed, no tones, no vowel length.</p>\n\n<p><strong>English</strong> (16 key points)</p>\n\n<p><img src=\"http://i.stack.imgur.com/D5GXm.png\" alt=\"English\"></p>\n\n<p><strong>Thai</strong> (9 key points); </p>\n\n<p><img src=\"http://i.stack.imgur.com/plgOG.png\" alt=\"Thai\"></p>\n\n<p><strong>Farsi</strong> (6 key points)<br>\n<img src=\"http://i.stack.imgur.com/2nz4k.png\" alt=\"Farsi\"></p>\n\n<p><strong>Arabic</strong> (3 key points)<br>\n<img src=\"http://i.stack.imgur.com/PT10n.png\" alt=\"Arabic\"></p>\n\n<p><strong>The more places for possible \"mutation\", the more likely a mutation will occur.</strong></p>\n\n<h1>Why changes can be massive</h1>\n\n<p><a href=\"http://dialectblog.com/2011/07/22/why-vowel-shifts/\" rel=\"nofollow\">This article</a> has an interesting insight:</p>\n\n<blockquote>\n  <p>To use a silly metaphor, imagine that Spanish is a train car with only five riders, while English is a car packed with thirteen people. The five people in the “Spanish” car are likely to remain put for the entire journey (there’s so much room!) The thirteen people in the “English” car, however, tend to jostle around, move to less crowded parts of the train, make room for people as the enter, etc. Simply put, they’re more likely to shift.</p>\n  \n  <p>But how do particular vowel shifts begin in the first place? What gets the ball rolling?</p>\n  \n  <p>There are two ways a vowel shift can be described. The first is as a <strong>“pull chain.”</strong> Extending the above metaphor, imagine that a passenger on our crowded car train notices an open space a few feet down, so he moves. A second rider moves into the empty space that the first passenger left behind, then another person moves into passenger #3′s space. And so on and so forth.</p>\n  \n  <p>A <strong>“push chain,”</strong> on the other hand, means the opposite: turning again to our “train,” this means an obnoxious train rider pushes another rider out of the way, that rider stumbles and pushes a third person out of the way as well. In real terms, this means that “pot” moves toward the vowel in “pat,” pushing it toward the vowel in “pet.”</p>\n</blockquote>\n\n<h1>Counter-examples</h1>\n\n<p>Moreover, there are many evidences when consonants evolved to a larger extent than vowels. Sanskrit had rather a poor vowels set (<code>[a/i/e/o]</code> plus phonated <code>[r/l/m]</code>), but it has developed a huge <a href=\"http://www.user.uni-hannover.de/nhtcapri/sanskrit-alphabet.html\" rel=\"nofollow\">consonants list</a>, including such exotic ones like ব্ধ্ব <code>[bdhva]</code> or ন্ধ্ব <code>[ndhva]</code>. No surprise that modern languages evolved from Sanskrit (e.g., Thai, Lao, Hindi) dramatically simplified the consonants, while the vowels actually retained.</p>\n\n<p>So, the answer is:</p>\n\n<ul>\n<li>Language change processes are similar to biological mutations;</li>\n<li>The more \"placeholders\" for mutation, the more likely a mutation will occur;</li>\n<li>Germanic languages often have large vowel sets, so the changes in vowels are more likely to happen;</li>\n<li>Many languages have dramatically changed their consonants contrary to their vowel sets that remained more or less intact for hundreds of years;</li>\n</ul>\n", "Id":"2804", "ParentId":"2798", "CreationDate":"2012-11-06T20:13:04.800", "Score":"2", "PostTypeId":"2", "OwnerUserId":"1009", "LastActivityDate":"2012-11-06T20:13:04.800", "OwnerUser":{"UpVotes":"512", "WebsiteUrl":"http://weew-waaw.com", "Id":"1009", "AccountId":"947951", "CreationDate":"2012-05-15T02:50:16.013", "AboutMe":"<p><img src=\"http://i.stack.imgur.com/VxMqM.jpg\" alt=\"Weew-Waaw, Thai to English, Thai to Russian transcription\"><br>\nI'm working on a project of rule-based Thai transcription: (the link is temporarily unavailable)<br>\nTechnically, it is written in F# with a C# front-end.<br>\nI would be happy to get acquainted with those who are experienced with NLP (Natural Language Processing), just ping me in the SE chat. :-)</p>\n", "Age":"42", "Location":"Bangkok, Thailand", "DownVotes":"50", "Views":"36", "Reputation":"1656", "DisplayName":"bytebuster", "LastAccessDate":"2014-01-19T00:53:20.473"}}