{"comments":[], "Body":"<p>The IPA is useful for what it is: an alphabetic writing system biased towards \"major European languages\" for performing certain analyses/comparisons/descriptions based essentially on the typographical requirements and linguistic models and theory of 100 years ago. As such:</p>\n\n<ul>\n<li>it allows you to analyse and denote <em>certain</em> phonetic/phonological phenomena that it is often useful to examine, e.g. cross-linguistic categorisation of sounds, comparison of broad features of the sound inventories of languages, description of broad/high-level pronunciation phenomena for the purpose of language description and teaching...;</li>\n<li>it operates more or less as any \"alphabet with diacritics\" will operate, so you may as well use the alphabet + diacritics that are familiar to many people rather than inventing a new one with essentially similar problems (though there are other similar phonetic transcription systems: the \"US\" transcription scheme is systemically similar to IPA, but not actually identical in the specifics of which symbols are used where);</li>\n<li>it's become \"common currency\" in dictionaries and teaching materials in some countries for some languages;</li>\n<li>it is \"common currency\" for denoting pronunciations in various linguistic journals and in linguistic publications in some countries;</li>\n<li>it is a <em>tool</em> to be adapted to specific languages/purposes and extended where necessary-- much of its effectiveness lies in how effectively the linguist is able to apply it to their needs;</li>\n<li>using IPA with modern typography tools (read: \"typing IPA on a computer keyboard\") is a complete pain in the arse most of the time.</li>\n</ul>\n\n<p>So, it's useful, but not the be-all and end-all of the universe:</p>\n\n<ul>\n<li>many speech technology applications that require transcriptions don't actually use IPA, but rather some other scheme that is easy to type and more closely adapted to the particular language/analysis needs in question;</li>\n<li>many phonetic and phonological studies nowadays aren't quite so preoccupied with the \"armchair segmental analysis\" for which IPA is most useful.</li>\n</ul>\n\n<p>So, if IPA isn't useful for what you're doing, nobody's saying you can't use or invent something else that is. On the other hand, if you are in the business of performing the kind of descriptions/analysis that phonetic transcription is useful for and it is for general readership rather than an internal database of an IT application, you may as well use IPA as not: it <em>is</em> still \"common currency\".</p>\n", "Id":"2845", "ParentId":"2841", "CreationDate":"2012-11-14T19:18:44.190", "Score":"6", "PostTypeId":"2", "OwnerUserId":"1047", "LastActivityDate":"2012-11-14T19:18:44.190", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://www.javamex.com/", "DownVotes":"0", "Id":"1047", "AccountId":"20470", "Views":"0", "Reputation":"326", "CreationDate":"2012-05-25T18:11:25.580", "DisplayName":"Neil Coffey", "LastAccessDate":"2013-11-29T21:16:26.503", "AboutMe":"<p>I am a language and IT specialist. My current activities include:</p>\n\n<ul>\n<li>development of various web sites, including the compilation and back-end development of language dictionaries and learning materials (incorporate Java Servlets and MySQL);</li>\n<li>software development, including various titles published for iOS;</li>\n<li>language translation, with a focus on specialist IT translation between French, Spanish and English;</li>\n<li>web articles devoted to Java programming with a focus on performance.</li>\n</ul>\n\n<p>Please message me privately for information about potential collaboration.</p>\n"}}