{"Body":"<p>I would really give not an answer but somewhat refusal for the question (despite the question is really good). Currently, the common position is to expand so-called \"principle of the arbitrariness of the sign\" also to language changes, i.e. you could guess which changes are impossible (for rude example, it's unlikely for any IE language to unify <em>all</em> vowels to a single one), but when you have multiple possible choices which doesn't break language structure at any level, you can't predict which one will happen. For the change you mean, if it had took place at all, it 1) moved sounds to neighbour ones, 2) didn't break phonologic relations between related sounds (d[h] - t[h] - t), and this is enough to allow it in theory.</p>\n\n<p>If you become able to explain in most cases <em>why</em> an allowed change happens, this would be the second main discovery through the diachronic linguistic history. (The first one was simply the fact that languages can originate from a common source.) Currently, linguistics has found multiple examples for special cases, as substrate/superstrate/neighbour language affecting, but not a common rule. You can compare this with evolution theory: there are prohibited mutations which give an unviable being, so they can't happen, and are allowed mutations, which can't be predict due to really stochastic source.</p>\n\n<p>The best rule for this I've seen currently is from the typology which counts probability of some change. For example, change /t/ -> /θ/ is known from numerous languages (the closest examples are modern Greek and Castilian, but for /d/ -> /ð/), so it's very likely. Also, pressure of need to distinguish /t/ and /tʰ/ could move any of them to another sound, to make the distinction more expressed (and hence easier to detect). This could be the \"narrow\" answer to your question: the move was done to keep useful difference between phonemes. But it doesn't give a reason for the whole move, described by Grimm's law.</p>\n\n<p>(Please also note that Glottalic theory says that the Germanic languages really keep the initial PIE series distribution, with minor changes.)</p>\n", "Id":"2856", "ParentId":"2826", "LastEditorUserId":"865", "CreationDate":"2012-11-16T08:01:20.893", "OwnerUserId":"865", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-11-19T06:59:26.880", "LastEditedUser":{"UpVotes":"20", "Location":"Kiev, Ukraine", "DownVotes":"0", "Id":"865", "AccountId":"1343107", "Views":"3", "Reputation":"284", "CreationDate":"2012-03-24T16:20:02.170", "DisplayName":"Netch", "LastAccessDate":"2014-01-06T20:38:36.213", "Age":"41"}, "LastActivityDate":"2012-11-19T06:59:26.880", "Score":"2", "CommentCount":"5", "OwnerUser":{"UpVotes":"20", "Location":"Kiev, Ukraine", "DownVotes":"0", "Id":"865", "AccountId":"1343107", "Views":"3", "Reputation":"284", "CreationDate":"2012-03-24T16:20:02.170", "DisplayName":"Netch", "LastAccessDate":"2014-01-06T20:38:36.213", "Age":"41"}}