{"OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "comments":[], "Body":"<p>Please see the comment I left on the question about intelligence vs. IQ. I am assuming the OP meant \"intelligence\" and was simply referring to IQ as a convenient measure.</p>\n\n<p><a href=\"http://semantics.uchicago.edu/kennedy/classes/sum07/myths/myths2%5Bintelligence%5D.pdf\">Language alone is not an indicator of intelligence</a>. Most introductory Linguistics courses will at least briefly cover <a href=\"http://en.wikipedia.org/wiki/Williams_syndrome\">Williams Syndrome</a>, a form of developmental delay that characteristically presents with exceptional language skills. While it might not make sense that something that causes exceptional language skills could be classified as a developmental delay, you need to remember that when people talk about \"intelligence\", they are often talking about a wide range of independent skills (math, induction, memory, expertise on a specific topic, etc.).</p>\n\n<p>However, you did not ask about the link between language and intelligence, you asked if one's native language can affect their intelligence. I couldn't find any research on that topic but I did find <a href=\"http://www.lingref.com/isb/4/159ISB4.PDF\">this paper</a> which found that bilingualism has no noticeable effect on intelligence.</p>\n\n<p>Another problem is that it would be almost impossible to attribute any differences to language alone. There are too many variables between different language speaking areas such as culture, education, and health care. I have found <a href=\"http://eprints.ru.ac.za/504/1/Gaylard_MA.pdf\">this paper</a> which found evidence that quality of education can noticeably affect intelligence test results.</p>\n\n<p>In summary, although I could not find any academic sources explicitly addressing your concern, I find it highly unlikely that one's native language affect intelligence levels and any differences that may exist cannot be reliably attributed to language as other factors have greater effect.</p>\n", "Id":"2890", "ParentId":"2889", "CreationDate":"2012-11-24T08:15:31.300", "Score":"7", "PostTypeId":"2", "OwnerUserId":"1055", "LastActivityDate":"2012-11-24T08:15:31.300", "CommentCount":"2"}