{"Body":"<p>I think this question represents a certain confusion of terminology. By definition, a living language does not have daughters (excluding some circumstances where a parent language is retained in a particular use after the spoken languages have moved on and split, as with Latin, Sanskrit, Classical Arabic, etc.) So the question should not be \"Why doesn't Korean have daughters?\" as much as \"Why doesn't Korean have <em>sisters</em> (other languages descended from the same parent)?\"</p>\n\n<p>With that in mind, here are some points:</p>\n\n<ol>\n<li>Korean does exhibit dialectical differences. It isn't exempt from the process of language change.</li>\n<li>Modern Korean is <a href=\"http://en.wikipedia.org/wiki/History_of_the_Korean_language\">descended from Old Korean</a>, which was probably one of the <a href=\"http://en.wikipedia.org/wiki/Buyeo_languages\">Buyeo languages</a>. As the name suggests, there were several languages spoken in the Korean peninsula at this time, which are believed to be descendants of the unattested Proto-Korean.</li>\n<li>The fact that there is only one language currently spoken on the Korean peninsula appears to be because one dialect gained enough prestige to eliminate its competitors. In other words, Modern Korean is an isolate because it killed off its sister langs. The timing of this sororicide is unknown, but probably occurred during the unification of Korea in the Middle Korean period (my speculation).</li>\n</ol>\n\n<p><strong>Edit</strong>: One more thing: I doubt whether it's actually a case for a language to \"normally\" have sisters or daughters. All languages change, but language change only results in language <em>split</em> if the original speaker community has spread out enough to lose frequent inter-communication. The number of languages that expand rapidly in this sense is actually rather small, though the fact of their expansion means that they represent a large fraction of all language speakers.</p>\n\n<p>So it seems most accurate to say that most languages have no daughters (or only one daughter, depending on how you look at it), but that most languages are <em>descended</em> from languages that have many daughters. In this sense, language isolates are \"normal\", while the big language families that we're familiar with are the result of some \"abnormal\" period of historical expansion.</p>\n", "Id":"295", "ParentId":"294", "LastEditorUserId":"91", "CreationDate":"2011-09-19T15:15:17.433", "OwnerUserId":"91", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-19T15:29:19.300", "LastEditedUser":{"UpVotes":"132", "WebsiteUrl":"http://jsbangs.com", "Id":"91", "AccountId":"5121", "CreationDate":"2011-09-14T01:49:40.413", "AboutMe":"<p>I have a degree in Linguistics, but I work as a programmer. Most of my expertise about English is self-taught, plus lots of random trivia I've acquired here and there.</p>\n\n<p>This is my favorite EL&amp;U comment ever:</p>\n\n<blockquote>\n  <p>This isn't really a question about English so much as a question about hugs. <a href=\"http://english.stackexchange.com/questions/33121/whats-the-meaning-of-large-hug-in-definition-of-bearhug\">Source</a></p>\n</blockquote>\n", "Age":"32", "Location":"United States", "DownVotes":"16", "Views":"34", "Reputation":"1443", "DisplayName":"JSBձոգչ", "LastAccessDate":"2014-01-18T20:22:40.170"}, "LastActivityDate":"2011-09-19T15:29:19.300", "Score":"27", "CommentCount":"8", "OwnerUser":{"UpVotes":"132", "WebsiteUrl":"http://jsbangs.com", "Id":"91", "AccountId":"5121", "CreationDate":"2011-09-14T01:49:40.413", "AboutMe":"<p>I have a degree in Linguistics, but I work as a programmer. Most of my expertise about English is self-taught, plus lots of random trivia I've acquired here and there.</p>\n\n<p>This is my favorite EL&amp;U comment ever:</p>\n\n<blockquote>\n  <p>This isn't really a question about English so much as a question about hugs. <a href=\"http://english.stackexchange.com/questions/33121/whats-the-meaning-of-large-hug-in-definition-of-bearhug\">Source</a></p>\n</blockquote>\n", "Age":"32", "Location":"United States", "DownVotes":"16", "Views":"34", "Reputation":"1443", "DisplayName":"JSBձոգչ", "LastAccessDate":"2014-01-18T20:22:40.170"}}