{"OwnerUser":{"UpVotes":"22", "DownVotes":"0", "Id":"87", "AccountId":"3435", "Views":"2", "Reputation":"208", "CreationDate":"2011-09-14T01:01:21.067", "DisplayName":"ShreevatsaR", "LastAccessDate":"2013-12-27T13:02:51.433"}, "comments":[], "Body":"<p>This is an answer not to the part about whether it is easier to learn German after Sanskrit (I don't know), but rather, a few more assorted points re. \"What similarities exist between the two languages\", or even more generally, \"Why would people make such a claim?\" </p>\n\n<p>As Cerberus noted, most of these claims come from people whose familiarity, outside of Indian languages, is with mainly English, and perhaps a bit of French (or rarely, Spanish or Italian). So even though many similarities noted between Sanskrit and German are in fact those shared by many members of the Indo-European family, the claim just means that <em>among the few languages considered,</em> German’s similarities are remarkable.</p>\n\n<p>[My background: I have a reasonable familiarity with Sanskrit; not so much with German. For impressions about German I’ll rely on <a href=\"http://en.wikipedia.org/wiki/German_language\">the Wikipedia</a> <a href=\"http://en.wikipedia.org/wiki/German_grammar\">articles</a>, and, (don’t lynch me) Mark Twain’s humorous essay <a href=\"http://www.crossmyt.com/hc/linghebr/awfgrmlg.html\">The Awful German Language</a> — of course I know it’s unfair and not a work of linguistics, but as examples of what the average English speaker might find unusual in German, it is a useful document.]</p>\n\n<p>With that said, some similarities:</p>\n\n<h3>Cases</h3>\n\n<p>German apparently has four cases; Sanskrit has eight cases (traditional Sanskrit grammar counts seven, not counting the vocative as distinct). Cerberus notes above that “Sanskrit and German have several functional cases, whereas French/Spanish/Italian/Portuguese/Dutch/English/etc. do not. Those are the languages one might be inclined to compare Sanskrit with”.</p>\n\n<h3>Compound words</h3>\n\n<p>Although English does have short compound words (like <em>bluebird</em>, <em>horseshoe</em>, <em>paperback</em> or <em>pickpocket</em>), German has a reputation for long compound words. (Twain complains that the average German sentence \"is built mainly of compound words constructed by the writer on the spot, and not to be found in any dictionary — six or seven words compacted into one, without joint or seam — that is, without hyphens”) He mentions <em>Stadtverordnetenversammlungen</em> and <em>Generalstaatsverordnetenversammlungen</em>; Wikipedia mentions <a href=\"http://en.wikipedia.org/wiki/Rinderkennzeichnungs-_und_Rindfleischetikettierungs%C3%BCberwachungsaufgaben%C3%BCbertragungsgesetz\">Rindfleischetikettierungsüberwachungsaufgabenübertragungsgesetz</a> and <a href=\"http://en.wikipedia.org/wiki/Donaudampfschiffahrtselektrizit%C3%A4tenhauptbetriebswerkbauunterbeamtengesellschaft\">Donaudampfschiffahrtselektrizitätenhauptbetriebswerkbauunterbeamtengesellschaft</a>. But these are <strong><em>nothing</em></strong> compared to the words one routinely finds in ornate Sanskrit prose. See for example <a href=\"http://hellenisteukontos.blogspot.in/2010/03/what-is-longest-word-of-sanskrit.html\">this post</a>. Sanskrit like German allows compounds of arbitrary length, and compounds made of four or five words are routinely found in even the most common Sanskrit texts.</p>\n\n<h3>Verb appearing late</h3>\n\n<p>It appears that German words tend to come later in the sentence than English speakers are comfortable with. I notice <a href=\"http://linguistics.stackexchange.com/questions/1057/german-is-sov-should-it-not-have-been-ich-ein-berliner-bin\">questions on this SE</a> showing that German has V2 word order, not SOV. However, many English speakers seem to find late verbs in German worth remarking on. One of <a href=\"http://english.stackexchange.com/questions/4507/can-i-get-an-example-of-statement-that-can-be-said-to-be-hofstadterian\">my favourite</a> sentences from Hofstadter goes </p>\n\n<blockquote>\n  <p>\"The proverbial German phenomenon of the \"verb-at-the-end\", about which droll tales of absentminded professors who would begin a sentence, ramble on for an entire lecture, and then finish up by rattling off a string of verbs by which their audience, for whom the stack had long since lost its coherence, would be totally nonplussed, are told, is an excellent example of linguistic pushing and popping.\"</p>\n</blockquote>\n\n<p>Twain too, says “the reader is left to flounder through to the remote verb” and gives the analogy of </p>\n\n<blockquote>\n  <p>\"But when he, upon the street, the (in-satin-and-silk-covered-now-very-unconstrained-after-the-newest-fashioned-dressed) government counselor's wife <strong>met</strong>,\"</p>\n</blockquote>\n\n<p>and also</p>\n\n<blockquote>\n  <p>\"In the daybeforeyesterdayshortlyaftereleveno'clock Night, the inthistownstandingtavern called `The Wagoner' was downburnt. When the fire to the onthedownburninghouseresting Stork's Nest reached, flew the parent Storks away. But when the bytheraging, firesurrounded Nest itself caught Fire, straightway plunged the quickreturning Mother-stork into the Flames and died, her Wings over her young ones outspread.\"</p>\n</blockquote>\n\n<p>Well, this is <em>exactly</em> typical Sanskrit writing. Those sentences might have been translated verbatim from a Sanskrit text. Sanskrit technically has <em>free</em> word order (i.e., words can be put in any order), and this is made much use of in verse, but in prose, usage tends to be SOV.</p>\n\n<p>Of Sanskrit's greatest prose work, <em>Kādambarī</em>, someone named Albrecht Weber wrote in 1853 that in it, </p>\n\n<blockquote>\n  <p>“the verb is kept back to the second, third, fourth, nay, once to the sixth page, and all the interval is filled with epithets and epithets to these epithets: moreover these epithets frequently consist of compounds extending over more than one line; in short, Bāṇa’s prose is an Indian wood, where all progress is rendered impossible by the undergrowth until the traveller cuts out a path for himself, and where, even then, he has to reckon with malicious wild beasts in the shape of unknown words that affright him.” (“...ein wahrer indischer Wald...”)</p>\n</blockquote>\n\n<p>(This is unfair criticism: personally, I have been lately reading the Kādambarī with the help of friends more experienced in Sanskrit, and I must say the style is truly enjoyable.) \nNow, the fact that this was a <em>German</em> Indologist writing for the <em>Journal of the German Oriental Society</em> somewhat goes against the claim of Sanskrit and German being similar. But one could say: for someone familiar with Sanskrit’s long compounds and late verbs that even Germans find difficult, the same features in German will pose little difficulty.</p>\n\n<h3>Adjectives decline like nouns</h3>\n\n<p>In Sanskrit, as it appears to be in German, an adjective takes the gender, case, and number of whatever it is describing. (Twain: “would rather decline two drinks than one German adjective”)</p>\n\n<h3>Gender of nouns has to be learned</h3>\n\n<p>By and large, it is so in Sanskrit as well. Twain notes that in German “a tree is male, its buds are female, its leaves are neuter; horses are sexless, dogs are male, cats are female -- tomcats included, of course; a person's mouth, neck, bosom, elbows, fingers, nails, feet, and body are of the male sex, and his head is male or neuter according to the word selected to signify it, and <strong>not</strong> according to the sex of the individual who wears it -- for in Germany all the women either male heads or sexless ones; a person's nose, lips, shoulders, breast, hands, and toes are of the female sex; and his hair, ears, eyes, chin, legs, knees, heart, and conscience haven't any sex at all”. (He goes on to write a “Tale of the Fishwife and its Sad Fate.”) It does not seem quite so bad in Sanskrit, but yes, gender of words needs to be learned. (In Sanskrit there exists a word for “wife” in each of the three genders.) However this is a feature common to <em>many</em> languages (including, say, languages like Hindi or French that have only two genders) so I shouldn’t list it among similarities.</p>\n\n<h3>Spelling</h3>\n\n<p>This is something quite trivial, and linguists often don’t even consider orthography a part of the language proper, but spelling seems to be a pretty big deal to Indians learning other languages. The writing systems of most Indian languages are phonetic, in the sense that the spelling deterministically reflects the pronunciation and vice-versa. There are no silent letters, no wondering about a word spelled in a particular way is pronounced. Indian learners of English often complain about the ad-hoc inconsistent spelling of English; it seems a bigger deal than it should be. From this point of view, the fact that it is claimed that for German, “After one short lesson in the alphabet, the student can tell how any German word is pronounced without having to ask” means that that aspect of German is easier to learn.</p>\n\n<h3>The harmony of sound and sense</h3>\n\n<p>This is extremely subjective and will be controversial, and perhaps I will seem biased, but to me, in Sanskrit, it seems possible to pick words whose sounds match the desired feeling, better than in other languages. I have seen people who knew many languages say the same thing, and also Western translators from Sanskrit etc., so it is interesting for me to see Twain make a similar remark about German. Anyway, this is subjective, so I’ll not dwell on this much.</p>\n\n<h3>Non-similarities</h3>\n\n<p>There are of course many; e.g. Sanskrit does not have articles (<em>the</em>, etc.) unlike German. It also has very few prepositions (has only a few ones like “without”, “with”, “before”), as the work of prepositions like “to”, “from”, or “by” is handled by case. The difficulty of German prepositions does not seem to be present in Sanskrit.</p>\n\n<h2>TL;DR version</h2>\n\n<p>Some alleged difficulties of learning German, such as cases, long compounds, and word order, are present to a far greater extent in Sanskrit, so in principle someone who knows Sanskrit may be able to pick them up more easily than someone trying to learn German without this knowledge. However, this may not be saying anything more than that knowing one language helps you learn others.</p>\n", "Id":"2953", "ParentId":"2880", "CreationDate":"2012-12-10T17:28:59.663", "Score":"9", "PostTypeId":"2", "OwnerUserId":"87", "LastActivityDate":"2012-12-10T17:28:59.663", "CommentCount":"1"}