{"comments":[], "Body":"<p>Like @Krubo, I always thought of the distinction between an affricate and a stop-affricate sequence as being primarily defined in phonological terms. (But of course this does not preclude phonetic differences.) But also, like @hippietrail, I was under the impression that native speakers generally don't have intuitions regarding whether sounds are separate phonemes or not.</p>\n\n<p>So I always thought that in order to tell whether a stop+fricative corresponds to a single affricate phoneme, or a sequence of phonemes, one has to examine its (or their) phonological behaviour with respect to previously motivated phonological restrictions.</p>\n\n<p>For example, if a language disallows syllable margins of a certain complexity, and the only way you could analyze an example with the relevant stop-fricative according to your previously-motivated syllable template is in a way that treats the stop-fricative as a single phoneme (or a sequence of phonemes), then you have an argument that the stop-fricative is a single phoneme (or seq. of phonemes). </p>\n\n<p>Or if you know that vowels are always, say, lax before a complex coda, but not before a simplex coda, and vowels are not lax before the stop-fricative, then you have an argument that the stop-fricative is a single phoneme. </p>\n\n<p>Or a metathesis process, or gemination process, might treat the stop-fricative as a single unit, etc. </p>\n", "Id":"298", "ParentId":"179", "CreationDate":"2011-09-19T17:14:11.170", "Score":"4", "PostTypeId":"2", "OwnerUserId":"177", "LastActivityDate":"2011-09-19T17:14:11.170", "OwnerUser":{"UpVotes":"6", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/tqgTp.png", "Id":"177", "AccountId":"896176", "CreationDate":"2011-09-19T16:30:42.833", "AboutMe":"<p>Linguistics grad student. Research interests lie in formal semantics, the morphosyntax-semantics interface.</p>\n", "Location":"Canada", "DownVotes":"0", "Views":"9", "Reputation":"396", "DisplayName":"user177", "LastAccessDate":"2014-01-09T01:15:39.280"}}