{"Body":"<p>Let me just quote the first two paragraphs of p.93 of David Crystal's <em>The Cambridge Encyclopedia of the English Language</em>. (If you are an English teacher consider getting a cheap copy on Amazon)</p>\n\n<blockquote>\n  <p>The two settlements--one in Virginia, to the south; the other to the north, in present-day New England--had different linguistic consequences. The southern colonists came mainly from England's 'West Country'--such counties as Somerset and Gloucestershire--and brought with them its characteristic accent, with its 'Zummerset' voicing of <em>s</em> sounds, and the <em>r</em> strongly pronounced after vowels. Echoes of this accent can still be heard in the speech of communities living in some of the isolated valleys and islands in the area, such as Tangier Island in Chesepeake Bay. These 'Tidewater' accents, as they are called, have changed somewhat over the past 300 years, but not as rapidly (because of the relative isolation of the speakers) as elsewhere in the country. They are sometimes said to be the closest we will ever get to the sound of Shakespearean English (p. 69).<br><br>\n    By contrast, many of the Plymouth colonists came from counties in the east of England--in particular, Lincolnshire, Nottinghamshire, Essex, Kent, and London, with some from the Midlands, and a few from further afield. The eastern accents were rather different--notably, lacking an <em>r</em> after vowels, as in present-day Received Pronunciation (RP, p. 365)--and they proved to be the dominant influence in the area. The tendency 'not to pronounce the <em>r</em>' is still a feature of the speech of people from New England.</p>\n</blockquote>\n", "Id":"3022", "ParentId":"3021", "LastEditorUserId":"483", "CreationDate":"2013-01-02T03:18:29.983", "OwnerUserId":"483", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-01-05T15:40:31.737", "LastEditedUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "LastActivityDate":"2013-01-05T15:40:31.737", "Score":"6", "CommentCount":"4", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}