{"comments":[], "Body":"<p>These two forms are not equivalent.  It is true that anywhere the <em>-se</em> forms are used in Spanish, the <em>-ra</em> forms can be used, but the opposite is not true.</p>\n\n<p>So while  both these pairs are fully equivalent:</p>\n\n<ul>\n<li>No estaba seguro de que <strong>viniera/viniese</strong>. [both imperfect subjunctive forms freely interchangeable]<br>(I wasn’t sure he was coming.)</li>\n<li>Después de que <strong>llegara/llegase</strong>, nos dijo que no podía quedarse. [both imperfect subjunctive forms freely interchangeable]<br>(After he arrived, he told us he couldn’t stay.)</li>\n</ul>\n\n<p>BTW, notice how in those two examples, even though Spanish requires a subjunctive form there, you do not use a subjunctive when translating it into English.  Other places you do, but not here.</p>\n\n<p>There are two places where you cannot use an <em>-se</em> form.  These are when the <em>-ra</em> form is acting as <strong>something other than an imperfect subjunctive;</strong> to wit, as either a literary pluperfect indicative or as a polite conditional.</p>\n\n<ol>\n<li><p>Although it is a learnèd, literary tense, because the <em>-ra</em> forms exactly map to the Latin pluperfect indicative, they can also fulfill that same rôle in very formal written Spanish. This is interesting because it allows the old “purely inflectional” tense to replace the now-standard “analytical tense”. [<a href=\"http://www.orbilat.com/Languages/Spanish/History/Subjunctive/Spanish-Subjunctive_Evolution-04.html\" rel=\"nofollow\">reference</a>]</p>\n\n<ul>\n<li>Apenas <strong>había cerrado</strong> la puerta cuando me llamó. [analytic tense; standard form]<br>(Hardly had I closed the door when he called me.)</li>\n<li>Apenas <strong>cerrara</strong> la puerta cuando me llamó. [inflectional tense; very formal written form]<br>(same)</li>\n</ul></li>\n<li><p>The <em>-ra</em> form can serve as an alternative to the conditional when used for polite requests.</p>\n\n<ul>\n<li>¿<strong>Querrías</strong> cerrarme la puerta, por favor? [conditional form]<br>(Would you like to close the door for me, please?)</li>\n<li>¿<strong>Quisieras</strong> cerrarme la puerta, por favor? [alternate polite conditional]<br>(same)</li>\n</ul>\n\n<p>This form is most often used in strong verbs like <em>quisieras, pudieras, debieras</em> — basically <em>would you, could you, should you</em>.</p></li>\n</ol>\n\n<p>In both those two situations, you cannot use the <em>-se</em> form, because the <em>-se</em> form functions only as an imperfect subjunctive.  It never functions as a pluperfect indicative or as a conditional, whereas the <em>-ra</em> form can. </p>\n\n<hr>\n\n<p>Another rarely seen literary tense sometimes occurs with the conjunction <em>apenas</em>.   This is an analytic tense composed of the auxiliary in the preterite rather than in the imperfect.  This is called the <em>pretérito anterior</em>, and occurs only after certain conjunctions, and even then almost only ever in writing.  It is used when the other clause is in the preterite, and you need something that is <strong>more preterite</strong>, so that it happens before — and in practice, usually <strong>right</strong> before.</p>\n\n<p>However, the normal pluperfect is an imperfect tense, not a perfect (completed) one, so the auxiliary is placed into a real preterite, making a new analytic tense.  For example:</p>\n\n<ul>\n<li>Una vez que me <strong>hube quitado</strong> la camisa, me sentí muchísimo más cómodo.<br>(Once I’d taken my shirt off, I felt way more comfortable.)</li>\n</ul>\n", "Id":"3042", "ParentId":"2644", "CreationDate":"2013-01-07T02:58:28.043", "Score":"3", "PostTypeId":"2", "OwnerUserId":"707", "LastActivityDate":"2013-01-07T02:58:28.043", "OwnerUser":{"UpVotes":"26", "WebsiteUrl":"http://www.perl.com/", "Id":"707", "AccountId":"216196", "CreationDate":"2012-01-24T16:28:35.700", "AboutMe":"<p><a href=\"http://stackexchange.com/users/216196\">\n<img src=\"http://stackexchange.com/users/flair/216196.png\" width=\"208\" height=\"58\" alt=\"profile for tchrist on Stack Exchange, a network of free, community-driven Q&amp;A sites\" title=\"profile for tchrist on Stack Exchange, a network of free, community-driven Q&amp;A sites\">\n</a></p>\n\n<p>I’m Tom Christiansen, author of <em>Programming Perl</em> and <em>Perl Cookbook</em> from O’Reilly. I’m a freelance instructor giving courses in Perl programming, including Unicode and regular expressions. I’ve been using BSD Unix for 30 years now; like your maid, I don’t do Windows.</p>\n\n<p>I’ve undergraduate degrees in Spanish and in Computer Science, and a graduate degree in compsci focusing on operating systems design and in natural language processing. I’ve studied Spanish, French, Italian, Portuguese, Latin, and German, with a smattering of other languages thrown in. For the last few years I’ve been dabbling in computational linguistics.</p>\n", "Age":"51", "Location":"Boulder, CO", "DownVotes":"1", "Views":"5", "Reputation":"206", "DisplayName":"tchrist", "LastAccessDate":"2013-12-24T16:58:31.240"}}