{"Body":"<p>If the <strong>source language already has genders</strong>, then they will often be taken along to the host language, provided that people in the host language know a little bit about the source language. But there are countless other subtle, complex factors.</p>\n\n<p><em><strong>Dutch</em></strong> has a <strong>neuter</strong> article (<em>het</em>) and the fused/common gender <strong>masculine-femine</strong> (<em>de</em>). There are no definite rules for borrowed words, and we never learned any such rules. I would know if there were any, but no: genders are assigned subconsciously. For existing Dutch words, there are some rules, but I think perhaps half the words have genders that feel arbitrary (though fixed) to us. For example, a person will nearly always be masculine or feminine, and words on <em>-heid</em> are always feminine; but for most other words you just have to know. The difference between masculine and feminine only comes up with possessive adjectives (<em>the fork and his?/her? prongs</em>) and personal pronouns (<em>not that fork: I saw her?/him? lying over there</em>). Colloquially, we usually use masculine pronouns for <em>de</em> words; in writing, I often have to look up the gender of a word, unfortunately. In the south and in Belgium, I think they don't use masculine by default.</p>\n\n<p>Because we have a word <em>het huis</em> in Dutch (\"the house\"), English <em>safehouse</em> will become <em>het safehouse</em>, as it is very <strong>similar</strong>. Usually the similarity is less direct; then a word with a similar <em>meaning</em> may be picked as the example. For instance, suppose that Japanese *<em>inko</em> means house (I'm just making this up), then I am more likely to say <em>het inko</em>.</p>\n\n<p>However, a second factor is how the word <strong>sounds</strong> compared to words that sound remotely similar. Words on -o are probably more often masculine in Dutch, because of the many Italian and Spanish words on -o, like impresario, virtuoso, amigo, gringo, etc., so I am more likely to say <em>de inko</em> because of the sound.</p>\n\n<p>Thirdly, I think many languages have a kind of <strong>\"default\" gender for (foreign) words</strong>. In German, I was taught that newly borrowed words are normally feminine. So it was easy to learn <em>die CD</em> and such (although, if this rule is valid in German, there must be many categories of exceptions). In Dutch, masculine and feminine have all but merged, that is, they have the same article, <em>de</em>. For that reason, <em>de</em> is much more frequent than <em>het</em> (neuter), so that <em>de</em> is more likely to be chosen for new words.</p>\n\n<p>Fourthly, there is the possibility that the gender is taken from a <strong>third language</strong>, if that language has already adopted the word and assigned a gender to it. Dutch might follow German in some cases; I don't know how often this really happens. </p>\n\n<p>To all these factors may be apportioned different weights in different circumstances, and they are somehow weighed by the subconscious of the first people who use the word, until at some point it has acquired a commonly accepted gender. It is often unpredictable in my experience.</p>\n\n<p>Note also that it is perfectly possible for a borrowed word to <strong>remain of uncertain gender</strong> indefinitely. We even have some ancient native (inherited) words that we still bicker over (in a good-natured manner, of course). Now a few practical examples.</p>\n\n<blockquote>\n  <p>Dutch <em>het net</em> => <strong>het Internet.</strong> Since <em>net</em> means the same thing in Dutch as in English, this one was easy.</p>\n  \n  <p><em>Het koekje</em> => <strong>de/het cookie.</strong> I'm not sure about this one; I would probably say <em>de cookie</em>. Perhaps it is too new, but people do talk about this on a regular basis, have done so for at least a decade, and yet it is still not entirely decided. One would expect such a strong similarity to the Dutch word to lead to <em>het cookie</em>, and yet I would say <em>de cookie</em>. I feel that perhaps the default gender <em>de</em> is just too strong in Dutch. Or perhaps the fact that it is a small object: perhaps those have an extra strong tendency to be <em>de</em> words? Hard to say.</p>\n  \n  <p><strong>De router, de server:</strong> we have no similar words, but words on <em>-er</em> usually indicate an agent, a person even, and people are normally not neuter, so definitely <em>de router, de server</em>.</p>\n  \n  <p><strong>De absence</strong>: this is the French word, pronounced as in French. It was adopted into Dutch long ago, so I did not witness its introduction. My guess is that the ending <em>-e</em> had a strong influence, and simply the fact that it is obviously feminine in French.</p>\n  \n  <p><strong>Het communisme</strong>: this probably came from French. For some reason, (nearly?) all words on <em>-isme</em> are neuter in Dutch. I have no idea why, because I think they are masculine in all other languages, including French, which doesn't have a neuter gender at any rate. They come from Latin -<em>ismus</em>, which is masculine, from Greek <em>-ismos</em>, also masculine. Very strange.</p>\n  \n  <p><strong>De coating</strong> (as in paint). There is no Dutch equivalent. The ending <em>-ing</em> is nearly always feminine in Dutch for non-persons, so <em>de</em> (cognate to German <em>-ung</em>).</p>\n  \n  <p><strong>De axolotl</strong>: nothing at all sounds like or resembles an axolotl, but I think animals are by default <em>de</em>, because they are agents (even though we do have plenty of neuter animals).</p>\n  \n  <p><strong>De tsunami</strong>: probably <em>de</em> because <em>-i</em> sounds a bit like Italian or Latin masculine? There is also <em>de golf</em> \"the wave\", <em>de vloed</em> \"the flood\". I'm not sure.</p>\n  \n  <p><strong>Het DNA</strong>: hard to say. Perhaps because <em>Acid</em> was translated subconsciously as <em>het zuur</em> by the first Dutch scientists? Because substances are more likely to be <em>het</em>?</p>\n</blockquote>\n", "Id":"3047", "ParentId":"3044", "LastEditorUserId":"82", "CreationDate":"2013-01-08T05:13:57.123", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-01-13T17:18:05.290", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-01-13T17:18:05.290", "Score":"11", "CommentCount":"2", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}