{"Body":"<p>None of these can be explained by synchronic rules of Latin grammar, at least not in the classical age. Nor does this seem to be regular Proto-Indo-European ablaut, where one would expect something like *<em>cp-/cep-/cop-</em>. Somehow many different allomorphs of <em>caput</em> exist; but allomorphs of other stems are plentiful in Latin and in most other languages. Many combinations of these allomorphs appear to be possible:</p>\n\n<ul>\n<li><strong>cap-/cep-/cip-</strong> (semantic root)</li>\n<li><strong>-ut-/-it-</strong> (suffix)</li>\n</ul>\n\n<p>As to the <strong>nominative singular <em>-ut</em> v. stem <em>-it-</em></strong>, nominatives singular are normally different from the other forms of words or suffixes of the 3rd declension. <em>Homo, hominis; rex, regis; munus, muneris;</em> etc. Each nominative can probably be explained, and there are patterns, but I don't know about the <em>-u-</em> in <em>caput</em> specifically. And <em>-ud/-ut</em> is probably a Proto-Indo-European suffix, probably with its own rules. I have consulted <em>Walde-Hoffmann</em> (1938) and <em>Ernout-Meillet</em> (1959), but I couldn't find a real explanation for <em>-ut-</em> v. <em>-it-</em> in <em>caput, capitis</em>.</p>\n\n<p>Interestingly, the same <em>-u/i-</em> allomorphs seem to exist in a Germanic word that is probably cognate to <em>caput</em> (so says <a href=\"http://gtb.inl.nl/iWNTLINKS/DATADIR/paginazy.html?EWN%20/iWDB/search?actie=article_content&amp;wdb=EWN&amp;id=ewn005911\" rel=\"nofollow\">Philippa (2004–2009)</a>, although the <em>Oxford English Dictionary</em> (2nd ed.) is sceptical). Dutch <em>hoofd</em> and German <em>Haupt</em> come from Proto-Germanic *<em>haub-id-</em>, whereas Old English <em>heafod</em>, modern <em>head</em>, and Old Norse <em>haufuþ</em> come from *<em>haub-ud-</em>. According to the <em>Oxford English Dictionary</em>, this <em>-id/ud-</em> constitutes \"suffix ablaut\". One would expect the Germanic and Latin suffixes to be cognates too, but, alas, etymological dictionaries rarely explain all the affixes, and I couldn't find it. Note that there is also a Germanic allomorph *<em>hab-</em> leading to Proto-Germanic *<em>hab-ud-</em>, Old English <em>hafud</em>, and Old Norse <em>höfuþ</em>.</p>\n\n<p>As to the <strong><em>-cip-</em> in <em>praecipito</em></strong>, an <em>-a-</em> in the first syllable of a verb normally changed into <em>-i-</em> after a prefix, in a certain phase of Latin. The same applies to <em>-ae-</em> and <em>-e-</em>, but not to <em>-o-</em> and <em>-u-</em>, as far as I know. The length of the vowel was generally preserved, so that long <em>-ā-</em> and <em>-ae-</em> become long <em>-ī-</em>, but short <em>-ă-</em> becomes short <em>-ĭ-</em>. Note that vowels did not (always) change in words formed in later phases of Latin. Nor did they change in the perfect stems of verbs. Hence:</p>\n\n<blockquote>\n  <p>Maneo - remaneo - immanens</p>\n  \n  <p>Paro - reparo - apparans</p>\n  \n  <p><em>(Present)</em> capio - recipio - incipiens</p>\n  \n  <p><em>(Perfect)</em> cepi - recepi - receptus</p>\n  \n  <p><em>(Present)</em> ago - redigo - redigiens</p>\n  \n  <p><em>(Perfect)</em> egi - redegi - redactus</p>\n</blockquote>\n\n<p>This may explain <em>-cip-</em> after many suffixes. However, it is possible that it is simply an older, unexplained allomorph.</p>\n\n<p>As to <strong><em>-e-</em> in <em>praeceps</em></strong>, this appears to be an allomorph that already existed in prehistoric Latin or earlier. (<em>Cep-</em> in the perfect is probably a lengthening of the vowel and explained through other mechanisms, but this is not certain.) The dictionaries above have no real explanation. It is possible that the <em>-e-</em> is due to contamination from words like <em>princeps</em> and <em>auceps</em>, which probably came from the <em>e</em> grade of the root of <em>capio</em>.  According to <em>Ernout-Meillet</em>, the root of <em>capio</em> had three allomorphs that seem to display regular Proto-Indo-European ablaut: **kēp-, <em>kōp-,</em> and *<em>kəp-</em> (from which <em>cap-</em>). Notice that the stem of <em>princeps</em> etc. is <em>-cip-</em>, whereas that of <em>praeceps</em> etc. is <em>-cipit-.</em></p>\n\n<p>The <em>-e-</em> is only in the nominative singular, and it is not surprising in general that the nominative singular should be irregular. <em>Pontifex</em> (gen. <em>pontificis</em>) and <em>maleficus</em> come to mind, from <em>facio</em>, \"make\". Somehow both <em>-e-</em> and <em>-i-</em> occur. Compare also <em>pars, partis</em> leading to <em>expers, expertis</em>: the same nominative <em>-e-</em>, but no <em>-i-</em> in the stem.</p>\n\n<p>As to the <strong>disappearance of the suffix</strong> in <em>anceps</em>, it is possible that it was syncopated, but it is more likely that the suffix was simply not used in all words derived from what may have been Proto-Indo-European *<em>kh₂p</em>-/*<em>kap-</em> (the origin of Proto-Indo-European *<em>kap-ut</em> is not quite certain: *<em>kh₂p</em>-/*<em>kap-</em> may have come from a pre-Proto-Indo-European substrate language). This root meant something like \"head\", and later reflexes include some forms with the suffix <em>-ut/-ud</em>, others with <em>-elo-</em> (Greek <em>kephalê</em>), and probably others again with no suffix at all.</p>\n\n<p>Note also that this root may be related to <em>capio, habeo,</em> and English/Germanic <em>have</em>/etc. (so suggests Walde), which come from a Proto-Indo-European root *<em>kap-</em> (from *<em>kh₂p-</em>/*<em>kəp-</em>), or *<em>gʰabʰ-</em> (from *<em>gʰh₂bʰ-</em>) / *<em>gʰebʰ-</em>, but this is uncertain. (These Proto-Indo-European roots may be variants on and reflexes of a pre-Proto-Indo-European substrate root, so suggests Philippa, <em>Etymologisch Woordenboek van het Nederlands</em> (2004–2009), <a href=\"http://gtb.inl.nl/iWNTLINKS/DATADIR/paginazy.html?EWN%20/iWDB/search?actie=article_content&amp;wdb=EWN&amp;id=ewn005673\" rel=\"nofollow\">'hebben'</a>).</p>\n\n<p>Words derived from the <em>capio</em> root exist that mean something like \"recepticle, container\" (notice <em>cep</em>-), and a semantic shift from pottery to head is a common phenomenon. Cf. Latin <em>testa</em> \"(piece of) earthen pot\", from <em>torreo</em> \"burn\" (related <em>toast</em>), which lead to French <em>tête</em> \"head\" and similar words in other Romance languages. Cf. also Latin <em>cuppa</em> \"cup\", probably from a non-Proto-Indo-European language (<a href=\"http://gtb.inl.nl/iWNTLINKS/DATADIR/paginazy.html?EWN%20/iWDB/search?actie=article_content&amp;wdb=EWN&amp;id=ewn007179\" rel=\"nofollow\">Philippa</a>), which probably led to English <em>cup</em>, Dutch <em>kop</em> \"cup; head (informal)\", German <em>Kopf</em> \"head (informal)\". The original Proto-Indo-European root for \"head\" was <a href=\"http://english.stackexchange.com/a/19926/3036\">*<em>ker-</em></a>, \"head, horn\", from which <em>horn, cerebrum, cervix, unicorn, triceratops</em>; somehow the central word for \"head\" was replaced often in the successor languages.</p>\n", "Id":"3060", "ParentId":"3057", "LastEditorUserId":"82", "CreationDate":"2013-01-10T04:40:55.143", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-01-10T08:28:35.010", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-01-10T08:28:35.010", "Score":"9", "CommentCount":"2", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}