{"OwnerUser":{"UpVotes":"47", "WebsiteUrl":"", "DownVotes":"1", "Id":"153", "AccountId":"871764", "Views":"33", "Reputation":"1445", "CreationDate":"2011-09-18T03:14:58.320", "DisplayName":"Floating Tone", "LastAccessDate":"2012-05-27T05:07:04.410", "AboutMe":"<p>I'm a PhD candidate in linguistics, with diverse interests including phonetics, phonology, morphology, language documentation, historical linguistics and sociolinguistics. I am particularly interested in the languages of Africa, Papua New Guinea and Australia. I'm also very interested in methods of making linguistic knowledge and materials more accessible and available to linguists and non-linguists alike.</p>\n"}, "comments":[], "Body":"<p>Yes, /fubar/ is typically used for <strong>phonemic</strong> transcriptions, and [fubar] for <strong>phonetic</strong> transcriptions. But, just to clarify the terminology, phonemic vs. phonetic is not necessarily the same thing as broad vs. narrow transcription.</p>\n\n<p>Many linguists talk about using both <strong>broad and narrow phonetic transcriptions</strong>, which just refers to the level of detail used in representing the actual speech sounds. \nA narrow phonetic transcription would represent every tiny little characteristic of the speech sounds as they were produced in an utterance of Language X, while a broad phonetic transcription would indicate some of the most salient characteristics of the transcribed phones, without being exhaustive but also without necessarily making claims about which segments are phonemically/phonologically contrastive.</p>\n\n<p><strong>Phonemic transcription</strong>, on the other hand, can really only be broad, in that it only represents the sounds that are purported to be contrastive in the given language, without any detail that is not directly relevant to forming these contrasts. Phonemic transcription does not describe how an utterance actually sounds when produced by a particular speaker speaking in a particular style in a particular situation - phonemic transcription is the 'idealised' representation of the speech sounds, and supposed to represent the underlying contrasts that are meaningful to speakers.\nYou can only do phonemic transcription when you have already done quite a bit of work on Language X (collected a range of lexical items, found some minimal pairs and/or worked out the patterns of allophonic variation, etc etc) because phonemic transcription implies that you/someone has decided which phones relate to contrastive phonemes (different sounds that can occur in exactly the same environment) and which phones occur as the result of free/conditioned variation.</p>\n\n<p>The examples given by @Alek Storm above illustrate the differences between [phonetic] and /phonemic/ transcription - just remember that phonetic can be broad <em>and</em> narrow.</p>\n", "Id":"307", "ParentId":"301", "CreationDate":"2011-09-20T07:07:00.840", "Score":"18", "PostTypeId":"2", "OwnerUserId":"153", "LastActivityDate":"2011-09-20T07:07:00.840", "CommentCount":"1"}