{"Body":"<p>This may be considered chiasmus, as the endings do form a cross:</p>\n\n<pre><code>sidere   mens\n N/Abl  F/Nom\n     ╲ ╱\n      ╳\n     ╱ ╲\neadem   mutato\nF/Nom    N/Abl\n</code></pre>\n\n<p>However, the <a href=\"https://en.wikipedia.org/wiki/Hyperbaton\" rel=\"nofollow\">hyperbaton</a> is what makes this phrase striking (or even double hyperbaton). Part of speech normally trumps syntactic agreement when it comes to chiasmus; that is, if we have four words, of which one pair are the same part of speech, and the other pair another, then that is what one would look at to consider whether or not the construction was chiastic, i.e. then A would have to be a part of speech, not a number/sex/case, and the same for B.</p>\n\n<p>\"Normal\" order:</p>\n\n<blockquote>\n  <p>mēns ĕădēm sīdĕrĕ mūtātō</p>\n</blockquote>\n\n<p>A regular chiasmus, <em>noun-adjective-adjective-noun</em>:</p>\n\n<blockquote>\n  <p>mēns ĕădēm mūtātō sīdĕrĕ</p>\n</blockquote>\n\n<p>To place <em>mens eadem</em> inside <em>sidere mutato</em>, as in motto of the University of Sydney, can be done in poetry; the reason will often be the metre:</p>\n\n<blockquote>\n  <p>sīdĕrĕ mēns ĕădēm mūtātō</p>\n</blockquote>\n\n<p>This could be part of a dactylic hexameter, the noblest of Greek and Latin meters, where each metre/foot must be either ¯ ˘ ˘ (long-short-short) or ¯ ¯ (long-long), except the sixth foot (long-either). Notice how the normal word order would never fit the metre, while the motto could, depending on what came before and after. The regular chiasmus could fit as well. Normally, such an unusual word order as in the motto is only used in poetry, and then usually <em>metri causa</em> (\"for the sake of metre\"), but poets may also do it on a whim, or because it sounds better for some other reason. So your motto sounds poetic because of its word order.</p>\n\n<p>In a regular chiasmus, the effect is often antithetical: <em>you are right, and wrong am I.</em> The non-parallel word order in a chiasmus makes one realise <em>that</em> the two phrase are parallel, which one might otherwise not have noticed so strongly. It can also be merely a local decorative (non-functional) effect.</p>\n\n<p>However, as to the precise stylistic effect of your motto, I would say the effect is no more specific than a poetic tinge. Focus lies where it lies in the translation, but no thanks to the word order. It is possible that other classicists will disagree with me, but probably not a great deal.</p>\n", "Id":"3101", "ParentId":"3100", "LastEditorUserId":"82", "CreationDate":"2013-01-21T13:05:23.537", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-09-08T05:24:24.483", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-09-08T05:24:24.483", "Score":"9", "CommentCount":"7", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}