{"comments":[], "Body":"<p>Language is a continuum, and not something that has an absolute, well-defined beginning (or end, for that matter).</p>\n\n<p>Think of a language like you would a species of animal or plant. There was no first human, or mouse, or giraffe, it has been a constant process of evolution. What we can see, however, is that at given intervals, there is a noticeable difference between how these creatures acted and looked, and when others broke off from the \"main\" line.</p>\n\n<p>Language is exactly like this. We can look at English from 500 years ago and notice how different it was, but if you were living at that time, from day to day, the change wasn't noticeable.</p>\n\n<p>As such, I don't believe any language was \"born\", but that this is rather a metaphor for the earliest time at which a language was evidentially distinct from its most recent descendant. We can look to history for clues about more abrupt changes, though.</p>\n\n<p>Language death is similar. In terms if Middle English dying out and being replaced with modern English, that was just the result of evolution. Then you can look at language that was wiped out by conquest, and look at how the natives speak the language of their conquerors. In Ireland, the way English is spoken, even by those who do not know any Irish, has traces of Irish in it (the classic 'at all, at all' is a calque of 'ar chor ar bith', for example). In that case, is the language really dead (FYI - Irish is not by any means a dead language).</p>\n\n<p>When we look at recently extinct languages, they are lost to proper study when the last speaker dies, and if they have not been recorded, they may be lost forever.</p>\n", "Id":"3104", "ParentId":"2864", "CreationDate":"2013-01-22T23:43:49.860", "Score":"1", "PostTypeId":"2", "OwnerUserId":"1117", "LastActivityDate":"2013-01-22T23:43:49.860", "OwnerUser":{"UpVotes":"4", "Location":"Dublin, Ireland", "DownVotes":"0", "Id":"1117", "AccountId":"1571138", "Views":"2", "Reputation":"152", "CreationDate":"2012-06-18T16:25:03.320", "DisplayName":"Richard King", "LastAccessDate":"2013-04-09T19:26:53.250", "AboutMe":"<p>Computational Linguist with an interest in Web Development. Graduate of TCD, and still Dublin based!</p>\n", "Age":"25"}}