{"OwnerUser":{"UpVotes":"126", "WebsiteUrl":"http://www.superlinguo.com", "Id":"64", "AccountId":"900445", "CreationDate":"2011-09-13T21:45:12.903", "AboutMe":"<p>I have a PhD in linguistics. My areas of interest include language documentation, Tibeto-Burman linguistics, gesture, language play, LOLspeak, evidentiality and making bad puns. I blog about language and linguistics at www.superlinguo.com</p>\n", "Age":"29", "Location":"Australia", "DownVotes":"6", "Views":"40", "Reputation":"2016", "DisplayName":"LaurenG", "LastAccessDate":"2013-10-26T00:28:12.653"}, "comments":[], "Body":"<p>For those unsure of terminology, \"analytic\" refers to how many morphemes group together to make a word. Some languages will have lots of morphemes together in a word (Australian and North American languages are famous examples of this) and they are called 'polysynthetic.' A language that has few morphemes together in a word is called 'analytic.' Mandarin is often cited as an example of such a language, where there is often only one morpheme per word.</p>\n\n<p>English is relatively analytic, but not the most analytic. While I can't find any stats for languages as a whole, the ever-reliable <a href=\"http://wals.info\" rel=\"nofollow\">WALS</a> database has a feature called \"[Inflectional synthesis of the verb]\"<a href=\"http://wals.info/feature/22A\" rel=\"nofollow\">2</a>. The verb is not a terrible place to look - although it does deprive us of the kinds of polysynthesis in German where adjectives and nouns act as morphemes in larger words. </p>\n\n<p>In this we see that English is, across the world's languages, relatively analytic - being one of 24 languages with only 2-3 morphemes per verb. There are only 5 languages with fewer (0-1 morphemes) as opposed to the remainder of the 145 language sample that have anywhere from 3-13 morpheme slots per verb. Looking at the 24 languages that have only 2-3 morphemes, we see that there aren't many in the Euro-area. There's Finnish, but that's not Indo-European, but Uralic.</p>\n\n<p>This leaves Hindi on the map - a member of the Indo-Aryan branch of the Indo-European family. I have not learned much Hindi, but I have learned Nepali, and I would say that these Indo-European languages have, at the most, only a slightly higher number of morphemes per word. This area would be your best candidate for finding another analytic language of the Indo-European family that is similar to English in terms of morphological density of words. </p>\n", "Id":"3194", "ParentId":"3192", "CreationDate":"2013-02-12T20:19:16.953", "Score":"1", "PostTypeId":"2", "OwnerUserId":"64", "LastActivityDate":"2013-02-12T20:19:16.953", "CommentCount":"5"}