{"Body":"<p>A language is a complex system of communication, spoken or written, verbal or non-verbal. </p>\n\n<p>Actually, natural languages are spoken or signed: written language is an artificial creation made by man and this includes also systems like Braille (for blind people), etc. There are many languages that nowadays lack a written form.</p>\n\n<p>The idea that spoken language comes before written language is reinforced by two aspects: <strong>ontogenesis</strong> (single individual), humans learn to speak first and then they are taught how to write and <strong>philogenetics</strong> (human species), in human history, spoken language developed first as opposed to the written language that developed later.</p>\n\n<h1>Language properties</h1>\n\n<p>Some of the language properties are (some of these are translated from other resources so if you spot a mistake, just let me know):</p>\n\n<ul>\n<li><p><strong>Biplanarità</strong> (not sure how to translate it): This is the most obvious property and it defines the correspondence between <em>signifier</em> (the form taken by a certain sign) and <em>signified</em> (the meaning conveyed).</p>\n\n<p>So for example, <strong>cat</strong> is a signifier, it's a word. The animal we think of by reading that word is the signified, i.e. the meaning the word conveys.</p>\n\n<p>At this point we would have the real-world entity, an actual cat, which is called <strong>referent</strong>.</p></li>\n<li><p><strong>Arbitrariness</strong>: A language is made of many symbols that are placed together to form utterances, using the grammar rules for that given language. But symbols are arbitrary: there is no natural link between a signifier and signified. If you say <strong>cat</strong>, there is nothing in this word that would naturally link it to the meaning of \"cat\" or to the actual animal. </p>\n\n<p>There are different levels of arbitrariness but for the sake of this answer I'll skip this part since it could get very long.</p></li>\n<li><p><strong>Duality</strong>: There are two levels, primary and secondary. A quick example would be the word cat we used earlier. The letters C, A and T are meaningless when given singularly (except particular cases but let's ignore that for now). If I say \"C\", you won't get nothing out of it. This could constitute our secondary level. When this elements are combined, we get to the primary level, the units.</p>\n\n<p>If you combine those three letters to form the word <em>cat</em>, then you have meaningful unit. If I say cat, you'll certainly think of the four-legged animal covered in fur.</p></li>\n<li><p><strong>Systemacity</strong>: Elements and words combine in a language according to certain rules. Without rules, we wouldn't be able to determine the meaning of an utterance or even decide whether an utterance has meaning at all.</p>\n\n<p>So languages have rules, rules for combining sounds, words and even sentences. With these rules there is a common ground between us and the rest, that can give communication a constant. Different expressions or ways of talking will have a single (mutable but single) point that defines what is appropriate for communicating and what is not.</p></li>\n<li><p><strong>Linearity</strong>: Signs can be uttered only one after the other, there cannot be simultaneous signs. You can think a lot of things at the same time, but your physical tract will only let you utter one sign at a time.</p></li>\n<li><p><strong>Productivity</strong>: Given some rules, a language can create new combinations or ways to express something so that the interlocutor can correctly understand this new word even if they have never seen/heard it before, thanks to the rules. </p>\n\n<p>So by taking a root from a single word, we're able to produce several other words related to the first. For example: farm</p>\n\n<p>Farm<b>er</b> = person<br>\nFarm<b>able</b> = adjective<br>\nand so on...</p></li>\n<li><p><strong>Displacement</strong>: We can talk about something (car, last night's soccer match) even if it's not there anymore or not in front of us. E.g. Talking in a bar \"My car is parked outside.\"</p>\n\n<ul>\n<li><strong>Language is stimulus-free</strong>: The previous two features are linked to the concept of languages being stimulus-free: humans don't always have the same response and wouldn't utter the same words when given the same stimulus. Furthermore, language is independent from the reality that we're experiencing.</li>\n</ul></li>\n<li><p><strong>Cultural transmission</strong>: This refers to the fact that languages (and all that this includes) is transmitted to future generations. Also, these don't necessarily acquire the language from their biological parents, but rather from the society where they grow up (which might include their parents).</p></li>\n<li><p><strong>Syntactic complexity</strong>.</p></li>\n<li><p><strong>Multifunctionality</strong>: Language can take <a href=\"http://en.wikipedia.org/wiki/Jakobson%27s_functions_of_language\">different functions</a>: poetic, metalinguistic, phatic, etc.</p></li>\n<li><p><strong>Ambiguity</strong>: There is not a unique relation between a signifier and a signified. A signifier could have many signifieds and a signified could have multiple signifiers.</p></li>\n<li><p><strong>Recursion</strong>: This is a phenomenon where a linguistic rule can be applied to the result of the application of the same rule. </p></li>\n<li><p><strong>Riflessività</strong> (not sure how to translate this): This is the ability of a language to talk about itself. We use the language to refer to the language itself, making it a metalanguage. </p></li>\n<li><p><strong>Transposition of means</strong>.</p></li>\n</ul>\n\n<hr>\n\n<h1>Sign Languages</h1>\n\n<p><strong>Sign languages are natural</strong>, which means they aren't created artificially to cover a certain purpose. They can be, but they are naturally born in deaf communities. In the past, deaf communities or even twins have been discovered and what happened was that they naturally developed a sign language to communicate. </p>\n\n<p>Note that <strong>Sign Languages have their own grammar and syntax</strong> and that's why a user of BSL (British Sign Language) cannot communicate as easily with a user of ASL (American Sign Language) as it happens for other speakers. English, even having different vocabulary in some occurrences, different accents, is still perfectly understandable from BrE and AmE speakers. But <strong>Sign Languages are totally independent</strong>. This obviously means that Sign Languages are not international, even if an International Sign Language (ISL) has been elaborated, previously called Gesturo.</p>\n\n<p>If that wasn't enough, Sign languages have their written form or <a href=\"http://en.wikipedia.org/wiki/SignWriting\">SignWriting</a> (just an example). They can be also be transcribed, the most used method being the <a href=\"http://en.wikipedia.org/wiki/Hamburg_Notation_System\">Hamburg Notation System or HamNoSys</a>, which would be the IPA version for the Sign Languages.</p>\n\n<p>In the 60s a scholar named <a href=\"http://en.wikipedia.org/wiki/William_Stokoe\">William Stokoe</a> was the first to declare Sign Languages (to be exact the American Sign Language) as fully-fledged languages that had all the properties of spoken languages, revealing the possibility of their components to be divided in sub-components. If in a spoken language we have a <strong>word made by phonemes</strong>, in a Sign Language we have a sign made by four parameters, which are the following:</p>\n\n<p><img src=\"http://i.stack.imgur.com/ydfvP.png\" alt=\"scheme made using the program XMind\"></p>\n\n<p>Recently also other non-manual components have been highlighted (even if they are considered suprasegmental features): </p>\n\n<ol>\n<li>face expression</li>\n<li>head position</li>\n<li>torso posture</li>\n<li>labialization</li>\n</ol>\n\n<p>Certainly, as stated before, Sign Languages are totally independent from spoken languages: they aren't a simplified copy of those languages. Their grammar and their syntax are totally different.</p>\n", "Id":"3214", "ParentId":"3212", "LastEditorUserId":"111", "CreationDate":"2013-02-17T13:45:38.280", "OwnerUserId":"111", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-02-18T18:35:19.887", "LastEditedUser":{"UpVotes":"308", "DownVotes":"10", "Id":"111", "AccountId":"514008", "Views":"172", "Reputation":"5430", "CreationDate":"2011-09-14T09:33:29.710", "DisplayName":"Alenanno", "LastAccessDate":"2014-01-19T00:38:35.883", "AboutMe":"<p>I'm a student majoring in Languages (branch: Linguistics), currently working as a freelance translator. I've recently discovered <a href=\"http://db.tt/WpiKeReH\" rel=\"nofollow\">Dropbox</a> and I'm going to use it for my needs! :)</p>\n\n<p><em><strong>I love</em></strong><br>\nLanguages, Movies (Fantasy, Sci-Fi, Tarantino, etc.), Music, 3D Graphics, books and so on. </p>\n\n<p>Appointed ♦ Moderator Pro Tempore on <a href=\"http://area51.stackexchange.com/proposals/6673/linguistics?referrer=GlDGLdkDYNxMg1X13CJ1vg2\">Linguistics SE</a>, <a href=\"http://area51.stackexchange.com/proposals/6388/chinese-language-usage?referrer=XzTG1Nz01tc01sJEhak_6g2\">Chinese SE</a> and the <a href=\"http://area51.stackexchange.com/proposals/10848/russian-language-usage?referrer=J7IYS3ZUomUDvVVb-6SmDQ2\">Russian SE</a> site. If you're interested in other Stack Exchanges, try the <a href=\"http://area51.stackexchange.com/proposals/42949/italian-language-usage?referrer=ALVtGpK0tjLp1Lw15QCaUA2\">Italian SE</a> site.</p>\n\n<p>I like to lurk on other sites' Metas. <em>Meta is fun!</em> </p>\n\n<p><strong>My feature requests</strong>:</p>\n\n<ol>\n<li><a href=\"http://meta.stackoverflow.com/q/135786/176533\">Alert a moderator when an answer is improved after a post notice</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/138273/176533\">Automatically add chat event to the community bulletin (or make it easier)</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/121363/176533\">Give 10k users the ability to see the total count of flags they've handled</a></li>\n</ol>\n\n<p><strong>Moderator issues</strong>: If you have concerns or want to contact me about my moderation, you can find/ping me either in the <a href=\"http://chat.stackexchange.com/rooms/1336/linguistics\">Linguistics SE chat room</a> or <a href=\"http://chat.stackexchange.com/rooms/1984/chinese-language-and-usage\">CL&amp;U chat room</a>; if I'm not there or I'm \"idle\", just ping me! Please <em>avoid</em> using my personal email for such things. Use the chat rooms.</p>\n\n<hr>\n\n<p><strong>Languages List</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <sup>Languages with  * = learning on my own</sup></p>\n\n<p><strong>Mother Tongue:</strong> Italian, Sardinian;<br>\n<strong>Fluent:</strong> English, Spanish;<br>\n<strong>Less Fluent:</strong> French, German, Russian;<br>\n<strong>Learning:</strong> Japanese*, Chinese*, Swedish*, Greek*, Finnish*;<br>\n<strong>Willing to learn:</strong> Welsh, Korean, Dutch, Arabic, Hebrew, Hindi [to be continued]</p>\n\n<p>Me gusta el Español.<br>\nJ'aime le Français.<br>\nDeutsch gefällt mir.<br>\nМне нравится Русский язык.<br>\n私は日本語が好きです。<br>\n我爱中文。<br>\nJag älskar Svenska.</p>\n"}, "LastActivityDate":"2013-02-18T18:35:19.887", "Score":"10", "OwnerUser":{"UpVotes":"308", "DownVotes":"10", "Id":"111", "AccountId":"514008", "Views":"172", "Reputation":"5430", "CreationDate":"2011-09-14T09:33:29.710", "DisplayName":"Alenanno", "LastAccessDate":"2014-01-19T00:38:35.883", "AboutMe":"<p>I'm a student majoring in Languages (branch: Linguistics), currently working as a freelance translator. I've recently discovered <a href=\"http://db.tt/WpiKeReH\" rel=\"nofollow\">Dropbox</a> and I'm going to use it for my needs! :)</p>\n\n<p><em><strong>I love</em></strong><br>\nLanguages, Movies (Fantasy, Sci-Fi, Tarantino, etc.), Music, 3D Graphics, books and so on. </p>\n\n<p>Appointed ♦ Moderator Pro Tempore on <a href=\"http://area51.stackexchange.com/proposals/6673/linguistics?referrer=GlDGLdkDYNxMg1X13CJ1vg2\">Linguistics SE</a>, <a href=\"http://area51.stackexchange.com/proposals/6388/chinese-language-usage?referrer=XzTG1Nz01tc01sJEhak_6g2\">Chinese SE</a> and the <a href=\"http://area51.stackexchange.com/proposals/10848/russian-language-usage?referrer=J7IYS3ZUomUDvVVb-6SmDQ2\">Russian SE</a> site. If you're interested in other Stack Exchanges, try the <a href=\"http://area51.stackexchange.com/proposals/42949/italian-language-usage?referrer=ALVtGpK0tjLp1Lw15QCaUA2\">Italian SE</a> site.</p>\n\n<p>I like to lurk on other sites' Metas. <em>Meta is fun!</em> </p>\n\n<p><strong>My feature requests</strong>:</p>\n\n<ol>\n<li><a href=\"http://meta.stackoverflow.com/q/135786/176533\">Alert a moderator when an answer is improved after a post notice</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/138273/176533\">Automatically add chat event to the community bulletin (or make it easier)</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/121363/176533\">Give 10k users the ability to see the total count of flags they've handled</a></li>\n</ol>\n\n<p><strong>Moderator issues</strong>: If you have concerns or want to contact me about my moderation, you can find/ping me either in the <a href=\"http://chat.stackexchange.com/rooms/1336/linguistics\">Linguistics SE chat room</a> or <a href=\"http://chat.stackexchange.com/rooms/1984/chinese-language-and-usage\">CL&amp;U chat room</a>; if I'm not there or I'm \"idle\", just ping me! Please <em>avoid</em> using my personal email for such things. Use the chat rooms.</p>\n\n<hr>\n\n<p><strong>Languages List</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <sup>Languages with  * = learning on my own</sup></p>\n\n<p><strong>Mother Tongue:</strong> Italian, Sardinian;<br>\n<strong>Fluent:</strong> English, Spanish;<br>\n<strong>Less Fluent:</strong> French, German, Russian;<br>\n<strong>Learning:</strong> Japanese*, Chinese*, Swedish*, Greek*, Finnish*;<br>\n<strong>Willing to learn:</strong> Welsh, Korean, Dutch, Arabic, Hebrew, Hindi [to be continued]</p>\n\n<p>Me gusta el Español.<br>\nJ'aime le Français.<br>\nDeutsch gefällt mir.<br>\nМне нравится Русский язык.<br>\n私は日本語が好きです。<br>\n我爱中文。<br>\nJag älskar Svenska.</p>\n"}}