{"Body":"<p>The phenomenon you describe may be <strong><a href=\"http://en.wikipedia.org/wiki/Metathesis_%28linguistics%29\" rel=\"nofollow\">(adjacent) metathesis</a></strong>, which is not infrequent in phonology. Metathesis means \"swapping\". In linguistics, <em>adjacent or local metathesis</em> refers to the swapping of two adjacent sounds at some point in phonological developments. As to why it happens, I know of no formal explanation.</p>\n\n<p>Apparently, there is something in our brains or speech apparatus that makes certain sounds less \"easy\" or pleasant to pronounce in combination with other forms as part of a phonological system (a language), or less easy to remember subconsciously. We are then inclined to various degrees to change pronunciation in a way that renders it closer to our common speech patterns.</p>\n\n<p>A sound can simply be changed, as in the change from older English -th to modern -s in <em>makes</em>; alternatively, adjacent sounds can be swapped, as in <em>iron</em>, which apparently evolved from /(a)irən/ into /aɪə(r)n/ in modern pronunciation: the r and the schwa were swapped.</p>\n\n<p>It can be seen that this is in certain circumstances a natural inclination in us humans by the frequency with which (non-Italian) children pronounce <em>spaghetti</em> as <em>pasghetti</em>; the cause is that <em>ps-</em> does not normally occur in many languages, such as English and Dutch. Languages tend to sometimes transform borrowed foreign words to conform to native phonology (sound patterns).</p>\n\n<hr>\n\n<p>In the case of <em>quartus</em>, <em>-t-</em> is an adjectival suffix. It is possible that at some point a form *<em>kwat(w)rtos</em> existed in Proto-Latin. If so, <a href=\"http://en.wikipedia.org/wiki/Dissimilation\" rel=\"nofollow\">dissimilation</a> may have been the main cause of the metathesis: a <em>t</em> sound twice, especially combined with a <em>w</em> sound twice, tends to disappear or transform in Latin, as in many other languages.</p>\n\n<p>Alternatively, it may just be that the consonant cluster *<em>-t(w)rt-</em> was too \"difficult\" to pronounce, i.e. not conforming to Latin phonology, and hence transformed/simplified into <em>-rt-</em>. But I do not know the intermediate stages.</p>\n", "Id":"3217", "ParentId":"3216", "LastEditorUserId":"82", "CreationDate":"2013-02-17T16:40:06.987", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-02-17T17:02:33.667", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-02-17T17:02:33.667", "Score":"2", "CommentCount":"7", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}