{"OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "comments":[], "Body":"<p>This is not a \"deviation\" at all. Contrary to your understanding, English employs tons of nasalization in its vowels. What it lacks is <em>phonemic</em> nasalization, that is, phonologically nasalized vowels whose distribution is not predictable.</p>\n\n<p>Generally, vowels (and sonorant consonants) in English get phonetically nasalized (i.e. they are pronounced with the velum lowered so that air can escape through the nose) when they are adjacent to nasal consonants. So, the [i] in <em>bead</em> is usually not nasalized, but the [i] in <em>mean</em> is nasalized because it is flanked by nasal consonants. The nasal passage is open for the [m] and stays open through the duration of the vowel and the final [n]. A vowel that is between a nasal consonant and a non-nasal consonant will usually get partially nasalized (more nasalized on the side next to the nasal). This explains why you are hearing the vowels in <em>Marge's</em> and <em>under</em> as nasalized.</p>\n\n<p>Many speakers leave their vela slightly lowered for a majority of the time while they are speaking, resulting in rampant partial nasalization of most of their vowels and sonorants, regardless of whether they are abutted by nasal consonants or not. As an American, I have noticed this to be a pervasive tendency in many dialects of British English (such as the one in your link). This would explain nasalization in words like <em>see</em> (although in this particular case that vowel does not sound nasalized to my ears).</p>\n\n<p>But the important point here is that, in all the cases above, the nasalization of the English vowels does not contribute to the phonological distinctiveness of those vowels. That's why speakers who leave their vela lowered most of the time have no trouble communicating with speakers of the same dialect that don't leave their vela lowered.</p>\n", "Id":"3231", "ParentId":"3230", "CreationDate":"2013-02-19T17:03:23.980", "Score":"13", "PostTypeId":"2", "OwnerUserId":"385", "LastActivityDate":"2013-02-19T17:03:23.980", "CommentCount":"2"}