{"OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "comments":[], "Body":"<p>The OP is making a very common mistake when it comes to comparing languages. If you can find a copy of <a href=\"http://rads.stackoverflow.com/amzn/click/0140260234\">Language Myths by  Laurie Bauer and Peter Trudgill</a>, I suggest you read Myth #2: Some Languages Just aren't Good Enough. If you can't find a copy then <a href=\"http://vagabonddrifter.wordpress.com/2010/05/14/language-myths-some-languages-are-not-just-good-enough/\">this blog</a> should give you the rough idea.</p>\n\n<p>Let's examine the example given in the question: <em>differentiate</em>, <em>differential</em>, <em>differentiation</em> are all collapsed into a single word, 微分. The OP says that this makes the words lose their \"subtle difference\". But what is the difference between these words?</p>\n\n<p><em>Differential</em> is a noun referring to <a href=\"http://en.wikipedia.org/wiki/Differential_%28mathematics%29\">\"a change in the linearization of a function.\"</a> <em>Differentiate</em> is a verb roughly meaning \"find the differential\". Finally, <em>Differentiation</em> is a noun meaning roughly \"the act of finding the differential\".</p>\n\n<p>If memory serves, Mandarin Chinese (like English) has a strict word order meaning that the \"differentiate\" verb form of 微分 should be unambiguous. However, this leave some ambiguity between the \"differential\" and \"differentiation\" forms.</p>\n\n<p>Except, such an ambiguity will most likely be resolved though context meaning that there's no real loss of meaning. Even in English there is no sentence using the word \"differentiation\" that can't be restated using \"differential\". For example, \"Show the differentiation\" could be restated as \"show how to find the differential\". The only reason these multiple noun forms exist is because using \"differential\" constantly could create some aesthetically unpleasing sentences, nothing to do with meaning.</p>\n\n<p>To give a more generic example, imagine a language spoken by a small tribe of primitive fishermen in the Amazon rain forest. They don't have words for \"nuclear power\" or \"the internet\", so that means they're incapable of talking about them, right? Wrong! The wonderful thing about language is it's living and changing. If you said \"nuclear power\" or \"the internet\" to Shakespeare, he'd be dumbfounded. English had to invent those words and if you introduced those concepts to our hypothetical Amazonian fishermen they'd invent a word for it too.</p>\n\n<p>Loanwords are a type of invention too. English had to take the word <a href=\"http://en.wikipedia.org/wiki/Kowtow\">kowtow</a> from Mandarin to describe that act. Similarly, we literally translated the word <a href=\"http://en.wikipedia.org/wiki/Face_%28sociological_concept%29#Chinese\">face</a> to describe the Confucian concept.</p>\n\n<p>Given enough time any language can find a way to describe any concept. Therefore you cannot say that one language is \"unfit\" to describe something.</p>\n\n<p>However, I will offer one proviso: English is used as the international language of science. This is not because other languages are unable to describe scientific concepts but used in order to promote sharing and understanding of scientific works. The Ur-example is <a href=\"http://en.wikipedia.org/wiki/Gregor_Johann_Mendel\">Gregor Mendel</a> who discovered how inheritance worked as early as the 1860s but because he published his work in Hungarian and in an obscure journal, it was not until the 1900s, after his death, that his work was rediscovered and revolutionized the way scientists viewed genetics. Perhaps if he had published in a German or French journal his work would have been recognized sooner.</p>\n", "Id":"3321", "ParentId":"3318", "CreationDate":"2013-03-07T02:39:03.187", "Score":"6", "PostTypeId":"2", "OwnerUserId":"1055", "LastActivityDate":"2013-03-07T02:39:03.187", "CommentCount":"4"}