{"OwnerUser":{"UpVotes":"302", "DownVotes":"1", "Id":"119", "AccountId":"14652", "Views":"52", "Reputation":"3065", "CreationDate":"2011-09-14T14:24:24.227", "DisplayName":"kaleissin", "LastAccessDate":"2014-01-18T22:21:33.313", "AboutMe":"<p>Sysadmin/programmer by day, linguist by night.</p>\n"}, "comments":[], "Body":"<p>Skim \"The Linguistics Wars\" by Harris to get a bit of political history for the field. Then you'll be aware that you might be served only a very small slice of the pie. For a bit of culture/humor, read the \"<a href=\"http://specgram.com/\" rel=\"nofollow\" title=\"Speculative Grammarian\">Speculative Grammarian</a>\". The more linguistics you know, the more funny it gets.</p>\n\n<p>For phonetics, phonetics is great fun if you go in for actually being able to pronounce it all. Will there be any articulatory phonetics? Try to load the entirety of the IPA (International Phonetic Alphabet) into your head anyway. Find a private space with a mirror so you can see what you mouth is doing. There's lots of online more-or-less good resources for learning the IPA, bookwise have a look at the \"Handbook of the International Phonetic Association\", and \"Phonetic symbol guide\" by Pullum. Handy reference works. Phonology is, naturally, less hands-on and come in several schools: optmality theory, autosegemental theory etc. etc., I haven't kept up.</p>\n\n<p>Semantics/pragmatics: \"Understanding utterances\" by Blakemore, and \"Women, Fire and Dangerous Things\" by Lakoff. Then look up Montague-semantics.</p>\n\n<p>Syntax: Now that's the tricky one. There are several frameworks for doing this. If it is claimed that no framework is being used it's probably a variation on Basic Linguistic Theory. See books by RMW Dixon. If there's lots of binary trees it's probably Minimalism. See Chomsky. If boxes, lots of set theory and unification: LFG, HPSG or something else ending in G. See Pollard &amp; Sag, Bresnan, Dalrymple. If matching the same analysis to several languages at once in order to map out the possibilities it's probably some Construction Grammar. Croft's \"Radical Construction Grammar\" is fine but he is not a good writer so be prepared to struggle a little. There's no doubt lots of new frameworks, it seems there's a new one at least twice a decade. </p>\n\n<p>Hmm. Skim Dixon's books, that should give a good overview of all the latinate terms. Analysis goes on top of those. On that note, also get \"A Dictionary of Grammatical Terms in Linguistics\" by Trask.</p>\n", "Id":"3348", "ParentId":"3344", "CommunityOwnedDate":"2013-03-10T13:30:04.713", "CreationDate":"2013-03-10T12:35:35.543", "Score":"2", "PostTypeId":"2", "OwnerUserId":"119", "LastActivityDate":"2013-03-10T12:35:35.543", "CommentCount":"2"}