{"Body":"<p>Since Chinese characters consist of limited sets of strokes which are, in turn, united into different combinations, I think this type of writing would not require too extended a keyboard. In fact, the total number of basic strokes is 9.</p>\n\n<p>Instead, the character input could be done just by these signs, so neither a number of keys nor keyboard measurements would cause any difficulty. </p>\n\n<p>What would be a real pain is how to make the strokes appear accordingly in proper order and at proper places of a character, e.g. when we write â or ê in French layout, we first press ^ and then a corresponding vowel sign. The sequence is 'upper element => lower element', but there can be three or more vertical elements within a Chinese character, not mentioning the fact that there are vertical or falling strokes (elements). </p>\n\n<p>In short, imagine a keyboard with a touchpad-like place in the middle, which is a basic place for a character, with nine buttons for basic strokes on the right and four buttons directing the strokes. Or the other way round: left buttons for strokes, right buttons for directions. </p>\n\n<p>By pressing one of the eight zones at the character touchpad, we choose where to print a basic stroke selected, precisinng the direction of the stroke with the directional keys. </p>\n\n<p>The other problemme would be the stroke order, which is different not only in Japanese and Chinese, but in some varieties of Chinese as well.</p>\n\n<p>So, in fact, the Chinese invention would be even simpler. \nWhat really would be entirely different is the syntax of programming languages and programming logic (especially in object programming).</p>\n\n<p>Oh, and please remember my five per cent for the idea whenever selling it on the market:-)</p>\n", "Id":"3384", "ParentId":"2090", "LastEditorUserId":"1686", "CreationDate":"2013-03-15T12:19:15.647", "OwnerUserId":"1686", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-03-15T12:34:27.053", "LastEditedUser":{"UpVotes":"145", "DownVotes":"36", "ProfileImageUrl":"http://i.stack.imgur.com/rZ1Oc.jpg", "Id":"1686", "AccountId":"2130467", "Views":"63", "Reputation":"1112", "CreationDate":"2013-01-19T17:49:32.827", "DisplayName":"Manjusri", "LastAccessDate":"2014-01-18T20:17:27.900", "AboutMe":"<p>I have no native language. I am more or less getting by in some tongues, and I can read and/or swear in douzens of other languages, but this doesn't mean I am an expert in them. By January 2013 I am 34 and wish to see the latter number growing. </p>\n\n<p>I study [cognitive] psychology and am planning to obtain some certificates in computer languages and programming.</p>\n\n<p>I enjoy horse riding, travelling, good cuisine, green Japanese tea, Russian and Spanish literatures and friendly company.</p>\n\n<p><strong>Fluent In:</strong> Dutch, English, Finnish, French, Russian, Spanish and Swedish.</p>\n\n<p><strong>Less Fluent:</strong> Danish, Estonian, Polish and Bulgarian, </p>\n\n<p><strong>Learning:</strong> Arabic, Chinese, Innuit, Japanese, Komi, Sanskrit, Tibetan and Yoruba.</p>\n\n<p><strong>Planning to Learn:</strong> Tangut, C, C++ &amp; Pascal</p>\n"}, "LastActivityDate":"2013-03-15T12:34:27.053", "Score":"0", "OwnerUser":{"UpVotes":"145", "DownVotes":"36", "ProfileImageUrl":"http://i.stack.imgur.com/rZ1Oc.jpg", "Id":"1686", "AccountId":"2130467", "Views":"63", "Reputation":"1112", "CreationDate":"2013-01-19T17:49:32.827", "DisplayName":"Manjusri", "LastAccessDate":"2014-01-18T20:17:27.900", "AboutMe":"<p>I have no native language. I am more or less getting by in some tongues, and I can read and/or swear in douzens of other languages, but this doesn't mean I am an expert in them. By January 2013 I am 34 and wish to see the latter number growing. </p>\n\n<p>I study [cognitive] psychology and am planning to obtain some certificates in computer languages and programming.</p>\n\n<p>I enjoy horse riding, travelling, good cuisine, green Japanese tea, Russian and Spanish literatures and friendly company.</p>\n\n<p><strong>Fluent In:</strong> Dutch, English, Finnish, French, Russian, Spanish and Swedish.</p>\n\n<p><strong>Less Fluent:</strong> Danish, Estonian, Polish and Bulgarian, </p>\n\n<p><strong>Learning:</strong> Arabic, Chinese, Innuit, Japanese, Komi, Sanskrit, Tibetan and Yoruba.</p>\n\n<p><strong>Planning to Learn:</strong> Tangut, C, C++ &amp; Pascal</p>\n"}}