{"Body":"<p>An asterisk is generally used to indicate that a certain form or construction is <strong>not found in natural language</strong>. To be precise, it means there is insufficient evidence to assume that it could exist or could once have existed in natural language.</p>\n\n<p>When describing <strong>proto-languages</strong>, this usually means that a certain root or word has been reconstructed: based on phonological rules, we think it must have been somewhat like this—but we cannot be sure, as it is always possible that some unique irregularity would result in a different form, and we have no written sources that contain this form. When a form has never been found in a real source, we say it has not been attested; in other words, it is <strong>unattested</strong>. In most proto-languages, <em>all</em> forms are hypothetical, so that they should all be preceded by an asterisk.</p>\n\n<p>With <strong>modern languages</strong>, we usually have plenty of sources to establish whether a certain form is possible. In fact, many linguists make up example sentences when they need to, because many forms and constructions are not at all controversial. So I might use <em>Achilles hated Hector</em> in an article if I needed an example. However, I may also want to use an example that is ungrammatical, i.e. that I believe would never be used naturally in the language under observation. Then I would put an asterisk in front of it:</p>\n\n<blockquote>\n  <p>*Achilles did hated Hector.</p>\n</blockquote>\n\n<p>Note that it depends on context whether a construction is grammatical: if I were writing about standard English, I'd have to use an asterisk; but, if I were writing about a certain dialect where this construction is actually used by some, the asterisk is out of place.</p>\n\n<p>Note also that \"natural language\" is a flexible and sometimes unclear concept; if you are researching English poetry of the 16th century, it is much harder to acquire enough evidence than with modern prose. Context or explanation should make it clear what <em>natural language</em> is supposed to be in a certain text.</p>\n\n<hr>\n\n<p>Most people would use a question mark instead of an asterisk with well-attested languages if the form or construction is doubtful. In proto-languages, the question mark is sometimes used to indicate a form that is even <em>more</em> uncertain than the common hypothetical ones—for example, if I am in doubt as to the most probable form of a certain root.</p>\n\n<p>Some people use the percentage sign to mark something that is only grammatical in a certain non-standard dialect.</p>\n", "Id":"340", "ParentId":"338", "LastEditorUserId":"82", "CreationDate":"2011-09-21T00:49:07.963", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-10-13T03:31:12.883", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-10-13T03:31:12.883", "Score":"27", "CommentCount":"2", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}