{"Body":"<p>Before attempting to address this question, we need to be clear on what is meant by <strong><em>voiced</em></strong>. The concepts of <em>phonological</em> voicing and <em>phonetic</em> voicing are often conflated, which leads to many misunderstandings among students of linguistics. As I mentioned in my comment above, you might want to read my answer to a related question about <a href=\"http://linguistics.stackexchange.com/questions/2340/whispered-voiced-consonents\">Whispered Voiced Consonants</a>.</p>\n\n<p>When we talk about /b/, we are referring to a phoneme, and [+voice] is a phonological feature that it bears. This feature can be thought of as a mnemonic label that is derived from the fact that, in some environments, this phoneme can be distinguished from the phoneme /p/ by the presence of phonetic voicing during the realization of the former but not during the realization of the latter. One common environment where this is true in English is in the middle of a word between vowels (e.g. <em>rebel</em> vs. <em>repel</em>). You can check this by recording a native speaker saying these words and looking in the spectrograms for a voice bar during the stop closure in one case but not the other.</p>\n\n<p>However, there are many environments in which /b/ is not realized with voicing during the closure, or in which it is only partly voiced. For example, for many speakers, at the beginning of an utterance, both /p/ and /b/ are realized without any voicing during the closure. It turns out that what is more relevant in distinguishing these phonemes in utterance-initial position is their <em>voice onset time</em>. Phonetic voicing starts right away after the closure of the /b/ but there is a delay in phonetic voicing in the case of the /p/ (there is aspiration noise in place of the phonetic voicing during this period). If we were to assign a narrow phonetic transcription to these sounds, we might actually consider this realization of /b/ to be [p] and this realization of /p/ to be [pʰ]. So, <strong>a stickler might say that the <em>phone</em> [b] must be produced with vibrating vocal folds, but the <em>phoneme</em> /b/ certainly can be realized without vocal fold vibration during the closure.</strong></p>\n\n<p>Even for /z/ and /s/, the distinction does not always lie in phonetic voicing. If you record a native speaker saying <em>Say 'course' for me</em> and <em>Say 'cores' for me</em>, where the target word ends in /s/ in the first case but /z/ in the second case, chances are you won't actually see much of a voice bar in the realization of the /z/. Instead, the more salient difference will be in the duration of the vocalic stretch before the fricative, and in the duration of the fricative itself. You may also see that the phonetic voicing from the vowel turns off a bit earlier before the [s] than it does before the [z].</p>\n\n<p>So /b/, /d/, and /z/ can be distinguished from /p/, /t/, and /s/, respectively by the distinctive feature [+/-voiced] (although some prefer the use of <em>lenis</em> and <em>fortis</em>, as @Aspinea mentioned). But distinctive features are a way of categorizing the phonological behavior of segments, and while their names have been derived from the articulatory and acoustic characteristics of the phonemes to which they are assigned, they should not be considered literal phonetic descriptors.</p>\n", "Id":"3401", "ParentId":"3398", "LastEditorUserId":"385", "CreationDate":"2013-03-18T15:24:04.537", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-03-18T18:02:21.467", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2013-03-18T18:02:21.467", "Score":"6", "CommentCount":"2", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}