{"Body":"<p>The following features are characteristic of Insular Celtic, a subfamily of Indo-European spoken in Great Britain and Ireland.  They are also characteristic of the so-called Hamito-Semitic languages of North Africa, a subfamily of Afro-Asiatic.  Not every Celtic or H-S language has all of the features, but they are fairly typical of the family as a whole, especially in their most archaic variants (e.g. Old Irish).</p>\n\n<ol>\n<li>Conjugated prepositions: [Prep + Pronominal Obj] is a single word.</li>\n<li>Word order: VSO, N - Modifier, Prepositions</li>\n<li>Relative clause linker: invariant particle, not relative pronoun</li>\n<li>Relative clause technique (oblique): copying, not gapping, e.g. \"the bed that [ I slept in <strong>it</strong> ]\".</li>\n<li>Special form of the verb peculiar to relative clauses.</li>\n<li>Polypersonal verb (subject and object both marked).</li>\n<li>Infixing/suffixing alternation: Object marker is infixed to the verb if there is a preverb, suffixed otherwise.</li>\n<li>Definite article in genitive embeddings may occur only on the embedded noun: \"house [the-man]\" = the man's house.</li>\n<li>Nonconcord of verb with full-NP subject: verb can fail to agree with the subject, depending on word order.</li>\n<li>Verbal Noun (VN: object in genitive), not Infinitive (object in same case as with finite verb).</li>\n<li>Predicative particle: in copular or nominal sentences, the predicate is marked with a participle homophonous to a \"local\" preposition: \"He (is) <strong>in</strong> a farmer\" = He is a farmer.</li>\n<li>Prepositional periphrastic: BE + Prep + VN, e.g. \"He is at singing\".</li>\n<li>DO periphrastic: DO + VN, e.g. \"He does singing\".</li>\n<li>Notional adverbial clause expressed as \"and\" + finite clause.</li>\n<li>Nonfinite forms usable instead of finite main-clause verb.</li>\n<li>Word-initial phonological change, expressing a variety of syntactic functions.</li>\n<li>Idiomatic use of kin terms in genitive constructions, e.g. \"son of sending\" = messenger, \"son of land\" = wolf.</li>\n</ol>\n\n<p>(Source: Orin Gensler, <em>A Typological Evaluation of Celtic/Hamito-Semitic Parallels</em>, Berkeley, 1993.)</p>\n\n<p>Note that this distinctive feature-complex is not typical of other Indo-European languages, and does not seem to be present in Continental Celtic.  This has led to the supposition of a substrate/sprachbund situation in the ancient British isles: the language spoken by the inhabitants before the arrival of Celtic was in heavy contact with Afro-Asiatic speakers and shared these distinctive features, in the usual sprachbundy way; this pre-Celtic language influenced the Celtic language imposed by the Indo-European conquerors in the usual substratal way.</p>\n\n<p>No other language groups of the world seem to share this set of 17 features to any statistically significant degree; this is unlikely to be the working-out of typological universals.</p>\n", "Id":"346", "ParentId":"335", "LastEditorUserId":"210", "CreationDate":"2011-09-21T05:55:28.960", "OwnerUserId":"210", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-21T06:58:05.037", "LastEditedUser":{"UpVotes":"15", "WebsiteUrl":"", "DownVotes":"0", "Id":"210", "AccountId":"315775", "Views":"1", "Reputation":"246", "CreationDate":"2011-09-21T05:26:24.817", "DisplayName":"librik", "LastAccessDate":"2014-01-18T21:25:28.900", "AboutMe":"<p>Undergrad at Illinois doing Math and Computer Science in the '80s.</p>\n\n<p>Grad at Berkeley doing Linguistics (Celtic &amp; Cognitive) in the '90s.</p>\n\n<p>Now doing Math and Computer Science for work, and Linguistics for fun!</p>\n"}, "LastActivityDate":"2011-09-21T06:58:05.037", "Score":"13", "CommentCount":"6", "OwnerUser":{"UpVotes":"15", "WebsiteUrl":"", "DownVotes":"0", "Id":"210", "AccountId":"315775", "Views":"1", "Reputation":"246", "CreationDate":"2011-09-21T05:26:24.817", "DisplayName":"librik", "LastAccessDate":"2014-01-18T21:25:28.900", "AboutMe":"<p>Undergrad at Illinois doing Math and Computer Science in the '80s.</p>\n\n<p>Grad at Berkeley doing Linguistics (Celtic &amp; Cognitive) in the '90s.</p>\n\n<p>Now doing Math and Computer Science for work, and Linguistics for fun!</p>\n"}}