{"Body":"<p>It's related to the concept of time. You know how <strong>the present</strong> refers to the exact moment we live in? Everything after it (i.e. everything that hasn't happened yet) is called <strong>the future</strong> and everything before it (i.e. everything that has already happened) is called <strong>the past</strong>. Also, you need to realize that the future will eventually become the past.</p>\n\n<p>For example, image it's currently Wednesday. Today, Wednesday, is the present. Yesterday, Tuesday, is the past and tomorrow, Thursday, is the future. Now imagine it's Thursday. Is Thursday still the future? No, it's now the present. And when it becomes Friday then Thursday will be the past. So <em>on Wednesday</em> Thursday was \"the future\" but <em>on Friday</em>, Thursday is \"the past\".</p>\n\n<p><strong>Speech time</strong> (which I'd probably write as \"time of speech\") refers to the exact moment a person speaks/writes anything. <strong>Tense</strong> tells use when an event is happening in relation to when the person is speaking. So <em>on Wednesday</em>, I would use <em>future tense</em> to talk about events on Thursday (e.g. \"I <strong>will</strong> go to the store on Thursday\"). <em>On Friday</em> I need to use <em>past tense</em> to talk about Thursday (e.g. \"I <strong>went</strong> to the store on Thursday\").</p>\n\n<p>Here is where is gets tricky and here is where I think your problem is: If it is Wednesday and I am talking about Thursday I must use the future tense <em>but</em> what if I wrote my message, \"I will go to the store on Thursday\", in an email and sent it to you but you didn't read it until Friday? <em>To you</em> Thursday is in the past but I still used future tense. The reason is that  at the time I wrote the message (the <strong>speech time</strong>) Thursday (when the <strong>event</strong> was to take place) was still in the future. However, time moved forward and by the time <em>you</em> read it, Thursday was in the past. However, this does not affect the grammatical of my message at all.</p>\n\n<p>In the context of the Harry Potter quote, <em>the story</em> takes place in the past. That is why <em>the narrator</em> (the person telling the story to you, the reader) uses past tense. But the <em>events</em> the characters talk about are happening <em>at the same time as they are speaking about them</em> (i.e. the <strong>event time</strong> is the same as the <strong>speech time</strong>) so even though to you, the reader, the events are all in the past, the characters must use present or future tense because <em>to them</em> the events either are happening at that moment or have yet to happen.</p>\n\n<p>In summary, tense is decided by the <em>temporal relationship</em> between when a <strong>speech</strong> is made (the <strong>speech time</strong>) and when the <strong>event</strong> it talks about takes place (the <strong>event time</strong>). The three simplest of these are past, present, and future.</p>\n\n<p>Obviously tenses are more complicated than just past, present, future. Once you feel you understand the basic principle, check out <a href=\"http://en.wikipedia.org/wiki/English_tenses\" rel=\"nofollow\">this Wikipedia article</a> for more information on Tenses in English.</p>\n", "Id":"3467", "ParentId":"3466", "LastEditorUserId":"1055", "CreationDate":"2013-03-30T05:19:44.337", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-03-30T11:22:50.393", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2013-03-30T11:22:50.393", "Score":"6", "CommentCount":"6", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}