{"OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}, "comments":[], "Body":"<p>I'm not an expert, so please judge this answer accordingly.  </p>\n\n<p>I don't think that your question has an answer.  The words \"basic\" and \"essential\" are too vague;  one cannot test a constituent for \"basic-ness\" or \"essential-ness.\"  </p>\n\n<p>For the sake of giving you the benefit of the doubt, I'm going to assume that you are talking about elementary units of analysis.   In recipes, for example, ingredients (like flour, sugar, ground beef) and procedures (like basting, broiling, stirring, or baking) would be elementary units of analysis:  a finite set of things in terms of which all recipes can be analyzed.   </p>\n\n<p>Things get more complicated when it comes to identifying elementary units of analysis for linguistics. </p>\n\n<p>Words can't be such units, because, as one expert recently pointed out to me, \"word\" is a popular and hard-to-define concept that academic linguists don't need.   </p>\n\n<p>Referents can't be such units, because referents constitute all the things and states of affairs that language can be used to refer to--in other words, almost everything in the universe that humans know about.   </p>\n\n<p>I don't think that mappings between morphemes and referents can be elementary units of analysis, because meaning and reference are not identical and the relationship between them is best discussed by experts, and because morphemes aren't neatly mapped onto meanings in one-to-one correspondence, and the mappings between morphemes and meanings varies from language to language.      </p>\n\n<p>Also, language has different types of putative units of analysis, because language has different components.  Phonology (sound pattern rules), morpho-syntax (grammatical structure), and semantics (meaning) would each need their own units of analysis.   When it comes to semantics, I don't think that anyone has identified a finite set of semantic primitives in terms of which all morpheme meanings can be analyzed.  To my admittedly limited knowledge, no one has even established that such a list is possible.   </p>\n\n<p>Your post suggests that you could profit from some first-year instruction in linguistics, or some introductory texts.   You might want to look up \"phonetics,\" \"phonology,\" \"morphology,\" \"syntax,\" \"semantics,\" and \"pragmatics.\"       </p>\n", "Id":"3483", "ParentId":"3482", "CreationDate":"2013-04-02T02:41:45.157", "Score":"3", "PostTypeId":"2", "OwnerUserId":"790", "LastActivityDate":"2013-04-02T02:41:45.157", "CommentCount":"2"}