{"OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1937", "AccountId":"2603690", "Views":"0", "Reputation":"19", "CreationDate":"2013-04-07T19:54:07.877", "DisplayName":"Mihai S.", "LastAccessDate":"2013-04-07T19:54:07.877"}, "comments":[], "Body":"<p>To be all fair and square to both sides of this discussion, the actual truth can go either way.</p>\n\n<p>However, in defense of those who say that Dacian was already related to Latin, it makes more sense than you think, if you but try to think it over.  This may explain the many dissimilarities between Romanian and other Romance languages, mainly why so many Romanian words have roots in Latin words different than their French, Spanish, Italian etc. counterparts.  Roman Emperor Trajan himself said that he was from a Dacian (or related) village, where as a child he spoke a sort of Latin, much like all Dacians from other neighboring villages - this can be found in his correspondence and journals.</p>\n\n<p>Of course that such a theory has a lot of opposition and I understand why that is so.  If this theory held, it would refute 99% of all doctoral studies, books, and textbooks about Romanians' origins and their Roman-Dacian heritage.  This would spell a big <em>Ouch!</em> for those who issued these studies.  Campaigns to change the idea of Romanian heritage have taken place before, and not just in Romania.  Before the 18-19th centuries, many sought to restore a Greater Dacia; after that, many sought to create a Greater Romania (which happened for a short spell of time).  During Communism, they sought to teach Romanians of their Slavic heritage (thank the Soviets for that), although Romanian and Russian barely had anything in common, as opposed to the other Romance languages.  After the 1989 fall of Communism, we returned to the idea of purely Roman heritage while seeking the support of the West and EU accession.  I don't know what Dacians did wrong to be sidelined as an uncivilized people (as I, myself, was taught they were, in school).  Interestingly enough, all invaders and foreign occupation have been described in Romanian history textbooks as evil, except the Romans.  In terms of defining foreign occupation, what makes the Romans so much better than the Russians, the Poles, the Ottomans, or the Austro-Hungarians?  The Romans were as much of an invading power as all the other ones.  Do you see the politics in this?  I know that I am biased, but I try not to be.  In the end, all history is more or less biased, because we explain it in accordance with our current knowledge, perceptions, and feelings.</p>\n\n<p>If we but apply common sense, here's one fact we are all aware of:  The Roman Empire conquered only about 14% of the Dacian kingdom, which it occupied for only ~160 years.  Comparatively, the Romans occupied other areas of Europe, Asia, and Africa for even 400-800 years at a time.  For some reason, as stated by many historians, Dacians seem to have forgotten their language completely in the 160-year occupation of only 14% of Dacia, while other peoples who were under Roman occupation for many more centuries seem to have kept their language just fine.  To me, that makes no sense.</p>\n\n<p>The Dacian kingdom was pretty well developed when it was conquered (partially) by the Romans.  Hence all the artisan work that has been discovered, the complex decorations on Dacian battle shields, Dacian fortifications and other ruins, the over 100 statues of Dacians exhibited in Rome (more than any other people conquered by the Romans), the 4 statues of Dacians guarding Constantine's arch, and the references to the Dacians made in the writings of Ptolemy, Socrates, Pythagoras, Herodotus and others as a well-organized, fearless people.  They were well known at the beginning of our era as a strong kingdom that often plundered the Roman Empire before they were conquered, during Roman occupation, and even after the Aurelian retreat in 271 AD (although to a much lesser extent).  After the Aurelian retreat south of the Danube they struck a deal with the Romans to protect the Roman Danubian borders from invaders (I'm not sure how well that played out).</p>\n\n<p>References to Romanians' being referred to as <em>Dacians</em> date all the way to the 18th century.  Horia, a famous Romanian revolutionary of that century, is depicted on a painting made for the Emperor of Austria at the time (whom he met at least three times at his court) as <em>Rex Daciae</em> (King of Dacia).  Horia was known as <em>Rex Daciae</em>, being known to seek the reunification of old Dacia.</p>\n\n<p>The idea that Romanians are pure descendants of the Romans was implanted in the minds of Romanians especially in Transylvania, by Transylvanian Romanian scholars who sought the support of the West, particularly France and the Vatican, in their struggle against Hungarian occupation and persecution of Transylvanian Romanians.  It makes perfect sense to seek such a relationship with these European (and heavily Catholic) powers when the Catholic Church was clearly at odds with the Protestant movement (later on), the Eastern Orthodox Church, and the Ottoman Empire (the Muslim threat).  The Orthodox Church was considered a Slavic church by most; the Slavs were not liked because of their connection to the great migrations that had heavily impaired European civilization and Catholic development, previously.  Mind you, the pan-European movement to latinize language occurred mostly after the Great Schism (1054) between the Vatican and Constantinople.  Therefore, the Dacians and proto-Romanians could not have been as heavily affected by Carolingian renaissance, or by the Catholic campaign of the Middle Ages that sought to instill the importance of Latin in the sociopolitical relations of Europe.</p>\n\n<p>Moreover, the University of Hamburg, Germany, ran some paleogenetic tests - that is, they compared the DNA of bones dated up to ~6000 BC with the DNA of Romanians nowadays.  The resemblance was staggering (around 75%).  At the same time, they compared the DNA of Romanians with the DNA of Italians... only about 5-6% resemblance.  There were more similarities between Romanians and Italians from Northern Italy, but nowhere near 75%.</p>\n\n<p>Apparently, Micheál Ledwith, adviser to Pope John Paul II, having had access to the Vatican Library, stated that indeed Romanian is not resulted from Latin, but rather that both Latin and Romanian stem from the same mother language, Thracian.  Basically, that means that Dacian and Latin were sister languages long before Dacians and Romans met.  When Dacians surrendered to Rome, after years-long wars, there is no mention of any translators mediating the peace talks, which would have normally been the case.  I conclude from this that Latin was a very important adstratum to the evolution of Romanian (as were the surrounding Slavic languages), but no more than that.</p>\n\n<p>Either way, all of this can be interpreted both ways...  There is a lot more to be told about these things, but I don't think I will.  If you speak Romanian, you may want to watch these two documentaries released last year about the Dacians and Romanians' heritage.  There are also versions on Youtube with English subtitles.</p>\n\n<p>\"Dacii - Adevaruri tulburatoare\" - \n<a href=\"https://www.youtube.com/watch?feature=player_embedded&amp;v=duj_84hnc58\" rel=\"nofollow\">https://www.youtube.com/watch?feature=player_embedded&amp;v=duj_84hnc58</a></p>\n\n<p>\"Dacii - Noi dezvăluiri\" - \n<a href=\"https://www.youtube.com/watch?feature=player_embedded&amp;v=3yBrbMrAppw\" rel=\"nofollow\">https://www.youtube.com/watch?feature=player_embedded&amp;v=3yBrbMrAppw</a></p>\n\n<p>PS - I am Romanian and I'm studying linguistics (particularly French).  I am proud to be Romanian and am proud of my heritage.  I don't dispute the Roman contribution to world civilization and to the Dacian people, by all means they were a great political and cultural empire.  But I do dispute the idea that the main ancestors of Romanians are the Romans.  For reasons aforementioned and others that I will not mention at this point, I do believe that there is more to Romanian heritage than the Romans and the Latin language.  I believe that the Dacian and Latin languages were closely related, enough that there was never a complete latinization and subsequent replacement of the Dacian language by Latin.  As for the Romanian words asserted to be Dacian, they are present in other Balkan countries/languages as well, and may very well be of Thracian descent (hence the pan-Balkan similitude).  You will find specific sources to the things I just mentioned in the above documentaries (which you can find on Youtube with English subtitles).</p>\n", "Id":"3500", "ParentId":"375", "CreationDate":"2013-04-07T19:54:07.877", "Score":"1", "PostTypeId":"2", "OwnerUserId":"1937", "LastActivityDate":"2013-04-07T19:54:07.877", "CommentCount":"1"}