{"Body":"<p>Though it doesn't exactly bring an answer to your question, I hope this can contribute to your reflexion.</p>\n\n<p>People suffering of depression are usually told to go to a shrink. In some european countries (esp. in France) cognitive behavioral therapies are not common, and patients have to go for a psychotherapy. When doing a psychotherapy, you can talk of anything you want with your shrink, but you have to express anything you've thought, experienced or felt through <em>words</em>, symbols and stylistic devices (when you discuss your dreams, for instance)</p>\n\n<p>Even though it can be an efficient treatment for most people, psychotherapies show their limits when it comes to people who are not at ease with language (not all but some patients with low education ; also young children), as they can't <em>think</em> their condition <em>through words</em>. \nThat doesn't mean they are stupid or that it is impossible to cure them. It just means that language is not the way for them to experience the world.</p>\n\n<p>Other kinds of therapy work for these people, in particular through art. Painting can be a more natural way for these people to 1/ experience and 2/ express how they feel.</p>\n", "Id":"3518", "ParentId":"3200", "LastEditorUserId":"1946", "CreationDate":"2013-04-10T19:29:07.427", "OwnerUserId":"1946", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-04-10T19:40:27.950", "LastEditedUser":{"UpVotes":"0", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/QGx5Y.jpg", "Id":"1946", "AccountId":"2616577", "Views":"0", "Reputation":"1", "CreationDate":"2013-04-10T18:58:05.473", "DisplayName":"Zwibir1st", "LastAccessDate":"2013-04-11T08:56:33.347"}, "LastActivityDate":"2013-04-10T19:40:27.950", "Score":"0", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/QGx5Y.jpg", "Id":"1946", "AccountId":"2616577", "Views":"0", "Reputation":"1", "CreationDate":"2013-04-10T18:58:05.473", "DisplayName":"Zwibir1st", "LastAccessDate":"2013-04-11T08:56:33.347"}}