{"Body":"<p><em>(I don't know that this is really a linguistics question at all. It's probably more to do with philosophy or sociology but I assume it would have to be on topic on an <a href=\"http://area51.stackexchange.com/proposals/13148/esperanto-language-usage\">Esperanto Stack Exchange</a> so I'm going to answer it on the basis that the question could be migrated to the Esperanto site if and when it appears.)</em></p>\n\n<p><strong>How would a new language foster those things?</strong></p>\n\n<ol>\n<li>Easy to Learn: By being free of regularities and using roots and morphemes already common among languages.</li>\n<li>Politically neutral: By not being the language of a single people, place, religion, or viewpoint.</li>\n<li>Peace and international understanding between people with different regional and/or national languages: By giving them an alternative language to use that all of them know and none of them own. Thus no language barrier. Thus understanding. Thus (hopefully) peace.</li>\n</ol>\n\n<p><strong>Why won't the current languages do?</strong></p>\n\n<ol>\n<li>Easy to Learn: All current languages are irregular and have varying degrees of complex arbitrary rules. Many include sounds which are difficult for speakers of other languages to produce.</li>\n<li>Politically neutral: Existing languages all belong to one or more of a certain ethnicity, race, nationality, religion, or viewpoint that not all other people share. People are not keen to adopt the language of a perceived enemy.</li>\n<li>Peace and international understanding between people with different regional and/or national languages: Mostly because of 2.</li>\n</ol>\n\n<p><strong>Did the advocates subscribe to the Sapir-Whorf view of linguistic determinism?</strong></p>\n\n<p>I don't believe it had to do with the Sapir-Whorf hypothesis whereby a new language might be created which by being able to express only certain things would make it possible to only think those given things.</p>\n\n<p>Rather I believe the creators of Esperanto feel that different groups speaking different languages are a barrier to communication between groups which leads to misunderstandings between them. The idea was when all people can communicate with each other without the use of translators and interpreters who cannot always be trusted that it will be easier to identify with one another and thus reduce the risk of misunderstanding, conflict, and war.</p>\n\n<p><strong>Since that hypothesis has now been widely rejected, what are the motivations of the Esperanto people today?</strong></p>\n\n<p>No doubt some still believe an international language if widely adopted will lead us to understand each other and stop warring with each other. Others want to learn a language and it's supposedly easy. Others think it's cool to learn a constructed language and this is the most widely used. But I'm sure there are almost as many reasons people speak Esperanto as there are people who speak Esperanto.</p>\n", "Id":"355", "ParentId":"354", "LastEditorUserId":"51", "CreationDate":"2011-09-21T13:41:27.927", "OwnerUserId":"51", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-21T14:07:44.743", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2011-09-21T14:07:44.743", "Score":"5", "CommentCount":"3", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}