{"OwnerUser":{"UpVotes":"132", "WebsiteUrl":"http://jsbangs.com", "Id":"91", "AccountId":"5121", "CreationDate":"2011-09-14T01:49:40.413", "AboutMe":"<p>I have a degree in Linguistics, but I work as a programmer. Most of my expertise about English is self-taught, plus lots of random trivia I've acquired here and there.</p>\n\n<p>This is my favorite EL&amp;U comment ever:</p>\n\n<blockquote>\n  <p>This isn't really a question about English so much as a question about hugs. <a href=\"http://english.stackexchange.com/questions/33121/whats-the-meaning-of-large-hug-in-definition-of-bearhug\">Source</a></p>\n</blockquote>\n", "Age":"32", "Location":"United States", "DownVotes":"16", "Views":"34", "Reputation":"1443", "DisplayName":"JSBձոգչ", "LastAccessDate":"2014-01-18T20:22:40.170"}, "comments":[], "Body":"<p>There are two things which conspired to eliminate most of the English verbal morphology:</p>\n\n<p><strong>Sound changes</strong>, especially the reduction and loss of unstressed final syllables, meant that verb forms that had been distinct in Anglo-Saxon became identical by Middle English, and lose their final bits of distinctiveness by Early Modern English. This accounts for the 1sg and all of the plural forms becoming identical in the present tense.</p>\n\n<p><strong>Social changes</strong> caused the old 2sg with <em>thou</em>, which had a distinct verbal ending in <em>-st</em>, to fall out in favor of <em>you</em>. <a href=\"http://english.stackexchange.com/questions/9780/did-english-ever-have-a-formal-version-of-you/9782#9782\">This has been discussed in detail on English.SE.</a> </p>\n\n<p>The collusion of these two forces means that only the lonely 3sg form remains distinct in English.</p>\n\n<p>Note that this isn't really unique to English, either. French has suffered a similar loss of unstressed final syllables, which means that in speech the French verb has lost most of its distinct forms. French spelling obscures this fact, though, as do conservative French grammar materials.</p>\n", "Id":"358", "ParentId":"356", "CreationDate":"2011-09-21T14:34:39.873", "Score":"14", "PostTypeId":"2", "OwnerUserId":"91", "LastActivityDate":"2011-09-21T14:34:39.873", "CommentCount":"9"}