{"Body":"<p>Your question might be based on some false assumptions or gaps in your linguistics knowledge.</p>\n\n<p>Firstly you need to know about linguistic typology, specifically morphological typology.</p>\n\n<p>Conjugation is a type of verb morphology in inflected languages.</p>\n\n<p>Languages are sometimes said to move from one morphological typology to the next in a cyclical pattern.</p>\n\n<p>English has moved further down the path away from inflection than some of its siblings, but others of its siblings are doing the same.</p>\n\n<p>These typologies are not as neat as they are sometimes made out to be which is why English and Japanese both don't fit neatly, but in different ways.</p>\n\n<p>In inflected and agglutinating languages, the endings can cover a concept of agreement and there are different things with which to agree. Number is one, person is another. These do not all have to be present in a given language just because it has a certain morphological typology.</p>\n\n<p>As for why English is losing some of its inflection, besides this being a trend for inflected languages generally, it has been suggested that one reason was that the Frisian and Norse languages which have both played a part in English's history had a lot in common but used similar inflections in different ways thus weakening them through ambiguity, making them susceptible to being lost.</p>\n\n<p>As for the side question, the languages you invited comparison with, Chinese is an isolating or analytic language with no inflections and arguably no affixation. Japanese is of mixed type where its verbal system in agglutinating which means words take multiple endings attached to each other each with a meaning rather than inflectional where one ending encapsulates several meanings. Japanese is analytic in its noun system though since it uses separate particles/postpositions rather than endings.</p>\n", "Id":"359", "ParentId":"356", "LastEditorUserId":"51", "CreationDate":"2011-09-21T14:42:21.347", "OwnerUserId":"51", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-07-29T08:38:13.823", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2012-07-29T08:38:13.823", "Score":"4", "CommentCount":"1", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}