{"Body":"<p>Anixx, with all due respect, as a \"native Russian speaker\" you'd be the last person I'd trust as to which language is more capable of inflection.  The suggestion that Russian has words that would require an entire English page to translate is completely ridiculous. You write English very well, but you may not understand some of the spoken subtleties that convey these \"overtones\" you refer to.  It is possible English accomplishes this through more subtle means than words: slight pauses, inflections, even minor dialect code-switchings.  But that doesn't mean English is unable to convey nuance, it just means you don't recognize it.  Ultimately language must reflect the speakers state of mind: your post inadvertently implies English speakers somehow have a lower state of mind than Russian speakers.  (Obviously, some of them do! <a href=\"http://www.youtube.com/watch?v=6dlyCTswYH0\" rel=\"nofollow\">http://www.youtube.com/watch?v=6dlyCTswYH0</a>)  It could also be cultural and pedagogic.  If you're in the UK, speaking about certain things or speaking with a certain high degree of \"resolution\" about certain subjects, to use your word, is considered declassé.  Heard of \"omit needless words\"?</p>\n\n<p>This also has much to do with the speaker's overall level of literacy; while an NFL football team and the 1920s Bloomsbury group would be mutually intelligible, they wouldn't have much to say to each other.  And subtleties would be completely lost.</p>\n", "Id":"3603", "ParentId":"2550", "LastEditorUserId":"51", "CreationDate":"2013-04-23T11:52:51.207", "OwnerUserId":"1990", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-05-05T22:50:44.113", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2013-05-05T22:50:44.113", "Score":"2", "CommentCount":"3", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1990", "AccountId":"2674447", "Views":"0", "Reputation":"29", "CreationDate":"2013-04-23T11:52:51.207", "DisplayName":"Don in California", "LastAccessDate":"2013-04-24T00:15:24.933"}}