{"Body":"<p>I'll attempt an answer.</p>\n\n<p>The key issue is the contrast between lay intuition, and mathematical logic. Lay intuition tells us that nouns and verbs are the most 'contentful' parts of a sentence. Mathematical logic brings its rules for operators and their scopes.</p>\n\n<p>If we have the expression <code>∃x(F(x))</code>, we can't have the <code>x</code> scoping wider than the outermost parentheses here. If an <code>x</code> had some sort of a universal scope, for example, over <code>G</code> too in <code>G(x)∧∃x(F(x))</code>, we'd soon have a formalism that only talks about <em>constant terms</em> in the universe. Such <code>x</code>s would be useless as variables.</p>\n\n<p>Now, note that the logical terms that we introduce for describing sentences are based on the <a href=\"http://en.wikipedia.org/wiki/Principle_of_compositionality\" rel=\"nofollow\">principle of compositionality</a>. If we had used <code>\"man\" =&gt; λx.man(x)</code>, and <code>\"some\" =&gt; λF∃x.F(x)</code> to derive <code>\"some man\" =&gt; ∃x.man(x)</code>, this would not correspond to what we understand of the phrase \"some man\". Instead, it would correspond to \"there is a man\".</p>\n\n<p>The proper expression for \"some\" would be <code>λPλQ∃x.P(x)∧Q(x)</code>. So, <code>\"some man\" =&gt; λQ∃x.man(x)∧Q(x)</code>, and (after a bit of α-conversion to avoid name clashes) <code>\"some woman\" =&gt; λR∃y.woman(y)∧R(y)</code>.</p>\n\n<p>Here are two more pieces of the puzzle: <code>\"visit\" =&gt; λSλu.S(λv(visit(v,u)))</code>, and <code>\"and\" =&gt; λHλJ.H∧J</code>.</p>\n\n<p>We now have NPs that have become functions that accept Vs and VPs as arguments. Determiners, that play a subordinate role in Phrase Structures, play a key role here in controlling the scope of variables, and the order in which functions apply over arguments.</p>\n\n<p>Given this, if you were to apply the <em>object</em> over the verb, and then apply the <em>subject</em> over the resultant, you'd have the man and the woman each visiting a garden, that may or may not be the same garden. However, if you were to apply the <em>subject</em> over the verb, and then apply the <em>object</em> over the resultant, you'd have them both visiting the same garden.</p>\n\n<p>In all this, we haven't brought in <strong>(Neo-)Davidsonian Event semantics</strong>, so we have made no commitments at all about whether or not the visit(s) to the garden(s) happened at the same time.</p>\n", "Id":"3614", "ParentId":"3612", "LastEditorUserId":"126", "CreationDate":"2013-04-27T14:01:00.647", "OwnerUserId":"126", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-04-27T18:56:23.347", "LastEditedUser":{"UpVotes":"94", "DownVotes":"21", "Id":"126", "AccountId":"154977", "Views":"23", "Reputation":"1354", "CreationDate":"2011-09-14T15:07:55.557", "DisplayName":"prash", "LastAccessDate":"2014-01-18T18:45:53.780"}, "LastActivityDate":"2013-04-27T18:56:23.347", "Score":"2", "CommentCount":"11", "OwnerUser":{"UpVotes":"94", "DownVotes":"21", "Id":"126", "AccountId":"154977", "Views":"23", "Reputation":"1354", "CreationDate":"2011-09-14T15:07:55.557", "DisplayName":"prash", "LastAccessDate":"2014-01-18T18:45:53.780"}}