{"Body":"<p>English (and most other Western-European languages) adopted many words from Latin and Greek throughout history, because especially Latin was the Lingua Franca all through Antiquity, the Middle Ages, the Renaissance, and later.</p>\n\n<p>However, English has many more words borrowed from Latin than other Germanic languages, which it owes to the conquest of England by the Normans in the year 1066. The Normans spoke Norman French, which was still much closer to Latin than modern French, especially in spelling. From then on, French was used as the language of administration for a while, and much of this was incorporated into English even as the influence of Norman culture in England waned.</p>\n\n<p>Note that, very, very long ago, in prehistoric times, the Germanic and Italic branches (the ancestor of Latin) diverged from the (reconstructed) proto-language called Proto-Indo-European. That's why e.g. English, Greek, Russian, Persian, Urdu, and Latin have certain things in common, although most similarities are now only apparent to the trained eye. The similarities you see between English and Latin are mostly caused by what happened after 1066.</p>\n", "Id":"3847", "ParentId":"3843", "LastEditorUserId":"82", "CreationDate":"2013-06-11T21:30:28.417", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-06-23T15:52:00.010", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-06-23T15:52:00.010", "Score":"7", "CommentCount":"6", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}