{"comments":[], "Body":"<p>Latin and Greek are related due to both being descended from the same prehistoric ancestor language. English also shares a common prehistoric ancestor with Latin and Greek.</p>\n\n<p>Most languages have a single origin (though creoles and mixed languages have two).</p>\n\n<p>But the origins of a language need not be the origins of each and every word. English has borrowed words from very many languages but from French it has borrowed <em>en masse</em> due to the Normans, who spoke an old variety of French, invading and ruling England almost a millenium ago.</p>\n\n<p>The grammar and core vocabulary of English have origins in Germanic.</p>\n\n<p>Many English words have origins outside English. Many of those had their origins in Norman French.</p>\n\n<p>Norman French, of course has Latin as its origin.</p>\n\n<p>So it's not correct to say \"English has both Latin and English origins\". Origin means starting point and the Norman borrowing happened much later than the starting point of English, though still in a remote time from our point of view.</p>\n\n<p>English has Germanic origins. Individual English words have hundreds of exotic origins from languages all over the world. A large percentage of English words have Norman French origins. Norman French had Latin origins. The majority of Norman French words had Latin origins (though there are surely words Norman French borrowed from other languages it was in contact with and passed on to English).</p>\n\n<p>But of course even the Germanic and Latin languages didn't spring out of nowhere. They also had origins. They are both traced back to a common origin in Proto-Indo-European. Some linguists try to trace the origins even further back and have many hypotheses, but most linguists agree that such is not possible.</p>\n", "Id":"3849", "ParentId":"3843", "CreationDate":"2013-06-12T01:01:34.513", "Score":"1", "PostTypeId":"2", "OwnerUserId":"51", "LastActivityDate":"2013-06-12T01:01:34.513", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}