{"OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "comments":[], "Body":"<p>As you know, <a href=\"http://en.wikipedia.org/wiki/Gender_in_English\" rel=\"nofollow\">English</a> does not have <em>grammatical gender</em>, but only <em>natural gender</em>.</p>\n\n<p>Natural gender may apply in different languages to humans only, humans and \"higher\" animals etc, it may or may not include pronouns. English has all those kinds of natural gender.</p>\n\n<p>(English also has a quirk where some things such as ships may be referred to with female pronouns but this is not grammatical gender).</p>\n\n<p>The concept of <em>neuter</em> doesn't have much meaning in English other than contrasting the pronoun <em>it</em> with <em>he</em>, <em>she</em>, <em>him</em>, and <em>her</em>.</p>\n\n<p>What you will find when implementing a human language on a computer is that you will have to deal with semantics and context as well as just syntax. Treating gender as part of syntax will lead you to problems but if you want to match pronouns in English then you will need to have some kind of semantic or contextual awareness too.</p>\n\n<p>What I find is that when adding such semantics is that other factors then spring up, some of which are more important than gender, and usually they have semantic counterparts in some languages. Chief amongst these is <a href=\"http://en.wikipedia.org/wiki/Animacy\" rel=\"nofollow\"><em>animacy</em></a>.</p>\n\n<p>Some verbs have different meanings if the subject is animate. Sometimes just figuring which noun phrases are subject, direct object, and indirect object requires you to know which are animate.</p>\n\n<p>Sometimes you may even want to distinguish between human and animal.</p>\n\n<p>So my answer is, for English, either leave out gender if you want something simple, or if you want something complex, then don't just implement gender but also either animacy or some kind of semantics, <a href=\"http://en.wikipedia.org/wiki/Ontology_%28information_science%29\" rel=\"nofollow\">ontology</a>, \"real-world\" knowledge, etc.</p>\n", "Id":"3894", "ParentId":"3891", "CreationDate":"2013-06-22T01:05:55.323", "Score":"4", "PostTypeId":"2", "OwnerUserId":"51", "LastActivityDate":"2013-06-22T01:05:55.323", "CommentCount":"6"}