{"Body":"<p>Have you taken a look at <a href=\"http://icelandiconline.is/#\" rel=\"nofollow\">Icelandic Online</a>? It's a free online Icelandic language course created at the University of Iceland. It's been designed with an emphasis on immersion and trial-by-error, so you aren't spoonfed everything in every lesson. Pronunciation is no exception to this, so this may not be what you're looking for.</p>\n\n<p>That said, if you stick with it it might prove useful in the pronunciation arena. One of the tricky things about Icelandic is that there is a lot of lenition, contraction, etc. that happens in the context of full utterances, so that the pronunciation of a phrase may not be the literal \"sum of its parts\" (think <em>going to</em> --> <em>gonna</em> in English), but these pronunciation changes aren't indicated in any way in the orthography the way we sometimes use apostrophes or changes in spelling to express such phenomena in English. This is of course true for a lot of languages to varying degrees, but my anecdotal experience as a linguist and a native speaker of English is that Icelandic presents a more extreme case along this spectrum.</p>\n\n<p>What's useful about the Icelandic Online program is that it provides tons of recordings (by native speakers) of both full dialogues and individual words. By listening to the carefully articulated pronunciations of the individual words you start to build a sense of how the orthography--and therefore the phonology--works, especially if you supplement it with <a href=\"http://en.wikipedia.org/wiki/Icelandic_phonology\" rel=\"nofollow\">the Wikipedia article on Icelandic phonology</a>, which gives you IPA information. Then, if you listen to the dialogue recordings you start to get a sense of how things get \"slurred\" and lenited in continuous speech.</p>\n\n<p>I hope that helps!</p>\n", "Id":"3929", "ParentId":"3924", "LastEditorUserId":"385", "CreationDate":"2013-06-28T14:51:33.753", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-07-30T18:25:17.133", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2013-07-30T18:25:17.133", "Score":"2", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}