{"OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "comments":[], "Body":"<p>Your question presupposes that \"you can fairly well analyse Modern English vowels as having length\", but it's not clear that that is the case. I'll get to that later, though.</p>\n\n<p>First, let's be clear--<em>if</em> we were to divide modern American English vowels up into long and short vowels, the categories would cross-cut the categories of long and short vowels that existed in Middle English. That is, <strong>it's not the case that all the vowels in modern American English words that were long vowels in their Middle English counterparts pattern together in modern American English.</strong> As I mentioned in my comment, for example, <em>moon</em> and <em>book</em> both had a long vowel in Middle English, but we wouldn't want to analyze them both as having a long vowel in modern American English.</p>\n\n<p>Further, <em>if</em> we were to divide modern American English vowels up into long and short vowels, it would <em>not</em> work to take the Middle English reflexes of the vowels that underwent the Great Vowel Shift as the underlying forms of their shifted \"descendents\" as well as of other instances of vowels that are realized in the same way--i.e. <strong>we wouldn't want to analyze the vowel in <em>name</em> and the vowel in <em>Beijing</em> as underlyingly /a:/</strong>, because there would be no sensible trigger for the synchronic vowel quality change. What would the rule look like? /a:/ --> [ej] ... in what environment? Everywhere?? Assuming you believe that underlying forms are stored in a speaker's grammar, how would a child ever infer the underlying form if it never surfaced?</p>\n\n<p>Given the above, I would say that, <strong><em>if</em> we even wanted to analyze modern American English as having short and long vowels (still a big <em>if</em>), history would have little relevance for our analysis other than the fact that some of the vowels we might analyze as long would have been long in Middle English.</strong> (But some wouldn't, and some that we would analyze as short would also have been long in Middle English.)</p>\n\n<p>Which finally brings me to what I gather is the real meat of the question--does it indeed make sense to use the distinctive feature [long] in a synchronic analysis of modern American English? My answer would be: <strong>yes, but the name for the feature would just be a convenient mnemonic label and other names could just as easily be given to that feature.</strong></p>\n\n<p>The best candidates for a +/-long distinction would be the vowels in minimal pairs such as <em>beat-bit</em>, <em>Luke-look</em>, and <em>raid-red</em>. It's true that, all else being equal (same prosodic environment, same speech rate, etc.), the vowels in the first members of the pairs will be phonetically longer than their counterparts in the second members. The vowels of the first and second members, respectively, also pattern together phonologically (i.e. they form <em>natural classes</em>); for example, while the first vowel in each pair may appear in a word-final open syllable (<em>bee</em>, <em>loo</em>, <em>ray</em>) the second vowel in each pair may not (*[bɪ], *[lʊ], *[ɹɛ]).</p>\n\n<p>In a synchronic analysis that makes use of distinctive features, then, it makes sense to posit a feature that would delineate these two natural classes. Based on the tendency of the vowels in one class to be realized as phonetically longer than those in the other class (all else being equal), we might choose the name \"long\" for our feature. But there are other phonetic differences that distinguish the two classes of vowels. That is, if we took recordings of the words <em>beat</em>, <em>Luke</em>, and <em>raid</em> and simply shortened them (using Praat's duration manipulation feature, for example), they would not be perceived by native speakers as <em>bit</em>, <em>look</em>, and <em>red</em>, respectively. This is because they differ in quality as well as length, as @hippietrail mentioned in her comment above. If we looked at spectrograms of the vowels in <em>beat</em>, <em>Luke</em>, and <em>raid</em>, we would see that the first two formants hit targets that are more \"extreme\" and that the formants of the vowels in <em>bit</em>, <em>look</em>, and <em>red</em> have relatively more \"neutral\" targets. Some people chalk this difference up to an articulatory difference that was historically characterized as one of \"tenseness\" of the articulatory muscles, and so a traditional label that was adopted for the feature was [tense].</p>\n\n<p>In the end, it technically doesn't matter what we call the feature since, as I mentioned, it is really just a convenient label for characterizing natural classes (see <a href=\"http://linguistics.stackexchange.com/questions/3398/understanding-voiced-consonants/3401#3401\">my response to this related question about voiced consonants</a> for further discussion). We could call it [feature 42]. It's true that calling it [long] is a sensible mnemonic choice, since duration is one dimension along which the relevant differences manifest themselves phonetically, but it wouldn't tell the whole story.</p>\n", "Id":"3971", "ParentId":"3921", "CreationDate":"2013-07-06T00:39:45.423", "Score":"4", "PostTypeId":"2", "OwnerUserId":"385", "LastActivityDate":"2013-07-06T00:39:45.423", "CommentCount":"5"}