{"comments":[], "Body":"<p>The short answer to your question is that no single term exists to describe the \"informal [but polite] language that is used across websites over the Internet\" nor informal/polite language in general.</p>\n\n<p>However, as jlawler has pointed, in sociolinguistics the technical term for a manner of speech is <a href=\"http://en.wikipedia.org/wiki/Register_%28sociolinguistics%29\" rel=\"nofollow\">\"a register\"</a>. Basically, humans change the way they pronounce words, the words they choose, and even the grammar they use based on who they are speaking to and how they wish to be perceived. I would suggest reading <a href=\"http://www.stanford.edu/~eckert/PDF/bell1984.pdf\" rel=\"nofollow\"><em>Language Style as Audience Design</em> by Allan Bell</a> for a more detailed analysis.</p>\n\n<p>As for your question, if you wish to perform a detailed analysis you could define \"a polite but informal register of speech commonly used on webpages\" and then give examples showing the main traits of this register. If you simply want to refer to generic polite but informal speech you can simply refer to a generic \"polite but informal register\".</p>\n\n<p>One final note is that I have seen some publications use the word \"code\" instead of register (as in <a href=\"http://en.wikipedia.org/wiki/Code-switching\" rel=\"nofollow\">code-switcing</a>) but I'd suggest sticking with register since it seems to be the more common word these days.</p>\n", "Id":"3986", "ParentId":"3985", "CreationDate":"2013-07-10T04:12:36.830", "Score":"4", "PostTypeId":"2", "OwnerUserId":"1055", "LastActivityDate":"2013-07-10T04:12:36.830", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}