{"Body":"<p>Of course that depends mainly on which country and which language is meant. Some names carry on the ancient names of countries and/or tribes, other ethnonyms convey the history of a long-period quarrels (settled by time or not).</p>\n\n<p>That is to say, the Japanese and/or Chinese names of countries are fabulous, but there are also some more examples from IE languages in Europe.</p>\n\n<p>To start with, there is a language with no names for lands like Checkia, Hungary, Germany and Italy, and that language is Polish. The literal meaning of  the country names would be <em>the Checks (Czechy)</em>, <em>the Hungarians (Węgry)</em>, <em>the Speechless ones (Niemcy)</em> and <em>the Italians (or Włochy, as named by the Speechless ones, and please don't ask me how it comes to be)</em> respectively. The names of Lithuania and Latvia in Polish also mean 'a group or a tribe' with collective sufixes: Litwa and Łotwa.</p>\n\n<p>Speaking on which, and moving along the European map, we meet some more examples of exotic names. Lithuanian, this ancient language of Baltic states, offers such a collection of ancient onomastic survirvors as <em>Lenkija (Poland)</em>, <em>Suomija (Finland)</em>, <em>Vokietija (Germany; not a big surprise)</em>, and Latvian offers the hidden treasures of ages passed like <em>Igaunija (Estonia)</em>, <em>Somija (Finland again)</em>, <em>Vācija</em> (Germans seem to lose their perfect <em>Clear</em> toponym wherever they get into), the almost irrecognisable name of Sweden masked as <em>Zviedrija</em> and - surprise again! - the powerful Eastern neighbour <em>Krievija a.k.a. Russia</em> (although I used to think, up to this post, that Lithuanian shares this exotic variety of view on its occidental neighbour with Lithuanian).</p>\n\n<p>The Swedish has nothing to surprise a linguist with, perhaps with the exception of <em>Ungern (Hungary).</em></p>\n\n<p><em>Estonia</em> itself is a good example of being both <em>Eesti</em> and <em>Viro</em> in Finnish, which also keeps the old traditions of near-neolythic naming of now-extinct tribe names in such words like <em>Venäjä (Russia)</em>, <em>Ruotsi (Sweden)</em>, <em>Puola (Poland)</em>, and calqued <em>Belorussia (Valko-Venäjä), Itävalta (Austria, a.k.a. Eastern State)</em> and <em>Alankomaat</em> *(Nederlands, or Neath-Lands)*. I am not mentioning  <em>Tanska</em> here, for its original mode of <em>Danmark</em> is quite recognisable. </p>\n\n<p>The Estonian names often rhynme with Finnish patterns, e.g. <em>Rootsi (Sweden)</em>, <em>Venemaa (Venäjä)</em>, and even if <em>the Netherlands</em> are <em>Holland</em>, being occasionally <em>Madalmaad</em> (Lowlands), the <em>Danmark</em> is still <em>Taani</em>, and the <em>Norway</em> is <em>Norra</em>.</p>\n\n<p>Of other Finno-Ugric languages I am familiar with, Komi mostly copies the Russian names, with the exception of <em>Russia (Rochmu)</em>, and Hungarian claims <em>Italy</em> to be <em>Olaszország</em>, otherwise adding the <em>ország</em> *(-land)* part to the rest of most other country names: <em>Spanyolország (Spain), Németország (Germany), Lengyelország (Poland)</em> and masked mysterious <em>Magyarország (Hungary)</em>, not mentioning <em>Észtország (Estonia)</em>, <em>Lettország</em> *(Latvia)* or <em>Oroszország (Russia)</em> together with  <em>Írország (Ireland)</em>. They are strange, but mostly regular.</p>\n\n<p>What is <em>not so</em> regular, is the Ghaelic orthography, and here are some interesting Irish examples; <em>An Eilbheis (Swissland)</em>, <em>An t-Seic (Check Republic)</em>, <em>Innis Tìle (Iceland)</em>, <em>An Eadailt (Italy)</em>, and almost any other country the name of which is made irrecognisible by a magic spell casted with Irish orthography: <em>A' Bhealaruis (Belorussia)</em>, <em>Moldàibhia (Moldova)</em> or <em>An Laitbhe (Latvia)</em>. <em>The Ireland</em> itself becomes Poblachd na <em>h-Èireann</em>, the <em>English</em> is <em>Beurla</em> and <em>England</em> is <em>Sasainn</em>, but I think there is nothing outstanding about these facts. </p>\n\n<p><strong>Trivia:</strong> the Irish name for Englishmen would make most of Russians laugh, since <em>Sasanach</em> in Irish is pronounced almost like <em>'wtf'</em> in Russian.</p>\n\n<p>The Basque language shows a certain modesty in exoticism as compared to this Indo-European feast of onomastics; <em>Errumania, Errusia, Eslovakia</em> and <em>Eslovenia</em> are just <em>Romania, Russia, Slovakia and Slovenia; Txekia</em> is <em>Checkia</em> and <em>Herbehereak</em> are <em>Neath-Lands</em> again, but why <em>Serbia, Suedia, Suitxa (Swiss) and San Marino</em> have no initial *E*s? This is just unfair. </p>\n\n<p><strong>PS</strong> <em>Of course, I am not referring here to Erresuma Batua, since the United Kingdom is a strange pair of words when translated into any other language; nor speaking I about Montenegro, which is sometimes translated into other languages as Black+Mountain, and sometimes, not.</em> </p>\n", "Id":"4003", "ParentId":"3996", "LastEditorUserId":"624", "CreationDate":"2013-07-14T19:29:48.420", "OwnerUserId":"1686", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-12-14T08:55:22.147", "LastEditedUser":{"UpVotes":"81", "DownVotes":"60", "Id":"624", "AccountId":"407237", "Views":"34", "Reputation":"1743", "CreationDate":"2011-12-28T07:24:31.420", "DisplayName":"Anixx", "LastAccessDate":"2014-01-18T10:33:34.597"}, "LastActivityDate":"2013-12-14T08:55:22.147", "Score":"6", "CommentCount":"7", "OwnerUser":{"UpVotes":"145", "DownVotes":"36", "ProfileImageUrl":"http://i.stack.imgur.com/rZ1Oc.jpg", "Id":"1686", "AccountId":"2130467", "Views":"63", "Reputation":"1112", "CreationDate":"2013-01-19T17:49:32.827", "DisplayName":"Manjusri", "LastAccessDate":"2014-01-18T20:17:27.900", "AboutMe":"<p>I have no native language. I am more or less getting by in some tongues, and I can read and/or swear in douzens of other languages, but this doesn't mean I am an expert in them. By January 2013 I am 34 and wish to see the latter number growing. </p>\n\n<p>I study [cognitive] psychology and am planning to obtain some certificates in computer languages and programming.</p>\n\n<p>I enjoy horse riding, travelling, good cuisine, green Japanese tea, Russian and Spanish literatures and friendly company.</p>\n\n<p><strong>Fluent In:</strong> Dutch, English, Finnish, French, Russian, Spanish and Swedish.</p>\n\n<p><strong>Less Fluent:</strong> Danish, Estonian, Polish and Bulgarian, </p>\n\n<p><strong>Learning:</strong> Arabic, Chinese, Innuit, Japanese, Komi, Sanskrit, Tibetan and Yoruba.</p>\n\n<p><strong>Planning to Learn:</strong> Tangut, C, C++ &amp; Pascal</p>\n"}}