{"OwnerUser":{"UpVotes":"23", "WebsiteUrl":"", "DownVotes":"5", "Id":"1832", "AccountId":"1670710", "Views":"4", "Reputation":"344", "CreationDate":"2013-03-07T05:57:57.617", "DisplayName":"limetom", "LastAccessDate":"2014-01-13T23:38:09.323", "AboutMe":""}, "comments":[], "Body":"<p><a href=\"http://www.benjamins.com/catalog/sl.34.4.01bug\" rel=\"nofollow\">Bugaeva (2010: 752)</a> sums up prototypical applicatives as follows:</p>\n\n<blockquote>\n  <p>The applicative is typically described as a syntactic construction signaled by\n  overt verbal morphology which allows the coding of a semantically peripheral\n  argument or adjunct as a core object argument (Peterson 2007: 1; cf. Comrie 1985:\n  III-316, Spencer 1991: 253, and Polinsky 2005: 442). This newly introduced object\n  argument is usually referred to as an applicative object (henceforth AO).</p>\n  \n  <p>The above definition implies that, a prototypical applicative construction has\n  the following three properties:</p>\n  \n  <ol>\n  <li>An applicative construction increases verb valency by one.</li>\n  <li>An applicative construction provides an alternative to oblique realization of\n  a semantically and syntactically peripheral participant, i.e. there must exist a\n  non-applicative (base) construction.</li>\n  <li>An applicative construction does not involve non-peripheral participants,\n  such as Agent and Theme/Patient. Addition of an Agent typically results in\n  causativization; likewise, addition of a Theme/Patient results in non-causative\n  transitivization.</li>\n  </ol>\n</blockquote>\n\n<p>Applicatives therefore wouldn't ever govern a case other than accusative (or however direct objects are marked). What they do do is take some peripheral or oblique argument (like a location or benefactive) and make it into a core argument (specifically, a direct object). Here's an example and its non-applicative paraphrase from Ainu (from Bugaeva 2010: 753):</p>\n\n<blockquote>\n  <p>(1)<br>\n  a. <em>casi upsor <strong>ta</strong> ahun=an ruwe ne</em><br>\n  castle inside <strong>to</strong> enter.SG=IND.S INF.EV COP<br>\n  ‘I entered the castle.’  </p>\n  \n  <p>b. <strong><em>casi upsor</strong> a=Ø=<strong>o</strong>-ahun ruwe ne</em><br>\n  <strong>castle inside</strong> IND.A=3.O=<strong>to.APPL</strong>-enter.SG INF.EV COP<br>\n  ‘I entered the castle.’  </p>\n</blockquote>\n\n<p>In (1a), <em>casi upsor</em> takes the postposition <em>ta</em>, which indicates it is an oblique argument, specifically, a location. However, the applicative paraphrase in (1b) doesn't have the postposition, and instead has the locative applicative morpheme <em>o-</em>. Additionally, Ainu has no case marking but has the strict word order of SV in simple intransitive clauses, and SOV in simple transitive clauses. This means that <em>casi upsor</em> here is likely the direct object. This is also backed up by the verbal agreement marking. In the indefinite person, like we have here, Ainu has a tripartite system, with the subject of transitive clauses, the subject of intransitive clauses, and the direct object of transitive clauses each being marked differently (<em>a(n)-</em> for A, <em>-an</em> for S, and <em>i-</em> for O). We see the overt agreement suffix here being the intransitive one, <em>-an</em> in the non-applicative paraphrase, and the transitive one, <em>a(n)-</em> in the applicative version.</p>\n\n<p><a href=\"http://www.people.fas.harvard.edu/~ctjhuang/NTNU/Pylkkanen_2002.pdf\" rel=\"nofollow\">Pylkkänen (2002)</a> looked at the similarities between \"true\" applicatives, like those that are found in Ainu, and double direct versus dative ditransitive verbs in English through a minimalist framework and found some fundamental differences, terming the former \"high applicatives\", and the latter \"low applicatives\". For instance, you cannot add a benefactive participant to an English unergative verb, but you can in the Bantu language Luganda:</p>\n\n<blockquote>\n  <p>(11)<br>\n  c. I ran.<br>\n  d. *I ran <strong>him</strong>. [meaning ‘I ran for his sake’--my addition] (Pylkkänen 2002: 17)</p>\n  \n  <p>(31)<br>\n  a. <em>Mukasa ya-tambu-<strong>le</strong>-dde <strong>Katonga</em></strong><br>\n  Mukasa PAST-walk-<strong>APPL</strong>-PAST <strong>Katonga</strong><br>\n  ‘Mukasa walked for Katonga’ (Pylkkänen 2002: 25) </p>\n</blockquote>\n", "Id":"4018", "ParentId":"4016", "CreationDate":"2013-07-16T10:54:23.463", "Score":"1", "PostTypeId":"2", "OwnerUserId":"1832", "LastActivityDate":"2013-07-16T10:54:23.463", "CommentCount":"1"}