{"OwnerUser":{"UpVotes":"6", "DownVotes":"0", "Id":"1611", "AccountId":"960307", "Views":"4", "Reputation":"181", "CreationDate":"2012-12-26T17:41:32.873", "DisplayName":"Joop Eggen", "LastAccessDate":"2014-01-16T17:34:00.430", "AboutMe":"<p>Speaking Esperanto, Dutch, English, German.</p>\n"}, "comments":[], "Body":"<p>As an aposteriori language Esperanto takes its words from existing languages. It does however have the notion of word stem plus <strong>-o</strong> for noun, <strong>-a</strong> for adjective, <strong>-as</strong> for verb present tense, and so on. And it reduces some pseudo-suffixes in word stems somewhat.</p>\n\n<ul>\n<li>nacio = nation (reduced \"~tion\" to \"~ci\")</li>\n<li>nacia = national (reduced \"~al\" to \"-a\")</li>\n<li><p>naciigi = nationalize (-ig meaning \"make\")</p></li>\n<li><p>kombini = combine</p></li>\n<li>kombinas = combinates</li>\n<li>kombino, kombinaĵo = combination (-aĵ = product, aĵo = thing)</li>\n</ul>\n\n<p>As you see there is some reduction of pseudo-suffixes, in favour of systematic endings.</p>\n\n<p>The numerals are - apart from 1 - all monosyllabic. Why 1 is the exception, one may guess. Esperanto has no indefinite article (English \"a\"), so maybe a security measure. The digits are also reduced in an almost Volapük like manner:</p>\n\n<p>unu du tri <strong>kvar kvin</strong> ses <strong>sep ok</strong> naŭ <strong>dek</strong></p>\n\n<p>The advantage is easy counting. Where a foreign speaker often tends to fall back on his native language where counting, Esperanto helps a bit.</p>\n\n<p>However to come back to your question: Esperanto does not reduce much, and it would have not be so much better. Volapük (\"Worldspeak\") shows that.</p>\n\n<p>Doing away with categorical suffixes (~ation, ~al, ~ess, ~ine) did not come without a (shorter) substitution, though systematized. This does not make Esperanto texts much more compact though.</p>\n\n<p>Though Esperanto gives a better active language possession, especially for non-europeans, providing an automatic assurrance of correctness, there exist other perspectives.</p>\n\n<p>Interlingua goes entirely the natural way, to have readable text close to the natural languages - with several pseudo-suffixes to make an adjective from a noun, and so on. So Interlingua is a language <em>not</em> reducing its syllables. <em>Nevertheless people love the language, and do not care to switch to Esperanto.</em></p>\n\n<p>Given the three in order of reduction-to-natural, failed Volapük (very reductive), successful Esperanto, and \"linguistic\" Interlingua, I think the majority of linguistics tend more in the direction of Interlingua than Esperanto (a shame). So reduction is no compelling advantage.</p>\n", "Id":"4030", "ParentId":"3957", "CreationDate":"2013-07-19T15:29:19.930", "Score":"0", "PostTypeId":"2", "OwnerUserId":"1611", "LastActivityDate":"2013-07-19T15:29:19.930", "CommentCount":"1"}