{"Body":"<p>The simple answer is that there are two \"a/an\"s in English. One is an article and one is a preposition.</p>\n\n<p>When you consider that languages are full of homonyms it is natural that there can be multiple items in a lexicon that share the same form (pronunciation/spelling) while having different meanings. Consider the word \"<a href=\"http://dictionary.reference.com/browse/sanction\" rel=\"nofollow\">sanction</a>\" which can mean the exact opposite of itself depending on whether it is a noun or a verb yet we have no problem understanding it. This is a good comparison because like \"a/an\" the type of word it is interpreted as depends on how it is used in the sentence but \"a/an\" has the added advantage that, unlike \"sanction\", it does not carry a semantic value (or at least none beyond the logical implications of using an indefinite article).</p>\n\n<p>When trying to decide if a particular instance of \"a/an\" is an article or a preposition you can use a substitution test like the ones put forward by hippietrail: substitute \"a/an\" in a sentence with other articles or prepositions and see if the sentence is still <strong>syntactically</strong> valid (it might be <em>semantically</em> weird but that's OK)</p>\n", "Id":"4052", "ParentId":"4049", "LastEditorUserId":"1055", "CreationDate":"2013-07-24T03:17:29.570", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-07-24T03:28:44.617", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2013-07-24T03:28:44.617", "Score":"1", "CommentCount":"3", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}