{"Body":"<p>Factors that might lead to the emergence of synonyms include</p>\n\n<ul>\n<li>Language contact</li>\n<li>Specialised vocabulary for particular fields (medicine, law, hip hop culture, ...)</li>\n<li>Vibrant literature, particularly poetry</li>\n<li>Geographical dispersion/dialect diversity</li>\n</ul>\n\n<p><strong>1. Language contact</strong></p>\n\n<p>Language contact often leads to the borrowing of words. While these might fill a lexical gap, they often do not. For example, in German (and probably other languages, too) it is now not unknown to hear people use the words <em>happy</em> or <em>nice</em>, for which native equivalents exist.</p>\n\n<p><strong>2. Specialised vocabulary</strong></p>\n\n<p>Particular communities, such as lawyers, fishing enthusiasts or those involved in hip hop culture, often have specialised vocabulary that in many cases can have synonyms <a href=\"http://linguistics.stackexchange.com/questions/3973/why-is-jargon-sometimes-used-instead-of-familiar-words\">in general usage</a>.</p>\n\n<p><strong>3. Vibrant literature/poetry</strong></p>\n\n<p>Creative writing has a tendency to invent new words to avoid the repetition of the same word, or words beginning in the same sound, or for words to end in the same sound/syllable (to produce a rhyme). Arabic literature, for example, vaunts itself as a creator of many synonyms, such as <a href=\"https://en.wikipedia.org/wiki/99_Names_of_Allah\" rel=\"nofollow\">99 ways of referring to Allah</a>.</p>\n\n<p><strong>4. Geographical dispersion/dialect diversity</strong></p>\n\n<p>As you pointed out in the question, geographical dispersion might play a role. Language communities that are separated by geographical barriers such as a mountainside or sheer distance tend to diverge. Because of this divergence words might take on new meanings or new words might come up that then are synonyms of other words used in another community speaking another dialect.</p>\n\n<h2>Problems with the definition of <em>synonym</em></h2>\n\n<p>As others pointed out in the comments determining what is a synonym is not trivial. Two words might be interchangeable in one context, but not in another. In other cases the lexical meaning of two words might be equivalent, but they belong to different registers (formal and colloquial), such as <em>man</em> and <em>guy</em>.</p>\n\n<p>Associated with this is a tendency of languages/communities of speakers to not tolerate complete synonyms. Soon enough, they diverge in meaning or gain different connotations. For example, after the <a href=\"https://en.wikipedia.org/wiki/Norman_conquest\" rel=\"nofollow\">Norman Conquest</a> many French words were borrowed into English. The word <em>sheep</em> derives from a Germanic root, and <em>mutton</em> from a Romance root. The contemporary French word <em>mouton</em> means <em>sheep</em>, but after it was borrowed into English lexical specialisation set in and it came to mean the meat, not the animal itself  - presumably because only the French-speaking elite could afford to eat meat and the English-speaking peasantry was involved in raising the animals (There is <a href=\"http://www.anglo-norman.net/dissem/data/page5-plain.htm\" rel=\"nofollow\">a contrasting view</a> which holds that the lexical distinction evolved later, but it isn't a problem for the argument that lexical distinctions arise after time - thanks to @hippietrail for the link).</p>\n\n<h2>Problems with determining which words belong to a language</h2>\n\n<p>The number of synonyms (however you define <em>synonym</em>) you count in a language depends on which words you think belong to that language. Cases that might be contentious include specialised vocabulary and loan words. Specialised vocabulary is often known only to the community that uses it, so you might want to exclude it from the vocabulary of the language since it is only known to a select group. On the other hand, there are bilingual dictionaries for many of these communities/fields which point to the fact that these words do have to belong to some language.</p>\n\n<p>Loan words might after some time be considered to become part of a language, and in many cases are not transparent as loan words any more after some time. However, <em>happy</em> and <em>nice</em> are still transparent in German as loan words from English. I suppose many native speakers of German would not consider them German words, despite the fact that speakers with little or no knowledge of English might use and understand them, which suggests they have become a part of the German language.</p>\n\n<p>In conclusion, these two problems will give rise to some methodological headaches when you actually want to count synonym pairs in a language.</p>\n", "Id":"4071", "ParentId":"4057", "LastEditorUserId":"2278", "CreationDate":"2013-07-28T14:46:39.340", "OwnerUserId":"2278", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-07-29T09:43:09.487", "LastEditedUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}, "LastActivityDate":"2013-07-29T09:43:09.487", "Score":"2", "CommentCount":"3", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}