{"comments":[], "Body":"<p>Reasons for the use of jargon are precision and the tendency of communities (professional or otherwise) to develop their own vocabulary. </p>\n\n<h2>Precision</h2>\n\n<p>Members of a community, such as lawyers, might sometimes feel the need to invent new words for concepts that exist in general usage to make it clear that they are referring to a strictly defined term. This might help <strong>avoid confusion</strong> between the looser meaning of the word in general usage and the narrower meaning of the one used in specialised discourse. </p>\n\n<p>Another option is to take the word from general usage and <strong>(re)define</strong> it in a way that suits the needs of the professional community. For example, German <em>Klage</em> means both <em>lawsuit</em> (law jargon, among others) and <em>complaint, lamentation</em>. Lawyers know that <em>Klage</em> if used by their peers refers to a <em>lawsuit</em> and not a complaint without legal consequences, there is no ambiguity involved. So if precision were the only principle shaping the language of professional communities one would expect very little or at least less coining of new terms to occur, especially since redefining an existing word would be more <strong>economical</strong> than coining a whole new word.</p>\n\n<h2>Identity</h2>\n\n<p>Another, perhaps more important, argument I think is that communities tend to come up with their own vocabulary. This is in part because they need to refer to concepts those who do not belong to the community have no interest in or knowledge of. But jargon can also arise in cases where the concept that a new word refers to is not particularly complicated or new, such as in the examples given in the question (<em>desist</em> for <em>stop</em>).</p>\n\n<p>Jargon serves to create a common <strong>identity</strong> among the members of the group. If you know the jargon you belong to the group, if you don't know it everybody will notice you don't belong to the group. <a href=\"http://books.google.de/books?id=diwosITLKwAC&amp;printsec=frontcover#v=onepage&amp;q&amp;f=false\" rel=\"nofollow\">Spolsky (1998)</a>, for example, says that</p>\n\n<blockquote>\n  <p>A specialised jargon serves not just to label new and needed concepts, but to establish bonds between members of the in-group and enforce boundaries for outsiders. If you cannot understand my jargon, you don't belong to my group.</p>\n</blockquote>\n\n<p>In this sense jargon is comparable to slang, which also serves to mark group boundaries. The difference, as <a href=\"http://www.researchgate.net/publication/225028025_Coaching_Behaviour_in_Team_Sports_of_Greece/file/79e415093f3afe273e.pdf#page=23\" rel=\"nofollow\">Kollataj (2009)</a> points out, is that slang is stigmatised but jargon is not. How groups of people, whether they work in the same professional community or belong to more loosely defined social groups, develop their own ways of communicating has been described by Penelope Eckert as <a href=\"http://www.stanford.edu/~eckert/PDF/eckert2006.pdf\" rel=\"nofollow\">communities of practice</a>.</p>\n", "Id":"4072", "ParentId":"3973", "CreationDate":"2013-07-28T21:46:48.990", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2278", "LastActivityDate":"2013-07-28T21:46:48.990", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}