{"OwnerUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}, "comments":[], "Body":"<p>An orthography is a system for writing a language. Ideally an orthography would be developed on the basis of a thorough analysis of the phonology of the language in question. The aim would be to have an unambiguous representation of each phoneme, with a one-to-one correspondence between graphemes and phonemes; this is known as a 'phonemic' or 'shallow' orthography. This can often be very difficult to achieve, but the less ambiguity in the writing system, the easier it seems to be for literacy. Japanese hiragana (<em>not</em> Kanji!) and the Finnish orthography are good examples of shallow orthographies</p>\n\n<p>On the other hand there are some languages which have a standard orthography which involves a complex many-to-many relationship between graphemes and phonemes; these are referred to as 'deep' orthographies. English is a fairly well-known language with a deep orthography, which gives rise to the situation where even native speakers may not know how to pronounce a word seen in writing for the first time, or how to write a word heard for the first time.</p>\n\n<p>A native (or naive) othography is one developed without being based on an analysis of the phonology. Typicaly it is created by speakers of the language in response to their desire to make written records and will be based on the best-known language that has a standard orthography: for example in Papua New Guinea people may draw on the Tok Pisin orthography. This means that the orthography is not a good match for their language, but it may be good enough that it meets some needs. Examples I've seen are of people wanting to write a song in their language for use in church, or people wanting to write their name, a sign on their house, and other such fairly short texts.</p>\n\n<p>I'm not actually aware of the term 'relaxed orthography' but it seems from your link that the webpage is referring to 'relaxed spelling'. Relaxed spelling refers to a situation where there is little prescription of spelling, so it is acceptable for words to be spelled in a variety of ways. English has a deep orthography, which makes numerous spellings potentially possible for most words (eg the famous spelling of 'fish' as <em>ghoti</em>) but relaxed spelling is generally not acceptable, at least in recent times (in the 18th century and earlier, English spelling was very relaxed). The idea of relaxed spelling generally wouldn't be very applicable to languages with a shallow orthography as the spelling is an accurate representative of the pronunciation.</p>\n", "Id":"4078", "ParentId":"4068", "CreationDate":"2013-07-30T05:59:42.560", "Score":"3", "PostTypeId":"2", "OwnerUserId":"363", "LastActivityDate":"2013-07-30T05:59:42.560", "CommentCount":"1"}