{"comments":[], "Body":"<p>Superiority/inferiority is by definition arbitrary, at least in the realm of linguistics. Any language is ultimately able to convey any thought, and that's all that really matters. I can't really imagine being able to objectively judge ease-of-communication on individual points - there are so many subjective decisions that would have to go into setting up a standard to judge by that I doubt it's possible.</p>\n\n<p>For your individual points:</p>\n\n<p>If 'easier to write' means 'closer to a 1:1 grapheme:phoneme correspondence ratio', then typically languages become harder to write over time - if spellings are standardised, they may not change for centuries (e.g. Tibetan, which was standardised a millenium ago); while the language will continue to change as normal. Typically some form of standardisation is the default (unofficial though it may be - since writing is associated with prestige, and prestigious things tend to be conservative), so in order for a language to become 'easier to write', its speakers have to make a conscious decision to change the way they spell things. It's not a naturally-occurring process at all.</p>\n\n<p>I don't know what 'more expressive' means. If you're a native speaker, you'll be able to express pretty much anything with extreme ease - and while there may be a construction here and there that's not that easy, there's almost certainly a good number of languages out there that struggle with something your language finds easy. If you're referring to the range of topics that can be discussed, that's more of a vocabulary question; and vocabulary can be changed and extended so easily that it really doesn't work as a standard of 'ease of communication' - you can just add new words then and there and then perfectly easily talk about whatever it was you couldn't have before.</p>\n\n<p>I also don't really know what 'more understandable' means. If you're a native speaker, you're going to understand it! :P If you're not, how easy it is to learn depends on what your native language is. For example, Portuguese is pretty easy for Spanish speakers to learn, harder for English speakers, and very difficult for Mandarin speakers - but Cantonese is relatively easy for Mandarin speakers, and much harder for English and Spanish speakers. Something like Burushaski or Xhosa or Nuxálk would be quite difficult for all of them - but then, Xhosa would be relatively easy for Zulu speakers. It's a question of similarity - if a language is similar to your native language in terms of grammatical structure (and vocabulary helps too), it'll be easy to learn. If it's structured very differently, it'll be harder to learn.</p>\n\n<p>Clearly, languages are not becoming more consistent (by which I assume you mean 'grammatically regular') - see Modern English, for example! Not that earlier stages were any -more- regular, but they weren't really -less- regular, either. Languages in general tend to maintain the same general level of regularity over time (with some exceptions, and different languages may differ greatly in regularity). The reason for this is that the two kinds of changes that languages undergo - sound change and grammatical change - have opposing effects on regularity. Sound changes create irregularity (as words get worn down, individual morphemes become harder to identify and harder to separate out), while grammatical changes typically create regularity (as individual words' inflection patterns are modified to better match more general patterns). These opposing forces tend to create a kind of equilibrium - sound changes make things more irregular, but once they get too irregular then grammatical change kicks in and makes them more regular again. And if you move on from grammatical regularity to other kinds of regularity (semantic, phonological, etc), you'll come across other issues - phonological patterns are extremely regular, though they might be horrendously complicated; while semantics, being more a 'space' of meanings that are arbitrarily divided, doesn't have very much in the way of 'patterns' at all outside of a few domains.</p>\n\n<p>So no, languages are not improving, because the term 'improving' is meaningless. Even if you agree that things like grammatical consistency and phonemic spelling are valuable, languages aren't improving. (And you have no real reason to value those things! Things like grammatical inconsistencies and irregular spellings are often windows into the history of a language - we can learn about how things used to be from the weird half-patterns they've left behind. Yes, they make a language harder to learn, but there's more to value in a language than how easy it is to learn.)</p>\n", "Id":"4081", "ParentId":"4080", "CreationDate":"2013-07-30T15:44:57.417", "Score":"7", "PostTypeId":"2", "OwnerUserId":"2132", "LastActivityDate":"2013-07-30T15:44:57.417", "OwnerUser":{"UpVotes":"13", "WebsiteUrl":"", "DownVotes":"1", "Id":"2132", "AccountId":"2572199", "Views":"6", "Reputation":"701", "CreationDate":"2013-06-04T23:59:57.060", "DisplayName":"Sjiveru", "LastAccessDate":"2014-01-18T21:42:32.287", "AboutMe":"<p>Still in training, but hopefully somewhat knowledgeable. Historical linguistics is awesome.</p>\n"}}