{"comments":[], "Body":"<p>\"Are modern languages in any non-arbitrary way superior to ancient languages, e.g. easier to write, more expressive, more understandable, more consistent?\"</p>\n\n<p>I can't address that last two parts of your question, for two reasons.   First, I know of no instance in the speakers of language A have more trouble understanding each other than the speakers of language B owing to some grammatical inadequacies of language A.  Second, the inconsistencies of a language are not a problem for the language's native speakers.  Most people can use even rare and complex language constructions in their native tongues by the time they are five years old.   See this article:   <a href=\"https://courses.cit.cornell.edu/psych215/PDF-files/language-acq-II.pdf\" rel=\"nofollow\">https://courses.cit.cornell.edu/psych215/PDF-files/language-acq-II.pdf</a> </p>\n\n<p>As for ease of writing, there doesn't seem to be a lot of evidence to support the notion that one type of orthography (say, logographic vs. alphabetic) is more easily written than another type.   See this post on the Linguist List:  <a href=\"http://linguistlist.org/issues/2/2-322.html\" rel=\"nofollow\">http://linguistlist.org/issues/2/2-322.html</a>.  Ease of learning may be another matter, but I haven't found information about this.        </p>\n\n<p>As for whether ancient languages are inferior to modern languages in any non-trivial way, we have no way of knowing what the most ancient languages were like.  </p>\n\n<p>Our species is about 195,000 years old.   See the Wikipedia article on homo sapiens:  <a href=\"https://en.wikipedia.org/wiki/Homo_sapiens\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Homo_sapiens</a>.  Writing systems were devised only within the last 6,000 years.  See the Wikipedia article on the History of Writing:   <a href=\"https://en.wikipedia.org/wiki/History_of_writing#Inventions_of_writing\" rel=\"nofollow\">https://en.wikipedia.org/wiki/History_of_writing#Inventions_of_writing</a>).     So, on the evolutionary time scale, so-called \"ancient\" languages like the first language to be written, Sumerian, might just as well be modern.   </p>\n\n<p>We don't even know for sure whether language first developed in our species or among our  pre-homo sapiens ancestors!   Some anthropologists believe that the origin of modern language happened about 50,000 years ago, when humans first left traces of \"behavioral modernity\" (manufacture of keen-edged stone tools, use of pigment for art, burial of dead, and other behaviors).   See the Wikipedia article on behavioral modernity:  <a href=\"https://en.wikipedia.org/wiki/Behavioral_modernity\" rel=\"nofollow\">https://en.wikipedia.org/wiki/Behavioral_modernity</a>   However, other experts believe that \"behavioral modernity\" began long before 50,000 years ago, and that the evolution of language may have occurred before the human line evolved into anatomically modern humans.  See this paper by Francesco D'Errico and a number of others:   <a href=\"http://www.academia.edu/290586/Archaeological_Evidence_for_the_Emergence_of_Language_Symbolism_and_Music_an_Alternative_Multidisciplinary_Perspective\" rel=\"nofollow\">http://www.academia.edu/290586/Archaeological_Evidence_for_the_Emergence_of_Language_Symbolism_and_Music_an_Alternative_Multidisciplinary_Perspective</a>   </p>\n\n<p>(Disclaimer:  I haven't slogged all the way through this last paper:  I concentrated on the abstract and what I gleaned by using the finder to locate the word \"language\" in various places in the text.)</p>\n\n<p>So while it makes sense to assume that the most ancient natural languages were less sophisticated than the languages of modern humans, we have no way of knowing what those first, rudimentary languages were like, or how they became as complex and expressive as every language that linguists have studied. </p>\n", "Id":"4095", "ParentId":"4080", "CreationDate":"2013-08-01T06:03:04.307", "Score":"1", "PostTypeId":"2", "OwnerUserId":"790", "LastActivityDate":"2013-08-01T06:03:04.307", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}