{"OwnerUser":{"UpVotes":"123", "WebsiteUrl":"https://sites.google.com/site/patrickdelliott/", "ProfileImageUrl":"http://i.stack.imgur.com/HGYBE.jpg", "Id":"2328", "AccountId":"3146009", "CreationDate":"2013-08-07T11:16:59.797", "AboutMe":"<p>I'm a PhD student in Linguistics at University College London. My primary area of interest is generative linguistics, and specifically syntactic and semantic theory. More narrowly still, i'm interested in ellipsis, comparatives, and binding theory. <a href=\"https://twitter.com/patrickdelliott\" rel=\"nofollow\">Follow me on twitter!</a></p>\n", "Location":"London, United Kingdom", "DownVotes":"43", "Views":"43", "Reputation":"970", "DisplayName":"P Elliott", "LastAccessDate":"2014-01-19T02:32:31.120"}, "comments":[], "Body":"<p>Your second example is the easiest to deal with - the PoS of the post-copula element is an adjective, in the predicative position. The individual-denoting subject \"he\" is predicated of the adjective \"fine\".</p>\n\n<p>The second example is a little trickier - 'soon' modifies an event (you can replace the pronoun 'it' with an event-denoting DP, i.e. \"the beginning is soon\", or \"the party is soon\". 'it' can't refer to an individual, i.e. *\"the rabbit is soon\"). This is similar to its use as an adverb - \"John will go to the party soon\" - 'soon' modifies the event of John-going-to-the-party. There doesn't seem to be anything to suggest that it isn't an adverb here, since copulas don't seem to place many restrictions on the PoS of their complement.</p>\n\n<p>'soon' is semantically licensed because it stands in a particular kind of relationship with the event-denoting subject. In fact, some people treat adverbs as predicates which take events as their arguments, which makes example (2) parallel to example (1). We can tentatively say that \"X is Y\" is licit just in case X and Y stand in an argument/predicate relationship.</p>\n", "Id":"4128", "ParentId":"4127", "CreationDate":"2013-08-07T11:16:59.797", "Score":"3", "PostTypeId":"2", "OwnerUserId":"2328", "LastActivityDate":"2013-08-07T11:16:59.797", "CommentCount":"4"}