{"comments":[], "Body":"<p>I don't think whether a language has many bound morphemes or not (or whether it is <a href=\"https://en.wikipedia.org/wiki/Synthetic_languages\" rel=\"nofollow\">synthetic</a> or <a href=\"https://en.wikipedia.org/wiki/Analytic_language\" rel=\"nofollow\">analytic</a>) has much influence on how readily loanwords are accepted into the language. Empirically showing that this is true would be complicated due to the many other factors you mentioned that influence the number of loanwords.</p>\n\n<p>To provide some anecdotal evidence I'll give examples of recent or ad-hoc borrowings from two synthetic languages and how they are integrated into the complex morphology of these languages. These examples show that languages with many bound morphemes readily borrow words and add native morphemes to them.</p>\n\n<h2>Polish</h2>\n\n<p>I recently heard the word <em>niezasejwowany</em> in a Polish pop song. This is a past participle and ultimately borrowed from English <em>to save</em>. It appears to be so recent a loanword that it's not in the rather good dictionary I use.</p>\n\n<p>Analysing <em>niezasejwowany</em> gives <em>nie-za-sejwowa-ny</em>, <em>un-PERF-save-PP-Sg.m.</em></p>\n\n<ul>\n<li><em>-ować</em> is a very productive verbal suffix usually used with borrowed verbs -> <em>sejwować</em></li>\n<li><em>za-</em> is a perfective marker -> <em>zasejwować</em></li>\n<li>past participle singular male is <em>zasejwowany</em></li>\n<li>and adding the negative prefix <em>nie-</em> gives <em>niezasejwowany</em></li>\n</ul>\n\n<p>Although this appears to be a rather recent loanword it is readily integrated into Polish morphology.</p>\n\n<h2>German</h2>\n\n<p>A while ago I heard a shop assistant praise another's hard work:</p>\n\n<blockquote>\n  <p><em>Du bist aber heute wieder hart am Worken</em></p>\n  \n  <p>You are but today again hard at working/work</p>\n  \n  <p><em>You are really working hard today</em></p>\n</blockquote>\n\n<p><em>Worken</em> is a deverbal noun from what I assume must be the verb <em>worken</em>, obviously borrowed from English <em>to work</em>. I haven't heard anyone use the verb <em>worken</em> in German, so I assume this is an ad-hoc borrowing or code-switching. The crucial point is that even such an ad-hoc borrowing is readily integrated into German morphology and gets a deverbal <em>-en</em> suffix to derive a noun.</p>\n\n<h2>Conclusion</h2>\n\n<p>Based on these examples I would say that even very recent borrowings are integrated into the morphology of synthetic languages without any problems. And if this is the case the number of bound morphemes a language uses should have no influence on how many loanwords it accepts.</p>\n", "Id":"4134", "ParentId":"3455", "CreationDate":"2013-08-08T02:14:38.090", "Score":"2", "PostTypeId":"2", "OwnerUserId":"2278", "LastActivityDate":"2013-08-08T02:14:38.090", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}