{"Body":"<p>It's not that everything in English is nominative, it's simply that English doesn't have productive morphological case <em>at all</em> - although there are some remnants of the old English case system, such as in the pronominal system, and the who/whom distinction. Lack of m-case is hardly unusual typologically - neither Chinese not Dutch has it, for example. </p>\n\n<p>To answer your question of how \"native English speakers translate the nominative cases in their brains\" - assure you that we get by! More seriously, Jean Vergnaud, in a 1977 letter to Chomsky &amp; Lasnik (<a href=\"http://mitpress.mit.edu/sites/default/files/titles/content/9780262062787_sch_0001.pdf\" rel=\"nofollow\">http://mitpress.mit.edu/sites/default/files/titles/content/9780262062787_sch_0001.pdf</a>) suggested that all languages possess 'abstract' case underlyingly, and it just so happens that it is spelled-out in languages like Czech, and not in languages like English, Chinese etc. This means that in English, abstract case is assigned based on the structural position of the Noun Phrase - for example, the grammatical subject is assigned abstract nominative, and the grammatical object is assigned accusative case. This conception of case is quite widely accepted in generative linguistics. It's worth emphasising that on this view, case is purely syntactic - it is not taken to dictate the semantic role of a Noun Phrase. A nominative subject can, e.g. be an agent (\"She hit John\") or a patient (\"She was hit by John\").</p>\n\n<p>English does indeed rely much more on things like word order - generally speaking, languages with rich case morphology are 'non-configurational', which means that they display more flexible word order. English is conversely 'configurational', so it has a more rigid word order. As an aside, languages like Chinese are an exception - it has no case morphology and free word order. We call these 'discourse configurational' languages.</p>\n\n<p>I'm not sure it's worth seriously addressing your contention that languages without m-case are inferior with regards to poetry, but i'll just add that Shakespeare, Milton, Donne, Keats, Wordsworth etc. would beg to differ...</p>\n", "Id":"4136", "ParentId":"4135", "LastEditorUserId":"2328", "CreationDate":"2013-08-08T11:57:52.933", "OwnerUserId":"2328", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-08-08T20:38:30.660", "LastEditedUser":{"UpVotes":"123", "WebsiteUrl":"https://sites.google.com/site/patrickdelliott/", "ProfileImageUrl":"http://i.stack.imgur.com/HGYBE.jpg", "Id":"2328", "AccountId":"3146009", "CreationDate":"2013-08-07T11:16:59.797", "AboutMe":"<p>I'm a PhD student in Linguistics at University College London. My primary area of interest is generative linguistics, and specifically syntactic and semantic theory. More narrowly still, i'm interested in ellipsis, comparatives, and binding theory. <a href=\"https://twitter.com/patrickdelliott\" rel=\"nofollow\">Follow me on twitter!</a></p>\n", "Location":"London, United Kingdom", "DownVotes":"43", "Views":"43", "Reputation":"970", "DisplayName":"P Elliott", "LastAccessDate":"2014-01-19T02:32:31.120"}, "LastActivityDate":"2013-08-08T20:38:30.660", "Score":"7", "CommentCount":"6", "OwnerUser":{"UpVotes":"123", "WebsiteUrl":"https://sites.google.com/site/patrickdelliott/", "ProfileImageUrl":"http://i.stack.imgur.com/HGYBE.jpg", "Id":"2328", "AccountId":"3146009", "CreationDate":"2013-08-07T11:16:59.797", "AboutMe":"<p>I'm a PhD student in Linguistics at University College London. My primary area of interest is generative linguistics, and specifically syntactic and semantic theory. More narrowly still, i'm interested in ellipsis, comparatives, and binding theory. <a href=\"https://twitter.com/patrickdelliott\" rel=\"nofollow\">Follow me on twitter!</a></p>\n", "Location":"London, United Kingdom", "DownVotes":"43", "Views":"43", "Reputation":"970", "DisplayName":"P Elliott", "LastAccessDate":"2014-01-19T02:32:31.120"}}