{"Body":"<p>Here's how such a sentence boundary algorithm could be built. </p>\n\n<p>The crucial thing is to come up with <strong>sequences of words (n-grams) that have a high likelihood of occurring at the end of a sentence or at the start of a sentence and a small likelihood of occurring within a sentence.</strong> </p>\n\n<p>A list of these n-grams could be compiled with a large corpus such as the written part of the <a href=\"http://www.natcorp.ox.ac.uk/\" rel=\"nofollow\">British National Corpus</a>. Once the list is complete, the algorithm would go through the text without punctuation and for every word boundary look up the preceding n-grams in the list. For example, in a sequence of words such as</p>\n\n<p><em>have you seen it it's incredible</em></p>\n\n<p>once the algorithm is at <em>have you seen it</em> it would look up <em>seen it</em> in the list and give you a score such as: Occurred 56 times at the end of sentences and 22 times within a sentence, i.e. a score of 56/22 = 2.5. There should also be a list of three-word sequences, so look up <em>you seen it</em>, which might have a score of 13/2=6.5, then go on with a four-word list. Now average all scores and if it passes a certain threshold (which would need to be determined empirically) the algorithm sets a sentence boundary.</p>\n\n<p>The same could be done with n-grams/word sequences occurring sentence-initially, and n-grams which occur at sentence boundaries.</p>\n\n<p>Edit: As @P Elliott pointed out in the comments, a somewhat similar algorithm <a href=\"http://www.aclweb.org/anthology-new/A/A97/A97-1004.pdf\" rel=\"nofollow\">has been implemented</a> and has high accuracy.</p>\n", "Id":"4168", "ParentId":"3167", "LastEditorUserId":"2278", "CreationDate":"2013-08-11T22:08:50.167", "OwnerUserId":"2278", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-08-12T13:37:57.000", "LastEditedUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}, "LastActivityDate":"2013-08-12T13:37:57.000", "Score":"2", "CommentCount":"10", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}