{"Body":"<p>I'm no expert, but a native speaker. Please excuse me for the lack of terminology, but Hungarian doesn't really adhere to the Nominative/Accusative/Dative/Genitive division.</p>\n\n<p>The root is \"<code>hoz</code>\" (<code>ő hoz</code> = he/she brings), the \"nominative\" or \"basic\" form is \"<code>hozni</code>\" (to bring)</p>\n\n<p><code>t</code> is the general sign of the past tense. (Hungarian really has only one past tense, excluding some tenses used in regional dialects)</p>\n\n<p>If you use <code>ta</code> it means it refers to the specific thing (<code>hozta a levelet</code> = he/she brought the letter vs. <code>hozott egy levelet</code> = he/she brought a letter)</p>\n\n<p>Note that the basic form would be the non-specific, \"<code>hozott</code>\", where the vowel is only there to make it more \"musical\", because \"hozt\" would feel funny, and so it's some kind of exception. Generally the unspecific form just adds a <code>t</code> and nothing else, like in <code>válaszol -&gt; válaszolt -&gt; válaszolta</code> = answer -> answered (general) -> answered (specific)</p>\n\n<p><s><sub>\nAbout being telic/altelic</sub></p>\n\n<blockquote>\n  <p>there is an end point to which you will stop bringing it and \n  instead be depositing/gifting/offering/leaving it at the place</p>\n</blockquote>\n\n<p><sub> it's really hard to say, as Hungarian does not make the same distinction as for example English between past simple and past perfect, past continuous, etc. In English and German, if you have compound sentences, you have to take care whether the action in the first sentence already finished when the second started or not. In Hungarian, <strong>there is no such thing</strong>, there is only one past tense (and only one future tense which is not really a future tense at all). All the complicity in other parts of the language are a little bit diminished by the very very simple tense rules.</sub></p>\n\n<p><sub>Note: there is a past tense to indicate an action very distant in the past, in this tense it would be <code>hozá</code>, or indicating an even more distant past <code>hozá vala</code> but this tense is quite archaic and not generally used except in some regional dialects.</sub></p>\n\n<p></s></p>\n\n<p><strong>Edit:</strong></p>\n\n<p>For additional fun, try to analyze <code>hozhattátok</code> = <code>you (plural) could have brought it</code></p>\n\n<p><strong>Edit 2 (telicity)</strong></p>\n\n<p>Just <code>hozta</code> does not necessarily mean that the action is finished. It might have been interrupted. So if someone interrupted me when I was bringing something, then I was not able to actually bring it.</p>\n\n<p>Using <code>meghozta</code> means that the action is finished. (But it's still the same tense). The prefix <code>meg-</code> in front of any verb accentuates that the action is completed. However, to compare it to the German \"machen -> gemacht\" would be, in my opinion, a mistake, because in German there was a change in tenses. Its role is very similar to other prefixes, just like <code>felhozta</code>, <code>elhozta</code>, <code>behozta</code>, which mean <code>brought it up</code>, <code>brought it here</code>, <code>brought it in</code>, respectively, which are obviously finished acts. The <code>meg-</code> just indicates its \"finishedness\", without specifying \"here\", \"there\", \"up\", or \"down\", etc.</p>\n\n<p>Using the <a href=\"http://en.wikipedia.org/wiki/Telicity#Testing_for_telicity_in_English\" rel=\"nofollow\">Wikipedia</a> example, \"John built a house in a month.\" vs. \"John built houses for a month.\", in Hungarian it is incorrect to use <code>hozta</code> with a formulation like \"in an hour\". You have to use <code>meghozta</code> or some other prefix. You can use <code>hozta</code> only in the context of \"for an hour\", and <code>meghozta</code>, <code>elhozta</code> etc. only in the context of \"in an hour\". So it seems telicity is inherent of the verb itself, not like in English where in both cases you use \"built\" and the context decides.</p>\n\n<p>So, from this example, <code>hozta</code> on its own would be atelic. You would need a prefix to indicate that the action is completed. The prefix can be separated from the word under certain circumstances, but it would still have to be in the sentence to indicate that it's an accomplished action.</p>\n", "Id":"4175", "ParentId":"3925", "LastEditorUserId":"2354", "CreationDate":"2013-08-12T17:56:25.570", "OwnerUserId":"2354", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-08-13T14:48:25.890", "LastEditedUser":{"UpVotes":"0", "Location":"Romania", "DownVotes":"0", "Id":"2354", "AccountId":"414546", "Views":"0", "Reputation":"161", "CreationDate":"2013-08-12T06:21:51.747", "DisplayName":"vsz", "LastAccessDate":"2013-08-14T14:05:48.357", "AboutMe":"<p></p>\n", "Age":"29"}, "LastActivityDate":"2013-08-13T14:48:25.890", "Score":"1", "CommentCount":"5", "OwnerUser":{"UpVotes":"0", "Location":"Romania", "DownVotes":"0", "Id":"2354", "AccountId":"414546", "Views":"0", "Reputation":"161", "CreationDate":"2013-08-12T06:21:51.747", "DisplayName":"vsz", "LastAccessDate":"2013-08-14T14:05:48.357", "AboutMe":"<p></p>\n", "Age":"29"}}