{"comments":[], "Body":"<p>After the Norman Conquest in 1066 French quickly replaced English in all domains associated with power. French was used at the royal court, by the clergy, the aristocracy, in law courts. But the vast majority of the population continued to speak English. Had the aristocracy and clergy miraculously vanished in 1100 English would have taken over right away. In reality it took until the 14th c. for English to slowly supplant French in many of these domains. There are several reasons for this:</p>\n\n<ul>\n<li><a href=\"http://en.wikipedia.org/wiki/John_lackland\" rel=\"nofollow\">John Lackland</a> (King of England) <strong>lost Normandy</strong> to the King of France. This meant that his and the Norman aristocracy's focus shifted to England. He still had possessions in the South of France, but these were too far off to shift the focus away from England.</li>\n<li>Society used to be split into a French-speaking aristocracy and clergy who wielded all the power, and English-speaking peasants without power. Now an urban and <strong>English-speaking middle class</strong> (traders, artisans, etc.) came up, and acquired wealth and power.</li>\n<li>The <strong>French-speaking population</strong> was ultimately rather <strong>small in number</strong>. Looking at it from this perspective one might ask why French stayed that important for such a long time. French did remain the language of power for two centuries or so, but ultimately the aristocracy slowly shifted towards English because their attachment with France had waned.</li>\n</ul>\n\n<p>By the 14th c. people started making fun of the French spoken by the Norman Aristocracy. Chaucer, in the <a href=\"http://muse.jhu.edu/journals/chaucer_review/v036/36.2rothwell.html\" rel=\"nofollow\">Prioress's Tale</a> in the Canterbury Tales says about the Prioress (a nun):</p>\n\n<blockquote>\n  <p><a href=\"http://www.librarius.com/canttran/genpro/genpro118-162.htm\" rel=\"nofollow\">And Frenssh she spak ful faire and fetisly</a>,</p>\n  \n  <p>After the scole of Stratford-atte-Bowe,</p>\n  \n  <p>For Frenssh of Parys was to hir unknowe.</p>\n</blockquote>\n\n<p>The Prioress only knew the kind of French taught in England (Stratford here) and not the kind of French spoken in Paris (seen as more desirable). This was at a time when text books for teaching French to the aristocracy came up. They now needed instruction in French because they didn't learn it at home any more.</p>\n", "Id":"4182", "ParentId":"4178", "CreationDate":"2013-08-13T09:04:39.013", "Score":"4", "PostTypeId":"2", "OwnerUserId":"2278", "LastActivityDate":"2013-08-13T09:04:39.013", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}