{"Body":"<p>(<strong>Amended</strong> per comments)</p>\n\n<p>AFAICT, in Czech, the animate/inanimate distinction is considered as a kind of “sub-gender” specification for the masculine gender. Usually you need to distinguish only m/f/n, but in a few cases, the masculine gender needs to be differentiated to animate/inanimate.</p>\n\n<p>Masculine animate nouns have the singular accusative different from the singular nominative (e.g. <em>man</em>: nom <em>muž</em>, acc <em>muže</em>) while inanimate nouns have accusative identical to nominative (e.g. <em>castle</em>: nom <em>hrad</em>, acc <em>hrad</em>). This is the difference native speakers use to recognize noun animacy (and choose the correct <a href=\"http://en.wikipedia.org/wiki/Czech_declension\">declension paradigm</a>). Furthermore, there are differences in singular dative and locative (e.g. <em>mužovi</em> vs. <em>hradu</em>), and plural nominative (e.g. <em>muži</em> vs. <em>hrady</em>).</p>\n\n<p>The most important aspect affected by animacy is the third-person plural past verb form: the inanimate nouns are treated almost like feminines, e.g. <em>muži byl</em><strong><em>i</em></strong> (“men were”), while <em>hrady byl</em><strong><em>y</em></strong> (similarily to <em>ženy byly</em> = “women were”).</p>\n\n<p>We have four declension paradigms for animate masculine nouns and two for inanimate masculine nouns, however, they are usually listed together and mixed (“pán, hrad, muž, stroj, předseda, soudce”, where <em>hrad</em> and <em>stroj</em> are those inanimate). So, in general usage, the animacy is definitely not on the same level of importance as gender.</p>\n\n<p>As for the “assignment” of animacy to nouns, it is generally true that animate nouns correspond to live beings, while abstract concepts and non-living entities correspond to inanimate nouns. But there are exceptions to this rule. Plants (e.g. <a href=\"http://en.wiktionary.org/wiki/strom\"><em>strom</em></a> = tree) and collective nouns (<a href=\"http://en.wiktionary.org/wiki/hmyz\"><em>hmyz</em></a> = insect) are inanimate, and a non-living, yet human-like snowman (<a href=\"http://en.wiktionary.org/wiki/sn%C4%9Bhul%C3%A1k\"><em>sněhulák</em></a>), or a by-definition-deceased <a href=\"http://en.wiktionary.org/wiki/nebo%C5%BEt%C3%ADk\"><em>nebožtík</em></a> are animate.</p>\n\n<p>Then we have several classes of nouns which may be used either as animate or inanimate. Some of them according to the speaker’s style choice: Nouns ending with <em>-tel</em> or <em>-ec</em> (e.g. <a href=\"http://en.wiktionary.org/wiki/ledoborec\"><em>ledoborec</em></a> = icebreaker) can use <em>ledoborci vypluli</em>, or <em>ledoborce vypluly</em> (choosing the noun variant and then the corresponding verb inflection), similarly with a few other small sets of nouns.</p>\n\n<p>Then there are nouns which are animate or inanimate according to the specific real-world meaning, e.g. <a href=\"http://en.wiktionary.org/wiki/sb%C4%9Bra%C4%8D\"><em>sběrač</em></a>, which might mean a gatherer (a person gathering something), or a pantograph (a device collecting something), and according to the meaning, it is animate (“sběrači měli plné košíky” – “gatherers had their baskets full”), or inanimate (“sběrače měly poruchu” = “collectors were broken”). An interesting word in this regard is <em>robot</em> (you might be aware that it is originally Czech, invented by Josef Čapek for his brother’s theatrical play R.U.R.): it was originally inanimate, but nowadays, it might be either animate (humanoid, intelligent robots), or inanimate (dumb machines, e.g. a kitchen robot).</p>\n\n<p>For some nouns, you can also use animate declension expressively, e.g. (“dám si ruma” = “I’ll have a rum”, even though <a href=\"http://en.wiktionary.org/wiki/rum#Czech\"><em>rum</em></a> is normally inanimate, so “dám si rum” is the basic usage).</p>\n", "Id":"419", "ParentId":"379", "LastEditorUserId":"253", "CreationDate":"2011-09-22T14:19:53.873", "OwnerUserId":"253", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-22T22:19:53.473", "LastEditedUser":{"UpVotes":"5", "WebsiteUrl":"http://cs.wikipedia.org/wiki/User:Mormegil", "Id":"253", "AccountId":"115911", "CreationDate":"2011-09-22T13:51:40.163", "AboutMe":"<p>C# developer</p>\n", "Age":"35", "Location":"Prague, Czech Republic", "DownVotes":"0", "Views":"3", "Reputation":"238", "DisplayName":"Mormegil", "LastAccessDate":"2013-12-18T14:59:12.850"}, "LastActivityDate":"2011-09-22T22:19:53.473", "Score":"9", "CommentCount":"4", "OwnerUser":{"UpVotes":"5", "WebsiteUrl":"http://cs.wikipedia.org/wiki/User:Mormegil", "Id":"253", "AccountId":"115911", "CreationDate":"2011-09-22T13:51:40.163", "AboutMe":"<p>C# developer</p>\n", "Age":"35", "Location":"Prague, Czech Republic", "DownVotes":"0", "Views":"3", "Reputation":"238", "DisplayName":"Mormegil", "LastAccessDate":"2013-12-18T14:59:12.850"}}