{"OwnerUser":{"UpVotes":"1", "DownVotes":"0", "ProfileImageUrl":"https://www.gravatar.com/avatar/?s=128&d=identicon&r=PG&f=1", "Id":"2358", "AccountId":"3163004", "Views":"3", "Reputation":"126", "CreationDate":"2013-08-12T17:00:49.507", "DisplayName":"Kevin Russell", "LastAccessDate":"2013-10-14T17:34:33.220"}, "comments":[], "Body":"<p>This should really be a comment to Alex B's answer, but the system won't let me comment yet...</p>\n\n<p>It's true that the meaning of \"formative\" or \"exponent\" depends on your theory of morphology. But in practice, the most widespread reason why people use these terms is to try to <em>avoid</em> theories of morphology — and especially to avoid the controversial and hopelessly theoretically loaded terms \"morph\" and \"morpheme\".</p>\n\n<p>Most people tend to use \"formative\" for any chunk of phonology that recurs across several words with a consistent behaviour (usually a sequence of one or more segments, though some people are more liberal about what counts) — as in Bauer's definition, except (crucially) remaining agnostic over whether it's a morph or not (rather than, like Bauer, insisting it can't be). It gives you a way to talk about things like the <em>re-</em> and <em>-fer</em> of English <em>refer</em>, without claiming that they do or don't mean anything and without getting into an argument (like Aronoff 1976 did) over whether they deserve to be called \"morphemes\". Or to talk neutrally about things like the theme vowels in a verb conjugation, or the apparent genitive suffixes that appear between the halves of many German compounds. Or to talk about <em>anything</em> without taking a stand on whether it's an independent word or a stem or an affix or a clitic or whatever.</p>\n\n<p>People don't use \"exponent\" quite as consistently, but it tends to be the flip side of \"formative\": talking about the phonological realizations of a meaning or of a morphosyntactic feature, while not taking a stand on what the phonological realization has to be like. Maybe it's a string of segments (a formative), but maybe it's just a single phonological feature, or a shift in the position of stress, or nothing at all (people talk about \"zero exponents\", while talking about \"zero formatives\" would be weird), or maybe it's even <em>deleting</em> something from the phonological representation. Maybe this particular phonological representation for the feature [past] recurs consistently across verbs, or maybe it occurs in just this one verb — doesn't matter, we can still just call it an \"exponent\".</p>\n\n<p>To oversimplify: \"Formative\" talks about form with minimal assumptions about meaning. \"Exponent\" talks about (the form of) meanings with minimal assumptions about form.</p>\n\n<p>Except for all the linguists who use the terms differently. :-)</p>\n", "Id":"4215", "ParentId":"4112", "CreationDate":"2013-08-17T21:30:37.647", "Score":"3", "PostTypeId":"2", "OwnerUserId":"2358", "LastActivityDate":"2013-08-17T21:30:37.647", "CommentCount":"1"}