{"OwnerUser":{"UpVotes":"432", "WebsiteUrl":"", "Location":"United States", "Id":"4", "DownVotes":"2", "AccountId":"167219", "Views":"42", "Reputation":"1906", "CreationDate":"2011-09-13T20:24:01.087", "DisplayName":"Mitch", "LastAccessDate":"2014-01-15T11:56:51.610", "AboutMe":"<p>Native speaker of American English (AmE) with touches of Southern AmE.\nProficient in French and German. Elementary knowledge of Mandarin. Basic knowledge of linguistics.</p>\n"}, "comments":[], "Body":"<p>Despite the superficial analogies, both at the large scale descriptive level (languages tend to bunch together in a tree-like fashion) and at the very theoretical level ('information' transfer over a 'noisy' channel), the mechanisms of language change are radically different from speciation. </p>\n\n<ul>\n<li>Two languages, no matter how far apart, can be combined by a younger generation into a pidgin/creole that becomes a rich viable language incomprehensible to its 'parents'. </li>\n<li>One language can become the source for vocabulary and the other for grammar. </li>\n<li>Languages that started off from very different sources can become closer by proximity (via Sprachbunds, like the Balkan Languages). </li>\n<li>There is nothing like DNA recombination in language.</li>\n<li>There is no 'natural' selection</li>\n<li>sex and death, two primary parts of the mechanism of biological evolution of languages, hardly correspond with the obvious language versions (overlapping speech language communities and extinction respectively).</li>\n<li>there is no analogous competition for resources or mates in language</li>\n<li>there are no 'niches' filled by lack of competition in language.</li>\n</ul>\n\n<p>On the other hand one analogy that does supply change is the concept 'mutation', which for biological speciation comes from molecular transcription errors in DNA; in language it comes from aural distortions, production errors, and mental processing mistakes.</p>\n\n<p>That all said, the major differences are that the mechanisms of change are very different (biology is about survival and reproduction, language is about either straightforward resolving noisy channels or sociological acceptance).</p>\n", "Id":"424", "ParentId":"392", "CreationDate":"2011-09-22T16:53:35.270", "Score":"6", "PostTypeId":"2", "OwnerUserId":"4", "LastActivityDate":"2011-09-22T16:53:35.270", "CommentCount":"6"}