{"comments":[], "Body":"<h2>Is the term <em>Japanese English</em> used by anybody?</h2>\n\n<p>Several comments to this question indicated doubts that terms such as <em>Japanese English</em> are appropriate or used by anybody. In fact, in research on English as a Lingua Franca (ELF) (and on postcolonial varieties of English) <strong>such terms are used frequently</strong>. A quick search on Google scholar turns up several instances, such as studies on <a href=\"http://www.linguistics.ucla.edu/people/jun/JKL7-Ueyama-Jun.pdf\" rel=\"nofollow\">intonation</a>, <a href=\"http://books.google.de/books?hl=en&amp;lr=&amp;id=2OK1G_AVnCUC&amp;oi=fnd&amp;pg=PR7&amp;dq=%22Japanese%20English%22&amp;ots=0f-5kuHA-E&amp;sig=daSPuRV81p-QuhdNYPCZF2Nkb60#v=onepage&amp;q=%22Japanese%20English%22&amp;f=false\" rel=\"nofollow\">language contact</a> and <a href=\"http://books.google.de/books?hl=en&amp;lr=&amp;id=oosABE1zdSkC&amp;oi=fnd&amp;pg=PR7&amp;dq=%22Japanese%20English%22&amp;ots=b4cYsxXM2b&amp;sig=ATw82Q2WVxGieAnrF4QY7Oa105A#v=onepage&amp;q=%22Japanese%20English%22&amp;f=false\" rel=\"nofollow\">bilingual families</a>.</p>\n\n<h2>Educational implications</h2>\n\n<p>Sometimes terms such as <em>Japanese English</em> are used as synonyms of <em>English as spoken by learners whose first language is Japanese</em>. Then their use has no educational implications.</p>\n\n<p>Other researchers might consciously opt for <em>Japanese English</em> etc. to underscore their commitment to teaching English as a second/foreign language without positing native speaker norms as a realistic goal or even ideal that learners should strive for. Instead, they should aim for international intelligibility, such as Jennifer Jenkins' <a href=\"http://eprints.soton.ac.uk/65985/\" rel=\"nofollow\">Lingua Franca Core</a>.</p>\n\n<p>This philosophy is based on the recognition that</p>\n\n<ol>\n<li>the number of native speakers of English is far outstripped by the number of speakers of English as a second or foreign language (ESL/EFL)</li>\n<li>most ESL/EFL speakers interact more with other ESL/EFL speakers than with native speakers, and many ESL speakers hardly ever interact with native speakers of English</li>\n</ol>\n\n<p>Consequently, native speaker norms are argued to be relatively unimportant to their needs. What should be the aim is teaching a variety of English that is <strong>internationally intelligible</strong>.</p>\n\n<h2>Are there native speakers of Japanese English?</h2>\n\n<p>Alex B. argued in the comments to the OP that <em>Japanese English</em> is not an appropriate term because there are no native speakers of this variety of English. However, there are also very few native speakers of Indian English, the vast majority of speakers of Indian English acquire it when entering school or later, and yet the term is relatively accepted.</p>\n\n<p>Research into postcolonial varieties of English has largely come to the conclusion that the existence of native speakers is irrelevant to the emergence of a separate variety of English. What is important is a community of speakers, (relatively) separated from other communities, that transmits their variety to future generations. There is a large body of research providing evidence for these claims, and Schneider's <a href=\"http://www.cambridge.org/us/academic/subjects/languages-linguistics/sociolinguistics/postcolonial-english-varieties-around-world\" rel=\"nofollow\">Postcolonial English</a> is probably the most important theoretical contribution to the debate.</p>\n\n<h2>P.S.: Who is a native speaker, anyway?</h2>\n\n<p>Actually, the concept of the native speaker is hard to apply to multilingual societies such as India and Nigeria where English is widely used as a second language. When people acquire two languages from birth, and a third language in school, and finally end up being more proficient in many areas in the third language (chronologically speaking), what is their native language? </p>\n\n<p>The concept of the native speaker is based on the 18th/19th/20th c. Western idea that one nation has one language. This works pretty well for most people in most Western countries (minus recent immigrants), but it didn't in Renaissance, medieval or earlier Europe, where educated people or traders from any country were supposed to be proficient in several languages - Latin, French, Italian, a local dialect, a local standard language.</p>\n", "Id":"4241", "ParentId":"3406", "CreationDate":"2013-08-23T17:31:29.863", "Score":"2", "PostTypeId":"2", "OwnerUserId":"2278", "LastActivityDate":"2013-08-23T17:31:29.863", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}