{"Body":"<p>A strict distinction between <strong>competence</strong> (the abstract grammar of a language that speakers have implicit knowledge of) and <strong>performance</strong> (the actual products of this grammar - utterance produced by speakers) prevented this. Generative grammarians argued that (1) corpora don't provide <strong>negative evidence</strong> - they don't tell us what kinds of sentences are not possible or ungrammatical, and that (2) performance is tainted by the limitations of the human mind (limited memory and attention span, tiredness etc.) (@PElliot points out in the comments that this argument is based \"on misunderstanding of the difference between performance and competence)</p>\n\n<p>For example, <strong>recursion</strong> (such as in <em>The man the woman the child... saw called</em>) is infinite in terms of competence, but in actual performance few iterations are possible - you end up losing track of how the different parts are supposed to go together.</p>\n\n<p>Any attempts to filter out these confounding influences were considered futile to the extent that using corpora (collections of actual language use - performance) was considered unscientific in generative grammar. We are used to thinking about communities of scientists as the pinnacle of rational thinking but in reality, what is considered scientific or unscientific relies very much on tradition and what the consensus is at a given time. Once a certain consensus has formed, it takes enormous effort (by individual scientists and the whole community) to re-examine this consensus.</p>\n\n<p>However, the last 20 years or so have seen some dialogue between generative grammarians and corpus linguists, leading to a <a href=\"http://books.google.de/books/about/Generative_Theory_and_Corpus_Studies.html?id=tz5kXmymHzgC&amp;redir_esc=y\" rel=\"nofollow\">conference on dialogue</a> between the two fields and other publications.</p>\n\n<p>EDIT:\nHere's an example from Carnie, Andrew. 2002. <em>Syntax. A Generative Introduction</em> (p. 10-11):</p>\n\n<blockquote>\n  <p>One obvious source [of data] is in collections of either spoken or written texts [...] called corpora [...]. While corpora are unquestionably invaluable sources of data, they can only be a partial representation of what goes on in the mind. More particularly, corpora will only contain instances of grammatical [...] sentences [...]. To really get at what we know about our languages [...], we have to know what sentences are not well-formed. [...] This kind of negative information is not available in corpora.</p>\n</blockquote>\n\n<p>Carnie makes the \"no negative evidence\" argument here. Note that he first calls corpora \"invaluable\" but then proceeds to say that to \"really get at what we know about\" language they are not useful. In other words, he doesn't seem to consider corpora all that useful and in fact never once mentions them again in the whole textbook.</p>\n", "Id":"4243", "ParentId":"3456", "LastEditorUserId":"2278", "CreationDate":"2013-08-24T11:53:29.590", "OwnerUserId":"2278", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-08-26T00:22:19.940", "LastEditedUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}, "LastActivityDate":"2013-08-26T00:22:19.940", "Score":"1", "CommentCount":"8", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}