{"Body":"<p>The semantic difference between <em>x or y</em> and <em>either x or y</em> is that <em>either...</em> suggests <strong>exclusion</strong> of <em>both x and y</em>.</p>\n\n<p>Let me illustrate this with a rough quote from the TV series <em>The West Wing</em> where a character is asked questions about his ex-wife and her pregnancy:</p>\n\n<blockquote>\n  <p>Q: How pregnant is your ex-wife?</p>\n  \n  <p>A: How pregnant? As I understand it, pregnancy is a binary state, you either are pregnant or you're not.</p>\n</blockquote>\n\n<p><em>Either x or y</em> suggests that x and y <strong>cannot both be true</strong>. You cannot be both pregnant and not pregnant at the same time. <em>x or y</em> allows that both x and y are true. </p>\n\n<p>If you offer someone <em>banana juice or apply juice</em> they can answer <em>Can I have both?</em></p>\n\n<p>If you say <em>You can have either banana or apple juice</em> they could still be cheeky and say <em>Can I have both?</em>, but they will know that this is not the desired answer.</p>\n\n<p>To be sure, <em>or</em> might be used without <em>either</em> when the context implies that not both x and y can be true:</p>\n\n<blockquote>\n  <p>Q: When will you get your hair cut? A: I'll do it tomorrow or the day after.</p>\n</blockquote>\n\n<p>Getting one's hair cut is an action that in all likelihood is completed in less than one day. Because this is implied by the context and because it is not important here that the action cannot take place on both days <em>either</em> can be omitted.</p>\n\n<p>The account of <em>either ... or</em> as exclusive that I've given here is supported by the <em>Comprehensive Grammar of the English Language</em> by Randolph Quirk et al., one of the standard academic descriptive reference grammars of the English language (ยง13.34):</p>\n\n<blockquote>\n  <p><em>Either ... or</em> emphasises the EXCLUSIVE meaning of <em>or</em>.</p>\n</blockquote>\n\n<p>However, there are <strong>exceptions</strong>, for example <em>either live or work in X</em>, in legal usage, appears to mean <em>work or live or both in X</em>.</p>\n\n<p>There is also a <a href=\"http://english.stackexchange.com/questions/13889/does-either-a-or-b-preclude-both-a-and-b\">question and good discussion</a> of this question son SE English L&amp;U.</p>\n", "Id":"4244", "ParentId":"4216", "LastEditorUserId":"2278", "CreationDate":"2013-08-24T12:13:09.407", "OwnerUserId":"2278", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-08-24T17:13:47.557", "LastEditedUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}, "LastActivityDate":"2013-08-24T17:13:47.557", "Score":"1", "CommentCount":"2", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}