{"OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}, "comments":[], "Body":"<p>The other answers have raised many important aspects why diphthongs are a useful concept, and I'd like to add some points that I personally feel are crucial in this debate.</p>\n\n<h2>Proofs</h2>\n\n<p>I'm not sure insisting on a proof of the existence of diphthongs will help you understand why many use the concept <em>diphthong</em> to analyse language. There is no proof that they exist because they don't. They are an abstraction (just like the phoneme), a way of analysing or describing language and the same phenomenon can be described in many different ways.</p>\n\n<p>There isn't any proof of gravity either - if an apple falls down, and you insist it's because of gravity I could still say it's because it is the nature of apples to fall down to Earth or that God likes apples to fall down etc. and we'd be no wiser. However, you could say that your theory of gravity explains a whole lot of other things at the same time, such as pears falling down and celestial bodies rotating around each other. In this sense gravity is a very elegant concept because it explains many phenomena at the same time.</p>\n\n<h2>Diphthongs are not combinations of monophthongs</h2>\n\n<p>In the same way I can point out how diphthongs allow a more elegant description of (for example) English phonology. There are <a href=\"https://en.wikipedia.org/wiki/English_phonology#Vowels\" rel=\"nofollow\">12 monophthongs</a> in English (RP). If we allow combinations of two monophthongs we should expect to find all or almost all such combinations - 12!/(12-2)! = 132. But there are only 8 diphthongs in English (RP). </p>\n\n<p>Of course we could come up with a number of rules stating that such an such monophthongs cannot occur together. We would need so many such rules that our description of English phonology would become bloated. Diphthongs are a more elegant abstraction for describing the sound system of English.</p>\n\n<h2>Syllables</h2>\n\n<p>Sverre pointed out that syllables must contain a single vowel and if there is movement from one vowel target to another then the syllable contains a diphthong. You argued that</p>\n\n<blockquote>\n  <p>One can define a vowel through syllable, or syllable through vowel</p>\n</blockquote>\n\n<p>and I agree that there is a certain circularity here. But syllables also have a definition independent of that. A syllable consists of a sonority (basically, loudness) peak and has sonority troughs (little loudness/acoustic energy) as boundaries. This solves the circularity of the syllable -> diphthong argument. And if the vowel contained in a syllable has two articulatory targets it is a diphthong.</p>\n", "Id":"4254", "ParentId":"4186", "CreationDate":"2013-08-25T19:32:29.627", "Score":"0", "PostTypeId":"2", "OwnerUserId":"2278", "LastActivityDate":"2013-08-25T19:32:29.627", "CommentCount":"2"}