{"OwnerUser":{"UpVotes":"78", "WebsiteUrl":"http://www.lac.u-psud.fr/spip.php?rubrique256", "Id":"120", "AccountId":"112131", "CreationDate":"2011-09-14T14:29:11.410", "AboutMe":"<p>Researcher in quantum information, mainly on cryptography.</p>\n", "Age":"38", "Location":"Paris, France", "DownVotes":"0", "Views":"1", "Reputation":"222", "DisplayName":"Frédéric Grosshans", "LastAccessDate":"2013-12-26T17:11:29.637"}, "comments":[], "Body":"<p>This is not an answer, but I'd like to correct a wrong assumption that you make at the beginning of your question :</p>\n\n<blockquote>\n  <p>Going on the general assumption that ASL is loosely rooted in English  (only in the sense that it was developed in a country dominated by native English speakers, this is not to say that ASL is derived from English), it most likely does not have a case system. </p>\n</blockquote>\n\n<p>However, ASL is rooted in FSL (French sign language) and is totally different from the British sign language !  To cite <a href=\"https://en.wikipedia.org/wiki/Sign_language\" rel=\"nofollow\">Wikipedia sign language page</a>,</p>\n\n<blockquote>\n  <p>Sign languages generally do not have any linguistic relation to the spoken   languages of the lands in which they arise. The correlation between sign and spoken languages is complex and varies depending on the country more than the spoken language. For example, the US, Canada, UK, Australia and New Zealand all have English as their dominant language, but American Sign Language (ASL), used in the US and most parts of Canada, is derived from French Sign Language whereas the other three countries sign dialects of British, Australian and New Zealand Sign Language. Similarly, the sign languages of Spain and Mexico are very different, despite Spanish being the national language in each country, and the sign language used in Bolivia is based on ASL rather than any sign language that is used in a Spanish-speaking country.[18] Variations also arise within a 'national' sign language which don't necessarily correspond to dialect differences in the national spoken language; rather, they can usually be correlated to the geographic location of residential schools for the deaf.</p>\n</blockquote>\n\n<p>and (further down on the same page)</p>\n\n<blockquote>\n  <p>The grammars of sign languages do not usually resemble that of spoken languages used in the same geographical area; in fact, in terms of syntax, ASL shares more with spoken Japanese than it does with English.</p>\n</blockquote>\n\n<p>According to your reasoning, <a href=\"https://en.wikipedia.org/wiki/Russian_Sign_Language\" rel=\"nofollow\">Russian Sign Language</a>, should have cases, since Russian has <a href=\"https://en.wikipedia.org/wiki/Russian_grammar\" rel=\"nofollow\">6 cases</a>.  However, it is also case-less, as member of the <a href=\"https://en.wikipedia.org/wiki/French_Sign_Language_family\" rel=\"nofollow\">FSL-family</a>.</p>\n\n<p>Which is to say that if ASL shares a characteristic of English (like <em>e.g.</em> lack of cases or word-order rigidity), it has <em>a priori</em> no reason to come from English.</p>\n", "Id":"4379", "ParentId":"4314", "CreationDate":"2013-09-03T16:27:39.210", "Score":"2", "PostTypeId":"2", "OwnerUserId":"120", "LastActivityDate":"2013-09-03T16:27:39.210", "CommentCount":"3"}