{"comments":[], "Body":"<p>I agree with P Elliott and his explanation that this is a question of markedness. His examples are from English, which has natural, but not grammatical gender. It might be interesting to see how this works in a language that has grammatical gender, and where grammatical gender usually trumps natural gender.</p>\n\n<p>In German, all nouns are marked for gender (= grammatical gender). Then noun <em>die Katze</em> (cat) is female, i.e. female is the unmarked gender for cats. There is also a male variant, <em>der Kater</em>.</p>\n\n<p><strong>Female</strong> <em>die Katze</em> or the pronoun <em>sie</em> is used if</p>\n\n<ul>\n<li>the speaker does not know the sex of the cat</li>\n<li>the speaker knows the sex of the cat, but does not want to specify it</li>\n<li>the speaker knows the sex of the cat, wants to specify it, and the cat is female.</li>\n</ul>\n\n<p><strong>Male</strong> <em>der Kater</em> or the pronoun <em>er</em> is used if</p>\n\n<ul>\n<li>the speaker knows the sex of the cat, wants to specify it, and the cat is male.</li>\n</ul>\n\n<p>Nouns referring to persons also pose an interesting problem. <em>Das Kind</em> (child) and <em>das Mädchen</em> (girl) are both neuter, which suggests that the unmarked grammatical gender for pronouns referring to them is also neuter. Indeed, prescriptive German grammar has it that neuter nouns can only be referred to by neuter pronouns, as in this example:</p>\n\n<ul>\n<li><em>Hast du das Mädchen gesehen? Es geht in diesselbe Schule wie ich.</em></li>\n<li><em>Have you seen that (neuter) girl? She (neuter) is in the same school as I.</em></li>\n</ul>\n\n<p>However, in spoken German this is quite uncommon and only used in formal contexts. The colloquial variant has natural gender trump grammatical gender:</p>\n\n<ul>\n<li><em>Hast du das Mädchen gesehen? Sie geht in diesselbe Schule wie ich.</em></li>\n<li><em>Have you seen that (neuter) girl? She (female) is in the same school as I.</em></li>\n</ul>\n", "Id":"4437", "ParentId":"4433", "CreationDate":"2013-09-13T09:29:27.430", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2278", "LastActivityDate":"2013-09-13T09:29:27.430", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}