{"Body":"<p>There are a couple of reasons that syntacticians make this distinction:</p>\n\n<ul>\n<li>Word order facts</li>\n<li>Locality facts</li>\n</ul>\n\n<p>As to the first, in a language like French (which has obligatory V -> T head movement), adverbs can separate the (main) verb from its object:</p>\n\n<pre>\n(1)  Jean embrasse souvent Marie\n     J.   kisses    often   Mary\n(2) *Jean souvent embrasse Marie\n     J.   often   kisses    Mary\n</pre>\n\n<p>In English (no V -> T movement), the facts are exactly the reverse:</p>\n\n<pre>\n(3) *John kisses often Mary\n(4)  John often kisses Mary\n</pre>\n\n<p>The second point has to do with the fact that Lowering cannot jump across an intervening projection, whereas Head Movement can<sup>1</sup>.  So in a structure like the following, we predict that T cannot lower onto V, because of the intervening Neg.  This is the motivation for <em>do</em>-support – <em>do</em> is inserted to \"support\" the features in T (which would otherwise be flagged ungrammatical by the Stray Affix Filter, which says basically that you cannot pronounce a bound morpheme in isolation).</p>\n\n<p><img src=\"http://i.stack.imgur.com/6E8Xd.png\" alt=\"tree\"></p>\n\n<pre><code>*\"John -ed not kiss Mary\" --&gt; \"John did not kiss Mary\"\n</code></pre>\n\n<p>Other languages which lack head movement have different strategies for avoiding this clash.  Mandarin, for example, which lacks verb movement to C, has a non-affixal question complementizer <em>ma</em>.</p>\n\n<p>Analyses which merely say \"and then it moves in the phonology!\" are punting the question of what happens in Lowering derivations.  If you are curious about how to say something substantive about Lowering/Affix Hopping in the phonology, <a href=\"http://www.ling.upenn.edu/~embick/move.pdf\" rel=\"nofollow\">this 2001 paper by Embick and Noyer</a> (pdf link) is a recent-ish attempt to construct a theory of post-syntactic movement.  (It also has several examples of post-syntactic movement other than the standard English verb-inflection one.)</p>\n\n<p><br /></p>\n\n<hr>\n\n<p><strong>(1)</strong>: Many syntacticians would like to say that head movement in fact cannot skip intervening heads, and must stop at every one along the trail from source to destination.  But this isn't agreed on by everyone; \"long head movement\" is the name that putative counterexamples go by.</p>\n", "Id":"446", "ParentId":"441", "LastEditorUserId":"43", "CreationDate":"2011-09-23T03:54:46.100", "OwnerUserId":"46", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-25T02:04:39.660", "LastEditedUser":{"UpVotes":"63", "DownVotes":"0", "Id":"43", "AccountId":"398830", "Views":"11", "Reputation":"558", "CreationDate":"2011-09-13T21:04:19.660", "DisplayName":"Phira", "LastAccessDate":"2013-01-16T14:26:40.447"}, "LastActivityDate":"2011-10-25T02:04:39.660", "Score":"10", "CommentCount":"2", "OwnerUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}}