{"Body":"<p>Old French most certainly retained a fully functional case system (cas sujet et cas régime) at least up to the XIVth century, perhaps up to the XVth century in eastern parts of France (and of course retains case inflections for pronouns to this day, e.g me/moi). This case system is a direct descendant of the Latin one.</p>\n\n<p>The subject is very well documented so on-line references, starting with Wikipedia, are easy to find. </p>\n\n<p>Interestingly, for some words both the cas régime and cas sujet survived in modern French, usually with slightly different meanings but in a few occasions with identical meanings. One can find prescriptive French speakers (some would say pedantic) who insist on using the cas sujet form in subject position and the cas régime form in object position (as this prescription presupposes one knows about this past cases, you can imagine that such speakers are vanishingly rare).</p>\n\n<p>UPDATE: In response to robert's comment, one could start with\n<a href=\"http://fr.wikipedia.org/wiki\" rel=\"nofollow\">http://fr.wikipedia.org/wiki</a>/Ancien_français\n<a href=\"http://fr.wikisource.org/wiki\" rel=\"nofollow\">http://fr.wikisource.org/wiki</a>/Grammaire_élémentaire_de_l’ancien_français</p>\n\n<p>Specifically on the survival of one case rather than the other, for instance:\n<a href=\"http://monsu.desiderio.free.fr/curiosites/cassujet.html\" rel=\"nofollow\">http://monsu.desiderio.free.fr/curiosites/cassujet.html</a></p>\n\n<p>I'm sure there are plenty of further references accessible vbyia googling cas régime and cas sujet.</p>\n\n<p>Also, I didn't mean to imply that some speakers retain any syntactic sensibility to these cases (there hasn't been any for 500 years), rather than a vanishingly small number of speakers will preferentially use <em>Le sieur</em> when subject and <em>putain</em> when régime rather than their (perhaps more common) alternatives as some kind of maximal adherence to prescriptive rules, including long lost ones. </p>\n", "Id":"4550", "ParentId":"3952", "LastEditorUserId":"1707", "CreationDate":"2013-09-26T07:42:45.783", "OwnerUserId":"1707", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-09-27T14:50:32.913", "LastEditedUser":{"UpVotes":"16", "WebsiteUrl":"http://www.math.u-psud.fr/~fouquet/", "DownVotes":"0", "Id":"1707", "AccountId":"1575488", "Views":"8", "Reputation":"461", "CreationDate":"2013-01-28T10:33:35.847", "DisplayName":"Olivier", "LastAccessDate":"2014-01-18T22:01:23.260"}, "LastActivityDate":"2013-09-27T14:50:32.913", "Score":"2", "CommentCount":"3", "OwnerUser":{"UpVotes":"16", "WebsiteUrl":"http://www.math.u-psud.fr/~fouquet/", "DownVotes":"0", "Id":"1707", "AccountId":"1575488", "Views":"8", "Reputation":"461", "CreationDate":"2013-01-28T10:33:35.847", "DisplayName":"Olivier", "LastAccessDate":"2014-01-18T22:01:23.260"}}