{"Body":"<p>First of all it is not completely right to say that Sanskrit and Hindi both use the Devanagari script. </p>\n\n<p>It is true that Devanagari script is the native script of Hindi, which is also written in other scripts such as Urdu script and roman script (mainly in social media and Hinglish). Sanskrit, on the other hand, has no native script whatsoever and it is written in several scripts in Indian subcontinent and Southeast Asia and it has been so since ancient times. It is quite possible that two Sanskrit speakers (one from North India and second from Thailand) perfectly understand each other while talking but still not be able to understand a single letter of each other's writing.</p>\n\n<p>Letters you are referring to (Lri, Rii etc.) belong to Sanskrit alphabet not the Hindi alphabet. The <a href=\"http://en.wikipedia.org/wiki/Devanagari\" rel=\"nofollow\">Devanagari script</a> is not exclusive to Hindi and is used to write alphabets of other languages such as Marathi and Sanskrit as well. As an other example, Marathi alphabet has some letters that are not in Hindi or Sanskrit alphabets but they all use Devanagari script.</p>\n", "Id":"4563", "ParentId":"4559", "LastEditorUserId":"2511", "CreationDate":"2013-09-26T16:46:48.693", "OwnerUserId":"2511", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-09-30T06:16:39.183", "LastEditedUser":{"UpVotes":"3", "Location":"Norwalk, CT", "DownVotes":"0", "Id":"2511", "AccountId":"252480", "Views":"0", "Reputation":"151", "CreationDate":"2013-09-26T02:55:36.900", "DisplayName":"Ritesh", "LastAccessDate":"2013-12-27T21:15:51.247", "AboutMe":"<p>Software Engineer</p>\n", "Age":"41"}, "LastActivityDate":"2013-09-30T06:16:39.183", "Score":"5", "CommentCount":"14", "OwnerUser":{"UpVotes":"3", "Location":"Norwalk, CT", "DownVotes":"0", "Id":"2511", "AccountId":"252480", "Views":"0", "Reputation":"151", "CreationDate":"2013-09-26T02:55:36.900", "DisplayName":"Ritesh", "LastAccessDate":"2013-12-27T21:15:51.247", "AboutMe":"<p>Software Engineer</p>\n", "Age":"41"}}