{"Body":"<p>I don't have any references on this at the moment, but anecdotally I can say that I indeed display a version of this length distinction in my dialect. There are some issues that should be highlighted, however.</p>\n\n<p>In general, the well-known vowel length alternation that is observed before voiced vs. voiceless consonants is the most common and the most robust when the consonants in question are coda consonants and when the syllable in question is phrase-final:</p>\n\n<blockquote>\n  <p>Case A: <strong><em>peas</em></strong> vs. <strong><em>peace</em></strong> or <strong><em>Say peas</em></strong> vs. <strong><em>Say peace</em></strong></p>\n</blockquote>\n\n<p>Many speakers also display this alternation phrase medially:</p>\n\n<blockquote>\n  <p>Case B: <strong><em>Say bad for me</em></strong> vs. <strong><em>Say bat for me</em></strong></p>\n</blockquote>\n\n<p>Finally, some length differences may be observed even when the consonant in question may not be analyzed as a coda:</p>\n\n<blockquote>\n  <p>Case C: <strong><em>ogre</em></strong> vs. <strong><em>ochre</em></strong> or <strong><em>buzz around</em></strong> vs. <strong><em>bus around</em></strong></p>\n</blockquote>\n\n<p>In Case C it may make sense to analyze the consonants as being ambisyllabic--that is, both belonging to the coda of the syllable to the left and the onset of the syllable to the right. Note that the syllable to the right is unstressed in all of the examples.</p>\n\n<p>I produce all of the length alternations mentioned above, although my speech follows the general trend in that the length differences are greatest in Case A, less in Case B, and the least in Case C. Similar length alternations can be observed in some words that I realize with flaps:</p>\n\n<p><em><strong>coding</em></strong> vs. <strong><em>coating</em></strong> or <strong><em>Say bad again</em></strong> vs. <strong><em>Say bat again</em></strong></p>\n\n<p>Note though, that in all of the above cases, the segments that are realized as flaps are found at morpheme boundaries, meaning that in other contexts they may be realized as [d] or [t] (or [tʰ]). I don't make a reliable length distinction in <em>ladder</em> vs. <em>latter</em>, and it is likely because in my lexicon the medial consonants in these words are not /t/ and /d/ but rather just /ɾ/. I have read claims that some speakers do make this distinction (though I don't have references off the top of my head), but I am not one of those speakers.</p>\n\n<p>It is interesting to note that, when the vowel in question is the diphthong /aɪ/ and the flap is at a morpheme boundary (as in <strong><em>rider</em></strong> vs. <strong><em>writer</em></strong>), I display both the length alternation as well as the vowel raising phenomenon discussed in <a href=\"http://linguistics.stackexchange.com/questions/4103/the-writer-rider-distinction\">the post mentioned by the OP</a>, but the vowel in <em>spider</em> and <em>cider</em> is raised (and the same length as the first vowel in <em>writer</em>), which suggests that in my lexicon those words do not have underlying /d/ in them. They could therefore either be analyzed as having /t/ or just /ɾ/, as I mentioned above.</p>\n", "Id":"4576", "ParentId":"4565", "LastEditorUserId":"385", "CreationDate":"2013-09-27T15:55:53.147", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-09-27T17:09:56.363", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2013-09-27T17:09:56.363", "Score":"1", "CommentCount":"3", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}