{"Body":"<p>You should not confuse the two terms:</p>\n\n<ol>\n<li>The Cossacks: are a group of predominantly East Slavic people who became known as members of democratic, semi-military and semi-naval communities,[1] predominantly located in Ukraine and in Southern Russia.</li>\n<li>The Kazakhs: are a Turkic people of Eastern Europe and the northern parts of Central Asia (largely Kazakhstan, but also found in parts of Uzbekistan, China, Russia and Mongolia).</li>\n</ol>\n\n<p>On top of that, The Russian Empire recognized the ethnic difference between the two groups; it called them both Kyrgyz to avoid confusion between the terms Kazakh and Cossack (both names originating from Turkic \"free man\".)</p>\n\n<p>the noun qazğaq derives from the same root as the verb qazğan (\"to obtain\", \"to gain\"). Therefore, qazğaq defines a type of person who seeks profit and gain.</p>\n\n<p>Vassmer's etymological dictionary traces the name to an Old East Slavic козакъ, kozak, originally from Cuman Cosac - a free man (in the Latin translation of this word in the Codex) or a freed man (in the Arabic translation)</p>\n\n<p>In a nutshell, they have the same meaning but each group refers to a specific area.</p>\n\n<p>Source: Wikipedia</p>\n\n<p>I hope my answer would be of help.\nThanks!</p>\n", "Id":"4680", "ParentId":"4678", "LastEditorUserId":"2568", "CreationDate":"2013-10-09T20:53:21.800", "OwnerUserId":"2568", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-10-10T01:04:11.167", "LastEditedUser":{"UpVotes":"0", "DownVotes":"0", "ProfileImageUrl":"http://graph.facebook.com/100001884229995/picture?type=large", "Id":"2568", "AccountId":"3366022", "Views":"1", "Reputation":"76", "CreationDate":"2013-10-09T11:59:42.993", "DisplayName":"Mohamed Lamine Hasan", "LastAccessDate":"2013-10-12T11:13:39.147"}, "LastActivityDate":"2013-10-10T01:04:11.167", "Score":"6", "CommentCount":"2", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "ProfileImageUrl":"http://graph.facebook.com/100001884229995/picture?type=large", "Id":"2568", "AccountId":"3366022", "Views":"1", "Reputation":"76", "CreationDate":"2013-10-09T11:59:42.993", "DisplayName":"Mohamed Lamine Hasan", "LastAccessDate":"2013-10-12T11:13:39.147"}}