{"OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "comments":[], "Body":"<p>I'm afraid there is no real answer.</p>\n\n<p>The word \"correct\" can refer to a <strong>correspondence of symbol to reality</strong>, as \"the earth is round\" refers to a situation in what people perceive as reality.</p>\n\n<p>When \"correct\" or \"legal\" is used to describe a <strong>grammatical phenomenon</strong>, however, there is <strong>no such correspondence to reality</strong>; at best, one can ask, \"given grammatical rule x, is utterance y legal/correct?\". Further, one can try to test a certain rule for consistency with other rules and call it \"incorrect\" if it seems inconsistent.</p>\n\n<p>But language is a huge set of rules and <strong>idiomatic exceptions</strong>: the mere fact that utterance y does not follow a rule or goes against a rule says no more than...the fact that it is irregular. It can be stylistically undesirable, neutral, or desirable. There can be no true objective judgement of \"correctness\" or \"legality\" about this.</p>\n\n<p>When people say \"utterance y is incorrect\", what they usually do is give an <strong>aesthetic</strong> opinion: does it sound good or not? These aesthetics may be influenced by various factors, such as social class, consistency, etc. A political authority, like the Académie Française, or the author of a style book, or prevailing cultural norms, may influence what things people approve and disapprove of; but to declare the decrees of such a political entity \"binding\" is an aesthetic, moral, or practical choice, not an observation of \"fact\".</p>\n\n<p>In conclusion, <strong>there is no objective way</strong> to establish when or whether a certain construction is \"the norm\".</p>\n", "Id":"4708", "ParentId":"4706", "CreationDate":"2013-10-12T03:06:58.357", "Score":"1", "PostTypeId":"2", "OwnerUserId":"82", "LastActivityDate":"2013-10-12T03:06:58.357", "CommentCount":"3"}