{"OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2597", "AccountId":"539422", "Views":"6", "Reputation":"191", "CreationDate":"2013-10-15T04:14:37.920", "DisplayName":"Urban Vagabond", "LastAccessDate":"2013-11-06T03:51:16.427"}, "comments":[], "Body":"<p>Your definition of \"marked phoneme\" is wrong. Marked phonemes are those that are cross-linguistically relatively uncommon, and are prone to disappear during sound changes. This doesn't necessarily have anything much to do with how \"hard\" the sounds are to articulate. </p>\n\n<p>It's true that sounds with complicated articulations are often simplified (e.g. the Proto-Indo-European sound /g<sup>w</sup>h/ with secondary labialization and breathy-voice is the most \"complex\" sound and the one most liable to disappear. But the markedness of most phonemes is due to the lack of <strong>auditory</strong> prominence. This is e.g. what makes /θ/ and /β/ marked in comparison with /f/, /s/, /v/ etc.</p>\n\n<p>From an articulatory standpoint, /θ/ is <em>easier</em> than /s/; this is in fact the origin of a \"lisp\", which replaces /s/ with /θ/. Yet /s/ is one of the most stable, most common and least marked sounds cross-linguistically, due to the fact that it has extremely high acoustic prominence (that's why people say \"pssss\" or \"sssst\" to get someone's attention).</p>\n\n<p>The hardest English sound to pronounce is almost certainly /r/, and it's often the last sound learned by children. To pronounce this sound you have to retroflex the front of the tongue, and bunch up (velarize) the back of the tongue, and round the lips, all at the same time. Foreigners have a hell of a time learning this sound. English /l/ is also difficult, and (as mentioned above) /s/. But all three sounds are highly stable and highly prominent. The Wikipedia article claiming that /θ/ is difficult to learn is certainly wrong; this impression comes from adult foreign-language speakers, who in general have difficulty with <em>all</em> sounds missing from their native languages.</p>\n", "Id":"4731", "ParentId":"4253", "CreationDate":"2013-10-15T06:06:22.437", "Score":"2", "PostTypeId":"2", "OwnerUserId":"2597", "LastActivityDate":"2013-10-15T06:06:22.437", "CommentCount":"2"}