{"Body":"<p>You listed a good number of methods, and some of their disadvantages. There are also other methods, but judging from your previous comments I'm really not sure whether you will be satisfied by any of them. Part of the reason for this, I presume, is that you first have to <strong>define</strong> what <strong>meaning</strong> is. Then you can choose a method and evaluate it. Take a look at the <a href=\"http://en.wikipedia.org/wiki/Semantics\" rel=\"nofollow\">Wikipedia entry on semantics</a>, and you might also want to read a good textbook or two.</p>\n\n<p>Regarding you question on <strong>dictionary compilation</strong>, for example, you would have to define what you consider to be a complete entry. Maybe you would want it to list all the separate meanings of a word. But what is a separate meaning, what is metaphorical? In other words, when do speakers stop using a word in a metaphorical sense and start using it in two different meanings? Besides, what about very unusual meanings? I'm not sure there's a point in including a meaning that occurred twice in 1847 - but where do you draw the line? In 1884, the <a href=\"http://public.oed.com/history-of-the-oed/\" rel=\"nofollow\">Oxford English Dictionary</a> recognised the whole project might take a little longer than they thought - they had just reached the lemma <em>ant</em>, after spending five years on what was intended as a ten year project. The choices you make for a dictionary ultimately depend on the resources available and the aims (few people feel the need to consult the actual multi-volume OED, it's not a general purpose dictionary).</p>\n\n<p>If you have a concrete enough definition of meaning, you can define concrete and rigorous methods. <strong><a href=\"http://en.wikipedia.org/wiki/Prototype_theory\" rel=\"nofollow\">Prototype theory</a></strong>, for example, holds that meaning is best described in a fuzzy sense, with the prototype of a category conforming completely to the definition, while more peripheral members of the category are not prototypical but still belong to the category. Based on this you can run experiments with native speakers. For example, you present cylindrical containers made out of glass, and with different heights and diameters to people, some have a handle, some do not. If you ask native speakers for different variants of this whether they're seeing a vase or a glass, you will probably find that a handle increases the likelihood that it's a glass or cup. If the object has a very small diameter and is tall it is more likely to be a vase etc.</p>\n\n<p><strong><a href=\"http://en.wikipedia.org/wiki/Distributional_semantics\" rel=\"nofollow\">Distributional Semantics</a></strong> is an approach in Computational Linguistics. It's based on the premise that the context of a word determines its meaning. If you have a large enough corpus you can model this context, and compare it to another corpus (say, of another dialect of the same language). In this way you can compare differences in meaning between the same word in two or more dialects.</p>\n", "Id":"4772", "ParentId":"4768", "LastEditorUserId":"2278", "CreationDate":"2013-10-22T16:47:01.930", "OwnerUserId":"2278", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-10-23T07:49:38.867", "LastEditedUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}, "LastActivityDate":"2013-10-23T07:49:38.867", "Score":"0", "CommentCount":"2", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}