{"Body":"<p>OK, this is an Answer, not a book, and conversations are inhibited here.<br>\nSo I'm going to observe some restrictions to keep this relatively short.</p>\n\n<ol>\n<li>I'm not dealing with Chomsky here; I find Chomsky's proposals and theories about language and its supposed relation to human brains, minds -- and lately biology and genetics -- to be at best irrelevant, and  at worst embarrassingly ridiculous. Either way, what he might say, or has said, is of no interest to me. For details, see <a href=\"http://rubberducky.org/cgi-bin/chomsky.pl\" rel=\"nofollow\">The Chomskybot</a>.</li>\n<li>I'm restricting myself to a discussion of syntactic rules as they are developed in McCawley 1998, which is pretty basic and non-formal (formality in syntactic theory is only justifiable to the extent it makes theories machine-washable, and that is not the issue here).</li>\n</ol>\n\n<p>That said, here's the presenting question:</p>\n\n<ul>\n<li>What is the point of 'a  set of algorithms that can produce linguistic forms that correspond to those that actual speakers produce', when what we really want is to understand the actual workings of the linguistic mind? [all presuppositions by the original poster]</li>\n</ul>\n\n<p>Well, there are an <strong>awful</strong> lot of different sentences in any language; if not an infinite number, at least an extremely large number, especially if you allow recursion without limit.<br>\nHow does one describe them all? No matter when we start, we'll never finish.<br>\nThat's not helpful.</p>\n\n<p>It's the same problem with anything alive; there are a lot of worms, for instance.<br>\nHow do we describe <strong>them</strong>? By noting similarities and differences, and positing clades, like species.<br>\nSame thing in syntax. We look for similarities and differences, and posit clades.</p>\n\n<p>For instance, take the Passive construction in English.<br>\nI call it a <em>Construction</em>, but it could be called a <em>Rule</em> just as well, or an <em>Alternation</em>, though it's not cyclic. \nYou have asked \"Why say the active is basic and the passive derives from it?\"</p>\n\n<p>Look at the data. Assuming one can recognize Passive sentences and distinguish them from Active sentences, one will soon discover that for every Passive sentence there is a corresponding Active sentence -- perhaps with an indefinite subject when the Passive sentence lacks a <em>by</em>-phrase -- but that this is not true in reverse.<br>\nThe following Active sentences, for instance, have <strong>no</strong> corresponding Passive sentences:</p>\n\n<ul>\n<li><em>Bill is sick ~ Mary ran yesterday ~ It's all over now. ~ He's being honest.</em></li>\n</ul>\n\n<p>That is, there are Active sentences with no corresponding Passives, but there are no Passives with no corresponding Actives. This is a fact, and if grammar is about facts, it ought to be able to state this fact. One way to do this is to consider Passive a special effect that can be applied to most transitive sentences, but not to intransitive sentences. </p>\n\n<p>Another point to make is that corresponding Active/Passive sentences mean <strong>the same thing</strong>.</p>\n\n<ul>\n<li><em>Bill ate the cake = The cake was eaten by Bill</em>.</li>\n<li><em>Mary kicked Bill's ass. = Bill's ass was kicked by Mary.</em></li>\n</ul>\n\n<p>These are synonymous (if one is true, so is the other, and if one is false, so is the other),<br>\neven though they look and sound different. So the <strong>meaning</strong> of the Passive is predictable from its corresponding Active. Furthermore, the <strong>form</strong> of the Passive is also predictable from its corresponding Active, by the following \"algorithm\":  </p>\n\n<blockquote>\n  <p>a) Promote Object of main verb to Subject<br>\n  b) Add auxiliary <em>be</em><br>\n  c) Follow <em>be</em> immediately with the past participle of main verb<br>\n  d) If desired, express former Subject as object of <em>by</em>-phrase.</p>\n</blockquote>\n\n<p>This allows the form <strong>and</strong> the meaning of passive sentences to be described, simply, by means of reference to the corresponding active sentence. And, by unwinding, to produce a corresponding active from a passive. This cuts the number of sentences that have to be described way down, because now Passives can be completely specified by reference to the prototype Active. And every time you discover another rule, you simplify the prototype that much more. That's the rationale, basically.</p>\n\n<p>Surely any scientific theory of grammar should be able to describe such a simple correlation between simple sentences in a simple way. This is one such way. If you've got a neater way, tell us about it. And Passive is just one rule of <a href=\"http://www.umich.edu/~jlawler/haj/Preliminarybufattenedlistoftransformations.pdf\" rel=\"nofollow\">several hundred</a> in English, and this way works for all of them.</p>\n\n<p>As for the tag in the question ...</p>\n\n<blockquote>\n  <p>when what we really want is to understand the actual workings of the linguistic mind</p>\n</blockquote>\n\n<p>Who's this \"we\" you refer to?  </p>\n\n<p>There is no evidence that there <strong>is</strong> such a thing as \"the linguistic mind\" as a separate or separable entity (even ignoring problems with the ontological status of <em>mind</em>), except in the imaginations of theorists. </p>\n\n<p>There is not even any evidence that different people speaking the <strong>same</strong> native language use the same internal syntactic processes. Much less <strong>all</strong> humans speaking <strong>all</strong> languages. Forget about \"the linguistic mind\" and \"universal grammar\"; it would be nice to be have telepathic X-ray syntax vision, but not even Superman has that. </p>\n\n<p>Real linguists just have data to look at. And the data shows patterns. And the patterns can be viewed as algorithms, or as databases, or as formatting for ideas, or as social activity, or as cultural conventions, or as a lot of things. But you have to be able to state them somehow, and get the job done before the heat death of the universe.</p>\n", "Id":"4775", "ParentId":"4750", "LastEditorUserId":"482", "CreationDate":"2013-10-22T23:39:18.953", "OwnerUserId":"482", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-10-23T02:34:16.717", "LastEditedUser":{"UpVotes":"263", "WebsiteUrl":"http://www.umich.edu/~jlawler", "Id":"482", "AccountId":"1019614", "CreationDate":"2011-11-04T19:51:14.297", "AboutMe":"<p>I'm a retired linguistics professor. \nI enjoy answering questions.</p>\n\n<ol>\n<li>My <a href=\"http://www.umich.edu/~jlawler\" rel=\"nofollow\">Website</a> at the University of Michigan</li>\n<li>My <em>alt.usage.english</em> <a href=\"http://www.umich.edu/~jlawler/aue\" rel=\"nofollow\">English Grammar</a> pages</li>\n<li><a href=\"http://www.umich.edu/~jlawler/NorWesCon.html\" rel=\"nofollow\">Details and handouts</a> from some recent talks.</li>\n<li>A term paper about K-12 <a href=\"http://www.umich.edu/~jlawler/LanguageScience.pdf\" rel=\"nofollow\"><em>Language Science</em></a></li>\n<li>Two <a href=\"http://www.umich.edu/~jlawler/210CourspackPart1.pdf\" rel=\"nofollow\">scanned</a> <a href=\"http://www.umich.edu/~jlawler/210CourspackPart2.pdf\" rel=\"nofollow\">coursepacks</a> from my <a href=\"http://www.umich.edu/~jlawler/210.html\" rel=\"nofollow\">Intro Ling class</a>. (each ~100 pp)</li>\n<li>Scanned <a href=\"http://www.umich.edu/~jlawler/wow/scans/\" rel=\"nofollow\">teaching materials</a> from my <a href=\"http://www.umich.edu/~jlawler/wow\" rel=\"nofollow\">Etymology class</a></li>\n<li><a href=\"http://www.umich.edu/~jlawler/Subversive.pdf\" rel=\"nofollow\">Abstract</a> of a recent talk (4/12/12 in Denton, TX)</li>\n</ol>\n", "Age":"72", "Location":"Bellingham WA", "DownVotes":"2", "Views":"96", "Reputation":"4431", "DisplayName":"jlawler", "LastAccessDate":"2014-01-18T23:44:21.787"}, "LastActivityDate":"2013-10-23T02:34:16.717", "Score":"4", "CommentCount":"8", "OwnerUser":{"UpVotes":"263", "WebsiteUrl":"http://www.umich.edu/~jlawler", "Id":"482", "AccountId":"1019614", "CreationDate":"2011-11-04T19:51:14.297", "AboutMe":"<p>I'm a retired linguistics professor. \nI enjoy answering questions.</p>\n\n<ol>\n<li>My <a href=\"http://www.umich.edu/~jlawler\" rel=\"nofollow\">Website</a> at the University of Michigan</li>\n<li>My <em>alt.usage.english</em> <a href=\"http://www.umich.edu/~jlawler/aue\" rel=\"nofollow\">English Grammar</a> pages</li>\n<li><a href=\"http://www.umich.edu/~jlawler/NorWesCon.html\" rel=\"nofollow\">Details and handouts</a> from some recent talks.</li>\n<li>A term paper about K-12 <a href=\"http://www.umich.edu/~jlawler/LanguageScience.pdf\" rel=\"nofollow\"><em>Language Science</em></a></li>\n<li>Two <a href=\"http://www.umich.edu/~jlawler/210CourspackPart1.pdf\" rel=\"nofollow\">scanned</a> <a href=\"http://www.umich.edu/~jlawler/210CourspackPart2.pdf\" rel=\"nofollow\">coursepacks</a> from my <a href=\"http://www.umich.edu/~jlawler/210.html\" rel=\"nofollow\">Intro Ling class</a>. (each ~100 pp)</li>\n<li>Scanned <a href=\"http://www.umich.edu/~jlawler/wow/scans/\" rel=\"nofollow\">teaching materials</a> from my <a href=\"http://www.umich.edu/~jlawler/wow\" rel=\"nofollow\">Etymology class</a></li>\n<li><a href=\"http://www.umich.edu/~jlawler/Subversive.pdf\" rel=\"nofollow\">Abstract</a> of a recent talk (4/12/12 in Denton, TX)</li>\n</ol>\n", "Age":"72", "Location":"Bellingham WA", "DownVotes":"2", "Views":"96", "Reputation":"4431", "DisplayName":"jlawler", "LastAccessDate":"2014-01-18T23:44:21.787"}}