{"OwnerUser":{"UpVotes":"123", "WebsiteUrl":"https://sites.google.com/site/patrickdelliott/", "ProfileImageUrl":"http://i.stack.imgur.com/HGYBE.jpg", "Id":"2328", "AccountId":"3146009", "CreationDate":"2013-08-07T11:16:59.797", "AboutMe":"<p>I'm a PhD student in Linguistics at University College London. My primary area of interest is generative linguistics, and specifically syntactic and semantic theory. More narrowly still, i'm interested in ellipsis, comparatives, and binding theory. <a href=\"https://twitter.com/patrickdelliott\" rel=\"nofollow\">Follow me on twitter!</a></p>\n", "Location":"London, United Kingdom", "DownVotes":"43", "Views":"43", "Reputation":"970", "DisplayName":"P Elliott", "LastAccessDate":"2014-01-19T02:32:31.120"}, "comments":[], "Body":"<p>There is no special term for a verb which can <em>not</em> be followed by an infinitive, but there are a variety of special terms for those which <em>can</em>. It turns out that treating all verbs that can be followed by an infinitive as a unified class is misguided - they can be divided up into several classes on the basis of certain properties.</p>\n\n<p><strong>Control verbs</strong></p>\n\n<blockquote>\n  <p>(1) I like to eat</p>\n</blockquote>\n\n<p>With control verbs, a single Noun Phrase seems to function both as an argument of the matrix predicate, and as an argument of the embedded predicate. I.e. in (1) The speaker is the one who is doing the <em>liking</em>, and also the one who is doing the <em>eating</em>. This is modelled in generative grammar by positing a dependency between the Noun Phrase and a null pronominal category \"PRO\" in the non-finite clause:</p>\n\n<blockquote>\n  <p>(1') I_i like [ PRO_i to eat ]</p>\n</blockquote>\n\n<p><strong>Raising verbs</strong></p>\n\n<blockquote>\n  <p>(2) John seems to be leaving.</p>\n</blockquote>\n\n<p>With raising verbs, a Noun Phrase in the matrix clause functions as an argument of the embedded predicate. I.e. John is the one who is doing the <em>leaving</em>, in (2). Crucially, John does not function as the argument of the matrix predicate - John is not doing any <em>seeming</em>. Generally speaking with raising verbs, the subject can be replaced by an expletive and the non-finite with a finite clause:</p>\n\n<blockquote>\n  <p>(2') It seems that John is leaving.</p>\n</blockquote>\n\n<p>This is not possible with other verbs which take a non-finite complement, such as control verbs:</p>\n\n<blockquote>\n  <p>(3) John likes to eat<br>\n  (3') * It likes that John is eating</p>\n</blockquote>\n\n<p>Raising verbs are analysed in generative grammar as involving displacement of the subject of the embedded non-finite clause to the matrix subject position:</p>\n\n<blockquote>\n  <p>(4) John seems [ t_John to be eating]</p>\n</blockquote>\n\n<p><strong>ECM Verbs</strong></p>\n\n<p>The final class of verbs which are followed by an infinitive are ECM verbs, e.g.</p>\n\n<blockquote>\n  <p>(5) Mary believes him to be a fine dancer.</p>\n</blockquote>\n\n<p>ECM verbs can be characterised by the fact that they semantically select an entire <em>proposition</em> as their argument. ECM constructions look superficially similar to control constructions in which the matrix object is the controller, e.g.</p>\n\n<blockquote>\n  <p>(6) They told us to start</p>\n</blockquote>\n\n<p>In (6), the pronoun <em>us</em> functions as both an argument of the matrix predicate <em>told</em>, and as an argument of the embedded predicate <em>start</em>. Remember that we modelled this as a dependency between the 'controller', and a null pronominal:</p>\n\n<blockquote>\n  <p>(6') They told us_i [ PRO_i to start ]</p>\n</blockquote>\n\n<p>ECM constructions are different, in that the syntactic object of the matrix predicate does not function as a semantic argument of the matrix predicate, but as a semantic argument of the embedded predicate. In (5), it is not <em>him</em> that is being believed by Mary, but rather the proposition <em>that he is a fine dancer</em>. We model this in generative grammar as displacement of the Noun Phrase in question from the subject position of the non-finite clause to the matrix object position, similar to the analysis of raising verbs:</p>\n\n<blockquote>\n  <p>(7) They told us [ t_us to start ]</p>\n</blockquote>\n\n<p>Whether or not a verb is a control, raising or ECM verb is presumably a fact which must be <strong>learned</strong>. If a verb cannot take a non-finite clause as its complement, than it simply does not belong to one of these categories.</p>\n", "Id":"4777", "ParentId":"4773", "CreationDate":"2013-10-23T13:19:11.727", "Score":"6", "PostTypeId":"2", "OwnerUserId":"2328", "LastActivityDate":"2013-10-23T13:19:11.727", "CommentCount":"1"}