{"Body":"<p>According to a statistical estimation I know roughly 7000 words in English. I am able to read all literature with one unknown word per three lines on average (guessing on basis of ten books I have read in the last six months), can speak pretty fluently but still noticeably worse than in my native language and understand nearly everything in spoken language (conversations, films, and so on). The only remaining part of the language I have a lot of difficulties with is music.</p>\n\n<p>My third language is Russian. I have a lot of practise with listening but not understanding because I've been exposed to it passively. In the previous month I have learned the thousand most commons words by memorizing them through space repetition software and I have got six hours of training in Russian lessons. Now I am able to understand all kinds of basic conversation but with a lot of guessing.  I can express only simple thoughts, very uncomfortably, slowly and in a completely wrong way but natives understand me.</p>\n\n<p>I have seen estimations of passive native vocabulary as high as 50k and more. As mentioned above my English vocabulary is about 7k words big and with regard to my abilities I am pretty sure that a normal human being doesn't know more than say 20k to 25k words. I guess that 10k - 12k is enough to speak/understand like a native in the case that you are strong in all other areas of a language (accent, grammar, ...).</p>\n", "Id":"4849", "ParentId":"3333", "LastEditorUserId":"51", "CreationDate":"2013-11-05T11:09:38.897", "OwnerUserId":"2682", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-11-05T13:05:27.817", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2013-11-05T13:05:27.817", "Score":"0", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://mgn.cz/", "Id":"2682", "AccountId":"3538201", "CreationDate":"2013-11-05T10:53:15.330", "AboutMe":"", "Age":"22", "Location":"Prague, Czech Republic", "DownVotes":"0", "Views":"0", "Reputation":"1", "DisplayName":"Indy", "LastAccessDate":"2013-11-12T09:32:28.293"}}