{"comments":[], "Body":"<p>Yes, there is <em>some</em> evidence that some of the archetypal isolating/analytic languages of South-East Asia may be developing more morpholexical complexity. However, it seems that there are only early signs, in comparison to the evidence for English becoming more analytic - that's been happening for hundreds of years so it's pretty easy to spot by now.</p>\n\n<p>It's important to consider that although many typical isolating languages seem to lack <strong>inflectional morphology</strong>, they may still show quite a lot of <strong>derivational morphology</strong>. In <a href=\"http://nickenfield.org/files/annurevanthro34081804120406.pdf\">this paper by Enfield (2005)</a>, there is some brief discussion of derivational morphology in Mon-Khmer languages, noting that while for some languages, like Khmer, the derivational morphology is visible but no longer productive, in other languages, such as Semelai, the system is quite rich and productive.</p>\n\n<p>Enfield also discusses the resources used by some languages of mainland South-East Asia to create elaborative, alliterative or rhyming expressions, noting that these frequently give rise to morphologically complex structures, and in particular that \"a huge system of such patterns is found in Vietnamese (Thompson 1987 [1965]), despite its status as an archetypically morphology-poor language\". He also adds that \"the productivity and internal complexity of elaborative morpholexicon in MSEA languages should weaken claims that these languages lack morphology. One just has to know where to look.\"</p>\n\n<p>One example given from Lao is <em>qêêk5-lêêk5</em> 'lying askew like someone asleep in an awkward position'.</p>\n\n<p>I don't know if there's any evidence for the derivational morphology in these languages becoming more complex over time, but for some it certainly doesn't seem to be going away. As far as more inflectional-type morphology goes, there was some work comparing grammaticalization in Mandarin Chinese and Thai, two typologically very similar languages, both at the extreme end of the 'isolating' part of the morphosyntactic structure continuum. In <a href=\"http://gauhati.academia.edu/MarkWPost/Papers/119576/Grammaticalization_and_compounding_in_Thai_and_Chinese_A_text-frequency_approach\">this paper by Post (2007)</a>, various types of constructions are examined to assess the depth of the grammaticalization of certain features, given that compounds and polysyllabic constructions are common in both languages and \"some affixlike behaviour has been observed\". Post finds that, for Chinese and Thai constructions of comparable form and function:</p>\n\n<ul>\n<li>\"analogous terms grammaticalizing within these constructions have achieved a greater extent of structural adjustment as functors in Chinese than in Thai, i.e. are more 'deeply' grammaticalized\", and;</li>\n<li>\"processes of compounding are more extensive in Chinese than in Thai, as measured by frequency of types and tokens as well as factors such as analyzability and semantic drift\".</li>\n</ul>\n\n<p>One example is the evidence for <em>bǎ</em> becoming generalized as a focused object-marker in Chinese.</p>\n\n<p>Post suggests that the points noted above:</p>\n\n<blockquote>\n  <p>\"appear to be <strong>symptomatic of a shift in morphosyntactic typology, on the Chinese side more so than in Thai, away from an extreme isolating, basically monosyllabic prototype towards a more concatenative structure.</strong> It is possible that both languages are shifting in this direction, and Chinese simply started earlier, or has moved faster, than Thai.\" </p>\n</blockquote>\n\n<p>He then goes on to suggest that there might be a stronger correlation between more compounding and 'deeper' grammaticalization; the obsolescence of basic source lexemes for the grammaticalizing forms (the source lexemes typically being replaced by compounds) might actually encourage the partially grammaticalized versions to shed their lexical-like attributes, and allow behavioural restrictions to become more firmly established.</p>\n\n<p>There are other hints of similar observations around, but these sorts of things can be very difficult to tease out in the early (or mid-term) stages, and require a lot of data, so I think it will be some time before we know for sure whether some of these languages are becoming more agglutinating. Seeing as there is really no such thing as a purely isolating language, we also can't know for sure whether some of these languages are on their way to becoming more or less isolating - they might not be ready to move on to agglutinating if they're not done with the isolating stage!</p>\n", "Id":"485", "ParentId":"385", "CreationDate":"2011-09-24T11:46:28.303", "Score":"6", "PostTypeId":"2", "OwnerUserId":"153", "LastActivityDate":"2011-09-24T11:46:28.303", "OwnerUser":{"UpVotes":"47", "WebsiteUrl":"", "DownVotes":"1", "Id":"153", "AccountId":"871764", "Views":"33", "Reputation":"1445", "CreationDate":"2011-09-18T03:14:58.320", "DisplayName":"Floating Tone", "LastAccessDate":"2012-05-27T05:07:04.410", "AboutMe":"<p>I'm a PhD candidate in linguistics, with diverse interests including phonetics, phonology, morphology, language documentation, historical linguistics and sociolinguistics. I am particularly interested in the languages of Africa, Papua New Guinea and Australia. I'm also very interested in methods of making linguistic knowledge and materials more accessible and available to linguists and non-linguists alike.</p>\n"}}