{"OwnerDisplayName":"FumbleFingers", "comments":[], "Body":"<p>I think CGEL is pretty much correct here.</p>\n\n<p>It's at least \"odd\" to use <em>there</em> in this construction to say something additional about the people <em>already mentioned in the previous sentence</em>, so that makes the first two versions sound somewhat clumsy to me.</p>\n\n<p>I also don't like the third version, but I'm not sure CGEL are on such solid ground with their obscure <em>addressee/discourse-new</em> terminology to explain why it's not so good. If I replace <em>\"behind him there was the Vice President\"</em> with <em>\"in front of him there was the Presidential seal\"</em> it doesn't seem so awkward to me. The fact that the VP is another <em>politician/person</em> similar to the other four already mentioned seems to be significant to my inner ear, which winces a bit at #3.</p>\n\n<p>Although I can't justify it on grammatical grounds, I don't much like #4 either. I agree \"stood\" is better than \"was\", but if the VP isn't mentioned in the first sentence that implies he was <em>already on the podium</em>. Which makes it seem strange to suddenly add him into the verbal picture that's being painted by using <em>\"appeared\"</em> in the first place. The context implies we already have a mental picture of the podium before the presidential appearance, so bringing up that pre-existing detail as if it were part of the sudden apparition being described just seems clumsy to me.</p>\n\n<p>In short, #4 may be grammatical by CGEL's lights, but I'm not keen on the entire construction. I think that's because \"stood\" doesn't really mean anything different to \"was\" here. We're at the margins of fine distinctions, but I'd rather just sidestep the issue with <em>\"The VP stood behind him\"</em>.</p>\n", "Id":"491", "ParentId":"489", "CreationDate":"2011-09-22T15:38:16.690", "Score":"7", "PostTypeId":"2", "OwnerUserId":"282", "LastActivityDate":"2011-09-23T11:30:12.550", "OwnerUser":{"UpVotes":"21", "WebsiteUrl":"", "Id":"282", "AccountId":"234202", "CreationDate":"2011-09-24T14:53:50.813", "AboutMe":"<p>The handle isn't randomly-chosen. I still type with two fingers after over 30 years as a solo custom software supplier, and I still mis-hit the keys!</p>\n\n<p>Actually, I've been in (involuntary) retirement for a year or so - giving me too much time on my hands, much of which I spend on Language.se gaining rep I probably don't deserve. But I do have a keen interest in all aspects of English for my own edification, plus I get a buzz out of the way EL&amp;U enables me to actively participate in fostering that same interest in others.</p>\n", "Age":"60", "Location":"United Kingdom", "DownVotes":"3", "Views":"11", "Reputation":"377", "DisplayName":"FumbleFingers", "LastAccessDate":"2013-11-10T21:17:40.387"}}