{"Body":"<p>There are so many ways that a person's speech can indicate that he is not a native speaker of English (or that he is a speaker of English from certain region). Basically, accents happen when you are using non-English rules (can be phonetic, syntax, idiomatic, etc.) when speaking English. Many speakers do not realize that they are using rules from their own language that are not compatible with the rules of English, since they assume the rules to be true. Because non native speakers often don't notice this, it is very hard to fix unless they practice with a native speaker and have him/her correct them.</p>\n\n<p>Some examples</p>\n\n<ul>\n<li><p>Phonemes. One's native language has a different set of phonemes than English, and some English phonemes are not available in one's language. For example, Japanese doesn't have the sound 'l' (they use something like an 'r' instead), French doesn't have 'th' (use 'z' or 's' instead) and a lot of English vowels are not available in French (so they merge them with the available vowels)</p></li>\n<li><p>Syllable pattern. For example, in Japanese a syllable can begin with at most one consonant and must end in a vowel, so they pronounce girlfriend as \"garufurendo\", etc.</p></li>\n<li><p>Pronunciation rules. For example, French don't pronounce the letter 'h', etc. Plus English is notorious for very unpredictable pronunciation rules, it is often hard for non native speakers to use the right pronunciation naturally.</p></li>\n<li><p>Intonation pattern. This is also hard to get right because it is unpredictable for non native speakers, other languages' pattern are often really different from English, and people often don't realize that they are speaking with a non native-like intonation pattern</p></li>\n<li><p>Syntax. For example, speakers of isolating languages tend to forget using the right inflection (plural, past tense, etc). After you learn for a while, you will not make such simple mistakes, but non native speakers often don't get the finer point of the syntax, like what hippietrail noticed</p></li>\n<li><p>Idioms</p></li>\n<li><p>Choice of words</p></li>\n</ul>\n\n<p>There are many other ways you can do it \"wrong\", so the best suggestion is to speak with a native speaker who knows about these things and have him/her correct you.</p>\n", "Id":"496", "ParentId":"486", "LastEditorUserId":"92", "CreationDate":"2011-09-24T16:18:24.533", "OwnerUserId":"92", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-01-17T07:10:19.517", "LastEditedUser":{"UpVotes":"488", "WebsiteUrl":"http://claimid.com/louisr", "Id":"92", "AccountId":"163323", "CreationDate":"2011-09-14T02:07:23.613", "AboutMe":"<p>trying to learn and help others learn :)</p>\n", "Age":"34", "Location":"Your computer", "DownVotes":"39", "Views":"97", "Reputation":"3271", "DisplayName":"Louis Rhys", "LastAccessDate":"2014-01-18T16:45:57.423"}, "LastActivityDate":"2012-01-17T07:10:19.517", "Score":"16", "CommentCount":"5", "OwnerUser":{"UpVotes":"488", "WebsiteUrl":"http://claimid.com/louisr", "Id":"92", "AccountId":"163323", "CreationDate":"2011-09-14T02:07:23.613", "AboutMe":"<p>trying to learn and help others learn :)</p>\n", "Age":"34", "Location":"Your computer", "DownVotes":"39", "Views":"97", "Reputation":"3271", "DisplayName":"Louis Rhys", "LastAccessDate":"2014-01-18T16:45:57.423"}}