{"comments":[], "Body":"<p>People that grow up with more than one language, can end up being fluent in each language, and have native-speaker competency, but there will still be a dominant language.  This could arise from social stigma (e.g. avoiding speaking a language that is not a dominant language in the community), from lack of full community to engage in (e.g. speaking a parent's native language in a community where few, if any others, speak that language, also commonly referred to as heritage speakers) or from simple cognitive barriers.  This barrier is usually associated with when the L2 is learned and how much the L2 is used, which leads to four main groups: early critical period-high proficiency, early critical period-low proficiency, late critical period-high proficiency, late critical period-low proficiency.<br>\nSo even with a Simultaneous Bilingual, there will be sociolinguistic pressures that make one of the languages a dominant language.  In this sense you can analyse the development of the bilingualism in much the same way as you would any second language acquisition.  Unfortunately there is no guarantee that the Simultaneous Bilingual will have better cross-linguistic ability when compared to the Sequential Bilingual, as this is a function of many variables, but I would feel comfortable putting my money on betting that the Simultaneous Bilingual would have a higher probability of being a high proficiency user of the L2, simply because they have more time, and we can assume that the L2 is acquired before the critical period is over.  Whereas the Sequential Bilingual might not begin learning the L2 until later in the critical period.  And it is important to recognize that the critical period fades over time, and at different rates for each person, and that the early critical period is more valuable than later stages of the critical period.<br>\nBut to answer your question more directly, there will be differences between the two bilinguals, but neither is a solid predictor of language competency.  Which I can attest to from personal experience, where I learned German at a later age (7) than my brother (5), and I have a greater competency than he does.  A good book I can recommend is the book <a href=\"http://rads.stackoverflow.com/amzn/click/0805854983\" rel=\"nofollow\">Second Langauge Acquisition</a>, which has a lot of good information on bilingualism.</p>\n", "Id":"531", "ParentId":"425", "CreationDate":"2011-09-26T15:09:28.263", "Score":"3", "PostTypeId":"2", "OwnerUserId":"150", "LastActivityDate":"2011-09-26T15:09:28.263", "OwnerUser":{"UpVotes":"10", "DownVotes":"0", "Id":"150", "AccountId":"409031", "Views":"12", "Reputation":"535", "CreationDate":"2011-09-17T17:33:21.593", "DisplayName":"Mark Tuttle", "LastAccessDate":"2012-11-29T16:52:17.370"}}