{"OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "comments":[], "Body":"<p>Pirahã <a href=\"http://en.wikipedia.org/wiki/Pirah%C3%A3_language\" rel=\"nofollow\">has a consonant phoneme that's pronounced [g] in some contexts and [n] in others</a>.  (It has no other nasal phonemes, and arguably no other velar phonemes.)  So the question here is, \"Is this Mystery Consonant <em>really</em> a /g/, or is it <em>really</em> an /n/?\"</p>\n\n<p>As a matter of convention, linguists tend to name consonants after their default pronunciation if there is a clear default.  According to the Wikipedia article, the Pirahã Mystery Consonant is pronounced [n] after a pause and [g] elsewhere.  That suggests that [g] is the default pronunciation, and that we should name the phoneme /g/.  And by the looks of it, that's what the linguists who work on Pirahã have done.  </p>\n\n<p>For what it's worth, too, it's not <em>terribly</em> uncommon for languages to lack nasal phonemes.  Whereas it's <em>quite</em> uncommon for languages to lack velar phonemes: /k/ is the most common consonant across languages.  (There are <em>some</em> languages without phonemic /k/, including Tahitian and maybe some varieties of Hawaiian.  But it's very, very rare.)  </p>\n", "Id":"532", "ParentId":"520", "CreationDate":"2011-09-26T15:27:01.710", "Score":"9", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2011-09-26T15:27:01.710", "CommentCount":"5"}