{"Body":"<p>The main difference lies in what part of your tongue enters in contact with your <em>velum</em> (aka <em>soft palate</em>).</p>\n\n<ul>\n<li><p>If you try to pronounce \"light\" [try with a French accent if that doesn't work with your native Australian pronunciation ;-)] you will notice that the <em>tip</em> of your tongue enters in contact with your velum.  It leans on the alveolar ridge and touches the upper front teeth.  This is conspicuous when the \"l\" is at the beginning of a word.</p></li>\n<li><p>If instead you decompose the pronunciation of words like \"feel\" or \"false\" [as heard on the BBC may be], you will notice that your tongue makes itself more compact and touches an inner part of the velum (by which I mean more towards the back of your mouth).<br>\nAs you can see from the examples I cited, this actually happens when the \"L\" is at the end of the syllable (and often the word itself).<br>\nNormally you should also notice, in a subsequent phase, that the tip of your tongue touches the front of your palate closer to the teeth, but since you already mentioned that you tend to finish your \"dark Ls\" with a \"w\" sound, it is possible that this part is absent in your pronunciation - which is actually quite common in America for instance.  On the other hand <em>Received Pronunciation</em> does have both phases.</p></li>\n</ul>\n\n<p><br>\nIf you don't notice a tongue position difference between \"light\" and \"dark\" Ls in your way of pronouncing the words mentioned above, you might still notice a synchronisation difference. </p>\n\n<ul>\n<li>In a \"light L\", the tongue moves faster towards the front. </li>\n<li>In a \"dark L\" one clearly feels two different phases - try \"false\" or \"tell\" against \"tale\". Caution though: this is a different phenomenon from the length of the preceding vowel.</li>\n</ul>\n\n<p>As for this more subtle difference, I have to quote \"<a href=\"http://rads.stackoverflow.com/amzn/click/0521533783\">Phonology and Language Use</a>\" (p. 87).</p>\n\n<blockquote>\nBrowman and Goldstein (1992, 1995) have discovered a generalization regarding the difference between certain sonorant consonants in\nsyllable-initial and syllable-final position.<br><br>\nIn syllable-initial position, the gestures involved in producing a consonant such as [n] or [l] are more synchronous than in syllable-final position, where the gestures\nare more spread out over time. Indeed, Browman and Goldstein (1992,\n1995) report that multiple gestures following a vowel are phased such\nthat the wider gesture – the one with lesser degree of constriction –\ncomes earlier, yielding a structure in which the syllable nucleus has the\nwidest opening and subsequent gestures are organized towards gradual\nclosure. Studies of the relative phasing of syllable-final gestures leads\nto a unified description of the seemingly unrelated phonetic pattern of\n‘velarization’ of [l] in syllable-final position and the nasalization\nof vowels before tautosyllabic nasal consonants. <br><br>\nAmerican English [l], both syllable-initial and syllable-final (‘dark’) [l], is produced with\ntwo gestures: one involving the tongue tip and one involving the tongue\ndorsum. For [l] before a vowel, the two gestures occur almost simultaneously, \nwhile after a vowel, the tongue dorsum gesture begins much\nearlier than the tongue tip gesture. In fact, for the postvocalic [l],\nthe end of the retraction of the back of the tongue occurs only a little\nafter the beginning of the raising of the tongue tip. The acoustic impression of a velarized or ‘dark’ [l] results from this retraction of the back\nof the tongue occurring before the tongue tip raises (Sproat and\nFujimura 1993).\n\n</blockquote>\n\n<p>A few more considerations: </p>\n\n<ul><li>In Albanian, it should be easier to tell which is which because dark Ls are spelled with a double \"l\" whereas light ones are spelled with just a single one.</li>\n<li>\nAn emphasised \"dark L\" is conspicuous in the Arabic pronunciation of \"Allah\" (الله‎) and since you are currently living in Albania, you should probably be able to feel the \"depth\" of the \"l\" in Allah (also noted /lˤ/ in IPA).\n</li>\n</ul>\n", "Id":"539", "ParentId":"535", "LastEditorUserId":"112", "CreationDate":"2011-09-26T19:32:44.203", "OwnerUserId":"112", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-26T21:12:01.000", "LastEditedUser":{"UpVotes":"219", "WebsiteUrl":"http://sourceforge.net/projects/jarsearch/", "Id":"112", "AccountId":"282385", "CreationDate":"2011-09-14T09:38:41.260", "AboutMe":"<p>Born a Frenchman, addicted to the BBC (wherever I live bloom satellite dishes), I have spent several years in the UK (specifically Richmond (I said \"UK\" )) as well as in Italy (Naples (I said \"Italy\")). Currently based in Dubai (UAE).</p>\n\n<p>An electronic Engineer by formation and an IT/Telecom professional by occupation, I've had the opportunity to work in many countries (Saudi Arabia, China mainland and Taiwan, Romania, Spain, Ghana, the Netherlands, Brazil, United States, Panama, Dominican Rep., Tunisia, Turkey, Syria and a few others).</p>\n\n<p>Raised by a German au pair at 5, having done my military duty in Germany, I've always been fascinated by languages in general and etymology in particular and my occupation has provided me with several opportunities to indulge in this hobby. I started to learn several languages and still can understand a few of them: including English, Italian and Spanish. The latter allowing me to communicate with my son (see avatar), my wife and my in-laws.</p>\n\n<p>Other accounts I have in the stackexchange family include <a href=\"http://english.stackexchange.com/users/5432/alain-pannetier\">English Language &amp; Usage</a>, <a href=\"http://stackoverflow.com/users/579240/alain-pannetier\">stackoverflow</a>,  <a href=\"http://programmers.stackexchange.com/users/18217/alain-pannetier\">programmers</a>, <a href=\"http://french.stackexchange.com/users/131/alain-pannetier\">French Language &amp; Usage</a>, <a href=\"http://german.stackexchange.com/users/205/alain-pannetier\">German Language and Usage</a> and <a href=\"http://stackexchange.com/users/282385?tab=accounts\">a few others</a>.</p>\n\n<p>If you wish to contact me, please feel free to do so using my email/chat account which is alain dot pannetier at gmail dot com.</p>\n", "Age":"53", "Location":"Paris, France", "DownVotes":"4", "Views":"14", "Reputation":"560", "DisplayName":"Alain Pannetier", "LastAccessDate":"2014-01-17T17:52:53.833"}, "LastActivityDate":"2011-09-26T21:12:01.000", "Score":"10", "CommentCount":"2", "OwnerUser":{"UpVotes":"219", "WebsiteUrl":"http://sourceforge.net/projects/jarsearch/", "Id":"112", "AccountId":"282385", "CreationDate":"2011-09-14T09:38:41.260", "AboutMe":"<p>Born a Frenchman, addicted to the BBC (wherever I live bloom satellite dishes), I have spent several years in the UK (specifically Richmond (I said \"UK\" )) as well as in Italy (Naples (I said \"Italy\")). Currently based in Dubai (UAE).</p>\n\n<p>An electronic Engineer by formation and an IT/Telecom professional by occupation, I've had the opportunity to work in many countries (Saudi Arabia, China mainland and Taiwan, Romania, Spain, Ghana, the Netherlands, Brazil, United States, Panama, Dominican Rep., Tunisia, Turkey, Syria and a few others).</p>\n\n<p>Raised by a German au pair at 5, having done my military duty in Germany, I've always been fascinated by languages in general and etymology in particular and my occupation has provided me with several opportunities to indulge in this hobby. I started to learn several languages and still can understand a few of them: including English, Italian and Spanish. The latter allowing me to communicate with my son (see avatar), my wife and my in-laws.</p>\n\n<p>Other accounts I have in the stackexchange family include <a href=\"http://english.stackexchange.com/users/5432/alain-pannetier\">English Language &amp; Usage</a>, <a href=\"http://stackoverflow.com/users/579240/alain-pannetier\">stackoverflow</a>,  <a href=\"http://programmers.stackexchange.com/users/18217/alain-pannetier\">programmers</a>, <a href=\"http://french.stackexchange.com/users/131/alain-pannetier\">French Language &amp; Usage</a>, <a href=\"http://german.stackexchange.com/users/205/alain-pannetier\">German Language and Usage</a> and <a href=\"http://stackexchange.com/users/282385?tab=accounts\">a few others</a>.</p>\n\n<p>If you wish to contact me, please feel free to do so using my email/chat account which is alain dot pannetier at gmail dot com.</p>\n", "Age":"53", "Location":"Paris, France", "DownVotes":"4", "Views":"14", "Reputation":"560", "DisplayName":"Alain Pannetier", "LastAccessDate":"2014-01-17T17:52:53.833"}}