{"Body":"<p>I'm not sure why you think that affixes cannot be stacked.  Here's an example from English, whose morphology no one will argue has non-affixal properites:</p>\n\n<pre>\nanti- dis- establish -ment -ari -an -ism\n</pre>\n\n<p>We also need to separate case marking from case agreement.  A given noun phrase is assigned one case; in languages like Latin that case percolates through the NP by agreement among its members, but that operation is logically separate from the assignment of case.  (Your Basque example could be analyzed as a post-position, but a parallel one with an unambiguous case marker is easy to construct: <em>aita eta amak</em> \"dad and mom-ERG\"*.)</p>\n\n<p>Clitics and affixes often share many features (phonological dependence on host/root, grammatical function), so it can be difficult to distinguish them from each other <em>a priori</em>.  Furthermore, the development from (independent word ->) clitic -> affix is quite common historically, so at any given time there is no strong guarantee that a particular item in a particular language is not in the process of shifting from one category to another and thus displaying a mixture of properties.  As a result of this fact, the categories \"clitic\" and \"affix\" have not been rigorously distinguished in the literature, leading to vagueness about what their defining properties are.</p>\n\n<p>There is one kind of clitic that is unambiguously non-affixal: second-position (also sometimes called Wagernackel) clitics.  These are always placed after the first word/phrase (there can be variation between the two options) regardless of its identity.  Another diagnostic of pure phonological clitic-ness is syntactic movement: if a clitic's host is moved, does the clitic follow (affixlike behavior) or remain behind (phonological clitic-like behavior).  Here's an example of <em>not</em> in English showing both kinds of behavior (the non-affixing variant is more formal, indicating that it is the more conservative option):</p>\n\n<pre>\n(1) Didn't John kiss Mary?\n(2) Did John not kiss Mary?\n</pre>\n\n<hr>\n\n<p>*The issue of distributing case over conjoined elements is interesting, given what we (don't) know about the syntax of conjunctions; it could provide a diagnostic of case vs. prepositionhood.  It has been claimed that case cannot distribute over a conjunction whereas prepositions can.  In the case of Basque, we should avoid calling things like the dative and (especially) ergative prepositions, so the status of this generalization is not clear.</p>\n", "Id":"565", "ParentId":"562", "LastEditorUserId":"46", "CreationDate":"2011-09-27T16:52:10.040", "OwnerUserId":"46", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-27T21:12:31.037", "LastEditedUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}, "LastActivityDate":"2011-09-27T21:12:31.037", "Score":"8", "CommentCount":"2", "OwnerUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}}