{"OwnerUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}, "comments":[], "Body":"<p>Tsela's answer is very thorough, but I wanted to point out another aspect of the question.  There are some basically universal cognitive biases about linear order in language (basically, new information goes later in the sentence).  Languages with a strict word order (in terms of argument positions) will have more resources for shuffling arguments to meet this property.  An extreme example of this would be Malagasy, which has strict VOS word order, but has morphology that allows you to put almost anything in \"subject\" position.*  \"Free word order languages\" on the other hand may lack some of this morphology, since they can satisfy the cognitive order requirements by reordering words in a sentence.  However, in a given discourse context, only one word order may be grammatical.  To use an example from Basque:</p>\n\n<pre>\nQ: Zein-ek ikusi du  Miren?\n   Who-ERG see   AUX M.-DAT\n   \"Who saw Miren?\"\nA: Jon-ek ikusi du  Miren\n   J.-ERG see   AUX M.\n   \"John saw Miren\"\n * Jon-ek Miren ikusi du\n   J-ERG  M.    see   AUX\n * Ikusi ba-du   Jon-ek Miren\n   see   AFF-AUX J.-ERG M.\n</pre>\n\n<p>So describing a language as having \"free word order\" can be misleading, since speakers are often constrained by context to use only one order.  When we discuss word order we should talk about which languages have more or less morphology for marking word order permutations.</p>\n\n<hr>\n\n<p>*If this is unfamiliar to you, it can be understood by analogy to English passives, which work by putting the object in subject position (<em>John kissed Mary</em> -> <em>Mary was kissed</em>).  Malagasy has \"more passives\" for putting things like an instrument or location into subject position.</p>\n", "Id":"567", "ParentId":"557", "CreationDate":"2011-09-27T17:08:52.527", "Score":"7", "PostTypeId":"2", "OwnerUserId":"46", "LastActivityDate":"2011-09-27T17:08:52.527", "CommentCount":"1"}