{"Body":"<p>Well they can be used consistently across languages if you are prepared to come up with a scheme that covers just the languages you need by going to a more narrow transcription, or to cover all languages by going to a very narrow transcription.</p>\n\n<p>But then you will have lots of diacritics on the symbols and it becomes a lot harder to read.</p>\n\n<p>You will also have to choose a phonological analysis of each language. Because we don't have access to \"god's design\" of any language we can only analyse how they work and come up with theories. And any sufficiently studied language will have multiple analyses, each resulting in a different set of phonemes and what other sounds are then allophones of those phonemes, etc.</p>\n\n<p>For English the main different analyses are based on regional Englishes, with the two major ones being Received Pronunciation for British English and General American for American English. But there are many other varieties of each of those, and even though the various analyses of each are mostly in agreement, there are still variations and you will have to make choices.</p>\n\n<p>For Chinese the situation is much worse. Even if you choose Standard Chinese there are several major variations on how to analyse the phonemic iventory based on peculiarities of which vowels are in complementary distribution. I belive there are three main ways to group the vowels. On top of this there are some symbols which have been obsoleted by the IPA which seem to still be used by Sinologists.</p>\n\n<p>Anyway it is doable but to do properly will require more thought and more work than perhaps you expected. The easy way will be to make some perhaps arbitrary choices about which analysis of which variety of each language to use as a base, and inherit any quirks they have.</p>\n\n<p>The hard way will be to embrace the discord among the analyses and try to cover as much of the variance among them.</p>\n\n<h1>TL;DR</h1>\n\n<p>There are more <em>phones</em> in a language than <em>phonemes</em>. The IPA symbols are not consistent across languages, or even within languages, at the <em>phoneme level</em>. IPA symbols are consistent across and within languages at the <em>phone level</em>.</p>\n", "Id":"5874", "ParentId":"5873", "LastEditorUserId":"51", "CreationDate":"2013-11-10T03:01:28.630", "OwnerUserId":"51", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-11-15T10:41:50.897", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2013-11-15T10:41:50.897", "Score":"4", "CommentCount":"1", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}