{"Body":"<p>(my slightly incoherent ramblings on recursion, Merge, and embedding) </p>\n\n<p><strong>Recursion as self-embedding</strong></p>\n\n<p>In some generative theories of syntax, recursion is usually understood as self-embedding, in the sense of putting an object inside another of the same type (Fitch 2010, Kinsella 2010, Tallerman 2012). However, Tallerman 2012 argues that HFC 2002 used recursion in the sense of phrase-building or the formation of hierarchical structure generally (p. 451).</p>\n\n<p><strong>Recursion is not Merge</strong></p>\n\n<p>cf. Berwick 1998's observation that recursive generative capacity is an inherent property of Merge (p. 332). They are both concatenative (or combinatorial) operations; however, Merge involves hierarchy.</p>\n\n<p><strong>Merge vs. iteration</strong></p>\n\n<p>Chomsky says that Merge is putting alpha and beta together. If you want to add gamma to it, then you add gamma to a object [alpha+beta]. The issue here is that for [alpha+beta] to be different from a mere sum of alpha and beta, some new property must arise, otherwise we’ll end up with iteration. What is this new property?</p>\n\n<p>Nevins et al. argue that Merge is recursive because it can combine “lexical items and phrases” of any type (p. 367, n.11), cf. Zwart 2011 “[t]he operation Merge is standardly taken to be recursive in that the output of Merge may be subject to further operations Merge” (p. 116).</p>\n\n<p>When alpha and beta are Merged, either alpha or beta projects its property (N, D, V, v, T, C etc.) onto this whole new phrase. This is what Horsntein 2010 calls Label (and Chomskyan Merge is Concatenate under his proposal; also notice that some generativists don’t do labels, like Chris Collins). However, this information about the head isn’t necessarily preserved through several instances of Merge, e.g. V selects a DP and we end up with a VP. What makes Merge truly recursive is that “the output of one derivation functions as a single item in the next derivation” (Zwart 2011, p. 116). I think this is very important, otherwise Merging gamma with [alpha+beta] will lead to simple iteration. [alpha+beta] must be treated as a single unit when it is Merged with gamma.</p>\n", "Id":"5880", "ParentId":"5875", "LastEditorUserId":"445", "CreationDate":"2013-11-11T02:22:23.390", "OwnerUserId":"445", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-11-11T02:33:25.913", "LastEditedUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}, "LastActivityDate":"2013-11-11T02:33:25.913", "Score":"3", "CommentCount":"2", "OwnerUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}}