{"OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "comments":[], "Body":"<p>There is modern English slang <em>that is in-fucking-credible</em>. </p>\n\n<p>Further you could say various forms of reduplication are discontinuous, such as the Greek perfect, where reduplication and perfective suffix must come together or not at all, similar to Dutch/German ge-werk-t. Present stem <em>lu-</em>, perfect stem <em>le-lu-k-</em>, where <em>le...k-</em> together mark the perfect stem. A few verbs also have reduplication in non-perfective stems, but then many Dutch/German words also have <em>ge-</em> in non-past-participles, like <em>ge-voel</em>. To both <em>ge...t</em> and <em>le...k-</em> applies that they are perhaps best considered two morphemes each.</p>\n\n<p>Seperable verbs might also count as discontinuous, but they are certainly not single morphemes.</p>\n\n<p>There is a Dutch <em>h</em> + reduplicated vowel that are sometimes informally used as an infix for emphasis, mainly in speech:</p>\n\n<blockquote>\n  <p>KPN dwingen om de post op zondag te bezorgen? Dat kan toch niet, wat zei ik nou net: KPN is een <em>ondernéhéming</em>, geen staatsbedrijf.</p>\n</blockquote>\n\n<p>\"Force KPN (postal service) to deliver the post on Sundays? You know that isn't possible, what have I just told you? KPN is an <em>enterpríhíse,</em> not a government agency.\" However, I'm not sure whether this <em>hV</em> should be considered a morpheme rather than just a phonetic bit of...something.</p>\n", "Id":"5936", "ParentId":"5935", "CreationDate":"2013-11-19T19:42:16.187", "Score":"3", "PostTypeId":"2", "OwnerUserId":"82", "LastActivityDate":"2013-11-19T19:42:16.187", "CommentCount":"3"}