{"Body":"<p>In any language (or most languages, anyway) there are sounds which speakers of some other languages will regard as different, but in the specific language they are regarded as variants of the same sound: usually, most speakers of that language will not even be aware that there is a difference. </p>\n\n<p>A group of sounds which are not distinguished in a language are referred to as a <em>phoneme</em>, and the different realisations of that phoneme are its <em>allophones</em>. </p>\n\n<p>Your example, of [l] and [ɫ], is a case in point: for most English speakers the choice between them is entirely occasioned by the phonetic environment (what sounds come before or after them), though this choice varies for different dialects of English. </p>\n\n<p>The standard test for whether two objectively different sounds are the same phoneme in a language, is to look for <em>oppositions</em>: words in which both occur, and are regarded by the speakers of that language as different sounds. </p>\n\n<p>However, that test is not the whole story. [h] and [ŋ] are not found in contrary opposition, yet are clearly not the same phoneme; the explanation, as Aspinea says, is that in English they are each limited to environments which don't happen to overlap. </p>\n\n<p>An interesting case in English is the dental fricatives, [θ] and [ð]. Many English speakers do not even notice until it is pointed out to them, that these are different sounds (the fact that they are both spelt 'th' often misleads people). They <em>are</em> different phonemes, but there are only a few minimal pairs: \"wreath\"/\"wreathe\"; \"sooth\"/\"soothe\", and (marginally in the modern language) \"thigh\"/\"thy\". </p>\n", "Id":"5946", "ParentId":"5940", "LastEditorUserId":"718", "CreationDate":"2013-11-20T14:24:52.067", "OwnerUserId":"718", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-11-23T01:25:44.787", "LastEditedUser":{"UpVotes":"90", "Location":"England, United Kingdom", "DownVotes":"10", "Id":"718", "AccountId":"34526", "Views":"13", "Reputation":"1364", "CreationDate":"2012-01-27T00:02:42.473", "DisplayName":"Colin Fine", "LastAccessDate":"2014-01-18T23:15:12.837"}, "LastActivityDate":"2013-11-23T01:25:44.787", "Score":"5", "CommentCount":"5", "OwnerUser":{"UpVotes":"90", "Location":"England, United Kingdom", "DownVotes":"10", "Id":"718", "AccountId":"34526", "Views":"13", "Reputation":"1364", "CreationDate":"2012-01-27T00:02:42.473", "DisplayName":"Colin Fine", "LastAccessDate":"2014-01-18T23:15:12.837"}}