{"Body":"<p>I teach my pupils the matter like this (and I hope it’s useful for anyone who reads this thread):</p>\n\n<p>Greek has three ways of representing actions (I’m leaving out future tense because it merely expresses tense).</p>\n\n<p>[1] as actions in process or repeated actions – durative [all forms beloning to the præsens stem] e.g. θνῃσκ- = to be dying</p>\n\n<p>[2] as (merely) completed or single actions pointing towards completion – completive [all forms of the aorist [stem]: (‘aorist’ and ‘aorist stem’ mean the same in this way of representing). θαν- = to expire one’s last breath</p>\n\n<p>[3] as a result of actions – resultative [all forms of the perfect stem] τεθνα-/τεθνηκ- = to have died -> to be dead</p>\n\n<p>Then I explain to them that this basic stem related meaning is conveyed in all forms belonging to that specific stem (durative/præsens, completive/aorist, resultative/perfect).</p>\n\n<p>Then I explain that all these stems have present tenses, past stenses, participles, imperatives, subjunctives, optatives and infinitives.</p>\n\n<p>The next thing I need to do is explain that the aorist doesn’t/can’t have a present tense, because the idea of ‘completedness’ and ‘present tense’ are incompatible.\nAnother thing that needs to be clarified is the perfect present tense is something different than the perfectum of Latin, but usually soon after this they realise there are only three past/preterite tenses in Greek [imperfectum (ἔθνῃσκεν), aorist past tense (ἔθανεν) and plusquamperfectum (ἐτεθνήκει) – all marked by the augment].</p>\n\n<p>So, not all forms belonging to the aorist (stem) express past tense (θάνοι τάχα καὶ ἡσυχῇ - may he pass away soon and peacefully, πολλὰ δῶρα βούλομαι σχεῖν – I want to get/have any presents, τὴν θύραν ἀνοῖξον – close the door, ἡσθήσομαι οἴκαδε ἀφικόμενος - I will be happy (after) having arrived home).</p>\n\n<p>‘Aorist (stem)’ and ‘past’ only coincide in those verb forms that have the augment.</p>\n", "Id":"5961", "ParentId":"3529", "LastEditorUserId":"51", "CreationDate":"2013-11-22T13:22:12.940", "OwnerUserId":"2757", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-11-23T16:44:05.490", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2013-11-23T16:44:05.490", "Score":"4", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2757", "AccountId":"3623703", "Views":"1", "Reputation":"51", "CreationDate":"2013-11-22T13:22:12.940", "DisplayName":"Klaas Edema", "LastAccessDate":"2013-11-22T14:14:27.497"}}