{"OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "comments":[], "Body":"<p><strong>A relative clause</strong>, like <em>who used to play</em>, <strong>doesn't necessarily come immediately after its antecedent</strong> (the word it refers back to), like <em>a friend of mine</em>. The preferred position is immediately after, but there can be intervening factors. However, if the intervening words make the connection between antecedent and relative clause too unclear, the sentence should be recast.</p>\n\n<p>In this case, apparently the pair <em>a friend of mine and I</em> are felt to be <strong>a unit</strong> so strongly connected that it overrides the preferred position of the relative clause, as viewed intuitively by your housemate when his brain constructed the sentence.</p>\n\n<p>Without <strong>context</strong>, it sounds almost ungrammatical to me, but I can understand how it would work if you knew more about what to expect about the people in the sentence and their activities. Context is very important in determining how far away antecedent and relative clause can be, and what kind of intervening phrases are allowed in between.</p>\n\n<p>Let me give you a simple example of a relative clause that is moved away from its antecedent but is still perfectly easy to understand and grammatical:</p>\n\n<blockquote>\n  <p>I visited the new King of Spain in Madrid, <strong>who</strong> was a devout Catholic and a great supporter of the Church.</p>\n</blockquote>\n\n<p>It is clear that <em>who</em> must refer to <em>the new King of Spain</em> and not to <em>Madrid</em>, because context tells us Madrid is not a person.</p>\n\n<blockquote>\n  <p>Lazy as she was, she strayed from the prescribed waking order: she awoke Kermit only after me, <strong>who</strong> then screamed in a tongue I did not know.</p>\n</blockquote>\n\n<p>Even in this odd situation, it seems clear from context that <em>who...</em> refers only to Kermit, not to me, because people usually don't scream together upon waking up, and because it seems unlikely that I should scream in a tongue I did not know. But in a specific context, anything is possible, I suppose.</p>\n\n<blockquote>\n  <p>My uncle and my cousins, <strong>who</strong> were in the bedroom, would all be conscripted as soon as the officer arrived.</p>\n</blockquote>\n\n<p>Who were in the bedroom: just my cousins, or also my uncle? This is completely ambiguous to me.</p>\n\n<blockquote>\n  <p>[My uncle and my father were fighting in the garden. I knew my father was wrong about this.] My uncle and my cousins, <strong>who</strong> were in the bedroom, would all be conscripted as soon as the officer arrived.</p>\n</blockquote>\n\n<p>Here <em>who</em> must refer only to <em>my cousins</em>, because my uncle was in the garden.</p>\n\n<blockquote>\n  <p>[All children had been told to join their fathers.] My uncle and my cousins, <strong>who</strong> were in the bedroom, would all be conscripted as soon as the officer arrived.</p>\n</blockquote>\n\n<p>Here <em>who</em> most probably refers to all three, because all children are with their fathers.</p>\n\n<p>Context is key. No utterance has a complete meaning without context, nor even a complete structure, most of the time.</p>\n", "Id":"5984", "ParentId":"5982", "CreationDate":"2013-11-24T05:49:32.607", "Score":"1", "PostTypeId":"2", "OwnerUserId":"82", "LastActivityDate":"2013-11-24T05:49:32.607", "CommentCount":"8"}