{"Body":"<p>Leaving the broader question about copulas to one side here.  Po and Rimmington’s ‘Chinese:  A Comprehensive Grammar’ (Routledge) has a good explanation for why ‘我好’ is not a well-formed answer to ‘你好嗎?’ (which I’m guessing is the context.)  Having the predicative adjective unmarked implies a contrast, ‘I’m good (but not him!)’.  A degree adverb like 很 is needed to get a neutral reading.  P and R further remark that ‘in fact the degree adverb很  hen3 ‘very’, unless it is emphasized, does not really mean ‘very’, and its integration into an adjectival predicative is more often than not to counteract an implication of contrast.’ (p.60)  Still, many other adverbs would work in this slot, for example 非常 fei1chang2, an unambiguous ‘very’.</p>\n\n<p>Some additional points that could suggest that  很 is not a copula: </p>\n\n<ol>\n<li><p>Statements like N 很 Adj can be reformulated with a degree complement, so that 很 is not in copula position:  </p>\n\n<p>那個書好得很  ‘That book is very good.’</p></li>\n<li><p>When negated with 不, 很 isn’t needed, i.e. 他不好  is well-formed, although 不太好  ‘not so good’, adding a different degree adjective, is common. </p></li>\n<li>Another predicate structure can also occur with some adjectives (generally ones that are non-gradable):  ‘是…的’.  A few adjectives can appear in predicates with either structure:</li>\n</ol>\n\n<p>他的話很對 or 他的話是對的    ‘What he says is correct.’</p>\n\n<p>Other things like the number of syllables will affect how Mandarin adjectives behave in collocations and as predicates.  P and R discuss a number of distinctions that affect how adjectives are used syntactically – qualifiers vs. quantifiers, gradable vs. non-gradable, derogatory vs. commendatory etc.  Introducing the notion of ‘copula’ into this would probably just confuse things, I suspect.</p>\n\n<p>By the way, in Classical Chinese 是 meant ‘this’.  Thus its use as a copula in Mandarin is a case of grammaticalization, although according to P and R this is only one of its many uses.  Cantonese uses 係 (pronounced haih, the Mandarin reading would be xi4) as a copula in sentences like 我係美國人 ‘I am an American.’  I would be interested to know in what ways the usage of Cantonese 係 parallels that of Mandarin是 and where usage differs.</p>\n", "Id":"5985", "ParentId":"5977", "LastEditorUserId":"2619", "CreationDate":"2013-11-24T06:17:18.127", "OwnerUserId":"2619", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-11-26T03:04:12.557", "LastEditedUser":{"UpVotes":"42", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/WDpU9.jpg", "Id":"2619", "AccountId":"3471110", "Views":"9", "Reputation":"176", "CreationDate":"2013-10-22T02:54:37.193", "DisplayName":"user2619", "LastAccessDate":"2014-01-16T18:07:58.383"}, "LastActivityDate":"2013-11-26T03:04:12.557", "Score":"2", "OwnerUser":{"UpVotes":"42", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/WDpU9.jpg", "Id":"2619", "AccountId":"3471110", "Views":"9", "Reputation":"176", "CreationDate":"2013-10-22T02:54:37.193", "DisplayName":"user2619", "LastAccessDate":"2014-01-16T18:07:58.383"}}