{"OwnerUser":{"UpVotes":"33", "WebsiteUrl":"http://www.tdhsmith.com", "Id":"62", "AccountId":"558608", "CreationDate":"2011-09-13T21:40:09.490", "AboutMe":"<p>I'm a graduate in mathematics currently pursuing linguistics; I am primarily interested in syntax, semantics, and language documentation, especially in regard to special registers and/or signed languages, but I enjoy just about anything language-related.  In my spare time I enjoy travelling, computer programming, geocaching, bad puns, obscure board game variants, urban farming, and all kinds of food.</p>\n", "Age":"25", "Location":"United States", "DownVotes":"2", "Views":"6", "Reputation":"470", "DisplayName":"tdhsmith", "LastAccessDate":"2012-09-04T04:59:08.823"}, "comments":[], "Body":"<p>I don't know much on the issue personally, but in <em><a href=\"http://www.jstor.org/pss/3086897\">Person and number in pronouns: a feature-geometric analysis</a></em> (Harley &amp; Ritter, 2002), they make the following claims:</p>\n\n<blockquote>\n  <p>...a language never has a dual without also having a plural (captured by the fact that both Group and Minimal must be active to encode dual). Similarly, <strong>no language has a paucal without also having a dual</strong>.</p>\n</blockquote>\n\n<p>This seems straightforward enough, and under this claim, languages with a paucal must have at least 4 numbers (singular, dual, paucal, plural). However, they make some concessions in the footnotes:</p>\n\n<blockquote>\n  <p>Corbett (2000:39) makes a distinction between determinate and indeterminate numbers. Singular, dual and trial denoting exactly one, two or three individuals, respectively, are determinate numbers; paucal and plural are indeterminate ones. We have not explicitly encoded this distinction in the geometry, with the advantage that it enables us to deal straightforwardly with <strong>languages that allegedly have a paucal without a dual</strong>, such as Bayso (Cushitic) or Walapai (Yuman), cf. Corbett (2000:22) and references cited therein. <strong>In these languages, the paucal denotes between two and six individuals</strong>, rather than the usual case of three to six. We propose that a dual is a simply a determinate minimal group, and that the paucal in Bayso or Walapai is an indeterminate one, represented by the same Minimal Group geometry as the dual.</p>\n</blockquote>\n\n<p>So it seems that the previous paucal-dual claim has counterexamples.  Still, there must be a singular-plural distinction before a paucal can appear, and it is quite likely there will be a dual as well.</p>\n\n<p>They make another interesting restriction on number related to the paucal:</p>\n\n<blockquote>\n  <p>Note that we predict that no language has both a trial and a paucal number; they are in complementary distribution, representing determinate and indeterminate interpretations of the same geometric configuration.</p>\n</blockquote>\n\n<p><em>And of course, no typological study is comprehensive.  I'd be happy to hear more on the issue myself. ;)</em></p>\n", "Id":"60", "ParentId":"57", "CreationDate":"2011-09-14T02:53:28.533", "Score":"15", "PostTypeId":"2", "OwnerUserId":"62", "LastActivityDate":"2011-09-14T02:53:28.533", "CommentCount":"2"}