{"comments":[], "Body":"<p>@jlawler:</p>\n\n<p>Thanks for the article. I found it quite interesring. I may sound too nitpicking, but I wouldn't agree with the abstract here:</p>\n\n<p>\"The modern suite of punctuation marks includes the period ‘ . ’, comma ‘ , ’, colon ‘ : ’, semicolon ‘ ; ’, left and right parentheses ‘ ( ) ’ (and other brackets, square ‘ [ ] ’ and curly ‘ { } ’), interrogation and exclamation marks ‘ ? ! ’ (bracketed with their inverses ‘ ¿ ¡ ’ in Spanish), dashes of several lengths ‘ - – — ’, single and double quotation marks ‘ “ « » ” ’, and the apostrophe, or raised comma “ ’ ” (not to be confused with the prime mark ‘ ′ ’, which is a diacritic)\".</p>\n\n<p>The author provides 3 different dashes. I agree with the last two, but the first one is called a hyphen and it, again, does not separate words into sentences or changes the meaning of a whole sentence, but connects two words (like the apostrophe) - exactly the reason why they should not be considered as punctuation marks.</p>\n\n<p>Another abstract here proves my point about intonation:</p>\n\n<p>\"Still another use – indeed, the original use – of punctuation is to provide some indication of the intonational and rhythmic intentions of the writer, as the written words indicate the lexical and grammatical intentions. For instance, the comma in English is often claimed to represent an intonation sequence of mid-low-high-mid, like the one used in counting:\nFifty-one, fifty-two, fifty-three, fifty-four, ... They serve, to those who follow this theory, to represent the ‘authorial voice’, and guide conventions for reading aloud. This of course applies to English only, and should not be considered to apply to other languages, like German, where the rules for punctuation are specifically governed by syntactic considerations\".</p>\n\n<p>However, I don't fully agree with it either. The punctuation marks do not necessarily express the author's voice - they mark the boundaries of sentences, phrases, clarify the meaning of the sentence. It just happens that we use intonation and pauses for this in speaking and punctuation marks in writing. German does it as well, perhaps not in the same way English does, but in the following sentence, wouldn't you have short pauses, where you have commas: Meine Freundin, die übrigens jetzt in der Schweiz wohnt, schreibt an mich jeden Tag.</p>\n\n<p>The author also mentions that the rules of punctuation are far from being standardised. What does it mean? If one is talking about the \"author's style\", it's one thing, but the rules of punctuation exist in every English speaking country, otherwise there wouldn't be such a thing as a punctuation mistake.</p>\n", "Id":"6009", "ParentId":"5998", "CreationDate":"2013-11-26T00:46:47.740", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2783", "LastActivityDate":"2013-11-26T00:46:47.740", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2783", "AccountId":"3640179", "Views":"1", "Reputation":"11", "CreationDate":"2013-11-26T00:46:47.740", "DisplayName":"Andrew", "LastAccessDate":"2013-11-27T17:45:11.437"}}