{"Body":"<p>I can try and provide an answer for questions 1 &amp; 3, based on Ritter &amp; Rosen 1993's paper \"Deriving Causation.\" The answer to 1 is more syntax-semantics interface than semantics though (given that Ritter &amp; Rosen do more syntax-semantics-interface style analyses.)</p>\n\n<p>So Ritter &amp; Rosen 1993 argues that \"have\" is a \"functor predicate\" which means that (i) it can introduce an argument (like a lexical predicate) but (ii) it lacks lexical semantic content (like a functional predicate), and thus does not encode a particular theta role for the argument it introduces. Rather, the \"theta role\" of the introduced argument is derived from the event structure that \"have\" introduces/modifies. This is meant to account for the observation (which you made above) that the argument \"have\" introduces can sometimes be introduced as a causer, or as an experiencer/affectee. </p>\n\n<p>They argue that the introduction of additional arguments to a construction correlates with the introduction of additional event structure to a predicate. So since \"have\" systematically introduces a new argument, it also systematically introduces more event structure. It is unspecified, however, for what kind of extra event structure it contributes. It can thus be interpreted as extending the event beyond the original starting point of the event - in which case the introduced argument will be interpreted as the causer of the event. Or it can be interpreted as extending the event beyond the original ending point of the event - in which case the introduced argument will be interpreted as the experiencer/affectee of the event. (I tried to schematize this below in a sort of diagram.)</p>\n\n<blockquote>\n  <p>(1) John had half the students walk out of his lecture. (Ritter &amp; Rosen 1993:525)</p>\n  \n  <blockquote>\n    <p>(a) Base Predicate:</p>\n    \n    <blockquote>\n      <p>|...walk out of class...|</p>\n    </blockquote>\n    \n    <p>(b) Have + Predicate: CAUSATIVE: Extend initiation</p>\n    \n    <blockquote>\n      <p>|......have.....|...walk out of class...|</p>\n    </blockquote>\n    \n    <p>(c) Have + Predicate: EXPERIENCER: Extend result</p>\n    \n    <blockquote>\n      <p>|...walk out of class...|......have.......|</p>\n    </blockquote>\n  </blockquote>\n</blockquote>\n\n<p>They also observe that the \"causer\" reading is not possible with unaccusative verbs. (This relates to your observation that there is an agentivity requirement.). So all unaccusative verbs in the \"have\" construction will be interpreted as introducing an \"affected\" argument. (Or be unacceptable).</p>\n\n<blockquote>\n  <p>(1) Unaccusatives with \"have\" - only \"Experiencer\" readings  </p>\n  \n  <blockquote>\n    <p>(a) I had my car spin (on the icy road)<br>\n    (b) I had the water in my pool freeze.<br>\n    (c) I had my car crumple in the accident  </p>\n  </blockquote>\n</blockquote>\n\n<p>As I understood their analysis, they aimed to account for this fact by arguing that \"have\" can only extend event structure, not introduce new event structure. And because unaccusatives don't underlying have causation/agentivity, \"have\" in an unaccusative construction can only extend the event's endpoint, so the introduced argument must be interpreted as the experiencer/affectee. (I don't know if this quite gels with your observations about awareness. Except maybe that \"ignorance is bliss\" and in order to be an experiencer/affectee, you have to know about your misfortune?)</p>\n\n<p>As for other languages with similar predicates, they propose that the Japanese adversative -rare is similar to \"have,\" but specified as extending the endpoint (hence the argument is always an experiencer/affectee), and that the French faire is similar to \"have\" but specified as extending the initial point (hence the argument is always a causer). There are also both benefactive and malefactive interpretations for some Salish applicatives (see, for example, Kiyosawa &amp; Gerdts 2010. Some googling has also resulted in a book \"Benefactives and malefactives: Typological perspectives and case studies\" by Zuniga and Zeppo (2010). That might give you a good place to look for the crosslinguistic morphosyntactic properties of malefactives.</p>\n\n<p>Sorry I've got nothing on the diachronic question. Totally not my forté. Sorry also that I haven't read the later article by Ritter &amp; Rosen (1997) - I'm not sure if they stick with their 1993 analysis, or change it.</p>\n\n<p><strong>Some References:</strong></p>\n\n<p>Ritter, E., &amp; Rosen, S. T. (1993). Deriving causation. Natural Language &amp; Linguistic Theory, 11(3), 519-555.</p>\n\n<p>Ritter, E., &amp; Rosen, S. T. (1997). The function of&lt; i> have. Lingua, 101(3), 295-321.</p>\n\n<p>Gerdts, D. B., &amp; Kiyosawa, K. (2003). Psych predicates and applicatives in Salish. In annual meeting of the Canadian Linguistic Association, Halifax, Nova Scotia.</p>\n\n<p>Zúñiga, F., &amp; Seppo, K. (Eds.). (2010). Benefactives and malefactives: Typological perspectives and case studies (Vol. 92). John Benjamins.</p>\n", "Id":"6024", "ParentId":"6021", "LastEditorUserId":"177", "CreationDate":"2013-11-28T03:34:00.010", "OwnerUserId":"177", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-11-28T07:03:53.737", "LastEditedUser":{"UpVotes":"6", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/tqgTp.png", "Id":"177", "AccountId":"896176", "CreationDate":"2011-09-19T16:30:42.833", "AboutMe":"<p>Linguistics grad student. Research interests lie in formal semantics, the morphosyntax-semantics interface.</p>\n", "Location":"Canada", "DownVotes":"0", "Views":"9", "Reputation":"396", "DisplayName":"user177", "LastAccessDate":"2014-01-09T01:15:39.280"}, "LastActivityDate":"2013-11-28T07:03:53.737", "Score":"2", "OwnerUser":{"UpVotes":"6", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/tqgTp.png", "Id":"177", "AccountId":"896176", "CreationDate":"2011-09-19T16:30:42.833", "AboutMe":"<p>Linguistics grad student. Research interests lie in formal semantics, the morphosyntax-semantics interface.</p>\n", "Location":"Canada", "DownVotes":"0", "Views":"9", "Reputation":"396", "DisplayName":"user177", "LastAccessDate":"2014-01-09T01:15:39.280"}}