{"OwnerUser":{"UpVotes":"5", "DownVotes":"1", "Id":"2247", "AccountId":"3045491", "Views":"34", "Reputation":"565", "CreationDate":"2013-07-14T16:52:54.170", "DisplayName":"Tim Osborne", "LastAccessDate":"2014-01-01T04:26:20.267"}, "comments":[], "Body":"<p>I have tested such examples on informants extensively. The coreferential reading is very unlikely, but it is not completely impossible. The opposite order of noun and pronoun allows the coreferential reading easily, of course:</p>\n\n<p>(1) John wants Bill to be smart more fervently than his mother does. </p>\n\n<p>The acceptability contrast across the two variants illustrates for me that above all, linear order (i.e. precedence) is a main factor influencing the distribution of pronouns in relation to their antecedents (and postcedents). Pronouns in a large majority of cases prefer an antecedent, as opposed to a postcedent. Only in very limited cases is the opposite order preferred, e.g. <em>In her Bed, Zelda spent her sweetest hours</em>. </p>\n\n<p>Examples like these have played a central role in the development of binding theory. Reinhart (1976, 1983) appears to have struggled with the acceptability of such data. The marginality of the coreferential reading in the first example (in the question) motivated her to allow some similar examples to allow the coreferential reading, and others to disallow it. This is precisely what is done with the two examples in the question, where the first is deemed to be much more acceptable than the second. The acceptability contrast between the two is probably not near as robust as the question assumes. Reinhart sought to accommodate degrees of acceptability in terms of sentence vs. VP adjuncts. If the coreferential reading is deemed possible, the adjunct at hand is a sentence adjunct, but if it is not possible, then it is a VP adjunct. </p>\n\n<p>The problem with Reinhart's explanation in terms of c-command is that acceptability of such cases is not black-and-white, yet it should be black-and-white given the approach to binding in terms of c-command that she was espousing. In fact this a major weakness in the study of syntax in general in my view. Marginality is messaged in one direction or the other in a manner that supports the particular theory at hand. </p>\n\n<p>In short, the answer to the question is that the coreferential reading for both example sentences may be possible, but it is quite unlikely. The Wikipedia article on binding has more to say about such cases: <a href=\"https://en.wikipedia.org/wiki/Binding_Theory\">https://en.wikipedia.org/wiki/Binding_Theory</a> .</p>\n", "Id":"6025", "ParentId":"6023", "CreationDate":"2013-11-28T04:35:04.193", "Score":"6", "PostTypeId":"2", "OwnerUserId":"2247", "LastActivityDate":"2013-11-28T04:35:04.193", "CommentCount":"2"}