{"OwnerUser":{"UpVotes":"13", "WebsiteUrl":"http://metaphorhacker.net", "Location":"UK", "Id":"2121", "DownVotes":"1", "AccountId":"2843698", "Views":"6", "Reputation":"453", "CreationDate":"2013-06-01T07:00:55.230", "DisplayName":"Dominik Lukes", "LastAccessDate":"2014-01-05T22:31:39.843", "AboutMe":"<p>My primary research is in figurative language and discourse but I've also taught intro to general linguistics, basic phonology and language and education. I'm interested in bi-lingualism, social variation, anthropological linguistics and blog about all on MetaphorHacker.net.</p>\n\n<p>I've also been involved in teaching foreign languages and teacher training. I've taught Czech to foreigners and co-written a grammar and textbook (see Czechly.com) and I've worked as a regional language specialist for the US Peace Corps. I've also been the academic director of a private TEFL teacher training school.</p>\n"}, "comments":[], "Body":"<p>From a linguistic perspective, there is no such thing as a theorem. There are some recognized heuristics for determining the difference of meaning/function of linguistic units. @fernacolo demonstrated one of these above. But there are more interesting things linguistics (the study of all of language - not just words, clauses and sentences) has to say about this.</p>\n\n<p>This example shows the difference between axiomatic and conventional aspects of the practice of mathematics. How notation is used to denote the order of operations is a matter of convention. The explicit conventions in the language of maths as used on Earth is that x and simple concatenation both mean multiplication and that multiplication has an order priority over other operations. Therefore, using these two conventions the answer is 2. However, there is also a human tendency to group things together so when polled, a group of people will be about evenly split between the two answers, quite possibly giving different answers at different times. However, the alien letter seems to imply that there is a difference in interpretation of notating multiplication by concatenation or by 'x'. But this is completely arbitrary. There is no such convention among mathematicians. We can guess that the aliens are using these two notations to indicate the prioritization of operations but that is on a very small sample and it is conceivable that this holds some other meaning to them. </p>\n\n<p>An alien lifeform with any level of linguistic insight, should be asking, not whether we have a way of communicating without ambiguity - because we don't, but rather whether we have procedures that help us disambiguate. And the answer to that is yes. In math, to resolve potential ambiguities about the order of operations, we use bracketing, which would remove any ambiguities about the answer in this problem. We have another way of resolving ambiguities which asking about each other's assumption. Therefore, removing that possibility from the interaction is misunderstanding the totality of linguistic tools at our disposal. The 'human' way of answering the question would be: \"It seems that you make a distinction between 'x' and concatenation to indicate the order of operations. Is that correct?\"</p>\n", "Id":"6046", "ParentId":"6043", "CreationDate":"2013-12-01T09:01:19.110", "Score":"2", "PostTypeId":"2", "OwnerUserId":"2121", "LastActivityDate":"2013-12-01T09:01:19.110", "CommentCount":"2"}