{"Body":"<p>Frank Blair's 1990 book \"Survey on a Shoestring: A Manual for Small-Scale Language Surveys\" gives a model for how to do this kind of analysis &ndash; it's the best non-computer based process I've found so far, although it does have limitations it its rather brute-force method. You might find some people who have used this method by checking who's cite Blair. I used this process in Lauren Gawne (2010) \"<a href=\"http://himalaya.socanth.cam.ac.uk/collections/journals/nepling/pdf/Nep_Ling_25.pdf\" rel=\"nofollow\">Lamjung Yolmo: a dialect of Yolmo, also known as Helambu Sherpa</a>\" in Nepalese Linguistics, which is available online. This kind of process requires you to decide how you're dealing with tone, and closely related sounds so it's best to check people's methodology. </p>\n\n<p>This kind of process is useful for determining how phonetically related two dialects, or closely related languages are. If you have more than two languages like I did in that paper this may help in establishing the historical relationship between groups of languages.  </p>\n", "Id":"605", "ParentId":"169", "LastEditorUserId":"22", "CreationDate":"2011-09-28T23:55:53.653", "OwnerUserId":"64", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-12-26T15:46:18.037", "LastEditedUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "LastActivityDate":"2011-12-26T15:46:18.037", "Score":"2", "OwnerUser":{"UpVotes":"126", "WebsiteUrl":"http://www.superlinguo.com", "Id":"64", "AccountId":"900445", "CreationDate":"2011-09-13T21:45:12.903", "AboutMe":"<p>I have a PhD in linguistics. My areas of interest include language documentation, Tibeto-Burman linguistics, gesture, language play, LOLspeak, evidentiality and making bad puns. I blog about language and linguistics at www.superlinguo.com</p>\n", "Age":"29", "Location":"Australia", "DownVotes":"6", "Views":"40", "Reputation":"2016", "DisplayName":"LaurenG", "LastAccessDate":"2013-10-26T00:28:12.653"}}