{"OwnerUser":{"UpVotes":"5", "DownVotes":"1", "Id":"2247", "AccountId":"3045491", "Views":"34", "Reputation":"565", "CreationDate":"2013-07-14T16:52:54.170", "DisplayName":"Tim Osborne", "LastAccessDate":"2014-01-01T04:26:20.267"}, "comments":[], "Body":"<p>The question is excellent. I would like to answer the question as well, adding an overlooked aspect of the issue.</p>\n\n<p>Some derivationalists will likely defend the first interpretation of syntactic movement listed in the question, stating that syntactic movement (or copying) is a real condition of the human faculty for language. Humans have an innate ability to move syntactic units around in their \"minds\". Thus syntactic structures are generated in a bottom-up fashion, whereby certain constituents first appear in one position and are then moved to higher positions, and this all occurs in the mind before the actual structure is uttered by the speaker.  </p>\n\n<p>Other syntacticians and grammarians (including myself) reject this conception of how humans produce the syntactic structures of utterances. For me, a more plausible understanding of how humans produce utterances is that they access constructions in a lexicon (or constructicon) in an online fashion as they actually speak utterances. On this sort of account, the syntactic structures of utterances are produced left to right, not bottom up. They are produced left to right moving in the same direction that our speech organs can produce sounds and in the same direction that our comprehension absorbs meaning. This sort of account rejects the first interpretation of syntactic movement in the question, although it does not necessarily agree with the second. </p>\n\n<p>A difficulty facing those syntacticians (like myself) who reject the innateness hypothesis of Chomskyan syntax is the fact that much of the terminology associated with the study of syntax was established in the 1960s and 1970s, at a time when Transformational Syntax (think deep and surface structure) were the main game in town. Thus since the terminology that we use today was established at that time, the presuppositions that that terminology bears remain intact in the field of syntax in general. Terms such as <em>extraposition</em>, <em>extraction</em>, <em>scrambling</em>, <em>fronting</em>, <em>topicalization</em>, <em>shifting</em>, etc. all carry the presupposition of movement. </p>\n\n<p>If a non-derivationalist wants to examine, for instance, the phenomenon denoted by the term <em>extraposition</em>, he/she is faced with a dilemma. He/she can use the term <em>extraposition</em> (which presupposes that something has been \"extraposed\") so that his/her audience knows immediately the phenomenon that is meant, but in doing so, he/she has to accept that the term itself expresses the unwanted presupposition of movement. Or he/she can avoid this unwanted presupposition by choosing another term, but this option has the drawback that introducing unknown terminology is difficult. Doing so requires more patience of the reader/listener, a fact that will likely reduce the size of the audience. </p>\n\n<p>What I am describing here is a situation that perpetuates the transformationalists' interpretation of syntax. The transformationalist has a major advantage, since if the non-transformationalist wants to be understood, he/she is almost forced to employ a terminology that actually supports the transformationalists' stance.  </p>\n\n<p>The long and the short of all this is that many more syntacticians, grammarians, and linguists would likely choose the second option listed in the question than the first, and there are others like myself who completely reject the first and distance themselves from the second, choosing instead a third interpretation which sees \"syntactic movement\" and \"transformations\" as constructions that are stored in the lexicon/constructicon.  </p>\n", "Id":"6057", "ParentId":"4750", "CreationDate":"2013-12-03T01:29:30.823", "Score":"2", "PostTypeId":"2", "OwnerUserId":"2247", "LastActivityDate":"2013-12-03T01:29:30.823", "CommentCount":"11"}