{"OwnerUser":{"UpVotes":"15", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/zegup.png", "Id":"2129", "AccountId":"2350982", "Views":"3", "Reputation":"246", "CreationDate":"2013-06-03T21:52:14.630", "DisplayName":"babou", "LastAccessDate":"2014-01-11T10:17:24.477", "AboutMe":"<p>The name Babou was given to me by my grandson (two years old at the time). It actually means grandpa in Armenian and Swahili.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>babou AT inbox.com</p>\n"}, "comments":[], "Body":"<p>There are many ways to describe a given language, even in a given\nformalism. I would think that at any time, a language is always\ninconsistent. Diachronic evolution seems a good reason to believe\nthat. Latin has slowly evolved into Italian, Spanish, Catalan,\nRoumanian, Portuguese and French (what did I forget?). Actually there\nhave been many more dialects and variants that did not all\nsurvive. And the evolution has been progressive. How can you expect to\nhave consistency in such an unstable context?</p>\n\n<p>I do not know of such experiments, but I would guess that no two\npeople will agree everywhere on the grammaticality of some sets of\nsentences.</p>\n\n<p>But that shows most for the visible (surface) syntax of languages. One\ntask of linguistics is to identify deeper and more stable concepts\nthat structure the language in a more consistent way.</p>\n\n<p>What matters for surface syntax, that you are considering, is more to\nunderstand adequate and tractable formalisms that will let you\ndescribe the language (almost) adequately, and develop techniques to\nattain from that the deeper structure. Distinct surface descriptions in\nthe chosen formalism can hopefully give you similar understanding.</p>\n\n<p>Actually, even the choice of the formalism can be open, and there are\nmany competing. Even if you consider only phrase structure, the\nvariant you have been using seem to be the context-free variant of\nChomsky.  But others, with interesting descriptive properties have\nbeen developped, such as tree-adjoining-grammars, to give an\nexample. Then these formalisms can form a skeleton to be completed by\nmore detailed information (features).</p>\n\n<p>Also relations with the lexicon have to be established, and structural\ninformation and features can be attached to the lexicon.\nInterestingly, when choosing or designing a formalism, independently\nof the language to be described, there will be tension between the\n\"phrase structure skeleton\" and the lexicon, regarding where some of\nthe structural information should be placed. Emphasizing the lexicon\ncan also be done by lexicalizing the phrase structure skeleton (which\nis what Greibach normal form does for context-free languages).</p>\n\n<p>And there are other very different kinds of formalisms, such as\ncategorial grammars.</p>\n\n<p>What matters is to acquire the knowledge, understanding and effective\nusage of natural language description tools. Then you use these tools\nto give the best description you can of the natural language\nstructure. We do not all have to agree on what might be the best\ndescription of the structure of a natural language (hence the\nvariations you complain about), but we need common descriptive tools\nto understand each other when discussing these issues.  The formalisms\nare (part of) the language needed by linguists to exchange and discuss\nmeaningfully about the natural language.</p>\n", "Id":"6082", "ParentId":"6080", "CreationDate":"2013-12-06T18:45:21.620", "Score":"0", "PostTypeId":"2", "OwnerUserId":"2129", "LastActivityDate":"2013-12-06T18:45:21.620", "CommentCount":"4"}