{"OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2833", "AccountId":"3693661", "Views":"1", "Reputation":"19", "CreationDate":"2013-12-06T18:50:24.650", "DisplayName":"Sunny", "LastAccessDate":"2013-12-06T18:50:24.650"}, "comments":[], "Body":"<p>I think you couldbe right... I also have thought about this. I myself found that there are a lot of words and names that have a similar sound and also a similar meaning. could be coincidence, but i compared the (seemingly semitic) german words with the ancient hebrew words and also with some latin languages and in many cases the latin languages didn't copy all the semitic words that the germans did copy. one example: the verb calling/shouting (there are different version of this word, both in hebrew as in the germanic languages.</p>\n\n<p>Modern Germanic languages:\n1. Dutch: roepen. Danish: ringe. German: rufen. Norwegian: ring. \n2. Dutch: schreeuwen. Danish: rabe. German: schreien. Norwegian: rope.\n3. Dutch: brullen. German: röhren. Danish: brol. Norwegian: roar. Eng: roar.    </p>\n\n<p>Old Hebrew:\n1. רוע Ruwa/Roa = Shouting/calling\n2. רנה Rinna = giving a shout/calling out\nSee the bibles verses: Jozua 6:16 &amp; Psalm 17:1 for an example of those words.</p>\n\n<p>Latin: clamor &amp; vocatio.</p>\n\n<p>Scientifically this may not be usable, especially because in this example I used the modern words. Nevertheless, also looking at the Y-DNA profiles of the german men there is a real mixture visable between two groups. One which is very comon in the western latin european countries (R1b) and is present in about 50-90% of the men and another group (I1) which is less comon (20-30%) mainly found in northern europe and scandinavia. The I1 group is most closely related to what today are the semitic people (group J: arabs, jews etc.) and are believed to have migrated already a while ago from the area of israel/iraq/syria etc. to europe. the R1b group has it's origins more in the area of eastern iran/afghanistan etc. and could have always spoken a indo-european language. The I1 group however could have originately spoken a semitic language before they mixed with the R1b's. Because the R1b group is much bigger nowadays (I1 is in no place the dominant group) it seems logical that the I1's slowly adopted the indo-europen language as they mixed in. However we still find some traces in the german languages that remind us of the semitic heritage of part of the germans.</p>\n\n<p>That's my theory ;)</p>\n", "Id":"6083", "ParentId":"911", "CreationDate":"2013-12-06T18:50:24.650", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2833", "LastActivityDate":"2013-12-06T18:50:24.650", "CommentCount":"1"}