{"Body":"<p>I'm going to start by going through some more detailed definitions of the various rule orderings, with examples:</p>\n\n<p>If rule A creates the environment for rule B to apply, then rule A <strong>feeds</strong> rule B, e.g.</p>\n\n<blockquote>\n  <p>A: ɣ → ∅ / V_V<br>\n  B: e → i / _e</p>\n  \n  <p>/teɣe/<br>\n  A: tee<br>\n  B: tie<br>\n  [tie]</p>\n</blockquote>\n\n<p>If the order A B is a feeding order, then the order BA is a <strong>counterfeeding</strong> order, i.e. applying the rules in order BA would <em>fail to feed</em>, e.g.</p>\n\n<blockquote>\n  <p>/teɣe/<br>\n  B: ----<br>\n  A: tee<br>\n  [tee]  </p>\n</blockquote>\n\n<p>Counterfeeding is <em>opaque</em> in the sense that the surface form violates the generalisation that [ee] sequences are generally altered via the raising rule (B).</p>\n\n<p>If rule A destroys an environment that could have triggered rule B, then A <strong>bleeds</strong> B, e.g.</p>\n\n<blockquote>\n  <p>A: V → ∅ / VVC_<br>\n  B: stop → fricative / V_V  </p>\n  \n  <p>/heidinir/<br>\n  A: heidnir<br>\n  B: ----<br>\n  [heidnir]  </p>\n</blockquote>\n\n<p>If the order AB is a bleeding order, then order BA is a <strong>counterbleeding</strong> order. So, applying the rules in the order BA would <em>fail to bleed</em>:</p>\n\n<blockquote>\n  <p>/heidinir/<br>\n  B: heiðinir<br>\n  A: heiðnir<br>\n  [heiðnir]  </p>\n</blockquote>\n\n<p>Counterbleeding is an <em>opaque</em> rule ordering: The surface form violates the generalisation that fricatives appear between vowels.</p>\n\n<p>Now, onto your question:</p>\n\n<p>Note that based on the definitions i've given, counterbleeding is not the same as feeding. In the feeding example, rule A creates the environment for rule B to apply - if rule A hadn't applied, then rule B couldn't apply. In the counterbleeding example, application of B simply does not <em>prevent</em> rule A from applying - even if rule B hadn't applied, rule A would still have been able to apply. Let's consider your concrete example in light of this. Let's say that X is a stop and Y is a fricative, and the environment in question is intervocalic, so:</p>\n\n<p>\"Let's say you have some segment X. Rule A and B may only apply to X. A applies first and changes X->Y. Next, B applies to Y but it is in vacuous application, so nothing happens. In this scenario A is said to bleed B.\"</p>\n\n<blockquote>\n  <p>A: stop → fricative / V_V<br>\n  B: stop → [-voice] / V_V  </p>\n</blockquote>\n\n<p>We can see that in the order AB, application of A will <strong>bleed</strong> application of B. Exactly.</p>\n\n<blockquote>\n  <p>/ada/<br>\n  A: aza<br>\n  B: ----<br>\n  [aza]  </p>\n</blockquote>\n\n<p>\"Now let's say we have rule A and B, but this time let's just say A applies to X or Y. Now, when we apply rule B first. Let's say B changes X->Y , and next A applies to Y. If A had applied first, then it would have bleeded B. This seems to be a feeding relationship.\"</p>\n\n<blockquote>\n  <p>A: [-sonorant] → ∅ / V_V<br>\n  B: stop → fricative / V_V  </p>\n  \n  <p>/ada/<br>\n  A: aa<br>\n  B: ----<br>\n  [aa]  </p>\n  \n  <p>/ada/<br>\n  B: aza<br>\n  A: aa<br>\n  [aa]  </p>\n</blockquote>\n\n<p>Because A applies the [-sonorant], it should affect both stops and fricatives. If we apply A first, it will destroy the environment that triggers B, so A bleeds B, therefore the order AB is a <strong>bleeding</strong> relationship, and the order BA is a <strong>counter-bleeding</strong> relationship. BA does not count as a <strong>feeding</strong> relationship, because A would have applied even if B had not applied, so although B does, in a sense, create the environment for A to apply to, B's application is not <em>necessary</em> to create the environment that A applies to. </p>\n\n<p>A final note: In practice, since B is triggered by a set of environments that are a proper subset of the set of environments that trigger A, B will block application of A to stops due to the <strong>elsewhere principle</strong>. If this wasn't the case, then we wouldn't have any evidence for the existence of B in the first place!</p>\n\n<p>Reference: Amalia Arvaniti's lecture slides for ACTL 2013.</p>\n", "Id":"6086", "ParentId":"6084", "LastEditorUserId":"2328", "CreationDate":"2013-12-07T16:18:49.187", "OwnerUserId":"2328", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-12-08T03:43:32.720", "LastEditedUser":{"UpVotes":"123", "WebsiteUrl":"https://sites.google.com/site/patrickdelliott/", "ProfileImageUrl":"http://i.stack.imgur.com/HGYBE.jpg", "Id":"2328", "AccountId":"3146009", "CreationDate":"2013-08-07T11:16:59.797", "AboutMe":"<p>I'm a PhD student in Linguistics at University College London. My primary area of interest is generative linguistics, and specifically syntactic and semantic theory. More narrowly still, i'm interested in ellipsis, comparatives, and binding theory. <a href=\"https://twitter.com/patrickdelliott\" rel=\"nofollow\">Follow me on twitter!</a></p>\n", "Location":"London, United Kingdom", "DownVotes":"43", "Views":"43", "Reputation":"970", "DisplayName":"P Elliott", "LastAccessDate":"2014-01-19T02:32:31.120"}, "LastActivityDate":"2013-12-08T03:43:32.720", "Score":"8", "CommentCount":"2", "OwnerUser":{"UpVotes":"123", "WebsiteUrl":"https://sites.google.com/site/patrickdelliott/", "ProfileImageUrl":"http://i.stack.imgur.com/HGYBE.jpg", "Id":"2328", "AccountId":"3146009", "CreationDate":"2013-08-07T11:16:59.797", "AboutMe":"<p>I'm a PhD student in Linguistics at University College London. My primary area of interest is generative linguistics, and specifically syntactic and semantic theory. More narrowly still, i'm interested in ellipsis, comparatives, and binding theory. <a href=\"https://twitter.com/patrickdelliott\" rel=\"nofollow\">Follow me on twitter!</a></p>\n", "Location":"London, United Kingdom", "DownVotes":"43", "Views":"43", "Reputation":"970", "DisplayName":"P Elliott", "LastAccessDate":"2014-01-19T02:32:31.120"}}