{"comments":[], "Body":"<p>There are roughly two kinds of accounts of the definiteness effect.</p>\n\n<ul>\n<li>One, as suggested by CGEL, is that the \"pivot\" (DP following the verb) must be discourse-new, or novel, or something along those lines.  (this idea is due to McNally, Comorovski, Zucchi, and others, just in case CGEL omitted the citations, as it often does.)</li>\n<li>Another, which has been somewhat more prominent than the explanation CGEL points to, is that it is some logical property of the determiner that plays the key role.  (Keenan, Barwise and Cooper, Higginbotham, and others.  But especially Keenan.)  I suppose this is the linguisticky stuff that is causing melting.  But Keenan's proposal in particular has a tremendous amount of empirical coverage, in a way far more than the discourse novelty approaches.  If you want a good recent summary of the Det approaches you should check out chapter 6 of Itamar Francez's 2007 Stanford dissertation, I think available on his website.  Most of these accounts amount to realizing the intuition that the constraint ensures that to check the truth of an existential claim, all you need is the set of individuals semantically provided by the \"coda\" (the thing optionally following the pivot), and not any larger set.</li>\n</ul>\n\n<p>There is no good account of what unifies these two types of explanations (though maybe McNally's dissertation takes the best stab), or really even <em>why</em> either of them should be true.  The best idea I'm aware of, which as yet has only been pursued informally is sketched in ch. 6 of Francez's dissertation (due to David Beaver), and is roughly that the non-canonical word order in existentials marks that the pivot must be topical, which leads to the definiteness effect.  How to turn this into a predictive theory, I haven't a clue (though it is something I'm working on).  </p>\n\n<p>In general Francez's dissertation is a good starting point without having to read through every google scholar result. </p>\n", "Id":"609", "ParentId":"489", "CreationDate":"2011-09-29T12:37:01.440", "Score":"9", "PostTypeId":"2", "OwnerUserId":"345", "LastActivityDate":"2011-09-29T12:37:01.440", "OwnerUser":{"UpVotes":"4", "WebsiteUrl":"http://www.cog.jhu.edu/~rawlins/", "Id":"345", "AccountId":"513980", "CreationDate":"2011-09-28T22:20:39.537", "AboutMe":"<p>I'm a linguist specializing in formal semantics and pragmatics.</p>\n", "Age":"35", "Location":"Baltimore, MD", "DownVotes":"1", "Views":"16", "Reputation":"490", "DisplayName":"kgr", "LastAccessDate":"2013-07-30T15:43:17.413"}}