{"comments":[], "Body":"<p>A very interesting and intriguing question.</p>\n\n<p>First one has to distinguish between open questions (Where have I put my car keys?) and yes-no-questions (Have I forgotten my car keys at your place?).\nIn open questions the question is marked by interrogative adjectives, pronouns (τίς) or adverbs (ποῦ, πότε) which probably had a different pronunciation than their indefinite counter parts, as one could deduce from their different accentuation (τις, τινές  / που,πού / ποτε, ποτέ).</p>\n\n<p>In Russian -a languages that doesn’t mark questions by automatically inverting the inflected verb and the subject either- open questions usually don’t have a rising intonation, whereas yes-no-questions have; the question is marked by words like ‘Where? What? Who?’ at the beginning of the sentence.</p>\n\n<p>One could assume that in Greek likewise the open questions were only marked by a different pronunciation of the interrogative word at the beginning of a sentence.</p>\n\n<p>A different case are the yes-no-questions; in Russian these are either marked by the interrogative marker ли (but it sounds a bit elevated) or by simply pronouncing the sentence with a raised tone towards the end.</p>\n\n<p>In Ancient Greek the interrogative particle ἆρα is often not present in sentences that are clearly intended as questions (Plato’s dialogues), like it isn’t in Russian.\nAnother similarity between both languages is the rather free word order which is used to convey nuances of stress on particular information in a sentence or reported speech;</p>\n\n<p>Therefore, I can hardly believe in Ancient Greek declarative sentences weren’t distinguished from yes-no-questions without ἆρα by a certain way of changing the melody/intonation in the question; there must have been a difference in melody/intonation to mark the spoken sentence as a question, mustn’t it?</p>\n", "Id":"6101", "ParentId":"2623", "CreationDate":"2013-12-10T15:36:17.987", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2847", "LastActivityDate":"2013-12-10T15:36:17.987", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "ProfileImageUrl":"https://www.gravatar.com/avatar/4601fefa8dceb8c71668ae2234131086?s=128&d=identicon&r=PG&f=1", "Id":"2847", "AccountId":"3709745", "Views":"0", "Reputation":"51", "CreationDate":"2013-12-10T15:07:10.147", "DisplayName":"Klaas Edema", "LastAccessDate":"2013-12-11T21:25:11.520"}}