{"Body":"<p>The answer C, the one you chose, is somewhat better than answer B. However, passive participles like <em>found</em> straddle two syntactic categories, verb and adjective. They can behave like an adjective with respect to a noun that they modify, i.e. they can be dependent on a noun as if they were a clear adjective, but they clearly maintain their verbal quality with respect to the material that they head. </p>\n\n<p>The verbal quality of <em>found</em> in the example can be seen in the fact that reduced relative clauses like <em>found dead on the southern Spanish coast</em> allow an analysis in terms of ellipsis. One can construe the words <em>that was</em> as having been elided: <em>A whale (that was) found dead on the southern Spanish coast was...</em> The verbal quality of <em>found</em> is also visible in the fact that true adjectives cannot be modified by adjuncts such as <em>on the southern Spanish coast</em>, e.g. *<em>A whale enormous on the southern Spanish coast...</em> Further, when attributive adjectives modify nouns, they usually precede the noun in English, e.g. <em>an enormous whale</em>. The fact that the passive participle follows the noun that it modifies is thus a further indication that it is more verb-like than adjective-like.</p>\n\n<p>Whoever wrote the question is valuing the one criterion more than these others. They are taking the fact that <em>found</em> modifies the noun <em>whale</em> like an attributive adjective would as decisive. In so doing, they are shortsighted and ignoring the verb-like qualities of <em>found</em>. </p>\n\n<p>In sum, I think you are justified in protesting. </p>\n", "Id":"6122", "ParentId":"6119", "LastEditorUserId":"2247", "CreationDate":"2013-12-12T04:17:01.153", "OwnerUserId":"2247", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-12-12T04:22:27.987", "LastEditedUser":{"UpVotes":"5", "DownVotes":"1", "Id":"2247", "AccountId":"3045491", "Views":"34", "Reputation":"565", "CreationDate":"2013-07-14T16:52:54.170", "DisplayName":"Tim Osborne", "LastAccessDate":"2014-01-01T04:26:20.267"}, "LastActivityDate":"2013-12-12T04:22:27.987", "Score":"7", "CommentCount":"7", "OwnerUser":{"UpVotes":"5", "DownVotes":"1", "Id":"2247", "AccountId":"3045491", "Views":"34", "Reputation":"565", "CreationDate":"2013-07-14T16:52:54.170", "DisplayName":"Tim Osborne", "LastAccessDate":"2014-01-01T04:26:20.267"}}