{"OwnerUser":{"UpVotes":"5", "DownVotes":"1", "Id":"2247", "AccountId":"3045491", "Views":"34", "Reputation":"565", "CreationDate":"2013-07-14T16:52:54.170", "DisplayName":"Tim Osborne", "LastAccessDate":"2014-01-01T04:26:20.267"}, "comments":[], "Body":"<p>The binding theory as presented in Haegeman's book has long since been abandoned by most people who study binding phenomena in a serious way. That book presents the traditional binding theory according to Chomsky (1981, 1986). While it may be good to study and learn that stuff to gain the big picture of the development of syntactic theory, be aware that the account of binding you are learning there is just a reference point nowadays. It's validity is defended by almost no one anymore.</p>\n\n<p>I don't have Haegeman's book here with me, so I cannot verify the example in her book. Taking what you give at face value, I can see why it is confusing. But as Alex B. points out, the way to interpret the example is that the relevant NP is <em>Poirot's brother</em>, not just <em>brother</em>. The first branching node to dominate this entire NP is IP, so the definition sort of works. The confusion stems from the fact that you've got two nouns, <em>Poirot</em> and <em>brother</em>, and it seems like one of these should be the relevant node for the definition, whereas what is really going on is that the two together form the relevant NP.</p>\n\n<p>Compare your example with a similar example like </p>\n\n<p>(1)  *[His1 sister] invited himself1. </p>\n\n<p>The definition of c-command and condition A of the theory make the correct prediction in this case, because the reflexive pronoun <em>himself</em> should be bound in its governing category. Since its binder <em>his</em> is embedded inside the NP <em>his sister</em>, it does not c-command out of the NP and therefore cannot bind <em>himself</em>.</p>\n\n<p>When you learn about the DP-hypothesis (NPs are really determiner phrases, not noun phrases), you will begin to see why the traditional binding theory that is presented by Haegeman (and many others) doesn't really work anymore. On a DP analysis, the possessive determiner <em>his</em> heads the subject DP in (1), which means it should be the relevant unit that c-commands out of the subject DP. In other words, if one assumes a DP analysis of noun phrases, the traditional binding theory does not work anymore. </p>\n\n<p>So I think that the greater message is that you should be prepared to experience further confusion and that as you progress to further stages of the development of syntactic theory, you will see that the field has been changing too fast.     </p>\n", "Id":"6155", "ParentId":"6153", "CreationDate":"2013-12-15T06:37:07.270", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2247", "LastActivityDate":"2013-12-15T06:37:07.270", "CommentCount":"17"}