{"comments":[], "Body":"<p>The general organization of how a verb distributes its semantic roles is called \"argument structure\" (this is part of the more general field of inquiry called \"lexical semantics\").  It is very common for verbs (especially those with 3 or more arguments) to display alternations.  The most commonly cited of these is the so-called <em>spray/load</em> alternation (because of two verbs that show it).  Here are examples with \"spray\"</p>\n\n<pre>\n(1) John sprayed paint on the wall\n(2) John sprayed the wall with paint\n</pre>\n\n<p>These two sentences are approximately equivalent in meaning.  Levin published a book called <em>English Verb Classes And Alternations: A Preliminary Investigation</em>, which consists of a list of English verbs and which of these frames they can appear in.  She has a ton of other work on this topic, some of it co-authored with Rappaport Hovav.</p>\n\n<p>In your specific example, \"assign\" and \"set\" are displaying different behavior.  First I would point out that these sentences seem most natural to me in the context of computer programming operations.  I would tentatively explain this by saying that \"assign\" treats its direct object (non-prepositional argument) always as a location, metaphorically speaking.  \"Set\" on the other hand can apparently operate on metaphorical locations or metaphorical pointers.  Why this is, and how it links up with other uses of these verbs, I couldn't really say.</p>\n\n<p>(Also, as a native speaker of English \"set X from Y\" sounds quite unnatural.  Technical writing is not always idiomatic, even when done by a native speaker.)</p>\n", "Id":"624", "ParentId":"619", "CreationDate":"2011-09-30T07:36:58.940", "Score":"3", "PostTypeId":"2", "OwnerUserId":"46", "LastActivityDate":"2011-09-30T07:36:58.940", "OwnerUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}}