{"comments":[], "Body":"<p>Your question concerns a particular analysis of a particular phenomenon by a particular instructor using a particular text that presents a particular framework of syntax. All these particularities make the question difficult to answer in a way that might satisfy the special needs of your situation. </p>\n\n<p>My assessment is that your description of the problem mostly answers your question. The subject <em>John</em> is simultaneously ATB-moved out of both VPs into the SpecIP. There is no PRO present because the coordinate structure does not contain a control structure - PRO is associated with control. </p>\n\n<p>For me, drawing GB tree diagrams was never an easy task, since there are many variables that come into play, and my suspicion is that even among those who are well versed in GB theory, the tree diagrams that a given individual produces vary quite a bit from the tree diagrams of other individuals. </p>\n\n<p>The particular tree diagram for your sentences relies crucially on the analysis of coordination, since you are dealing with coordinated VPs. I think you want a tree that positions the VPs equi-level. In each of the VPs, a trace t coindexed with the subject in SpecIP should appear in each of the two SpecVP positions.  </p>\n\n<p>Finally, I can comment that the GB analysis your instructor is looking for would be rejected by many working in syntax today. Your textbook is almost two decades old. In particular, many might prefer an analysis that does not assume ATB-extraction in your first example (but ATB-extraction is plausible for your second example). Instead, one might assume straightforward coordinated VPs that contain no traces. Such an analysis is preferred by non-derivational (i.e. non-transformational) theories. </p>\n", "Id":"6276", "ParentId":"6270", "CreationDate":"2013-12-29T19:29:31.747", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2247", "LastActivityDate":"2013-12-29T19:29:31.747", "OwnerUser":{"UpVotes":"5", "DownVotes":"1", "Id":"2247", "AccountId":"3045491", "Views":"34", "Reputation":"565", "CreationDate":"2013-07-14T16:52:54.170", "DisplayName":"Tim Osborne", "LastAccessDate":"2014-01-01T04:26:20.267"}}