{"OwnerUser":{"UpVotes":"123", "WebsiteUrl":"https://sites.google.com/site/patrickdelliott/", "ProfileImageUrl":"http://i.stack.imgur.com/HGYBE.jpg", "Id":"2328", "AccountId":"3146009", "CreationDate":"2013-08-07T11:16:59.797", "AboutMe":"<p>I'm a PhD student in Linguistics at University College London. My primary area of interest is generative linguistics, and specifically syntactic and semantic theory. More narrowly still, i'm interested in ellipsis, comparatives, and binding theory. <a href=\"https://twitter.com/patrickdelliott\" rel=\"nofollow\">Follow me on twitter!</a></p>\n", "Location":"London, United Kingdom", "DownVotes":"43", "Views":"43", "Reputation":"970", "DisplayName":"P Elliott", "LastAccessDate":"2014-01-19T02:32:31.120"}, "comments":[], "Body":"<p>I'll attempt to go through the various analytical possibilities for your example sentence within the GB framework:  </p>\n\n<blockquote>\n  <p>(i) John opened the door and left</p>\n</blockquote>\n\n<p><strong>Hypothesis 1: (i) involves sentential co-ordination</strong></p>\n\n<p>This hypothesis entails that (i) involves co-ordination at the IP-level. This leaves open a couple of different possibilities for analysing the subject gap in the second conjunct:</p>\n\n<p><strong>Hypothesis 1.1: (i) involves obligatory control of PRO</strong></p>\n\n<p>If (i) involves control, we know that it must be <em>obligatory</em> control, since the subject of the second conjunct has to refer to <em>John</em>. There are two separate arguments against this. The first, as you make clear in your question, is that PRO must be in an ungoverned position, but a finite subject is governed by I. The second is that obligatorily controlled PRO must be c-commanded by its controller, which isn't the case here. Here's the tree:</p>\n\n<p><img src=\"http://i.stack.imgur.com/qut3U.png\" alt=\"enter image description here\"></p>\n\n<p><strong>Hypothesis 1.2 (i) involves movement of the subject</strong></p>\n\n<p>We can represent this possibility by replacing PRO in the above tree with a trace co-indexed with the subject of the first conjunct. We can straightforwardly rule this out due to the fact that movement must be to a c-commanding position.</p>\n\n<p><strong>Hypothesis 1.3: (i) involves pro</strong></p>\n\n<p>As you state in your question, we can rule this out straightforwardly since English isn't a pro-drop language.</p>\n\n<p>Now that we've exhausted the possibilities for analysing (i) as involving sentential co-ordination, we can consider an alternative hypothesis: Namely, the one your instructor laid out.</p>\n\n<p><strong>Hypothesis 2: (i) involves VP co-ordination</strong></p>\n\n<p>Hypothesis 2 is, i believe, compatible with both VP-internal, and VP-external subject hypotheses. The difference between the two is that if we adopt the VP-internal subject hypothesis, (i) must involve ATB extraction of the subject from both conjuncts, whereas if we adopt the VP-external subject hypothesis, no extraction is necessary - the subject is simply base generated in the matrix subject position.</p>\n\n<p><strong>Hypothesis 2.1: VP co-ordination + VP-internal subject</strong></p>\n\n<p><img src=\"http://i.stack.imgur.com/FKWyN.png\" alt=\"enter image description here\"></p>\n\n<p>Ross (1967) identifies conjuncts as <em>syntactic islands</em>, in order to rule out extraction of, e.g., a wh-word from a single conjunct, as in the following example:  </p>\n\n<p>(ii) What did John buy <em>t</em> and Mary sold a car?</p>\n\n<p>Constituents can exceptionally be extracted from conjuncts just so long as parallel extraction takes place from out of all of the conjuncts.</p>\n\n<p><strong>Hypothesis 2.2: VP co-ordination + VP-external subject</strong></p>\n\n<p><img src=\"http://i.stack.imgur.com/OYEST.png\" alt=\"enter image description here\"></p>\n\n<p>Ultimately, 2.1 and 2.2 can only be distinguished on the basis of independent evidence for the VP-internal subject hypothesis, such as the distribution of floating quantifiers. Since this is covered in the Haegeman textbook, and it isn't immediately relevant to your question, i won't go into it here.</p>\n", "Id":"6286", "ParentId":"6270", "CreationDate":"2013-12-31T16:17:14.707", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2328", "LastActivityDate":"2013-12-31T16:17:14.707", "CommentCount":"5"}