{"Body":"<p>I think the claim of Bar-Hillel is two-fold that, at that time the two approaches, which I will call roughly n-gram (or fixed length context) and thesaurus methods, were doomed to failure – as he projected at that time.</p>\n\n<p>I think the n-gram approach has been vindicated since then. I think the reasons are not because of better use or manipulation of contexts but because of simply:</p>\n\n<ul>\n<li>better corpora (masses of working data)</li>\n<li>better processing capability (simply speed)</li>\n<li>restriction to local translation contexts (technical documents as opposed to literature).</li>\n</ul>\n\n<p>The thesaurus method (which is really nowadays an 'ontology' method) has not been incorporated well into MT (as far as I know so far), but I expect that the same 3 situations (better corpora, processing capability, restricted contexts) will make MT even more successful. </p>\n\n<p>That is, I think the ideas mentioned by Bar-Hillel as failures of the 1960's MT technologies are just not failures any more, but strengths. I expect soon enough that those methods will not be enough, but over the past decades, MT really has gotten much much better. No, it's not totally hands-off automatic, but then neither is driving.</p>\n\n<p>(disclaimer: I had never read the Bar-Hillel paper before now. Also, I am not an MT researcher or implementer)</p>\n", "Id":"629", "ParentId":"582", "LastEditorUserId":"46", "CreationDate":"2011-09-30T14:01:48.870", "OwnerUserId":"4", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-30T19:05:00.170", "LastEditedUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}, "LastActivityDate":"2011-09-30T19:05:00.170", "Score":"4", "OwnerUser":{"UpVotes":"432", "WebsiteUrl":"", "Location":"United States", "Id":"4", "DownVotes":"2", "AccountId":"167219", "Views":"42", "Reputation":"1906", "CreationDate":"2011-09-13T20:24:01.087", "DisplayName":"Mitch", "LastAccessDate":"2014-01-15T11:56:51.610", "AboutMe":"<p>Native speaker of American English (AmE) with touches of Southern AmE.\nProficient in French and German. Elementary knowledge of Mandarin. Basic knowledge of linguistics.</p>\n"}}