{"Body":"<p>Speaking from personal experience:</p>\n\n<p>We started with a model of what differentiates languages, in this case a set of 13 parameters which could either be on or off. Considering each possible combination of these parameters, we ended up with 3072 languages (less than the expected 2^13=8192 because many combinations were impossible). For each language, we generated a list of all possible sentences which could be constructed in the language without sentence-lengtheners like conjunctions and relative pronouns. Each sentence looked something like <code>Noun Adverb Verb Adjective Noun</code>.</p>\n\n<p>NB. These models were used to test theories of language acquisition, not language change, but the methodology could be used there as well. Also, this computer model assumes that the linguistic model (i.e. parameter-setting) is accurate; that part unfortunately can't be tested.</p>\n\n<p><strong>Edit</strong>: The research I was directly involved in was never published. However, the same model was originally used by Janet Fodor and William Sakas of CUNY. A quick search finds <a href=\"http://www.colag.cs.hunter.cuny.edu/pub/FodorSakasBUCLD28.pdf\" rel=\"nofollow\">this paper</a>, which describes the \"language domain\" in more detail.</p>\n", "Id":"630", "ParentId":"626", "LastEditorUserId":"58", "CreationDate":"2011-09-30T14:05:53.640", "OwnerUserId":"58", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-02T02:04:56.577", "LastEditedUser":{"UpVotes":"43", "DownVotes":"1", "Id":"58", "AccountId":"264197", "Views":"14", "Reputation":"458", "CreationDate":"2011-09-13T21:34:17.763", "DisplayName":"Anschel Schaffer-Cohen", "LastAccessDate":"2011-11-03T19:12:24.783"}, "LastActivityDate":"2011-10-02T02:04:56.577", "Score":"7", "CommentCount":"1", "OwnerUser":{"UpVotes":"43", "DownVotes":"1", "Id":"58", "AccountId":"264197", "Views":"14", "Reputation":"458", "CreationDate":"2011-09-13T21:34:17.763", "DisplayName":"Anschel Schaffer-Cohen", "LastAccessDate":"2011-11-03T19:12:24.783"}}