{"OwnerUser":{"UpVotes":"16", "WebsiteUrl":"http://www.math.u-psud.fr/~fouquet/", "DownVotes":"0", "Id":"1707", "AccountId":"1575488", "Views":"8", "Reputation":"461", "CreationDate":"2013-01-28T10:33:35.847", "DisplayName":"Olivier", "LastAccessDate":"2014-01-18T22:01:23.260"}, "comments":[], "Body":"<p>The question in the title seems rather different from the two questions in the body of the text, and these two in turn are not synonymous either (the original purpose of a tool may be quite different from what a tool is mainly use for). </p>\n\n<p>At any rate, my answer to the question in the title is that they are legitimate theories (because an illegitimate theory is a quite rare beast, it seems to me). The original purpose of any given scientific concept is always hard to ascertain, though in that case one can confidently say that phrase structure rules <em>were not</em> originally introduced to describe cognitive structure, for the simple reason that their popularization in linguistics occurred <em>before</em> the idea that there might exists cognitive structure involved in language became largely accepted (and in fact, the development of phrase structure triggered the cognitive reevaluation, not the other way round). As far as I know, the idea that phrase structure grammars could be an accurate model of cognitive capability appeared for the first time in Robert Lees' review of <em>Syntactic Structures</em> in 1957, whereas dependency relations were introduced in the XIXth century.</p>\n\n<p>Regarding the last question,it seems to me that our knowledge of syntactic phenomena is still thin enough so that there is no meaningful distinction between accurate description and theoretical modeling of the cognitive process involved. That said, it is clearly the case that certain strand of phrase structure grammar (minimalism for instance) are prone to posit and work with linguistic concepts which have no immediately accessible linguistic incarnation (for instance unpronounced abstract nodes in trees or abstract Case) whereas other strands dismiss the process as unscientific (angels on pinheads in the words of frequent contributor @jlawler).</p>\n", "Id":"6326", "ParentId":"6325", "CreationDate":"2014-01-06T13:17:51.867", "Score":"3", "PostTypeId":"2", "OwnerUserId":"1707", "LastActivityDate":"2014-01-06T13:17:51.867", "CommentCount":"3"}