{"Body":"<p>I would like to make an addition to what Manjusri said in his in all respects correct answer.</p>\n\n<p><em>Cейчас</em>, unlike <em>теперь</em>, can mean \"just wait a bit\", \"in a moment\", like in </p>\n\n<blockquote>\n  <p>— Иди сюда! (— Come here!)</p>\n  \n  <p>— Сейчас, я занят! (— Just wait a bit, I'm busy!)</p>\n</blockquote>\n\n<p>Also, <em>сейчас</em> can refer not only to the nearest future when it is used with a verb in the future tense, as Manjusri said, but also it can refer to the nearest past, in this case it is used with a verb in the past tense:</p>\n\n<blockquote>\n  <p>Где ты сейчас была? (Where have you been recently?)</p>\n</blockquote>\n\n<p>As you can see, the two words have slightly different meaning, that's why their usage is not determined by the style, or by how formal/informal your speech is, but only by what you actually want to say.</p>\n\n<p>The etymology of <em>сейчас</em> is transparent for the speakers of Russian, it is derived from <code>сей час</code> (this hour, this time). <em>Теперь</em> is not that obvious, but it also comes from a noun phrase. In the early attested form it was <code>топрьво</code> which can be analyzed as \"то прьво\" (тот первый, that first). It has cognates in other Slavic languages, like Ukrainian <code>тепер</code> or Polish <code>dopiero</code> (only, until), while <em>сейчас</em> has none, it is attested only in Russian.</p>\n\n<p>And in Russian there is the third word that means \"now\", that is the cognate of the all-Indo-European n-word with this meaning, it is <code>ныне</code>. In Modern Russian it has the stylistic coloring of being elevated, poetic, and archaic. It is a cognate of Latin <code>nunc</code>, Germanic <code>nun/nu</code> (including English <code>now</code>), Sanskrit <code>nū</code>, etc.</p>\n", "Id":"6361", "ParentId":"6358", "LastEditorUserId":"2689", "CreationDate":"2014-01-09T18:13:25.333", "OwnerUserId":"2689", "PostTypeId":"2", "comments":[], "LastEditDate":"2014-01-09T18:22:41.887", "LastEditedUser":{"UpVotes":"41", "Location":"Ukraine", "DownVotes":"12", "Id":"2689", "AccountId":"2118122", "Views":"8", "Reputation":"828", "CreationDate":"2013-11-06T08:33:33.413", "DisplayName":"Yellow Sky", "LastAccessDate":"2014-01-19T01:45:10.363", "AboutMe":"<p>I've been working as a teacher of English and German for more than 10 years already. Linguistics is my life-long passion, I can speak and read no less than 12 languages well, I am studying Malay and Manju at the moment. My native languages are Ukrainian and Russian.</p>\n", "Age":"37"}, "LastActivityDate":"2014-01-09T18:22:41.887", "Score":"1", "OwnerUser":{"UpVotes":"41", "Location":"Ukraine", "DownVotes":"12", "Id":"2689", "AccountId":"2118122", "Views":"8", "Reputation":"828", "CreationDate":"2013-11-06T08:33:33.413", "DisplayName":"Yellow Sky", "LastAccessDate":"2014-01-19T01:45:10.363", "AboutMe":"<p>I've been working as a teacher of English and German for more than 10 years already. Linguistics is my life-long passion, I can speak and read no less than 12 languages well, I am studying Malay and Manju at the moment. My native languages are Ukrainian and Russian.</p>\n", "Age":"37"}}