{"comments":[], "Body":"<p>As John Lawler says, start by learning phonetics: this will sharpen your &lsquo;ear&rsquo;, making it possible a) to recognize phonic distinctions which a lifetime of linguistic practice has trained you to ignore, and b) to understand how those distinctions are effected. Rigorously apply what you have learned to your own idiolect. Estrange yourself from your own voice: make yourself conscious of what you do with sounds so you can more easily discard inappropriate features. Take voice classes (stage voice, not singing voice) to amplify your range and exercise muscles you have never used.  </p>\n\n<p>All that is preparatory. You may or may not have time to do it all before you have to emulate a particular dialect, but work as much of it in as you can. It makes your subsequent work more efficient.</p>\n\n<p>For a specific dialect, listen to examples: not words but utterances of several sentences and paragraphs, so you become familiar with the prosody (which at bottom is more important than the phonology to making the dialect convincing). Analyze the phonic features, so you know what you&rsquo;re aiming at. Speak along with the sound clips, being careful to keep your vocal muscles relaxed and responsive; if you tense up, you&rsquo;ll lose control and start imposing your own patterns. </p>\n\n<p>Equally, however, you need to appropriate the dialect, accommodate it to your own vocal physiology and your own purposes. Don&rsquo;t imitate your examples slavishly: speak the new dialect as you would have spoken it had it been your native dialect.</p>\n\n<p>And if you&rsquo;re using the dialect as an actor, keep in mind that intelligibility and characterization both trump accuracy. Don&rsquo;t fall in love with your dialect work for its own sake. It&rsquo;s just a tool.</p>\n", "Id":"6368", "ParentId":"6357", "CreationDate":"2014-01-10T12:37:41.730", "Score":"1", "PostTypeId":"2", "OwnerUserId":"1597", "LastActivityDate":"2014-01-10T12:37:41.730", "OwnerUser":{"UpVotes":"27", "Location":"St. Louis, MO", "DownVotes":"1", "Id":"1597", "AccountId":"1722349", "Views":"9", "Reputation":"180", "CreationDate":"2012-12-19T03:05:47.227", "DisplayName":"StoneyB", "LastAccessDate":"2014-01-19T00:05:50.170", "AboutMe":"<p>A commercial writer for 20 years, a theatre guy for 30 years before that, once a drummer - until I heard Joe Morello.</p>\n", "Age":"66"}}