{"OwnerUser":{"UpVotes":"79", "WebsiteUrl":"http://stackoverflow.com/users/21258/joe-pineda", "ProfileImageUrl":"https://www.gravatar.com/avatar/3829797d6709334d9a07fe18dfcb553f?s=128&d=identicon&r=PG", "Id":"2785", "AccountId":"11104", "CreationDate":"2013-11-26T03:56:44.347", "AboutMe":"<p>Developing professionally since 11 years ago. VB6 and SQL Server, mostly.\nUse Linux, C++ and Perl at home.</p>\n", "Age":"35", "Location":"Mexico City, Mexico", "DownVotes":"5", "Views":"3", "Reputation":"395", "DisplayName":"Joe Pineda", "LastAccessDate":"2014-01-19T02:51:24.697"}, "comments":[], "Body":"<p>For Japanese at least, both happened: sometimes the characters are used semantically, others phonetically - either according to their Chinese pronunciation (which can come from either a Northern or Southern, earlier or recent form of Chinese) or to the Japanese reading.</p>\n\n<p>For instance, one of the Chinese readings of the char. \"origin/beginning/birth\" is \"hon\". Now then, the Japanese word for \"book\" is also \"hon\" (don't know if its native or a Chinese/Korean borrowing). So instead of adopting the Chinese char. for \"book\", the Japanese use \"birth/start\" phonetically most of the times when they want to write \"book\".</p>\n\n<p>When char. for \"now, immediately, contemporaneity\" appears right before the char. for \"sun/day\", that specific case is a semantic usage: both together are meant to be read \"kyô\" (today).</p>\n\n<p>That for isolated chars. themselves. Japanese nowadays uses the chars. according to its own structure (SOV), in the very first examples of Japanese writing there's vascilation between trying to follow the S-V-O structure of Chinese or the native one. There's a lot of vacillation also regarding how to phonetically encode words in the vernacular.</p>\n\n<p>In A. C., Moorhouse's book \"History of the alphabet\" I read that something similar happened when Babylonians adopted cuneiform writing from the Summers, and then <strong>again</strong> when the Hittites adopted cuneiform from the Babylons. So, in a Hittite sample of writing, a set of chars. can be read in Hittite, in Babylon or in Sumerian, depending on context!!!</p>\n", "Id":"6377", "ParentId":"6375", "CreationDate":"2014-01-11T21:46:54.300", "Score":"3", "PostTypeId":"2", "OwnerUserId":"2785", "LastActivityDate":"2014-01-11T21:46:54.300", "CommentCount":"1"}