{"Body":"<p>I am slightly puzzled by the fact that you seem to know Rizzi's work but not the answer to this question, but anyway. This answer entirely presupposes the framework in which L.Rizzi is working.</p>\n\n<p>Rizzi's aim is to describe the articulation of what he calls the <em>complementizer layer</em> CP of a sentence. He remarks that this part of the sentence (typically found at the left periphery of the clause, and universally so if one believes in R.Kayne's antisymmetry principle) may contain several projections which typically differ in syntactical properties and semantic interpretation. Among them, the one he calls <strong>Topic</strong> hosts topicalized elements (for the moment, by definition). <em>In Romance</em>, a characteristic property of an element in that position is that it is left-dislocated and replaced by a coreferential clitic pronoun.</p>\n\n<blockquote>\n  <p>Le livre que tu m'as conseillé, je l'ai adoré.</p>\n  \n  <p>(The book that you me recommended, I it have adored)</p>\n</blockquote>\n\n<p><strong>Focus</strong> hosts elements in focus (again, for the moment, by definition) and is distinguished <em>in Romance</em> from <strong>Topic</strong> by a number of properties: most saliently focal stress, the necessity for the sentence to be contrastive and the fact that there may be only one <strong>Focus</strong> position. L.Rizzi also gives a number of much more subtle diagnosis (weak cross over, quantificational properties...)</p>\n\n<p>For instance (focal stress in bold):</p>\n\n<blockquote>\n  <p><strong>Ton</strong> livre, je l'ai adoré. Pas celui de Nolan.</p>\n  \n  <p>(<strong>Your</strong> book, I it have adored. Not Nolan's).</p>\n</blockquote>\n\n<p>Now part of the difficulty is that even though these two functional projections are usually easily distinguished in Romance, hence my stress on this family of languages above, the distinction might be quite mysterious or elusive in other languages. For instance, the topic position in Finnish seems to be the normal subject position and as such entirely unmarked. At the other side of the spectrum, some languages mark theses positions overtly, as does the post-position も in Japanese with <strong>Focus</strong> (but note that Japanese tolerates multiple <strong>Focus</strong> positions, contrary to Romance).</p>\n\n<p>As usual with syntax anyway, more subtle characterizations will depend on what you intend to do with these categories.</p>\n\n<p>References:</p>\n\n<p>L.Rizzi <em>The fine structure of the left periphery</em> in <em>Elements of grammar: Handbook in generative syntax</em>.</p>\n\n<p>S.Miyagawa <em>Why agree? Why move?</em> Linguistics Inquiry Monograph 54.</p>\n\n<p>UPDATE: I can't believe I forgot to cite the following truly wonderful poem. I can't see how anyone could wonder about <strong>Topic</strong> and <strong>Focus</strong> ever after.</p>\n\n<p><a href=\"http://www.let.uu.nl/~Ora.Matushansky/personal/rizzi.html\" rel=\"nofollow\">On functional structure</a></p>\n", "Id":"6387", "ParentId":"6384", "LastEditorUserId":"1707", "CreationDate":"2014-01-13T14:43:32.850", "OwnerUserId":"1707", "PostTypeId":"2", "comments":[], "LastEditDate":"2014-01-14T13:12:47.273", "LastEditedUser":{"UpVotes":"16", "WebsiteUrl":"http://www.math.u-psud.fr/~fouquet/", "DownVotes":"0", "Id":"1707", "AccountId":"1575488", "Views":"8", "Reputation":"461", "CreationDate":"2013-01-28T10:33:35.847", "DisplayName":"Olivier", "LastAccessDate":"2014-01-18T22:01:23.260"}, "LastActivityDate":"2014-01-14T13:12:47.273", "Score":"2", "CommentCount":"9", "OwnerUser":{"UpVotes":"16", "WebsiteUrl":"http://www.math.u-psud.fr/~fouquet/", "DownVotes":"0", "Id":"1707", "AccountId":"1575488", "Views":"8", "Reputation":"461", "CreationDate":"2013-01-28T10:33:35.847", "DisplayName":"Olivier", "LastAccessDate":"2014-01-18T22:01:23.260"}}