{"comments":[], "Body":"<p>Peasants tend to be conservative in their clothing, religious beliefs, customs, and speech. They're resistant to adopting innovations originating elsewhere but in their small communities, albeit when they do acquire innovations they normally retain them for a long time.</p>\n\n<p>The urban poor tend to use and abuse the language in an effort to create their own shibboleths. They frequently invent new words, give new meanings to existing words, and from time to time innovate in grammar. These innovations then spread \"up\" to the urban middle class and from there permeate the speech of the riches/nobles.</p>\n\n<p>Once this last group adopts them, they suddenly cease being considered \"substandard\" and become \"The Standard\" - whereas the speech of the townsfolk, previously considered an exemplary standard, becomes substandard (until they \"upgrade\", of course).</p>\n\n<p>You can see it everywhere: In France, the further you're from Paris the more conservative the language becomes, either in pronunciation (\"moi\" sounds as \"mwè\" in Québec and some parts of rural France, ending in \"ils pensent\" still being pronounced in some regions) and in vocabulary (some areas retain crevette, mar, chatel instead of chevrette, mer, chateau).</p>\n\n<p>Same happens in U.K., with Broad Scotts retaining features Standard English has lost.</p>\n\n<p>In China, the southern so-called dialects are much more conservative than Putonghua (an idealized version of Beijing's dialect). Icelandic is <em>almost</em> the same language the vikings spoke, whereas modern Danish and Norse are way different, etc.</p>\n\n<p>Happens as well when a languages is imposed via a conquest: in rural Mexico, peasant communities that abandoned their indigenous languages long ago in favor of Spanish speak a grossly outdated version of it: ansina, truje, vide instead of así, traje, vi... that's so XVI-XVII century!!! It's now considered very sub-standard, even though that was the prestigious way of speaking long ago.</p>\n\n<p>Cities tend to excercise a standardizing influence over surrounding towns. When you notice small town folks have a strong accent what you're really seeing is people who have not standardized their speech based on how the nearest urban people speak. Cities have the advantage of being highly populated and dense, so have an easier time imposing their ways to the others than the other way around.</p>\n\n<p>Disclaim: I'm no professional linguist either, just a linguistics aficionado.</p>\n", "Id":"6418", "ParentId":"6416", "CreationDate":"2014-01-15T18:30:17.233", "Score":"2", "PostTypeId":"2", "OwnerUserId":"2785", "LastActivityDate":"2014-01-15T18:30:17.233", "OwnerUser":{"UpVotes":"79", "WebsiteUrl":"http://stackoverflow.com/users/21258/joe-pineda", "ProfileImageUrl":"https://www.gravatar.com/avatar/3829797d6709334d9a07fe18dfcb553f?s=128&d=identicon&r=PG", "Id":"2785", "AccountId":"11104", "CreationDate":"2013-11-26T03:56:44.347", "AboutMe":"<p>Developing professionally since 11 years ago. VB6 and SQL Server, mostly.\nUse Linux, C++ and Perl at home.</p>\n", "Age":"35", "Location":"Mexico City, Mexico", "DownVotes":"5", "Views":"3", "Reputation":"395", "DisplayName":"Joe Pineda", "LastAccessDate":"2014-01-19T02:51:24.697"}}