{"comments":[], "Body":"<p>As usual, Wikipedia has a <a href=\"https://en.wikipedia.org/wiki/Singular_they\" rel=\"nofollow\">great article</a> regarding this.</p>\n\n<p>Late Medieval English used \"they\" in the singular when the number of possible nouns was unknown or left vague on purpose by the speaker. In most other situations, then native speakers would use \"he\" as generic - e.g. a dog's toy was \"his toy\" rather than \"its\", and such use was sometimes used also for subjects who could potentially be either male/female.</p>\n\n<p>Centuries later, when first the \"Politically Correctness\" movement came, and then some feminists started to deride what they deemed signs of sexism in the language, the need to get a real neuter-gender alternative to he/she resulted in expanding the use of singular they. You'll also occassionally find other words invented by some feminists ex-profeso to avoid the perceived implied otherness of the feminity, mostly in feminist literature (of course).</p>\n\n<p>In other languages, the most natural way to refer to a sex-less 3rd person would be to use the equivalent of \"it\", but in English the distinction \"male/female\" has become very weak over time, whereas the distinction \"animate/inanimate\" is still perceived in full force - so the only time \"it\" can be applied to humans is when they're babies or very very young children. So instead of \"A young teenage almost never uses contraception when having its first sexually intimate relationship \" you get \"(...) <strong>their</strong> first sexual (...)\", as grammatically contorted as it may seem.</p>\n\n<p>Some papers and writers have simply inverted the common usage of \"he\" as generic and instead take \"she\" as the generic unless maleness is needed/specified, so you get more grammatical sentences whilst avoiding perceived sexism.</p>\n", "Id":"6437", "ParentId":"6431", "CreationDate":"2014-01-16T20:58:09.580", "Score":"2", "PostTypeId":"2", "OwnerUserId":"2785", "LastActivityDate":"2014-01-16T20:58:09.580", "OwnerUser":{"UpVotes":"79", "WebsiteUrl":"http://stackoverflow.com/users/21258/joe-pineda", "ProfileImageUrl":"https://www.gravatar.com/avatar/3829797d6709334d9a07fe18dfcb553f?s=128&d=identicon&r=PG", "Id":"2785", "AccountId":"11104", "CreationDate":"2013-11-26T03:56:44.347", "AboutMe":"<p>Developing professionally since 11 years ago. VB6 and SQL Server, mostly.\nUse Linux, C++ and Perl at home.</p>\n", "Age":"35", "Location":"Mexico City, Mexico", "DownVotes":"5", "Views":"3", "Reputation":"395", "DisplayName":"Joe Pineda", "LastAccessDate":"2014-01-19T02:51:24.697"}}