{"Body":"<p>To expand on Jeremy Needle's point, the insularity of a community has a great effect on that community's accent and dialect (and in some cases, language). As many people have already pointed out, the reasons this lie in sociolinguistics.</p>\n\n<p>First, it is important to note that <a href=\"http://en.wikipedia.org/wiki/Language_change\" rel=\"nofollow\">language change</a> does not happen by divine intervention. Language change happens because a single person or small group of people make a change; inventing a new word, using an existing word in a different context, or pronouncing a word differently. Sometimes these changes make there way out into the world and become popular (<a href=\"http://books.google.co.kr/books?id=UDDwqsz_Kr0C&amp;pg=PA461&amp;lpg=PA461&amp;dq=innovation+diffusion+sociolinguistics&amp;source=bl&amp;ots=S9jTcgsiL5&amp;sig=oCmc5iu6Ge-pkTfwsOFDW0N1vCY&amp;hl=en&amp;sa=X&amp;ei=QHnYUpepOobekgWJ6IGYDQ&amp;ved=0CEUQ6AEwAw#v=snippet&amp;q=%22it%20is%20speakers%20that%20innovate%22&amp;f=false\" rel=\"nofollow\">\"it is speakers that innovate and not languages\"</a>).</p>\n\n<p>The exact method of change is up for debate (in fact, the book I linked to above has an entire chapter devoted to the different theories) but most of the proposed theories rely on changes spreading through social interactions between speakers. For example, using <a href=\"http://en.wikipedia.org/wiki/Social_Network_%28sociolinguistics%29\" rel=\"nofollow\">Social Network Theory</a> it should become obvious why rural areas tend to have more distinct accents/dialects/languages: these communities have relatively few links to outside communities and thus fewer paths through which changes can spread. Additionally, the the generally tight-nit nature of rural communities may mean that innovations can become squashed by social pressure to sound like the rest of the community.</p>\n\n<p>There is a flip side to this too. If a high-status member of community creates an <a href=\"http://encyclopedia2.thefreedictionary.com/Linguistic+Innovation\" rel=\"nofollow\">innovation</a>, the tight-nit nature of the community may cause this change to spread faster and the lack of links to the outside communities may prevent this innovation from spreading further.</p>\n\n<p>The interesting part is that none of this necessarily means that rural accents/dialects/languages need to be harder to understand than their urban brothers. In actuality, \"[un]intelligibility\" the OP speaks of isn't so much that rural accents are <em>harder</em> than their native accents but rather that they are <em>different</em>.</p>\n\n<p>In summary: there are social factors which make rural communities less likely to adopt language changes originating from the outside but which may also encourage the adoptions changes originating from the inside. Additionally, the same social factors which inhibit rural communities' ability to adopt outside changes also inhibit the ability for changes form inside the community to spread to other communities. Over time this can result in accents/dialects/languages which are very different from the surrounding accents/dialects/languages and thus [potentially] harder for their neighbours to interpret.</p>\n", "Id":"6438", "ParentId":"6416", "LastEditorUserId":"1055", "CreationDate":"2014-01-17T00:59:45.467", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2014-01-17T01:05:26.870", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2014-01-17T01:05:26.870", "Score":"1", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}