{"OwnerUser":{"UpVotes":"13", "WebsiteUrl":"http://stevenxu.ca", "Id":"9", "AccountId":"69900", "CreationDate":"2011-09-13T20:51:36.750", "AboutMe":"<p>Hi friends! I'm <a href=\"http://stevenxu.ca\" rel=\"nofollow\">Steven Xu</a>. I'm an enthusiastic San Francisco software engineer focused on the Web. </p>\n\n<p>In my spare time, I like to play and coach volleyball and dabble in linguistics, especially phonetics.</p>\n", "Age":"24", "Location":"Canada", "DownVotes":"0", "Views":"74", "Reputation":"1326", "DisplayName":"Steven Xu", "LastAccessDate":"2013-09-27T23:39:20.960"}, "comments":[], "Body":"<p>Perhaps you might get a more pointed response in the <a href=\"http://english.stackexchange.com/\">English Language and Usage</a> StackExchange. </p>\n\n<p>As for the question itself, my first instinct would be that the potential continuous meaning of the simple present <em>I eat lunch</em> is blocked by the existence of an unambiguously progressive form <em>I am eating lunch</em>. We see this pattern all the time in <a href=\"http://en.wikipedia.org/wiki/Blocking_%28linguistics%29\" rel=\"nofollow\">semantic/morphological blocking</a>.</p>\n\n<p>Other Germanic languages, to my very limited knowledge, do not have a similar progressive verb form, so I would reckon that it is a new development in English. Moreover, the auxiliary + deadjectival verb nature of the progressive strongly points to it being a derivative form. It's probable that somewhere along the line, people decided that <em>is X-ing</em> was a good way to specifically refer to a continuous action, and the emergence of the new construction pushed out one of the original meanings of the simple present.</p>\n\n<p>My proposal is not necessarily true, though. It could easily be the case that the progressive forms emerged in response to the lack of the continuous meaning. That's a question an English historian might be better able to answer than me.</p>\n", "Id":"65", "ParentId":"64", "CreationDate":"2011-09-14T04:10:55.393", "Score":"1", "PostTypeId":"2", "OwnerUserId":"9", "LastActivityDate":"2011-09-14T04:10:55.393", "CommentCount":"3"}