{"Body":"<p>A known <em>single</em> origin for all is certainly impossible since many languages <em>don't</em> have the same cognate term. So what I guesss you are really looking for is a single <em>plausible</em> justification for semantic similarity between the concepts that might lead to using a single cognate term (wihtin a language) for the same concept. </p>\n\n<p>The canonical example, the Romance languages, where the terms for the two concepts are identical, all stem from both \"time\" and \"weather\" deriving from \"<a href=\"http://www.myetymology.com/latin/tempestus.html\" rel=\"nofollow\">tempestus</a>\" = \"season, weather\" (EN) derived directly from \"tempus\" for \"time\" (EN).  </p>\n\n<p>The other examples <em>in IE</em>, Slavic and Celtic, sometimes have one cognate form (\"vrijeme\" (CR)) sometimes two, \"pogoda\" \"czas\" (PL).</p>\n\n<p>The only other language (not already mentioned) I could find (using Google translate) where the two concepts have a common word is Vietnamese:</p>\n\n<ul>\n<li>time: thời gian</li>\n<li>weather: thời tiết</li>\n</ul>\n\n<p>where all the individual words seem to be about time.</p>\n\n<p>This is just examples. All we can really do is is make an educated but still speculative explanation about the semantic drift that since there does exist at least one example where the distinct concepts have similar roots (Latin), that a word form for \"time\" has affinities with marked time periods with special weather a \"season\", and that can drift over to \"weather\" itself. That one example is enough to justify that they are related.</p>\n\n<p>The existence of the example in Vietnamese just makes it more likely that it is not such a crazy explanation, because, as you you suggest, it comes from a supposedly uninfluenced language area (supposing that even those a Celtic \"ams\" for both time and weather was not an independent creation but a loan \"analogy\", even though the root is independent).</p>\n\n<p>One might suggest that Vietnamese might have its pair of terms influenced analogy wise by French but that would take a more in-depth historical/etymological analysis of Vietnamese.</p>\n", "Id":"660", "ParentId":"435", "LastEditorUserId":"4", "CreationDate":"2011-10-02T20:26:48.240", "OwnerUserId":"4", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-03T15:58:43.197", "LastEditedUser":{"UpVotes":"432", "WebsiteUrl":"", "Location":"United States", "Id":"4", "DownVotes":"2", "AccountId":"167219", "Views":"42", "Reputation":"1906", "CreationDate":"2011-09-13T20:24:01.087", "DisplayName":"Mitch", "LastAccessDate":"2014-01-15T11:56:51.610", "AboutMe":"<p>Native speaker of American English (AmE) with touches of Southern AmE.\nProficient in French and German. Elementary knowledge of Mandarin. Basic knowledge of linguistics.</p>\n"}, "LastActivityDate":"2011-10-03T15:58:43.197", "Score":"4", "CommentCount":"9", "OwnerUser":{"UpVotes":"432", "WebsiteUrl":"", "Location":"United States", "Id":"4", "DownVotes":"2", "AccountId":"167219", "Views":"42", "Reputation":"1906", "CreationDate":"2011-09-13T20:24:01.087", "DisplayName":"Mitch", "LastAccessDate":"2014-01-15T11:56:51.610", "AboutMe":"<p>Native speaker of American English (AmE) with touches of Southern AmE.\nProficient in French and German. Elementary knowledge of Mandarin. Basic knowledge of linguistics.</p>\n"}}