{"OwnerUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}, "comments":[], "Body":"<p>Steven's second paragraph, about blocking, is not quite correct.  Spanish for example has both a simple present (<em>él come</em>) and a present progressive formed from a copula + gerund (<em>él está comiendo</em>), however the former is the default expression of a punctual action (at least in conservative dialects).  I have heard it claimed that in some innovative dialects the gerund is in the process of replacing the simple present.  </p>\n\n<p>As a matter of history, Old English lacked a copula + gerund form, and developed it over the course of its development into Middle and Early Modern English.  This development was not uniform.  One of the last constructions to gain a morphologically regular progressive form was the passive.  In earlier English, the sentence in (1) was ungrammatical, with (2) being the preferred way of expressing the meaning:</p>\n\n<ol>\n<li>The trunks were being carried down.</li>\n<li>The trunks were carrying down.</li>\n</ol>\n\n<p>That example was taken from <a href=\"http://languagelog.ldc.upenn.edu/nll/?p=2903\">this Language Log post</a>, which also has an illustration that people were objecting to this innovation as late as the latter half of the 19th century (the use of the progressive in other contexts was well-established by this time).</p>\n", "Id":"68", "ParentId":"64", "CreationDate":"2011-09-14T04:36:21.983", "Score":"12", "PostTypeId":"2", "OwnerUserId":"46", "LastActivityDate":"2011-09-14T04:36:21.983", "CommentCount":"2"}