{"OwnerUser":{"UpVotes":"232", "WebsiteUrl":"http://www.flickr.com/photos/aedia/", "Id":"77", "AccountId":"394997", "CreationDate":"2011-09-13T23:41:02.527", "AboutMe":"<p>Visit the new <a href=\"http://ell.stackexchange.com\">English Language Learners</a> beta!</p>\n\n<p>I am a native speaker of American English. </p>\n\n<p>My background is in computer science. I am fueled by coffee and a painful degree of empathy with usability test subjects.</p>\n\n<p>I currently convert technical details to plain language for normal people, and convert normal language to technical details for programmers.</p>\n", "Age":"30", "Location":"United States", "DownVotes":"1", "Views":"13", "Reputation":"424", "DisplayName":"aedia λ", "LastAccessDate":"2013-09-16T20:25:09.320"}, "comments":[], "Body":"<p><a href=\"http://www.mrc-cbu.cam.ac.uk/people/matt.davis/Cmabrigde/\">Matt Davis</a> provides a useful summary related to this meme. Versions in Spanish, French, Dutch, Danish, German, Czech, Icelandic, Portuguese, Swedish, Bahasa Indonesia, Russian, Albanian, Hungarian, Italian, Irish, and Polish are available on the page. </p>\n\n<p>Hebrew and Finnish are also linked and Davis mentions:</p>\n\n<blockquote>\n  <p>[of Finnish] Both Peter and Ari suggest that the resulting scrambled text is very difficult to read. ...one thing that makes these scramblings difficult to read is that the jumbled-letters often move across morpheme-boundaries.</p>\n  \n  <p>[of Hebrew] Samuel suggests that the scrambled text is \"a REAL mess.. you can not understand it at all\". This may reflect a interesting property of the Hebrew writing system. Since vowels are not written in the text, there is a lot less redundancy in written Hebrew. It may be that readers are already using some inference processes to work out what words are written, the extra load added by jumbling letters creates an additional, excessive level of difficulty.</p>\n</blockquote>\n\n<p>Davis mentions that while no research that spawned this meme was done at \"Cambridge University\" (some versions of the common text say English University, in fact), this text may have been more widely circulated after a <a href=\"http://www.mrc-cbu.cam.ac.uk/people/matt.davis/Cmabrigde/newscientist_letter.html\">1999 note from Graham Rawlinson</a> containing jumbled text, related to his <a href=\"http://www.mrc-cbu.cam.ac.uk/people/matt.davis/Cmabrigde/rawlinson.html\">1976 PhD research</a> that described how readers can understand text despite high noise or error rates.</p>\n\n<p><a href=\"http://www.languagehat.com/archives/000840.php\">Languagehat</a> also discussed this in 2003, and many of the commenters there have good points about what to explore further. Here's one, S.W.:</p>\n\n<blockquote>\n  <p>Most of this seems fairly close to the concept of non-words and orthographic non-word neighborhood effects (i.e., RT's in a yes/no word/non-word lexical task being longer when non-words have a higher neighborhood, or lexical inhibition). Since most of these are strictly <em>non-words</em>, I'm betting that the non words with higher orthographic neighborhoods are harder to read.</p>\n  \n  <p>Also, since we're talking about representing these non-words as actual words I'd be willing to bet there are two very obvious factors involved. I'm betting the base-words (non scrambled) with a higher orthographic neighborhood are even harder to recognize, e.g. high non-word orthographic neighborhood, high base-word orthographic neighborhood = much more difficult to recognize.</p>\n  \n  <p>And, as someone pointed out, we're not even considering ascenders, descenders, syntax, schemas for written text, the degree to which each word is scrambled.... </p>\n</blockquote>\n\n<p>I'm not aware of what research covers those issues but it mgiht mkae for a good porjcet or fololw-up qeutsoin.</p>\n", "Id":"695", "ParentId":"691", "CreationDate":"2011-10-04T17:10:22.197", "Score":"5", "PostTypeId":"2", "OwnerUserId":"77", "LastActivityDate":"2011-10-04T17:10:22.197", "CommentCount":"1"}