{"Body":"<p>The cognitive psychological fact I remember from ancient papers (1970's?) is that, in order of difficulty of reading:</p>\n\n<ul>\n<li>all caps \"HOW EASY IS THIS TO READ?\"</li>\n<li>all lower case \"how easy is this to read?\"</li>\n<li>title case, all major words capitalized: \"How Easy is This to Read?\"</li>\n</ul>\n\n<p>And this is done in a (presumably monolingual) English population. I don't remember if this is only for titles of for longer narratives or for any length.</p>\n\n<p>From a cursory web search it seems the trend in culture in English is for headlines to be in sentence case (just the first word capitalized, the rest lower case), with the unsupported justification that sentence case 'is easier to read'. As to individuals writing, any kind of capitalization is more difficult than not, because of the extra finger to use to 'shift'.</p>\n\n<p>It's very difficult to say that in general reading is easier in one language rather than another because of so many confounding variables (translation, culture, education, etc) forgetting all the language specific discrepancies.</p>\n\n<p>But similarly, comparing speed of reading one passage with another modified passage is confounding because the difficulty of the change itself may outweigh the ostensible benefits.</p>\n\n<p>As to your other questions, just because there is an experimental justification of a certain technique (capitalization) doesn't mean the culture is in any way receptive to it. Spelling reform in English, despite its simple engineering basis, is considered close to 'flat-earth' theories in adoptability. I don't know of any other languages where the language leaders are intentionally trying to change capitalization or use some kind of syntax marking. </p>\n", "Id":"700", "ParentId":"699", "LastEditorUserId":"4", "CreationDate":"2011-10-05T00:53:59.170", "OwnerUserId":"4", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-05T14:48:57.657", "LastEditedUser":{"UpVotes":"432", "WebsiteUrl":"", "Location":"United States", "Id":"4", "DownVotes":"2", "AccountId":"167219", "Views":"42", "Reputation":"1906", "CreationDate":"2011-09-13T20:24:01.087", "DisplayName":"Mitch", "LastAccessDate":"2014-01-15T11:56:51.610", "AboutMe":"<p>Native speaker of American English (AmE) with touches of Southern AmE.\nProficient in French and German. Elementary knowledge of Mandarin. Basic knowledge of linguistics.</p>\n"}, "LastActivityDate":"2011-10-05T14:48:57.657", "Score":"6", "CommentCount":"9", "OwnerUser":{"UpVotes":"432", "WebsiteUrl":"", "Location":"United States", "Id":"4", "DownVotes":"2", "AccountId":"167219", "Views":"42", "Reputation":"1906", "CreationDate":"2011-09-13T20:24:01.087", "DisplayName":"Mitch", "LastAccessDate":"2014-01-15T11:56:51.610", "AboutMe":"<p>Native speaker of American English (AmE) with touches of Southern AmE.\nProficient in French and German. Elementary knowledge of Mandarin. Basic knowledge of linguistics.</p>\n"}}