{"Body":"<p>I think @Aaron is on the right track in pointing you to the <a href=\"https://secure.wikimedia.org/wikipedia/en/wiki/Yod_dropping#Y-cluster_reductions\">Wikipedia article on yod dropping and yod coalescence</a>. However, some clarifications are in order. </p>\n\n<p>There is actually a family of variants for what you are calling the \"softer d\"--<strong>the variants can respectively be transcribed in IPA as [dj], [dʲ], [d͡ʑ], and [d͡ʒ].</strong> Remember that in IPA [j] (called <em>yod</em>) stands for the sound at the beginning of the word <em>yell</em>, and the symbol [d͡ʒ] stands for the sound at the beginning of the word <em>gel</em>. When you used the letter <em>j</em> in your question, I'm guessing the sound you had in mind was more like the latter, although by placing the letter <em>d</em> before it you were perhaps approximating one of the \"intermediate\" sounds ([dʲ] or [d͡ʑ]). I refer you to <a href=\"https://secure.wikimedia.org/wikipedia/en/wiki/Ipa#Letters\">the Wikipedia article on IPA</a> and the relevant linked articles (you can click on individual symbols in the IPA chart for in-depth explanations of them) for a review of the sounds represented by these symbols. There you can also read about the differences in articulation among these different sounds, but generally speaking <strong>the articulatory differences between [d] and the variants mentioned here have to do with the placement of the tongue immediately after the closure (farther back for the variants than for the [d]) and the speed at which the tongue blade moves away from the roof of the mouth (more sluggish for the variants than for the [d]).</strong></p>\n\n<p>To discuss the transcriptions in terms of a concrete example, some speakers pronounce <em>dew</em> as if they are pronouncing the word <em>yew</em> with a [d] sound before it. That pronunciation would be transcribed as [djuː ]. Some speakers of the dialect (or dialect group) to which you are referring pronounce it like the word <em>juice</em> without the [s] sound at the end of it, i.e. it is indistinguishable from the word <em>Jew</em>. We can consider these pronunciations to be at opposite ends of a sort of spectrum, where the first pronunciation comprises a [d]-[j] sequence and the second one comprises a single sound (considered a <em>coalescence</em> of two separate phonemes /d/ and /j/). Yet other speakers might pronounce it somewhere in the middle, which would be transcribed with one of the other variants mentioned above. (I myself do none of the above; I pronounce it just like the word <em>do</em>, which some would analyze as yod dropping.)</p>\n\n<p>Finally, it is important to point out that by using the word <em>phoneme</em> you are presupposing that the speech sound (or sound sequence) to which you are referring is the realization of a single underlying unit. Chances are you just meant <em>speech sound</em>. However, this brings up an issue that is relevant for @Aaron's comment about the pronunciation having a rule-based--as opposed to lexical--source. The existence of the minimal pair <em>dew</em> vs. <em>do</em> (as well as other relevant pairs like <em>twos</em> and <em>Tuesday</em>) in the relevant dialect(s) shows that the environment for this sound (or sequence of sounds) is not predictable and therefore the distinction must be lexical.</p>\n", "Id":"711", "ParentId":"206", "LastEditorUserId":"385", "CreationDate":"2011-10-06T06:33:04.020", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-06T13:00:17.847", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2011-10-06T13:00:17.847", "Score":"10", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}