{"comments":[], "Body":"<p>The strong form of the Sapir-Whorf hypothesis has been discredited on several grounds after its initial formulation. However, recent decades have seen interest spring up in investigating questions about how language interacts with other aspects of cognition. In a very recent paper on this topic, Lila Gleitman and Anna Papafragou write: \"In general, both logic and currently available evidence suggest a disclamatory view of strongest proposals (e.g., Benjamin Whorf, 1956) according to which  particulars of certain human languages are important progenitors of thought, such that elements of perception or conception would be permanently altered by learning one or another language. However, several credible lines of experimental and developmental evidence suggest significant influence of linguistic representation during on-line processing in many cognitive and perceptual domains\" (<a href=\"http://www.ircs.upenn.edu/~truesweb/lila_pdfs/Gleitman%20&amp;%20Papafragou%20%28in%20press%29%20-%20Language_and_thought.docx\" rel=\"nofollow\">doc here</a>). A really fantastic philosophical investigation into the cognitive role of language can and should be read, <a href=\"http://www.google.com/url?sa=t&amp;source=web&amp;cd=3&amp;ved=0CC8QFjAC&amp;url=http://www.gregbryant.org/carruthers.pdf&amp;rct=j&amp;q=The%20cognitive%20functions%20of%20language&amp;ei=792NTvrEAYTb0QGI4PEg&amp;usg=AFQjCNGAMxCkX1f1vn03C5BBXApmL_7VZQ&amp;cad=rja\" rel=\"nofollow\">here</a>. (Note that this latter reference includes 30 pages of open peer commentary, which is then responded to by the author.)</p>\n", "Id":"725", "ParentId":"714", "CreationDate":"2011-10-06T17:01:00.073", "Score":"5", "PostTypeId":"2", "OwnerUserId":"178", "LastActivityDate":"2011-10-06T17:01:00.073", "OwnerUser":{"UpVotes":"56", "WebsiteUrl":"http://ling.umd.edu/~wellwood", "Location":"College Park, MD", "Id":"178", "DownVotes":"11", "AccountId":"922214", "Views":"88", "Reputation":"1112", "CreationDate":"2011-09-19T23:20:44.103", "DisplayName":"Alexis Wellwood", "LastAccessDate":"2013-08-12T15:15:17.400", "AboutMe":"<p>Other relevant links for me are the University of Maryland <a href=\"http://phling.umd.edu/\" rel=\"nofollow\">PHLING</a> and the <a href=\"http://languagescience.umd.edu/\" rel=\"nofollow\">Language Science community</a>.</p>\n"}}