{"comments":[], "Body":"<p>Forgetting all the research in to the Sapir-Whorf hypothesis, the answer is both obviously yes and obviously no, all depending on how you interpret 'language', 'shape' and 'thought'.</p>\n\n<p>I have a hard time thinking about building supplies because I don't have the vocabulary to express all the intricacies of hardware. So obviously yes, the hardware language allows a new way of thinking. (but then what is causing what here: I can have thoughts about things without the vocabulary items, the latter just make it easier and quicker, and beside which came first, the words or the thoughts). </p>\n\n<p>And on the other hand obviously no, language doesn't force thought, one can translate (once experienced from one language to another, one can be bilingual and converse the same thoughts in two different languages. But, it may take one longer in one language than another, or the experiences and cultured learned with one language may not have corresponding things to translate to in the other.</p>\n\n<p>But to balance these out properly, I think one can say (without cynicism) that the Sapir-Whorf hypothesis is superficially true: when you first visit a new language it always feels like you have to -think-differently to use it properly, and that that is a reflection of and caused by the language itself. But with experience, one can translate from one to the other.</p>\n\n<p>(and then there is all the experimental evidence that strong Sapir-Whorf is unfounded and even weak Sapir-Whorf has problems).</p>\n", "Id":"733", "ParentId":"714", "CreationDate":"2011-10-07T14:41:07.697", "Score":"2", "PostTypeId":"2", "OwnerUserId":"4", "LastActivityDate":"2011-10-07T14:41:07.697", "OwnerUser":{"UpVotes":"432", "WebsiteUrl":"", "Location":"United States", "Id":"4", "DownVotes":"2", "AccountId":"167219", "Views":"42", "Reputation":"1906", "CreationDate":"2011-09-13T20:24:01.087", "DisplayName":"Mitch", "LastAccessDate":"2014-01-15T11:56:51.610", "AboutMe":"<p>Native speaker of American English (AmE) with touches of Southern AmE.\nProficient in French and German. Elementary knowledge of Mandarin. Basic knowledge of linguistics.</p>\n"}}