{"Body":"<p>There are reasons specific to syllable structure and markedness that @Aerlinthe has done a great job of delineating (that answer got an upvote from me!), but I think it's also important to point out that we could replace the phrase \"syllable complexity\" in this question with almost any other grammatical feature: Why do languages have different vowel inventories from each other? Why do languages have different numbers of genders from each other?  Why do languages have different word orders from each other?</p>\n\n<p>If we're comparing the phonological systems of two arbitrary languages, we might as well ask: Why does Zulu make use of clicks while French doesn't? Why does Cantonese distinguish six tones while Mandarin only distinguishes four (or five)? The human articulators are clearly capable of creating speech sounds with an ingressive airstream and the human ear is able to distinguish six distinct tunes, so why don't all human languages exploit these capabilities?</p>\n\n<p>The short answer is that they don't need to. Languages have evolved over time to meet the functional demands of spontaneous inter-human communication, and different phonological systems exploit different capabilities of the articulatory and perceptual systems of humans to meet these demands. Complexity, if it can be quantified, tends to pop up in different parts of the grammar in different languages. Sure, Japanese doesn't take advantage of consonant clusters to maximize the number of possible syllables at its disposal, but English doesn't make use of vowel length contrasts, which would otherwise increase the number of possible syllables in <em>its</em> syllable arsenal. </p>\n\n<p>It's this inherent property of languages that makes them beautiful, and it's what keeps us linguists in business!</p>\n", "Id":"744", "ParentId":"736", "LastEditorUserId":"385", "CreationDate":"2011-10-08T02:48:19.093", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-08T03:08:54.900", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2011-10-08T03:08:54.900", "Score":"10", "CommentCount":"1", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}