{"OwnerUser":{"UpVotes":"56", "WebsiteUrl":"http://ling.umd.edu/~wellwood", "Location":"College Park, MD", "Id":"178", "DownVotes":"11", "AccountId":"922214", "Views":"88", "Reputation":"1112", "CreationDate":"2011-09-19T23:20:44.103", "DisplayName":"Alexis Wellwood", "LastAccessDate":"2013-08-12T15:15:17.400", "AboutMe":"<p>Other relevant links for me are the University of Maryland <a href=\"http://phling.umd.edu/\" rel=\"nofollow\">PHLING</a> and the <a href=\"http://languagescience.umd.edu/\" rel=\"nofollow\">Language Science community</a>.</p>\n"}, "comments":[], "Body":"<p>Extensive typological study doesn't appear to have been done on this. However, this is probably so because it has been difficult to say precisely <em>what</em> the mass/count distinction is about. </p>\n\n<p>What we can understand is that the mass/count distinction tracks (imperfectly) an important human cognitive distinction between objects (or, countables) and substances (or, uncountables, \"fake mass nouns\" like <em>furniture</em> aside). As with many conceptual distinctions, different languages may mark the difference overtly, others may not. To give a different example, a language like West Greenlandic has a host of \"pluractional\" morphemes that attach to verbs, one of which indicates whether an event description picks out a series of iterative events, or whether it picks out a single event of continuous extent. English doesn't have such morphemes, but interestingly in this language we see certain event descriptions as underdetermining the two uses (e.g., <em>John ran more than Mary last year</em>, if true, can mean he ran on more occasions (iterative), or for a greater temporal or spatial extent (continuative)). So a conceptual distinction that is overtly marked in West Greenlandic is left implicit in English.  </p>\n\n<p>Similarly, English does not mark mass occurrences of nouns, but marks individual (with the indefinite article <em>a(n)</em>) and plural (with the <em>-s</em> suffix) occurrences of nouns. The bare form of a noun is often understood on a material reading (which is why the gruesome interpretation in <em>There was boy all over the road</em>, as if uttered after a horrific accident), and singular/plural occurrences are understood as picking out a singularity or multiplicity of individuals that fall under the concept named by the noun. If a language, for example, doesn't have a singular/plural distinction, one might think that noun occurrences there are understood via a combination of the preferred conceptualizations of <em>things falling under the concept</em> (e.g., we think of <em>boy</em> best as describing individual boys, and <em>water</em> best as describing an unindividuated substance), and extralinguistic context. The grammar doesn't force such speakers to express which conception they intend.</p>\n\n<p>An oft-discussed counterexample to the idea that the distinction is universal, is the claim that all nouns are actually mass in Chinese---\"count\" nouns don't exist except in the sense that they are \"built up\" in combination with classifiers. However, as <a href=\"http://www.lisacheng.nl/pdf/Massifier.pdf\">Cheng and Sybesma argue</a>, and <a href=\"http://philpapers.org/rec/CHIMNV\">Chierchia accepts</a>, even this language has reflexes of the conceptual distinction---i.e., it uses only \"classifiers\" for nouns that are understood as \"count\" (i.e., highly individuated), and only \"massifiers\" for those understood as \"mass\" (i.e., low individuation).</p>\n\n<p>In sum, the role of grammar seems to be specifying <em>what kind</em> of conceptualization we're after. In English, there are a lot of nouns that are comfortable occurring as either mass or count, the difference ending up in whether we want to express a notion of the material, <em>rock</em>, or that of some quantity of individuals comprised of that material, <em>rocks</em>. Other occurrences, like <em>muds</em> seem less acceptable, but this could just be a matter of the frequency with which we encounter individuated MUD; if we can talk about kinds of muds or jars that contain some mud in a context, so that <em>I bought three muds at the mud store</em> isn't really so bad. Extralinguistic context can help us individuate even under the concept MUD. </p>\n\n<p>Whether a language <strong>uses grammar to express the mass/count distinction</strong> will be a fact about particular languages, but the conceptual distinction is likely universal. (Hat tip to Dustin Chacón for discussion of Chinese.)</p>\n", "Id":"762", "ParentId":"224", "CreationDate":"2011-10-10T17:28:36.133", "Score":"8", "PostTypeId":"2", "OwnerUserId":"178", "LastActivityDate":"2011-10-10T17:28:36.133", "CommentCount":"2"}