{"OwnerUser":{"UpVotes":"432", "WebsiteUrl":"", "Location":"United States", "Id":"4", "DownVotes":"2", "AccountId":"167219", "Views":"42", "Reputation":"1906", "CreationDate":"2011-09-13T20:24:01.087", "DisplayName":"Mitch", "LastAccessDate":"2014-01-15T11:56:51.610", "AboutMe":"<p>Native speaker of American English (AmE) with touches of Southern AmE.\nProficient in French and German. Elementary knowledge of Mandarin. Basic knowledge of linguistics.</p>\n"}, "comments":[], "Body":"<p>To make an analogy, spoken language is like a hand and written language is like a hammer. </p>\n\n<p>We are born with the capability to speak/hear (specific anatomical structures in the ear, mouth/throat/lungs, and brain) and we spontaneously learn spoken language by its presence. But writing systems are artificial, man-made contrivances, a coding system to record the spoken language, a tool that attempts to extend the usefulness of spoken language.</p>\n\n<p>One naturally learns language growing up around people, but one needs instruction in reading and writing to do it. People communicated for thousands of years quite well without writing. The rules of writing are totally dependent on those of language that came before it.</p>\n\n<p>To understand the arbitrariness of writing consider that Mandarin is normally expressed in logograms (the complicated picture-like collection of strokes for one syllable), but can also be expressed in pinyin, a romanization, roughly one letter per phoneme. Similarly, Persian is normally written in an Arabic script (leaving out most vowels) where Arabic is a very different structured language, but before the Arabic invasion was written in cuneiform, a syllabic system, but can be transcribed to a roman lettering. All these forms are with no change in meaning. The point is that writing systems are arbitrary inventions.</p>\n\n<p>Writing is merely an attempt at encoding natural language (the non-written, primary, spoken thing). So, studying writing is studying the arbitrary man-made patterns of orthography, and these structures are very different from (or, if not, depend entirely on) the patterns of spoken language.</p>\n\n<p>Studying writing (an interesting topic) is like studying a hammer, a very different thing than studying the hand that uses it.</p>\n\n<hr>\n\n<p>As an aside, sign language needs to be accounted for (only because it is nominally not spoken), and that account (by analysis and experiment) seems to be that it has the same properties as spoken language in contrast to written ones.</p>\n\n<p>For reference, see the preface/first chapter of any introductory linguistics textbook. There is the <a href=\"http://en.wikipedia.org/wiki/Linguistics#Speech_and_writing\" rel=\"nofollow\">speech and writing</a> section of wikipedia, which supports what I say, but you should seen actual authority to be convinced if you need a trustable reference.</p>\n", "Id":"796", "ParentId":"788", "CreationDate":"2011-10-13T14:15:11.750", "Score":"3", "PostTypeId":"2", "OwnerUserId":"4", "LastActivityDate":"2011-10-13T14:15:11.750", "CommentCount":"15"}