{"comments":[], "Body":"<p>The simplest answer is that high performance NLP applications do not use X-bar theory as an explicit representation. A major factor in this is that parsing is most commonly evaluated against the Penn Treebank or various dependency annotated corpora, neither of which would be considered X-bar structures. For an idea of what kind of structures and information are used in statistical parsing, check out one of the seminal articles such as <a href=\"http://acl.ldc.upenn.edu/J/J03/J03-4003.pdf\">Head-Driven Statistical Models for Natural Language Parsing (Collins, 2003)</a>.</p>\n\n<p>There is certainly some work in NLP that does not explicitly use an X-bar representation but shows that constraints that could be considered to have come from X-bar (or equally, later from Minimalism) are useful in certain applications. For an example in parsing, see the Empty Categories section of <a href=\"http://www.seas.upenn.edu/~gabbard/fully_parsing_the_penn_treebank.pdf\">Fully Parsing the Penn Treebank (Gabbard et al., 2006)</a>; for POS tagging see <a href=\"http://www.aclweb.org/anthology-new/D/D09/D09-1072.pdf\">A Simple Unsupervised Learner for POS Disambiguation Rules\nGiven Only a Minimal Lexicon (Zhao and Marcus, 2009)</a>.</p>\n\n<p>Outside of performance-driven NLP applications, there is some work. As Alan H. points out, <a href=\"http://dingo.sbs.arizona.edu/~sandiway/pappi/index.html\">Sandiway Fong's Principles and Parameters Parser</a> is a great example. It follows from <a href=\"http://dspace.mit.edu/bitstream/handle/1721.1/6957/AITR-972.pdf?sequence=2\">Principle-Based Parsing (Berwick, 1987)</a>. For more background in the evolution of these systems, see Robert Berwick or Mitch Marcus's dissertations.</p>\n", "Id":"80", "ParentId":"31", "CreationDate":"2011-09-14T06:56:15.270", "Score":"9", "PostTypeId":"2", "OwnerUserId":"106", "LastActivityDate":"2011-09-14T06:56:15.270", "OwnerUser":{"UpVotes":"30", "WebsiteUrl":"http://www.seas.upenn.edu/~lignos", "DownVotes":"6", "Id":"106", "AccountId":"896149", "Views":"16", "Reputation":"381", "CreationDate":"2011-09-14T05:56:35.697", "DisplayName":"Constantine", "LastAccessDate":"2013-12-29T05:06:56.547", "AboutMe":"<p>I am a PhD student at the University of Pennsylvania. I work on language acquisition/processing and computational linguistics.</p>\n"}}