{"OwnerUser":{"UpVotes":"56", "WebsiteUrl":"http://ling.umd.edu/~wellwood", "Location":"College Park, MD", "Id":"178", "DownVotes":"11", "AccountId":"922214", "Views":"88", "Reputation":"1112", "CreationDate":"2011-09-19T23:20:44.103", "DisplayName":"Alexis Wellwood", "LastAccessDate":"2013-08-12T15:15:17.400", "AboutMe":"<p>Other relevant links for me are the University of Maryland <a href=\"http://phling.umd.edu/\" rel=\"nofollow\">PHLING</a> and the <a href=\"http://languagescience.umd.edu/\" rel=\"nofollow\">Language Science community</a>.</p>\n"}, "comments":[], "Body":"<p>Linguistics is the scientific study of language. A language is narrowly defined as the set of rules that \"speakers\" (speaking or signing) acquire when they are very, very young. There is evidence for processes of language acquisition underway at the very youngest testable ages (under a year old).</p>\n\n<p>A speaker with a grammar like mine <em>knows</em>, without ever being told, that strings of words like <em>colorless green ideas sleep furiously</em> are well-formed, but strings like <em>furiously sleep ideas green colorless</em> are not. I can say that the first sentence would be true if (i) there existed some things that were colorless, green, and ideas, (ii) such things could sleep, and (iii) such sleepings could happen furiously. The other string supports no such interpretation. Since I don't have to look up these two strings in some kind of book to tell whether one is good or bad, we say that my grammatical rules are internalized.</p>\n\n<p>The rules of grammar (again, in the linguist's sense) are learned <em>implicitly</em>. They are not taught, as the rule \"i before e except after c\" has to be learned when one learns how to spell, but rather inferred on the basis of experience in a linguistic environment (i.e., a community of speakers who do some speaking in the presence of the child). </p>\n\n<p>Lastly, knowledge of language is universal. Barring severe cognitive deficits or social deprivation, every normally-developing child acquires a native tongue. </p>\n\n<p>Written language stands in sharp contrast: children learn to read and write much later (usually once they start attending school) than they learn to understand and produce spoken language; written language has no internalized rules, it reflects only the speakers' internal rules and, possibly, a speaker's regard for the prescriptive rules of style; written language has to be learned explicitly (often laboriously); and, written language is not universal—there are many, many people on this planet who have knowledge of language but can't read or write. </p>\n\n<p>\"Written language\" is an artifact of (some) human cultures <em>who already had spoken languages</em>. Spoken language is definitional of our <em>species</em>, and it is this kind of species-specific capacity that linguists study. This is not to say that the capacity for writing is not complex; it is in fact <em>more</em> complex than the capacity for language, in that explaining how we can have writing systems requires in part an explanation of what the language we're writing down <em>is</em> in the first place.</p>\n", "Id":"802", "ParentId":"788", "CreationDate":"2011-10-13T22:27:20.853", "Score":"12", "PostTypeId":"2", "OwnerUserId":"178", "LastActivityDate":"2011-10-13T22:27:20.853", "CommentCount":"2"}