{"OwnerUser":{"UpVotes":"72", "WebsiteUrl":"http://suburbandestiny.com/conlang", "Id":"20", "AccountId":"15651", "CreationDate":"2011-09-13T20:53:42.550", "AboutMe":"<p>I'm a programmer by day and an amateur linguist by night.</p>\n\n<p>I organize the Arlington Linguistics Book Club, where we read a wide variety of books that make the science of linguistic accessible to a popular audience.</p>\n", "Age":"41", "Location":"United States", "DownVotes":"6", "Views":"39", "Reputation":"1657", "DisplayName":"MatthewMartin", "LastAccessDate":"2014-01-08T19:46:09.130"}, "comments":[], "Body":"<p>Except for Esperanto, there aren't any conlangs with native speakers (except a single Volopuk speaker, a single Klingon speaker) So there isn't much to study language change in the same sense that we can study language change of say Latin as it slowly turns into French.</p>\n\n<p>The next problem is that in the remaining languages, there aren't that many people and they are generally very conscious of the fact that they are using a language with explicitly invented rules, so you can't easily separate explicit creative acts of the users from the natural processes of language change. In this case one would expect fashion and the effectiveness of promoters of a given design to sway the crowd.</p>\n\n<p>The last thing that would complicate an examination of language change is that outside of Esperanto, the users of a constructed language are learning it as a second language and sometimes using it as a contact language (communication between people without a shared language, like a pidgin or creole), so you'd expect to also observe people moving along a learning curve and resorting to the sort of things people do when they are in a contact language situation.  For example, pidgin speakers will sometimes try all possibilities of vocabulary and word order until the surmise they have communicated something.</p>\n", "Id":"808", "ParentId":"804", "CreationDate":"2011-10-14T13:13:40.990", "Score":"5", "PostTypeId":"2", "OwnerUserId":"20", "LastActivityDate":"2011-10-14T13:13:40.990", "CommentCount":"3"}