{"OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "comments":[], "Body":"<p>All languages, as far as we know, do <em>something</em> to mark <strong>information status</strong>.  Basically this means that when you refer to an X, you have to do <em>something</em> to indicate the answer to questions like:</p>\n\n<ol>\n<li>Do you have a specific X in mind?</li>\n<li>If so, you think your hearer is familiar with the X you're talking about?</li>\n<li>If so, have you already been discussing that X for a while, or is it new to the conversation?</li>\n<li>If you've been discussing the X for a while, has it been the main topic of conversation?</li>\n</ol>\n\n<p>Question #2 is more or less what we mean by \"definiteness.\"  (Though for what it's worth, English can use the definite article even when the answer to #2 is \"no.\"  For instance, in formal English you can say \"The whale is a mammal\" &mdash; and this doesn't mean you're talking about a specific whale with which your hearer is already familiar.)</p>\n\n<p>But there are lots of other information-status-marking strategies that don't directly involve definiteness marking.  For example:</p>\n\n<ul>\n<li>As far as we know, all languages mark <strong><a href=\"http://en.wikipedia.org/wiki/Focus_%28linguistics%29\">focus</a></strong>.  Roughly speaking, focused words or phrases are ones that count as \"new information.\"  In English we use prosodic intonation to mark foci; other languages use word order (e.g. in Hungarian) or have a special function word that acts as a focus marker (e.g. in many African languages).</li>\n<li>In some languages, it's required to mark the <strong><a href=\"http://en.wikipedia.org/wiki/Topic%E2%80%93comment\">topic</a></strong> of a sentence (e.g. Russian, Mandarin and Japanese).  This is correlated with definiteness but isn't quite the same thing: topics are likely to be definite, but they don't have to be.</li>\n<li>Some languages mark <strong><a href=\"http://en.wikipedia.org/wiki/Obviative\">obviation</a></strong>.  (This is really common in native North American languages.)  This gets a little complicated, but very roughly: if a clause in these languages has two or more third-person referents, the speaker needs to mark one as \"more salient\" and the others as \"less salient.\"  Definiteness tends to play a role in the decision &mdash; with definite referents tending to count as \"more salient\" &mdash; but there are also tendencies for e.g. people to be \"more salient\" than animals and possessors to be \"more salient\" than their possessions, so it's not a straight-up definiteness-marking system.  </li>\n<li>Some languages mark <strong><a href=\"http://en.wikipedia.org/wiki/Telicity\">telicity</a></strong> (e.g. Finnish). A <em>telic</em> event is one that is complete; an <em>atelic</em> event is one that isn't complete.  So for instance, \"I built-ATELIC the model plane\" might mean \"I worked on the model plane (but didn't finish).\"  This has some functional overlap with definiteness marking: consider the difference between \"I ate some cake\" (atelic, indefinite) and \"I ate the cake\" (telic, definite). </li>\n<li>Some languages mark <strong>specificity</strong> (e.g. Spanish).  Consider the English sentence \"I'm looking for a friend.\"  On one reading it means \"I just want <em>someone</em> to be my friend\" (nonspecific), on another it means \"I've got a particular friend I want to talk to, and I'm trying to find <em>him</em>\" (specific).  In Spanish those two senses are distinguished: <em>estoy buscando un amigo</em> for the nonspecific reading, <em>estoy buscando <strong>a</strong> un amigo</em> for the specific one.</li>\n<li>Some languages have <strong><a href=\"http://en.wikipedia.org/wiki/Switch-reference\">switch-reference</a></strong> systems.  (This is huge in New Guinea, and also in Amazonia.)  The details vary, but basically you mark whether a clause has the same subject or a different subject than the clause that went before.  This has some functional overlap with information status marking, because it tends to highlight newly introduced referents.  </li>\n<li>A few languages <strong>mark definiteness on the <em>verb</em> rather than on noun phrases</strong>.  Hungarian, for instance, has a special verb form used when the direct object is definite. (Hungarian <em>also</em> has definite and indefinite articles, so this is a case of redundant marking of the same feature.  I don't know whether any language uses verb marking as its <em>only</em> strategy to indicate definiteness.)</li>\n</ul>\n\n<p>And these aren't mutually exclusive.  Hungarian has definite and indefinite articles for noun phrases, <em>and</em> topic marking, <em>and</em> definiteness marking on the verb.  Finnish marks topic and telicity.  English mostly uses definite and indefinite articles, but it does have topic-marking constructions that you can use if you want to.  </p>\n\n<p>And finally, in a pinch, you've always got the option of <strong>periphrasis</strong>: you can say \"one guy in particular\" or \"a different guy\" or \"that guy we've been talking about\" or \"a guy you don't know but I'm gonna tell you about him now\" or whatever.  </p>\n\n<p>So we've got all these different information status distinctions that a language might mark.  And the interesting thing is that there's <strong>a lot of redundancy between them</strong>.  If you know that a referent is nonspecific, you can infer that it's indefinite.  If you know that a referent is topical and specific, you can often infer that it's definite.  If you know that a referent has been the subject of the past umpteen clauses, you can infer that it's definite and probably topical.  </p>\n\n<p>The upshot is, a language doesn't need to mark all of the distinctions, as long as it consistently marks some of them.  And this is why there can be languages like Finnish with no grammatical definiteness marking at all.  Finnish <em>does</em> marks topic, focus and telicity, and this gives enough information to work out whether a referent is definite or indefinite.  Similarly, this is why English can get away with no grammatical switch-reference: we mark focus and definiteness, and use periphrasis in a pinch (\"no, not <em>that</em> X, the <em>other</em> X\"), and that's enough to let us work out whether a clause has the same subject or a different subject than the one before.</p>\n", "Id":"811", "ParentId":"739", "CreationDate":"2011-10-14T15:55:36.783", "Score":"17", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2011-10-14T15:55:36.783", "CommentCount":"2"}