{"OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "comments":[], "Body":"<p>You're using the words \"language\" and \"dialect\" as if they were mutually exclusive: as if some people spoke \"languages\" and other people spoke mere \"dialects.\"  But that's not how linguists use those words.  Think of them instead as referring to two different levels on the same hierarchy.</p>\n\n<ul>\n<li>Everyone speaks a language.</li>\n<li>Everyone speaks a dialect (or \"variety\"*) <em>of</em> whatever language they speak.</li>\n</ul>\n\n<p>For instance, I speak the Midland US dialect <em>of</em> English.  Asking whether I speak a dialect or a language is like asking whether I was born in Michigan or in the United States.  The answer is \"both,\" because one includes the other.  Saying \"I don't speak a dialect, I just speak proper English\" would be like saying \"I don't live in a state or territory or in Washington D.C., I just live in the US,\" which is pretty much nonsense.</p>\n\n<p>So maybe it makes sense to rephrase your questions, like so:</p>\n\n<ol>\n<li>Are there any cases where two varieties of the same language are treated as separate languages for political reasons?</li>\n<li>Are there any cases where two distinct languages are treated as varieties of the same language for political reasons?</li>\n</ol>\n\n<p>In both cases the answer is \"yes.\"  For #1, look at Serbian, Croatian and Bosnian.  Most linguists consider these all to be local varieties of the <a href=\"http://en.wikipedia.org/wiki/Serbo-Croatian_language\">Serbo-Croatian language</a>, but native speakers will insist that they're different languages.  For #2, look at the language situation in China, where for instance <a href=\"http://en.wikipedia.org/wiki/Varieties_of_Chinese\">Mandarin and Cantonese are treated as varieties of the same language</a> even though they're distinct languages by any non-political standard.\n<hr>\n*Most linguists wouldn't consider \"dialect\" to be derogatory.  But in non-technical talk, it <em>is</em> often used derogatorily &mdash; as in \"That's not a real language, it's just a dialect.\"  So I like to use the word \"variety\" just because it makes it clear that I don't have any derogatory meaning in mind.  That's just a personal preference, though, and as far as I'm concerned if you want to say \"dialect\" that's fine too.</p>\n", "Id":"812", "ParentId":"810", "CreationDate":"2011-10-14T16:22:37.070", "Score":"15", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2011-10-14T16:22:37.070", "CommentCount":"7"}