{"comments":[], "Body":"<p>I think you can call this <em>the \"air ball\" phenomenon.</em> Dave Barry (an American writer of a humor column for the <em>Miami Herald</em>) wrote an article entitled <a href=\"http://www.miamiherald.com/2007/07/30/2175440/message-from-the-stars.html\" rel=\"nofollow\">Message from the Stars</a>, in which he cited the research of Dr. Cherrill P. Heaton, entitled \"Air Ball: Spontaneous Large Group Precision Chanting.\" (Although the journal may be searched <a href=\"http://www.tandfonline.com/loi/rpms20\" rel=\"nofollow\">here</a>, I did not find the original article in <em>Popular Music and Society</em>; however, this <a href=\"http://articles.latimes.com/1995-09-24/news/mn-49383_1_air-ball\" rel=\"nofollow\">LA Times article</a> attests to the article writer interacting with Barry.)</p>\n\n<p>Heaton's article says that an audience will mock a basketball player who completely misses the basket, rim, and backboard by chanting \"air ball,\" centering on an \"F\" for air\" and a \"D\" for \"ball.\" This is the minor third interval with which you hear German mothers calling their children.</p>\n\n<p>Mothers in the US will call for their children with the air ball interval, but I have only heard it when they are calling outdoors. Sometimes, if there is some anger or impatience on the part of the parent, I have heard the interval go up, but not always a minor third.</p>\n\n<p>People will call their pet dogs with this interval. Children will mock each other in games where their opponent has failed in a game (to tag someone, to hit them with a dodge ball) with a \"nyaa, nyaa\" in the same falling minor third (air ball) pattern.</p>\n", "Id":"830", "ParentId":"824", "CreationDate":"2011-10-16T17:50:30.437", "Score":"2", "PostTypeId":"2", "OwnerUserId":"225", "LastActivityDate":"2011-10-16T17:50:30.437", "OwnerUser":{"UpVotes":"8", "Location":"Charlotte, NC", "DownVotes":"0", "Id":"225", "AccountId":"239923", "Views":"6", "Reputation":"385", "CreationDate":"2011-09-21T13:52:43.483", "DisplayName":"rajah9", "LastAccessDate":"2014-01-07T16:34:51.110", "AboutMe":"<p>Contract financial developer at a large bank in Charlotte, NC.</p>\n", "Age":"55"}}