{"Body":"<p>It is obvious to anyone who only knows one language and doesn't know anyone who is bilingual that their own language is simple and other languages have varying degrees of complexity and ease of learning. For an English speaker, <strong>learning as a second language</strong>, French and Spanish are relatively <em>easy</em>, but Latin and Chinese are much more <em>difficult</em> and require each a lot of special extra studying to get 'right' (this is ignoring the irrelevant complication of writing method and living/dead situations).</p>\n\n<p>But the question is about <strong>first language</strong> learning. It turns out from seeing many children learning their first language and from bilingual children that they communicate perfectly fine in any of their first languages and communicate equally well in either if bilingual. (I have no reference for this but) they are also grammatical to the same extent  at the same age (French children know the gender of all the nouns they use, with mistakes made in false generalization just like English speaking children might make the mistake 'getted' instead of the past tense 'got').</p>\n\n<p>Language like Russian or German with long lists of conjugations and declensions with multiple forms for gender, person, mood, etc, etc with agreement and then there are all the exceptions, they seem so complex and need lots of study by people whose first language doesn't have such features (actually, they need lots of study by people whose L1 -does- have similar features, they don't realize their own language is complex in that way and even if you know the form of the rules you still need to know the specifics). </p>\n\n<p>It just turns out that first language learners have no problem with what others perceive as complexity. Think of all the separable verbs in English: call out, call up, call in, call off, put away, put up, put up with, put out. It's just not obvious which preposition to use for which meaning, you just have to learn it. But native English speakers don't even get taught this at school.</p>\n\n<p>So, it just turns out counter to intuition that children do learn to speak fluently -and- grammatically in their L1 at the same rate for all languages.</p>\n", "Id":"849", "ParentId":"778", "LastEditorUserId":"4", "CreationDate":"2011-10-19T14:04:53.270", "OwnerUserId":"4", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-26T17:27:22.107", "LastEditedUser":{"UpVotes":"432", "WebsiteUrl":"", "Location":"United States", "Id":"4", "DownVotes":"2", "AccountId":"167219", "Views":"42", "Reputation":"1906", "CreationDate":"2011-09-13T20:24:01.087", "DisplayName":"Mitch", "LastAccessDate":"2014-01-15T11:56:51.610", "AboutMe":"<p>Native speaker of American English (AmE) with touches of Southern AmE.\nProficient in French and German. Elementary knowledge of Mandarin. Basic knowledge of linguistics.</p>\n"}, "LastActivityDate":"2011-10-26T17:27:22.107", "Score":"13", "OwnerUser":{"UpVotes":"432", "WebsiteUrl":"", "Location":"United States", "Id":"4", "DownVotes":"2", "AccountId":"167219", "Views":"42", "Reputation":"1906", "CreationDate":"2011-09-13T20:24:01.087", "DisplayName":"Mitch", "LastAccessDate":"2014-01-15T11:56:51.610", "AboutMe":"<p>Native speaker of American English (AmE) with touches of Southern AmE.\nProficient in French and German. Elementary knowledge of Mandarin. Basic knowledge of linguistics.</p>\n"}}