{"Body":"<p>So, the hypercatergory D has been deconstructed since before it was accepted as the highest layer of the nominal, like in Szabolcsi's work that shows \"every\" being distinct from articles, and Shlonsky's work on \"all\" as its own weird category, \"each\" goes all over the place, and investigation in numerals and weak quantifiers suggest they form a unique category low enough in the structure for classifiers to cliticize. The one determiner that has stood the test of time is \"the\" (see Alexiadou, Haeheman, and Stavrou's book on the topic)</p>\n\n<p>But, one such language, with that caveat and with another caveat to be named, is my pet language Bengali. It has -- again, arguably -- a D layer in that there is nominal-internal NP movement, over numerals. So:</p>\n\n<pre><code>tinTa    Sundor    beRal\nthree.Cl beautiful cat\n\nSundor    beRal tinTa\nbeautiful cat   three.Cl\n\n\"the three beautiful cats\"\n</code></pre>\n\n<p>Also, I can't think of the reference, it it has been claimed that Bengali also has scrambling and strict scope -- with the exception of canonical SOV sentences! I'll add the citation later with examples.</p>\n", "Id":"852", "ParentId":"851", "LastEditorUserId":"76", "CreationDate":"2011-10-19T23:00:39.300", "OwnerUserId":"438", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-11-02T06:44:56.020", "LastEditedUser":{"UpVotes":"35", "WebsiteUrl":"http://github.com/alekstorm", "Id":"76", "AccountId":"411223", "CreationDate":"2011-09-13T23:34:32.303", "AboutMe":"", "Age":"24", "Location":"Urbana, IL", "DownVotes":"17", "Views":"36", "Reputation":"1043", "DisplayName":"Alek Storm", "LastAccessDate":"2013-12-09T07:20:27.393"}, "LastActivityDate":"2011-11-02T06:44:56.020", "Score":"7", "CommentCount":"2", "OwnerUser":{"UpVotes":"5", "WebsiteUrl":"http://ohhai.mn", "Id":"438", "AccountId":"985599", "CreationDate":"2011-10-19T23:00:39.300", "AboutMe":"<p>I am a 2nd year PhD student at the University of Maryland, studying Linguistics. I work in (morpho)syntax, and dabble in semantics and psycholinguistics. My research interests are in the structure and interpretation of the noun phrase from a crosslinguistic perspective, the structure of Bengali and Indo-Aryan, the representation of argument and event structure, and constraints on variation in grammar and parsing.</p>\n\n<p>Outside of Linguistics I'm interested in religion and atheism, issues related to social justice (particularly for religious and ethnic minorities and people with disabilities), new(-ish) media (internet culture, comic books, video games, various electronics), and various aspects of nerd culture. I have a cat.</p>\n", "Age":"27", "Location":"Adelphi, MD", "DownVotes":"0", "Views":"11", "Reputation":"509", "DisplayName":"dustinalfonso", "LastAccessDate":"2013-06-10T14:38:09.880"}}