{"OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "comments":[], "Body":"<p>Another way to find \"safe\" mergers in a language is to look for mergers that <em>some native speakers of that language</em> make.  For instance, in English, many speakers merge <a href=\"http://en.wikipedia.org/wiki/Phonological_history_of_English_low_back_vowels#Cot.E2.80.93caught_merger\" rel=\"nofollow\">\"cot\" and \"caught\"</a> (i.e. fail to distinguish /ɑ/ and /ɔ/).  And in the US at least, those of us who don't have the cot/caught merger are still accustomed to hearing it from other people.  So a foreign learner who merged /ɑ/ and /ɔ/ would still be intelligible here.</p>\n\n<p>Keep in mind though that this suggestion is <em>relative to a specific language.</em>  So <em>in US English,</em> merging /ɑ/ and /ɔ/ is \"safe,\" but that doesn't mean it's equally safe in other languages.  For instance, I don't know of any French dialects that merge /ɑ/ and /ɔ/, so I doubt that merger would be as safe in French.  </p>\n\n<p>I don't think that you're going to find any mergers that are \"universally safe\" &mdash; i.e. safe in <em>all</em> languages &mdash; and so if you want your SPA to be a universally applicable system, you're going to run into trouble pretty quickly.  On the other hand, a simplified phonetic notation <em>for a specific language</em> could succeed.  So you might end up with \"SPA-English\" (merging /ɑ/ with /ɔ/) and \"SPA-French\" (merging /œ̃/ with /ɛ̃/ and /ɑ/ with /a/) and so on.</p>\n", "Id":"885", "ParentId":"882", "CreationDate":"2011-10-24T15:19:38.923", "Score":"8", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2011-10-24T15:19:38.923", "CommentCount":"4"}