{"comments":[], "Body":"<p>As a linguist, when I go to work on a previously undescribed language I work with individuals to collect language samples then analyse these to make statements about the structure of the language. If one individual happily uses structures that no-one else in the community seems to use (and if I'm sure it isn't just performance error of some sort) then I'll ascribe that to the person's idiolect (individual variety). I might even mention this variation in my analysis though this would be more likely if there was a significant minority using it. I certainly wouldn't say that one variety is more 'correct' than the other. It could happen that this individual's usage will catch on and spread to become widely used in the community, or it may not.</p>\n\n<p>While linguists talk about 'the grammar of the language' as though it's a single entity (it does make a handy book title) it's important to remember that each of us has our own grammar inside our head which enables us to produce linguistic utterances. For speakers of the same language much of this knowledge is  shared, but that doesn't mean they're identical.</p>\n\n<p>But it is also true that people produce utterances that are 'incorrect'. People make mistakes all the time and repair them if they notice, but they don't always notice. <a href=\"http://itre.cis.upenn.edu/~myl/languagelog/archives/001843.html\" rel=\"nofollow\">Geoff Pullum</a> expands on this nicely. I suspect that at least some of the cases you've noticed of 'there is many…' might be mistakes, but some might not be.</p>\n", "Id":"887", "ParentId":"876", "CreationDate":"2011-10-25T00:36:20.333", "Score":"2", "PostTypeId":"2", "OwnerUserId":"363", "LastActivityDate":"2011-10-25T00:36:20.333", "OwnerUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}}