{"comments":[], "Body":"<p>Damage to the <a href=\"http://en.wikipedia.org/wiki/Corpus_callosum\" rel=\"nofollow\">corpus callosum</a> results in various <a href=\"http://en.wikipedia.org/wiki/Split-brain\" rel=\"nofollow\">split-brain</a> disorders. I remember one of them being such that if you present the patient with an object in one of their visual fields, then they can describe its shape and color, but can't identify the objects. If you present the objects in the other visual field, then they can correctly identify the object. However, I don't remember the name of the patient, or the study.</p>\n\n<p>However, just by looking at <a href=\"http://en.wikipedia.org/wiki/Split-brain#Patient_VP\" rel=\"nofollow\">patient VP</a> from Funnell, Corballis, &amp; Gazzaniga's study we can see that the language processing and visual identification processing parts of the brain react differently to damage of the corpus callosum. Thus, it would not be surprising to see effects of being able to describe in words, but not identify as I described in the previous paragraph. </p>\n\n<p>If I have a bit more time later, I will try to hunt down the study I mentioned in the first part of my answer.</p>\n", "Id":"902", "ParentId":"897", "CreationDate":"2011-10-29T03:14:36.403", "Score":"6", "PostTypeId":"2", "OwnerUserId":"33", "LastActivityDate":"2011-10-29T03:14:36.403", "OwnerUser":{"UpVotes":"125", "WebsiteUrl":"http://www.cs.mcgill.ca/~akazna/", "Id":"33", "AccountId":"459207", "CreationDate":"2011-09-13T20:58:42.087", "AboutMe":"<p>From the School of Computer Science and Department of Psychology at McGill University, I marvel at the world through algorithmic lenses. My specific interests are in quantum computing, evolutionary game theory, modern evolutionary synthesis, and theoretical cognitive science. Previously I was at the Institute for Quantum Computing and Department of Combinatorics &amp; Optimization at the University of Waterloo and a visitor to the Centre for Quantum Technologies at the National University of Singapore.</p>\n\n<ul>\n<li><a href=\"http://egtheory.wordpress.com/\" rel=\"nofollow\">Theory, Evolution, and Games Group Blog</a></li>\n<li><a href=\"http://cstheory.blogoverflow.com/author/artemkaznatcheev/\">Theoretical Computer Science Blogoveflow</a></li>\n<li><a href=\"https://plus.google.com/u/0/101780559173703781847/\" rel=\"nofollow\">G+ profile</a></li>\n</ul>\n", "Age":"25", "Location":"Montreal, Canada", "DownVotes":"18", "Views":"25", "Reputation":"876", "DisplayName":"Artem Kaznatcheev", "LastAccessDate":"2014-01-11T00:59:33.567"}}