{"Body":"<p>This seems like a weak case. I'm sure there's a much more thorough rebuttal in the literature, but I'll give at least a few contrary remarks.</p>\n\n<p>The second point, that some words in the two languages seem to have some sounds in common, is the most frequent unscientific argument presented in linguistics circles for the existence of a language family. The problem is that between any two sufficiently large sets of data (language vocabularies have thousands of items), there will <em>nearly always</em> be a couple dozen pairs of words that can be extracted that are \"similar enough\" to be cognates. But that isn't how sound change works - to demonstrate shared ancestry, you must reconstruct words of the common ancestor language, and give a series of <em>regular</em> sound changes that output words in the daughter languages - Grimm's law is a model example of this.</p>\n\n<p>The late Basque linguist Larry Trask gave a quite readable defense against the ceaseless proposals attempting to connect Basque, a language isolate, with nearly every other language family, in <a href=\"http://books.google.com/books?id=jyDjgt1CcU4C&amp;pg=PA65&amp;lpg=PA65&amp;dq=%22Origin+and+Relatives+of+the+Basque+Language%22&amp;source=bl&amp;ots=MPuC8HyPhO&amp;sig=tKr2tRa1VgvA3wL-Sr-Mg6RsI3s&amp;hl=en&amp;ei=nAeuTsnyMsHs0gHMuNibBw&amp;sa=X&amp;oi=book_result&amp;ct=result&amp;resnum=6&amp;ved=0CEoQ6AEwBQ#v=onepage&amp;q=%22Origin%20and%20Relatives%20of%20the%20Basque%20Language%22&amp;f=false\">\"Origin and Relatives of the Basque Language\"</a> (1995), which I highly recommend for its applicability to this case.</p>\n\n<p>I also fail to see how a Proto-Semitic influence would have induced PIE to replace *[k] and *[t] with *[x] and *[θ] when <a href=\"http://en.wikipedia.org/wiki/Proto-Semitic_language#Inventory\">both languages had *[k] and *[t]</a>. Furthermore, PS doesn't even have an *[f] sound, so PIE could not have borrowed it. (You gave *[h], instead of *[x], as the reflex of PIE *[k] - this was a later development in English).</p>\n\n<p>Proto-Indo-European had only two tenses, present and past, on verbs in the imperfective aspect. Tense on other verbs was unmarked. The rich tense systems of its descendants are modern innovations.</p>\n\n<p>\"Ablaut\" refers to a morphological alternation already present in PIE - you're thinking of Germanic <em>umlaut</em>, a process which is uncontroversially understood as the product of fronting a stem vowel before a suffix containing [i] (the suffix is later dropped). A substrate influence is not needed to explain this.</p>\n\n<p>That being said, you're right that the loss of complexity in the case marking system and the large number of words unique to Proto-Germanic may indicate a pre-IE linguistic substrate. Unfortunately, barring a revolutionary discovery of a new trove of data, we will most likely never know.</p>\n", "Id":"919", "ParentId":"911", "LastEditorUserId":"76", "CreationDate":"2011-10-31T03:11:57.630", "OwnerUserId":"76", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-31T20:35:09.570", "LastEditedUser":{"UpVotes":"35", "WebsiteUrl":"http://github.com/alekstorm", "Id":"76", "AccountId":"411223", "CreationDate":"2011-09-13T23:34:32.303", "AboutMe":"", "Age":"24", "Location":"Urbana, IL", "DownVotes":"17", "Views":"36", "Reputation":"1043", "DisplayName":"Alek Storm", "LastAccessDate":"2013-12-09T07:20:27.393"}, "LastActivityDate":"2011-10-31T20:35:09.570", "Score":"11", "CommentCount":"3", "OwnerUser":{"UpVotes":"35", "WebsiteUrl":"http://github.com/alekstorm", "Id":"76", "AccountId":"411223", "CreationDate":"2011-09-13T23:34:32.303", "AboutMe":"", "Age":"24", "Location":"Urbana, IL", "DownVotes":"17", "Views":"36", "Reputation":"1043", "DisplayName":"Alek Storm", "LastAccessDate":"2013-12-09T07:20:27.393"}}