{"comments":[], "Body":"<p>I may have misunderstood what you're looking for.  But if I understand your question right, there <em>is</em> a term for what you're talking about: <em>iconicity</em>. In cognitive linguistics, expressions that are similar in form and meaning are said to be \"more iconic\" than expressions that don't show that sort of similarity.  </p>\n\n<p>So for instance, an onomatopoetic animal name like <em>cuckoo</em> is said to be \"more iconic\" than a non-onomatopoetic one like <em>eagle</em>.  If you say something is <em>lo-o-o-o-o-ong</em>, with a lengthened vowel, that's \"more iconic\" than saying <em>very long</em>.  If you say <em>he did it over and over and over</em>, repeating the word to indicate a repeated event, that's \"more iconic\" than saying <em>he did it many times</em>.  Saying <em>he went home and fell asleep</em>, with the events described in the same order in which they occurred, is \"more iconic\" than saying <em>he fell asleep after going home.</em>  </p>\n\n<p>Still, I agree with all the caveats that other folks have given you.  It is impossible to quantify exactly how iconic an expression is &mdash; there's no, like, \"iconicity quotient\" you can calculate.  And often it's not even clear which of two expressions should count as more iconic than the other. Is <em>cuckoo</em> more or less iconic than <em>whipporwill</em>?  Or for that matter, is <em>eagle</em> more or less iconic than <em>pigeon</em>?  There's really no way to answer.  </p>\n\n<p>So as a concept it's not always very useful, and it's certainly not very precise.  Still, the concept is <em>there</em> if you want to use it.  </p>\n", "Id":"933", "ParentId":"839", "CreationDate":"2011-11-03T03:38:16.600", "Score":"2", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2011-11-03T03:38:16.600", "OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}}