{"comments":[], "Body":"<p>As others have answered, this question is based on a weird definition of what a \"mother tongue\" is. It also seems to presuppose that thought is <em>always</em> articulated in a language, which is far from true (I have no reference for that, but I know for a fact that I generally think directly in concepts rather than words, and I know other people who do as well. I think it's been studied before, but I cannot find a reference to that study at the moment. As far as I remember, there is a sizeable minority of people who think mostly in concepts rather than words).</p>\n\n<p>One thing I think I can add is that even if you take Alenanno's definition of a mother tongue (which is indeed the most common one), there is actually <em>nothing</em> special about one's mother tongue, besides the fact that it was the one learned chronologically first. It's for instance perfectly possible to completely lose command of one's mother tongue later in life. There are lots of examples of people migrating with their families at the age of 6 to 10 (or even later) to another country, completely cutting the link with their original country. By the age of 40 to 50, it's not uncommon for those people to not be able to speak their mother tongue any longer, except maybe for one or two heavily accented words.</p>\n\n<p>My personal experience also agrees with this: I am a French person who moved to the Netherlands 10 years ago. I speak Dutch and English fluently, and much more often than I speak French. And although I still use French regularly (if not that often) and it is my mother tongue, it is <em>not</em> the language I speak best any more! I often struggle trying to find my words when speaking French, and I've been told I developed a Dutch accent when speaking the language (I can't hear it myself). Dutch nowadays comes to me much more naturally than French, and I feel I can express myself far more easily even in English than in French! So although it is my mother tongue, nowadays French is only my third language in terms of fluency.</p>\n\n<p>So to answer your last questions, yes, it is perfectly possible to think spontaneously in another language than your mother tongue (if you think in a language at all!). There is no special technique to reach that point. As kaleissin pointed out, it's purely a matter of fluency: the more you actively use a language (passive use like reading and listening is not enough), the more naturally you'll be able to think in it.</p>\n", "Id":"952", "ParentId":"949", "CreationDate":"2011-11-04T10:15:25.520", "Score":"5", "PostTypeId":"2", "OwnerUserId":"45", "LastActivityDate":"2011-11-04T10:15:25.520", "OwnerUser":{"UpVotes":"4", "WebsiteUrl":"http://christophoronomicon.blogspot.com/", "Id":"45", "AccountId":"402526", "CreationDate":"2011-09-13T21:05:16.063", "AboutMe":"", "Age":"38", "Location":"Netherlands", "DownVotes":"0", "Views":"12", "Reputation":"533", "DisplayName":"Tsela", "LastAccessDate":"2012-10-11T15:15:46.777"}}