{"comments":[], "Body":"<h3>The original alphabet</h3>\n\n<p>We do not appear to have any <em>ancient</em> authority on why alphabetical order is the way it is.</p>\n\n<p>Several modern scholars, such as Cyrus Gordon and Alessandro Bausani, have posited that the order is in various ways based on the calendar or the lunar zodiac.  (Giovanni Garbini gives a summary of Bausani's theory in his essay <a href=\"http://books.google.com/books?id=1EEtmT9Tbj4C&amp;lpg=PA119&amp;pg=PA118#v=onepage&amp;q&amp;f=false\" rel=\"nofollow\">The Question of the Alphabet</a>; this is quoted in many places online.)</p>\n\n<p>Writing systems scholar Peter T. Daniels, however, has stated that <a href=\"http://groups.google.com/group/sci.lang/msg/b00ad9eb811a52db\" rel=\"nofollow\">there is no evidence for such suggestions</a>, and has also <a href=\"http://groups.yahoo.com/group/ANE-2/message/10513\" rel=\"nofollow\">stated</a>:</p>\n\n<blockquote>\n  <p>Scholars have been trying for centuries to explain the order of the letters of the alphabet, and no plausible answer has ever been found.</p>\n</blockquote>\n\n<h3>Additional letters</h3>\n\n<p>As for additional letters, there is no hard and fast rule that I'm aware of, but I believe the most common practice has been simply to add them to the end of the alphabet.  </p>\n\n<p>The Greeks did this with most of their new letters; beyond tau (the last letter of the Phoenician alphabet) are added upsilon, phi, chi, psi, and omega.  When the Romans invented the letter G, they put it in the gap that had been created by dropping Z from its original place between F and H.  However when they borrowed Y and Z from Greek later, these new letters went to the end of the line.</p>\n\n<p>If the new letter is derived from an existing letter, it may sometimes be added to the alphabet immediately after it (thus J follows I, V and W follow U, Ñ follows N), but even in these cases this does not always happen; for example, the letters æ, ø, å, ä, and ö used in Scandinavian languages are added to the end of the alphabet.</p>\n", "Id":"958", "ParentId":"956", "CreationDate":"2011-11-05T08:06:45.930", "Score":"11", "PostTypeId":"2", "OwnerUserId":"472", "LastActivityDate":"2011-11-05T08:06:45.930", "OwnerUser":{"UpVotes":"2", "DownVotes":"1", "Id":"472", "AccountId":"1010298", "Views":"4", "Reputation":"300", "CreationDate":"2011-11-01T23:30:01.573", "DisplayName":"Muke Tever", "LastAccessDate":"2013-05-12T17:28:00.543", "AboutMe":"<p>I like to split hairs.</p>\n"}}