{"Body":"<p>It depends what you will count as evidence, and which position you want to argue against. Internal evidence would show that aspects of a phonological system cannot be described perspicaciously without recourse to segments, while external evidence would involve arguments based on the performance of speakers to the effect that their behavior could not be explained without positing segments in a mental representation. There are two possible positions to argue against, (a) that not all of phonology is organized into segments, or (b) that none of phonology is organized as segments. Obviously (b) will be easier to argue against.</p>\n\n<p>The strong segmentalist view propounded by Chomsky in the 1960's and still by Halle is that phonological representations are matrices, where each column represents a segment. Arguments about the autosegmental nature of tone and accent have made this position difficult to adhere to. The more reasonable segmentalist position today is that phonological representations are made of timing nodes which are linked to different universal features. The timing slots correspond to segments. The argument made by Lodge (in his 2009 book \"Fundamental concepts in phonology\") is that the features are not universal, and can therefore be assigned an arbitrary phonetic interpretation. He does not, however, argue that phonological representations lack any sort of timing tier. His model of phonology still requires timing nodes, but varies from generativist work in rejecting the universality of features. Silverman (in his 2006 book \"A Critical Introduction to Phonology\") brings up external evidence against features, citing a well-known 1979 Study by Morais et al (Cognition 7:(4) 323-331) showing that Portuguese illiterates were unable to perform a task requiring them to add or subtract a segment to/from the beginning of a word.\nAs far as I can tell, there is no opponent of segments who would argue that phonological words are always stored, perceived and produced as indivisible wholes, but this would be a good artificial endpoint to set in evaluating different proposals.</p>\n\n<p>As far as I know, there is no detailed criticism of Lodge's proposal, but I think that a good argument against it on internal grounds would be to show that phonetic interpretation of features must be highly constrained and, at some level, language-independent. </p>\n\n<p>Concerning external evidence, a type of evidence frequently reported in favor of\nsegmentalism is evidence from speech errors, Idsardi (2010), for example,<a href=\"http://ling.umd.edu/~idsardi/papers/2010di-phonology.pdf\">suggests</a> in his review\nof Silverman's book, refers to a study on speech errors by Wan &amp; Jaeger (1998). On\nthe other hand, speech errors are cited by Articulatory Phonologists as evidence in\nfavor of the gestural organization of speech. A 1992 <a href=\"http://linguistics.berkeley.edu/phonlab/users/ohala/papers/segment_primitive_or_derived.pdf\">paper</a> by John Ohala argues for segments on the\nbasis of a thought experiment.</p>\n\n<p>In sum, I think a preliminary to this task is to try to clarify the positions of the antisegmentalists (admittedly not an easy task) and determine exactly at what points\nthese vary from those of segmentalists. It tends to be the case that many arguments put forward on either side are against positions which are not held by anyone, and defenses\nagainst such arguments are defenses of positions which were never attacked.</p>\n", "Id":"965", "ParentId":"960", "LastEditorUserId":"483", "CreationDate":"2011-11-06T15:06:13.917", "OwnerUserId":"483", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-11-06T15:16:23.810", "LastEditedUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "LastActivityDate":"2011-11-06T15:16:23.810", "Score":"8", "CommentCount":"2", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}