{"OwnerUser":{"UpVotes":"56", "WebsiteUrl":"http://ling.umd.edu/~wellwood", "Location":"College Park, MD", "Id":"178", "DownVotes":"11", "AccountId":"922214", "Views":"88", "Reputation":"1112", "CreationDate":"2011-09-19T23:20:44.103", "DisplayName":"Alexis Wellwood", "LastAccessDate":"2013-08-12T15:15:17.400", "AboutMe":"<p>Other relevant links for me are the University of Maryland <a href=\"http://phling.umd.edu/\" rel=\"nofollow\">PHLING</a> and the <a href=\"http://languagescience.umd.edu/\" rel=\"nofollow\">Language Science community</a>.</p>\n"}, "comments":[], "Body":"<p>I think your question may reflect an instance of a much more general pattern. That is, suppose you find an expression X in a language, and another expression Y in that language, and you believe X and Y to stand in a \"privileged\" relation (two types elaborated below). It seems that, across languages, one is likely to find that X and Y occur as simplex (i.e., nondecomposable) lexical items asymmetrically: i.e., if Y occurs as a simplex lexical item in the language, so does X. But simplex X occurring in a language does not guarantee expression of simplex Y. </p>\n\n<p>One concrete example to explain one notion of a \"privileged\" relation between two expressions is privileged antonymy. Consider the adjectives <em>tall</em> and <em>short</em>: we \"feel\" that these expressions are related in a way that makes the inferences in (1) and (2) valid, but not that in (3) (despite <em>long</em> on occasion meaning something very similar to <em>tall</em>):</p>\n\n<ol>\n<li>Mary is taller than John |= John is shorter than Mary</li>\n<li>Mary is shorter than John |= John is taller than Mary</li>\n<li>Mary is longer than John !|= John is shorter than Mary   (where !|= reads as \"does not entail\")</li>\n</ol>\n\n<p>Given what was discussed in the first paragraph above, we thus expect a language to exist where there is no word for <em>short</em>, but that conveys such a meaning via negating the positive adjective, e.g. <em>not tall</em>. One never expects to find a language that does the reverse, e.g. where <em>short</em> occurs with <em>not short</em>, and expression of simplex <em>tall</em> fails to occur. </p>\n\n<p>Describing strong versus weak meanings, Larry Horn in his 1972 dissertation gives nice examples using the dual modals <em>must</em> and <em>may</em>, and adjectives like <em>(un)able</em> and <em>(im)possible</em>, to observe that in general, it seems the \"positive\" or \"stronger\" of a dual occurs as an expression <em>simpliciter</em>, while the \"negative\" or \"weaker\" is likely to occur as a combination of the positive/stronger expression with a negative marker. Note that such a synthetic construction carries exactly the (logical) meaning of what the negative/weaker expression as a simplex lexical item would carry. </p>\n\n<p>Horn has some speculations about why this asymmetric pattern may obtain, but it has not so far been explained in detail, and how far such phenomena extend throughout lexical semantics is (I think) unknown. Understanding that the patterns <em>even</em>/ <em>odd</em> and <em>even</em>/ <em>not even</em> exist cross-linguistically, as opposed to <em>odd</em>/ <em>not odd</em>, feels of the same flavor of the above spread of examples. It is unclear to me how one might cast the pair <em>even/odd</em> in terms of antonymy or strength, however.</p>\n", "Id":"973", "ParentId":"764", "CreationDate":"2011-11-07T03:55:42.970", "Score":"6", "PostTypeId":"2", "OwnerUserId":"178", "LastActivityDate":"2011-11-07T03:55:42.970", "CommentCount":"0"}