{"comments":[], "Body":"<p>I'm sure these concepts are mentioned in the books recommended by Alex B, but there are some other related constructions you might find interesting. For instance, many ergative/absolutive languages have a construction that's called the \"antipassive\", in which the ergative argument becomes absolutive, and the absolutive argument becomes an oblique (kind of lowering of the agent to a patient grammatical role, and a patient to oblique shift). Additionally, one could conceptualize passives as a subtype of the applicative-type construction, well documented in African languages, in which various morphemes shift around other case/thematic relations. Finally, I recommend google scholaring focus argument constructions, often seen in Polynesian languages (and they go crazy in the Formosan languages), in which there are various NP \"slots\" arguments go into, and verbal morphology tells which slot gets which thematic role (arguably a particular flavor of a head-marking Baker-style \"polysynthesis\" language)</p>\n", "Id":"979", "ParentId":"934", "CreationDate":"2011-11-08T01:59:33.423", "Score":"2", "PostTypeId":"2", "OwnerUserId":"438", "LastActivityDate":"2011-11-08T01:59:33.423", "OwnerUser":{"UpVotes":"5", "WebsiteUrl":"http://ohhai.mn", "Id":"438", "AccountId":"985599", "CreationDate":"2011-10-19T23:00:39.300", "AboutMe":"<p>I am a 2nd year PhD student at the University of Maryland, studying Linguistics. I work in (morpho)syntax, and dabble in semantics and psycholinguistics. My research interests are in the structure and interpretation of the noun phrase from a crosslinguistic perspective, the structure of Bengali and Indo-Aryan, the representation of argument and event structure, and constraints on variation in grammar and parsing.</p>\n\n<p>Outside of Linguistics I'm interested in religion and atheism, issues related to social justice (particularly for religious and ethnic minorities and people with disabilities), new(-ish) media (internet culture, comic books, video games, various electronics), and various aspects of nerd culture. I have a cat.</p>\n", "Age":"27", "Location":"Adelphi, MD", "DownVotes":"0", "Views":"11", "Reputation":"509", "DisplayName":"dustinalfonso", "LastAccessDate":"2013-06-10T14:38:09.880"}}