{"OwnerUser":{"UpVotes":"5", "WebsiteUrl":"http://ohhai.mn", "Id":"438", "AccountId":"985599", "CreationDate":"2011-10-19T23:00:39.300", "AboutMe":"<p>I am a 2nd year PhD student at the University of Maryland, studying Linguistics. I work in (morpho)syntax, and dabble in semantics and psycholinguistics. My research interests are in the structure and interpretation of the noun phrase from a crosslinguistic perspective, the structure of Bengali and Indo-Aryan, the representation of argument and event structure, and constraints on variation in grammar and parsing.</p>\n\n<p>Outside of Linguistics I'm interested in religion and atheism, issues related to social justice (particularly for religious and ethnic minorities and people with disabilities), new(-ish) media (internet culture, comic books, video games, various electronics), and various aspects of nerd culture. I have a cat.</p>\n", "Age":"27", "Location":"Adelphi, MD", "DownVotes":"0", "Views":"11", "Reputation":"509", "DisplayName":"dustinalfonso", "LastAccessDate":"2013-06-10T14:38:09.880"}, "comments":[], "Body":"<p>Periphrastic forms with \"have\" are fairly common -- one might think of \"have to\" in \"I have to win\" (and its Spanish equivalent, \"Tengo que ganar\"!) as auxiliaries, and all of the future tenses in Romance are formed from a verb followed by an inflected form of the word \"have\" in Latin.</p>\n\n<p>In any event, if I remember correctly, the way that the English present perfect was formed was via reanalysis of constructions like \"I have the cat fed\", in which \"have\" is the lexical verb, and \"fed\" is some kind of secondary predicate of the noun \"cat\". It's not too hard to see why it got used as a present perfect -- the \"have\" is expressing that the state is taking place now, and the past participle form \"fed\" expresses that the relevant event is completed. I imagine that Portuguese probably went through a different trajectory to get the meaning it has, or it followed a similar trajectory, and then semantically drifted to where it is now. Someone would need to check the facts, though.</p>\n", "Id":"996", "ParentId":"987", "CreationDate":"2011-11-09T11:50:10.437", "Score":"2", "PostTypeId":"2", "OwnerUserId":"438", "LastActivityDate":"2011-11-09T11:50:10.437", "CommentCount":"3"}