{"Body":"<p>Gold's theorem on the unlearnability of certain sets of languages (among them context-free ones) made several assumptions in its modeling of learning a language:</p>\n\n<ol>\n<li><p>At each time step the learner receives one sentence from our language, and for each sentence in our language there is some finite time by which the learner will have been exposed to the sentence. Apart from this, there are no restrictions on the ordering or frequency of occurrence of the sentences (in fact, the environment might pick sentences in an adversarial order to make learning hard).</p></li>\n<li><p>There are absolutely no restrictions on the learner's learning strategy (in fact, it need not even be computable)</p></li>\n<li><p>The languages in our sets of languages are named (equivalently: numbered). A learner has successfully learned a language L if for any environment consistent with (1) there is some finite time after which the learner always guesses that the environment's language is L. A set of languages is learnable if there exists a single learner that can learn every language in the set.</p></li>\n</ol>\n\n<p>Back in the late 60s and 70s this theorem made a bit of a stir in the <a href=\"http://en.wikipedia.org/wiki/Poverty_of_the_stimulus\">povery of the stimulus</a> debate. However, the modeling is pretty simple, how has this model of language learning been refined by linguists in the years since?</p>\n\n<hr>\n\n<h3>Notes</h3>\n\n<ul>\n<li><p>I am interested only in formal refinements of the above model. Thus, replacing rule (2) by \"the learner's learning strategy must be a Turing Machine that takes as input the finite segment of sentences seen so far and outputs the name of a language\" is fine, but a replacement like \"the learner is an average child\" is not of interest (unless the authors have a formal definition of average-child).</p></li>\n<li><p>Modifications that change the input (say to allow explicit negative instances) or impose a distribution on it are fine, but obviously rule (3) must be modified accordingly. I think this is how people show the learnability of <a href=\"http://en.wikipedia.org/wiki/Stochastic_context-free_grammar\">stochastic context-free grammars</a>.</p></li>\n<li><p>I am not interested in arguments that try to trivially undercut the whole approach, even if they have empirical validity. For instance, the whole approach can be derailed by asserting that human languages (and definitely individual humans) are not capable of creating sentences of arbitrary depth. Alternatively, a human learner has an upper bound on their life span and hence cannot wait an arbitrarily large (but finite) time to hear a sentence. These arguments are very important in the greater poverty of the stimulus debate, but make formal modeling a bit boring.</p></li>\n<li><p>I am vaguely familiar with some of the refinements of the above model used by theoretical computer scientists and would like to hear about models that are of interest to linguists, not just computer scientists.</p></li>\n</ul>\n", "Id":"1066", "FavoriteCount":"6", "Title":"General mathematical frameworks of language acquisition since Gold", "CreationDate":"2011-11-24T11:57:37.273", "AnswerCount":"3", "PostTypeId":"1", "OwnerUserId":"33", "Tags":"<language-acquisition><theoretical-linguistics><reference-request>", "comments":[], "ViewCount":"240", "LastActivityDate":"2012-05-31T02:29:31.687", "Score":"9", "OwnerUser":{"UpVotes":"125", "WebsiteUrl":"http://www.cs.mcgill.ca/~akazna/", "Id":"33", "AccountId":"459207", "CreationDate":"2011-09-13T20:58:42.087", "AboutMe":"<p>From the School of Computer Science and Department of Psychology at McGill University, I marvel at the world through algorithmic lenses. My specific interests are in quantum computing, evolutionary game theory, modern evolutionary synthesis, and theoretical cognitive science. Previously I was at the Institute for Quantum Computing and Department of Combinatorics &amp; Optimization at the University of Waterloo and a visitor to the Centre for Quantum Technologies at the National University of Singapore.</p>\n\n<ul>\n<li><a href=\"http://egtheory.wordpress.com/\" rel=\"nofollow\">Theory, Evolution, and Games Group Blog</a></li>\n<li><a href=\"http://cstheory.blogoverflow.com/author/artemkaznatcheev/\">Theoretical Computer Science Blogoveflow</a></li>\n<li><a href=\"https://plus.google.com/u/0/101780559173703781847/\" rel=\"nofollow\">G+ profile</a></li>\n</ul>\n", "Age":"25", "Location":"Montreal, Canada", "DownVotes":"18", "Views":"25", "Reputation":"876", "DisplayName":"Artem Kaznatcheev", "LastAccessDate":"2014-01-11T00:59:33.567"}}