{"Body":"<p>I'm living in an area of Tbilisi Georgia that is traditionally the ethnic Armenian area. I would like to take the opportunity to listen to people in the street to detect whether anybody is speaking Armenian.</p>\n\n<p>From an English speaker's perspective the phonology of Georgian and Armenian are very similar, they both have ejective consonants for instance. Other than some words borrowed from each other or from common sources though, the languages are totally unrelated.</p>\n\n<p>I have been developing a feeling for Georgian as I try to learn it but I'm not at all proficient yet. I also spent a few days in Armenia last year and learned a few words but not enough to have any feeling for the language.</p>\n\n<p><strong>So are there some sounds, morphemes, common words, or intonation clues that I can listen for to know when somebody is speaking Armenian rather than Georgian?</strong></p>\n\n<p>(For instance, I used to have the same problem with Japanese and Korean but now the easiest thing is to listen for lots of \"-yo\" endings for Korean and lots of \"-masu\" endings for Japanese.)</p>\n", "Id":"1171", "Title":"Which cues can I listen for to distinguish spoken Georgian and Armenian?", "CreationDate":"2011-12-17T10:47:20.150", "AnswerCount":"2", "PostTypeId":"1", "OwnerUserId":"51", "Tags":"<phonetics><morphology><comparative-linguistics><georgian><armenian>", "comments":[], "ViewCount":"192", "LastActivityDate":"2013-04-06T20:41:47.027", "Score":"4", "CommentCount":"3", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}