{"Body":"<p>Although a much higher proportion of Japanese people understand English than people from English-speakering countries understand Japanese, it isn't as high as the Scandinavian countries.</p>\n\n<p>I wouldn't find this so surprising if it weren't for the high incidence of English loanwords in the language, and English used as decorative text in advertising and the like.</p>\n\n<p>Is it mainly English's grammar that they have difficulty understanding? Or are other factors to blame, such as English's non-phonetic writing, and it having sounds that they think they can't pronounce?</p>\n", "Id":"1208", "LastEditorUserId":"483", "Title":"Is grammar the main barrier to Japanese people understanding English?", "CreationDate":"2011-12-28T06:22:47.487", "OwnerUserId":"421", "PostTypeId":"1", "Tags":"<cross-linguistic><english><japanese><sociolinguistics><multilingualism>", "AnswerCount":"2", "comments":[], "LastEditDate":"2011-12-31T04:49:59.550", "LastEditedUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "ViewCount":"267", "LastActivityDate":"2011-12-31T16:54:05.297", "Score":"2", "OwnerUser":{"UpVotes":"21", "WebsiteUrl":"http://andrewjgrimm.wordpress.com/", "Id":"421", "AccountId":"17355", "CreationDate":"2011-10-14T12:12:21.327", "AboutMe":"<p>I work at the University of New South Wales, where I use Ruby to analyze biological data.</p>\n\n<p>In part of my spare time, I work on fun programming projects. One was trying to analyze what underlies Wikipedia's <a href=\"http://en.wikipedia.org/wiki/Wikipedia:Get_to_Philosophy\" rel=\"nofollow\">Get to Philosophy</a> game. I also worked on one called the \"Small Eigen Collider\".</p>\n\n<p>I'm currently learning Japanese, and I'm an active participant in <a href=\"http://lang-8.com\" rel=\"nofollow\">lang-8.com</a>, a website where you write journal entries in a language you're learning, and get corrected by native speakers of that language. In return, you correct people writing entries in your native language. Recently, I've been asking a few questions prompted by slightly incorrect English I've encountered on lang-8.</p>\n", "Age":"35", "Location":"Sydney, Australia", "DownVotes":"0", "Views":"13", "Reputation":"320", "DisplayName":"Andrew Grimm", "LastAccessDate":"2013-09-30T12:58:51.183"}}