{"Body":"<p>In diachronic comparison of languages, say PIE to Latin to Romance, it is a classic recognition that the later languages strictly lose some of the morphologically marked categories. PIE had 8 noun cases (nominative, accusative, genitive, etc), Latin 5, Romance 2 or even 1. Pick a morphological category and pretty much always the complexity is reduced: past participles in English are more likely to become weak rather than strong, the subjunctive is disappearing, there's no grammatical gender at all.</p>\n\n<p>Presumably those forms (that were later lost) came from somewhere, those categories and phonological markers were created. I can imagine a cycle of inflected to isolating (a period of loss) and then back to inflectional where the grammatical markers get phonologically assimilated (fused onto the root), but i have no data to support this.</p>\n\n<p>I feel like I heard a long time ago that Finnish/Hungarian/Turkish might be gaining distinctions or that the word initial inflections in verbs in Irish came from phonological interaction between a pronoun and the following verb, but those are just vague intimations. I am looking for more substantively presented examples.</p>\n\n<p>Is there any definitive data of a language moving from isolating to inflected?  Present day examples are best, but attested versions (not theoretical) from the past would be good too.</p>\n", "Id":"127", "LastEditorUserId":"92", "FavoriteCount":"11", "Title":"Languages that are gaining morphological distinctions", "CreationDate":"2011-09-14T17:36:21.640", "OwnerUserId":"4", "PostTypeId":"1", "Tags":"<historical-linguistics><morphology><language-change>", "AnswerCount":"7", "comments":[], "LastEditDate":"2011-09-20T04:55:41.713", "LastEditedUser":{"UpVotes":"488", "WebsiteUrl":"http://claimid.com/louisr", "Id":"92", "AccountId":"163323", "CreationDate":"2011-09-14T02:07:23.613", "AboutMe":"<p>trying to learn and help others learn :)</p>\n", "Age":"34", "Location":"Your computer", "DownVotes":"39", "Views":"97", "Reputation":"3271", "DisplayName":"Louis Rhys", "LastAccessDate":"2014-01-18T16:45:57.423"}, "ViewCount":"719", "LastActivityDate":"2013-01-23T14:58:25.173", "Score":"29", "CommentCount":"10", "OwnerUser":{"UpVotes":"432", "WebsiteUrl":"", "Location":"United States", "Id":"4", "DownVotes":"2", "AccountId":"167219", "Views":"42", "Reputation":"1906", "CreationDate":"2011-09-13T20:24:01.087", "DisplayName":"Mitch", "LastAccessDate":"2014-01-15T11:56:51.610", "AboutMe":"<p>Native speaker of American English (AmE) with touches of Southern AmE.\nProficient in French and German. Elementary knowledge of Mandarin. Basic knowledge of linguistics.</p>\n"}}