{"Body":"<p>The Japanese language lacks personal pronouns in the IE sense. Japanese is very pro-drop, and often sentences will be constructed so personal pronouns do not appear, and the agents which the pronouns would have referred to are implicit from the context.</p>\n\n<p>In the first person, however, pronouns do occur with some frequency, but these are really \"special nouns\" such as 私 watashi (originally \"individual\") or 僕 boku (\"servant\").</p>\n\n<p>In the second person, pronouns are often avoided completely, since using them can be considered rude. When they <em>are</em> used, they are special nouns like in the first person case, e.g. 君 kimi (\"lord\") or お前 omae (\"before me\").</p>\n\n<p>Apart from the noun argument, there are other reasons why these seem different from personal pronouns in the IE sense:</p>\n\n<ol>\n<li>They have changed a lot over time, e.g. a samurai in the Edo period might have referred to himself as 拙者 sessha, but this is not used anymore.</li>\n<li>These \"pronouns\" can be modified by adjectives and relative clauses like other nouns, which is not the case for pronouns in the IE languages that I know of.</li>\n</ol>\n\n<p>The lack of real personal pronouns seems very curious to me. You would imagine that it is one of the first things that a language develops.</p>\n\n<p>Questions:</p>\n\n<ol>\n<li>What other languages, if any, have no pronouns (or all pronouns have some/all of the above peculiarities, or maybe other peculiarities)?</li>\n<li>Is it reasonable to believe that these languages lacked \"real\" pronouns from the very beginning, or is it reasonable to believe that they lost them due to some process (e.g. because there is a tendency to avoid them like in Japanese)?</li>\n</ol>\n\n<p><strong>Edit:</strong> I've edited the formulation slightly, since I already know about polite 2nd person pronouns covered by nouns/3rd persons/plurals. I also know about the tendency for non-nominative forms to take over the nominative forms.</p>\n", "Id":"1424", "LastEditorUserId":"724", "AcceptedAnswerId":"1425", "Title":"What languages lack personal pronouns, and why?", "CreationDate":"2012-02-14T14:39:01.423", "OwnerUserId":"724", "PostTypeId":"1", "Tags":"<japanese><pronoun><word-classes>", "AnswerCount":"3", "comments":[], "LastEditDate":"2012-02-15T05:03:51.163", "LastEditedUser":{"UpVotes":"33", "DownVotes":"8", "Id":"724", "AccountId":"482018", "Views":"10", "Reputation":"709", "CreationDate":"2012-01-29T05:39:01.393", "DisplayName":"dainichi", "LastAccessDate":"2014-01-16T02:01:24.110"}, "ViewCount":"1157", "LastActivityDate":"2012-02-15T06:40:13.070", "Score":"15", "CommentCount":"8", "OwnerUser":{"UpVotes":"33", "DownVotes":"8", "Id":"724", "AccountId":"482018", "Views":"10", "Reputation":"709", "CreationDate":"2012-01-29T05:39:01.393", "DisplayName":"dainichi", "LastAccessDate":"2014-01-16T02:01:24.110"}}