{"Body":"<p>In some cultures, females and males speak different language varieties[1]. </p>\n\n<ol>\n<li>When retelling, for example, what a man said, would a female say it in the male variety or translate it into the female variety? </li>\n<li>Would a male do the same when retelling what a female said? </li>\n<li>Would behavior change depending on who is listening?</li>\n<li>Can the genders speak each other's varieties at all?</li>\n</ol>\n\n<p>[1] I'm not sure if 'language' is the right word for this. I'm having an extremely hard time searching stackexchange or google for information about this topic, presumably because my word choice is too generic.</p>\n\n<p>I don't actually have great examples, just an inkling for various things I've read in the past. My assumption is that women speak language A and men speak language B, but perhaps the distinction in practice is much less severe than I imagined. I just found the Lakota example: <a href=\"http://en.wikipedia.org/wiki/Lakota_language#Enclitics\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Lakota_language#Enclitics</a></p>\n\n<p>Probably not the best example to try and hear differences: <a href=\"http://www.youtube.com/watch?v=3fdaG7ULqAo\" rel=\"nofollow\">http://www.youtube.com/watch?v=3fdaG7ULqAo</a></p>\n\n<p>The example that got me thinking about this was a language in which the women could essentially hum and still be understood. (It made the news recently because it seemed to refute Chomsky or something.)</p>\n\n<p>I suppose it makes sense for men to learn the women language from their mothers? At what point do boys start to use male words and grammar, or are they constantly corrected to speak that way? (if that is indeed real and not a faulty assumption on my part).</p>\n", "Id":"1730", "LastEditorUserId":"51", "FavoriteCount":"2", "Title":"In cultures where genders speak different language varieties, how do genders quote each other?", "CreationDate":"2012-03-31T16:24:44.453", "OwnerUserId":"884", "PostTypeId":"1", "Tags":"<sociolinguistics>", "AnswerCount":"2", "comments":[], "LastEditDate":"2013-09-26T09:44:45.000", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"314", "LastActivityDate":"2013-10-01T18:59:57.283", "Score":"6", "CommentCount":"10", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"884", "AccountId":"1018924", "Views":"0", "Reputation":"31", "CreationDate":"2012-03-31T16:23:36.077", "DisplayName":"diN0bot", "LastAccessDate":"2012-04-05T08:54:15.103"}}