{"Body":"<p>Some languages, including Mandarin and Cantonese, have a dedicated belief verb that one uses for describing <em>false</em> beliefs.  For instance, in Mandarin, <em>yiwei</em> is used to describe beliefs that the speaker wants to emphasize are false; <em>xiang</em> is a neutral belief verb, like English 'think' and 'believe,' and can be used to describe <em>any</em> belief, regardless of whether the speaker considers it true or false.  (You might translate <em>yiwei</em> into English as \"be under the mistaken impression that.\")</p>\n\n<p>There's been a lot of research on these verbs in developmental psychology.  (The question is, roughly, \"If a child grows up speaking a language that has a special false-belief verb, do they acquire the concept of false belief or the ability to think about false beliefs any faster?\" <a href=\"http://pavlov.psyc.vuw.ac.nz/courses/Psyc%20415/415%20PAPERS%20FOR%202011/liu%20et%20al%202008%20a%20meta-analysis%20in%20china.pdf\">This meta-analysis refers to a number of studies on this question in Chinese languages</a>, if anyone's interested.)  But I haven't seen any linguistic work on the subject.  </p>\n\n<p>Can anyone point me towards any linguistic work on false-belief verbs, in any language?</p>\n", "Id":"1732", "LastEditorUserId":"51", "Title":"False-belief verbs", "CreationDate":"2012-03-31T22:15:40.573", "OwnerUserId":"306", "PostTypeId":"1", "Tags":"<semantics><reference-request><sapir-whorf-hypothesis>", "AnswerCount":"2", "comments":[], "LastEditDate":"2012-07-02T11:12:38.803", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"408", "LastActivityDate":"2012-08-14T04:56:07.170", "Score":"18", "CommentCount":"8", "OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}}