{"Body":"<p>I am not a linguist in any way shape or form, but I am studying Japanese, and came across this linguistic issue that fascinates me.</p>\n\n<p>Over on the <a href=\"http://japanese.stackexchange.com/\">Japanese Language and Usage site</a>, there is a discussion about a word \"<a href=\"http://japanese.stackexchange.com/questions/5183/is-flyjin-a-japanese-word-and-if-so-does-it-have-an-antonym\">flyjin</a>\".</p>\n\n<p>The word was create by taking a Japanese word, \"gaijin\", which means \"foreigner\", and swapping the \"gai\" part with the word \"fly\". It means \"a foreigner who left Japan after the earthquake\". It is a somewhat controversial word within the English speaking foreign community in Japan, but here I'm just focused on the linguistic aspects of the word.</p>\n\n<p>The consensus is that is <em>not</em> a Japanese word, since Japanese people don't use it. The issues that gave rise to the word are virtually unknown outside the English speaking subculture within the larger Japanese culture.</p>\n\n<p>But it's a word that only exists <em>because of</em> the Japanese language. Further, it's a word to describe a situation that only exists in Japan, and it defines an aspect of Japanese culture as seen from within a subculture.</p>\n\n<p>Also, while it might at first seem that it's the combination of two languages, since \"gaijin\" is Japanese, and \"fly\" is English, I believe it's not quite that simple. \"Fly\" is a word most Japanese people understand, as it, like a lot of English words, have been integrated to the point of reasonably common usage. I wouldn't go so far as to say it's a fully Japanese word now, but it's not that alien either (another linguistic concept I can't fully grasp).</p>\n\n<p>Is there a term for this kind of occurrence, where a word is created from a language and because of that language, but not used within that language?</p>\n\n<p>Are there other examples?</p>\n\n<p>Is it accurate to say that the word is not Japanese just because of the issue of usage among most Japanese speakers? Might it not be reasonable to say it is a Japanese word because it is made from that language? <em>(I'm not making a case to say it should be one way or the other, I'm just exploring the issue.)</em></p>\n", "Id":"1770", "LastEditorUserId":"51", "AcceptedAnswerId":"1773", "Title":"What is it called when a word is constructed out of a language, but is not a part of that language?", "CreationDate":"2012-04-09T03:23:39.980", "OwnerUserId":"913", "PostTypeId":"1", "Tags":"<terminology><word-classes>", "AnswerCount":"2", "comments":[], "LastEditDate":"2012-04-11T12:39:13.830", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"157", "LastActivityDate":"2012-04-11T12:39:13.830", "Score":"4", "CommentCount":"7", "OwnerUser":{"UpVotes":"4", "WebsiteUrl":"", "DownVotes":"0", "Id":"913", "AccountId":"61851", "Views":"0", "Reputation":"154", "CreationDate":"2012-04-09T03:09:06.597", "DisplayName":"Dave M G", "LastAccessDate":"2013-03-12T12:22:23.810", "AboutMe":"<p>Just stopping by to ask a question or two.</p>\n"}}