{"Body":"<p>In English there are just two series of stops, voiced (b, d, g) and unvoiced (p, t, k). The latter are generally aspirated (though it depends on phonological context).</p>\n\n<p>In many common languages of Europe and Asia the unvoiced consonants are not aspirated, this is a common difficulty for English speakers learning them.</p>\n\n<p>And in some other languages that English speakers do not learn as frequently there are contrasting aspirated and unaspirated unvoiced stops.</p>\n\n<p>Now I've been learning Georgian for a few months and it has three series of contrasting stop consonants (and possible affricates I suppose):</p>\n\n<ul>\n<li><strong>voiced</strong>: b, d, g, j, dz</li>\n<li><strong>unvoiced aspirated</strong>: pʰ, tʰ, kʰ, chʰ, tsʰ</li>\n<li><strong>ejective</strong>: pʼ, tʼ, kʼ, chʼ, tsʼ, qʼ</li>\n</ul>\n\n<p>Ejectives are even harder for English speakers to master than unaspirated voiceless stops. And in fact some teaching aids I've seen don't even mention the ejective quality of these stops and instead focus on the unaspirated quality, presumably because this is easier and is sufficient to distinguish the sounds for both the learners and the Georgian native speakers they will interact with.</p>\n\n<p>So this has got me thinking, <strong>are there languages which contrast all three kinds of unvoiced stops: aspirated pulmonic, unaspirated pulmonic, and unaspirated ejective?</strong></p>\n", "Id":"1831", "LastEditorUserId":"363", "Title":"Are there languages with contrasting unvoiced aspirated, unaspirated, and ejective stops?", "CreationDate":"2012-04-20T08:11:12.067", "OwnerUserId":"51", "PostTypeId":"1", "Tags":"<ejectives><stops><plosives>", "AnswerCount":"3", "comments":[], "LastEditDate":"2012-04-23T07:48:48.530", "LastEditedUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}, "ViewCount":"443", "LastActivityDate":"2012-05-08T03:55:10.747", "Score":"6", "CommentCount":"7", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}