{"Body":"<p>Tracing back in time through the language hierarchy, I imagine that geographical areas where ancestors of existing \"alive\" languages were spoken will narrow in, leaving lots of gaps (Since for instance, PIE wasn't spoken in the whole area where people speak Indo-European now).</p>\n\n<p>This makes me wonder how one can speculate about what was in those gaps.</p>\n\n<p>Let's for instance take Proto-Germanic. When some people spoke it, what did people speak outside that area, but within the area where people speak Germanic languages now?</p>\n\n<p>For, say, North America, I imagine people spoke native American languages that might or might not be ancestors of existing native American languages.</p>\n\n<p>For Northwestern Europe, I'm not so sure. I can think of some possibilities:</p>\n\n<ol>\n<li>Language isolates.</li>\n<li>Ancestors or relatives of existing non-IE languages, e.g. Basque.</li>\n<li>Descendants of other IE-proto-languages, Proto-Romance, Proto-Slavic etc. (If these branched before Proto-Germanic)</li>\n<li>Descendants of PIE which <em>aren't</em> descendants of other IE-proto-languages.</li>\n</ol>\n\n<p>I guess the only thing that people <em>can't</em> have spoken, per definition, is a Germanic language.</p>\n\n<p>What kind of speculation can be made about this question, especially in cases where no writing is left?</p>\n\n<p>Sorry for a wishy-washy question. Rather than specific languages, I'm looking to get a better understanding of the whole macro-dynamics of language evolution.</p>\n", "Id":"1983", "AcceptedAnswerId":"1987", "Title":"When some people spoke proto-XX, what did other people speak?", "CreationDate":"2012-05-25T06:23:14.847", "AnswerCount":"2", "Tags":"<evolution><evolutionary-linguistics>", "PostTypeId":"1", "OwnerUserId":"724", "comments":[], "ViewCount":"120", "LastActivityDate":"2012-05-25T19:04:49.253", "Score":"4", "CommentCount":"1", "OwnerUser":{"UpVotes":"33", "DownVotes":"8", "Id":"724", "AccountId":"482018", "Views":"10", "Reputation":"709", "CreationDate":"2012-01-29T05:39:01.393", "DisplayName":"dainichi", "LastAccessDate":"2014-01-16T02:01:24.110"}}