{"Body":"<p>As I understand, there is no essential difference between spoken and signed languages. Both have the same kinds of phonetic, morphological, syntactical and semantic complexities, both are prone to ambiguities, both change over time etc. The main difference is one of medium. </p>\n\n<p>Spoken languages have, of course, some advantages over their signed counterparts, as the possibility to communicate without visual contact. But signed languages have, in turn, other advantages over the spoken, like higher \"bandwidth\", i.e., information is conveyed by multiple channels at the same time (hand shape, hand position, eye gaze and head nodding).</p>\n\n<p>In spite of that, spoken languages are much more common than signed languages. And most of the latter have developed at \"artificial\" environments, like schools for deaf children. Why don't we see, for example, isolated tribes (with hearing and speaking people) that haven't developed any kind of spoken language, but have a rich tradition of signed languages, instead?</p>\n", "Id":"2104", "FavoriteCount":"3", "Title":"Why are spoken languages more common than signed languages?", "CreationDate":"2012-06-14T12:27:46.273", "AnswerCount":"2", "PostTypeId":"1", "OwnerUserId":"22", "Tags":"<sign-languages><evolutionary-linguistics>", "comments":[], "ViewCount":"142", "LastActivityDate":"2012-06-23T11:11:56.387", "Score":"5", "CommentCount":"5", "OwnerUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}}