{"Body":"<p>Consider sentences like this one.   \"Reluctant to place the dog and the children in the same houses as caretakers affected by the slobbering sickness, the authorities decreed that said children would be placed in the care of the Church of the Fiery Severed Fist of Our Beloved Deity while said dog would be placed in a large forest where the elimination of their waste would no longer constitute a public nuisance.\"</p>\n\n<p>At first blush, \"said\" seems to function as a determiner in the last sentence.  \"the said children*\" or \"a said dog*\" are both ungrammatical, although \"the aforementioned children\" is perfectly okay.  This particular sense of \"said\" does not appear to belong to an open class.  Participles that premodify nouns can be, and often must be, preceded by determiners, as in the phrases \"the dwindling candles\" or \"a rotating planet.\"  However, we don't see \"the said candles*\" or \"the said rotating planet*.\"   We do see \"said dwindling candles\" or \"said rotating planet.\"   So \"said,\" in this context, looks like a determiner.  </p>\n\n<p>But I'm well aware that I could be missing something here, and so pose this question to the group.   Is \"said\" really a determiner in the contexts that I've just mentioned?</p>\n", "Id":"2147", "Title":"Can the word \"said\" be a determiner in written English?", "CreationDate":"2012-06-20T03:45:59.220", "AnswerCount":"2", "PostTypeId":"1", "OwnerUserId":"790", "Tags":"<syntax>", "comments":[], "ViewCount":"249", "LastActivityDate":"2012-06-23T01:44:41.980", "Score":"7", "CommentCount":"12", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}