{"Body":"<p>Many of us know that the term \"ontology\" applies to the a priori philosophical study of the nature of existence.   Ontology is a branch of metaphysics (the attempt to coherently characterize reality a priori in the most general terms possible).  So, for example, a lot of rationalists have only one set of things in their ontological inventory (inventory of the kinds of things that exist), namely those states of affairs which can be modeled with the scientific method.  Traditionally, such thinkers are known as metaphysical materialists.</p>\n\n<p>Apparently,\"ontology\" seems to have a different meaning in computer science, namely a shared specification of the types of concepts that can be represented, e.g. what kinds of classes, states of affairs, relationships, and I-don't-know-what-else.   (See <a href=\"http://www-ksl.stanford.edu/kst/what-is-an-ontology.html\" rel=\"nofollow\">http://www-ksl.stanford.edu/kst/what-is-an-ontology.html</a>.)</p>\n\n<p>What I'd like to know is, do some linguists attempt to specify ontologies (more or less as computer scientists use that term) for natural languages, either specific natural languages or natural languages in general?       </p>\n", "Id":"2193", "LastEditorUserId":"51", "FavoriteCount":"2", "AcceptedAnswerId":"2197", "Title":"What does the term \"ontology\" mean vis a vis the study of natural language?", "CreationDate":"2012-07-01T04:31:29.253", "OwnerUserId":"790", "PostTypeId":"1", "Tags":"<terminology><semantics><philosophy-of-language>", "AnswerCount":"1", "comments":[], "LastEditDate":"2012-07-02T10:00:48.020", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"257", "LastActivityDate":"2012-07-02T10:00:48.020", "Score":"5", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}