{"Body":"<p>I am somewhat familiar with (not at all learned of)the morphosyntactic criteria by which many languages are classified--such as the system by which the grammatical abstractions of agent, argument, and patient are  treated-- and descried of the criteria potency unto a numerosity of classes yborn of this method of linguistic taxonomy. Being a trinary collection, the abstractions before listed may be partitioned such that unto every set (of a given partition) is assigned a speciality of morphosyntactic treatment; the set of all partitions logically distinguishable would bear  a cardinality of five and include sorts of languages neither ergative-abslutive nor nominative-accusative. </p>\n\n<p>Namely I query pose as to the existence of a language per which the patient of transitive verbs is treated as is the agent of transitive verbs. Specifically I muse at yet on such a language which as well treats the single argument of intransitive verbs differently than the other two said abstractions.</p>\n\n<p>I know of languages which may not so neatly fall into any of the classes for which the described partitions account (such as split ergative and active-stative languages) and if response to my inquiry requires disqualification of some premise I've supposed of linguistic taxonomy, I grant the nicety of direct answer may be hence precluded as the same may only transpire upon congruence between him positing and the interlocutor as to the presumed veridical obtentions as for the topic of their discourse.</p>\n\n<p>I greatly appreciate any and all consideration given to this question.</p>\n", "Id":"2203", "LastEditorUserId":"1157", "Title":"Exists there a language in which the patient of transitive verbs and the single argument of intransitive verbs are treated alike?", "CreationDate":"2012-07-03T18:52:38.750", "OwnerUserId":"1157", "PostTypeId":"1", "Tags":"<morphosyntax>", "comments":[], "LastEditDate":"2012-07-04T00:05:58.213", "LastEditedUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1157", "AccountId":"1623671", "Views":"0", "Reputation":"4", "CreationDate":"2012-07-03T18:52:38.750", "DisplayName":"Jarrod", "LastAccessDate":"2012-07-05T22:25:38.090"}, "ViewCount":"98", "LastActivityDate":"2012-07-04T00:05:58.213", "Score":"0", "CommentCount":"11", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1157", "AccountId":"1623671", "Views":"0", "Reputation":"4", "CreationDate":"2012-07-03T18:52:38.750", "DisplayName":"Jarrod", "LastAccessDate":"2012-07-05T22:25:38.090"}}