{"OwnerDisplayName":"BillyNair", "Body":"<p>I was born and raised in Hawaii and grew up speaking <a href=\"http://en.wikipedia.org/wiki/Hawaiian_Creole_English\" rel=\"nofollow\">Pidgin</a>. My parents are from Washington and California so at home I spoke [what I thought was] Standard English. I moved to the mainland when I was 18, in 1996, and have come to speak English with almost no detection of my Pidgin roots (except when I say words like \"Hawai`i\", \"Samoan\", \"ukulele\"). I can speak it with very little effort, but there is still some effort, I catch myself analyzing my words milliseconds before I say them. It feels like a second language that I have learned to speak natively. I have been out of practice with my Pidgin so I can't just jump in and sound local at any moment, but if I talk to my siblings on the phone or go back to Hawaii to visit, it only takes a few minutes before I slide back into partial Pidgin and a couple days before I am back to my old self.</p>\n\n<p>When I am speaking Pidgin, I feel like it just comes out of me without any effort, like that is the way I think in my head. When my brothers and our families are together we can <a href=\"http://en.wikipedia.org/wiki/Code-switching\" rel=\"nofollow\">\"Code Switch\"</a> effortlessly between ourselves and the rest of our family without any problems, but will always go back to Pidgin with our siblings. </p>\n\n<p>Something I have wondered for a while is why Pidgin is so much easier to speak for us. I have decided it is one of 2 options: Either it is because we grew up speaking it (but we also spoke English), or because pidgins and creoles are just designed to be closer to how we think just by the nature of their origins. But, then again, English was a pidgin that became a creole and standardized into a language so you would think that because it followed the same process, it too would be just as easy to speak. <strong>And, yes, Hawaiian Pidgin has a wrong way to speak it!</strong> You can't just throw out the rules and say words in a random order throwing in a few Polynesian words for flavor. Kids come from the mainland all the time and fail miserably attempting to speak Pidgin.</p>\n\n<p>Are there any linguists here that would have a \"real\" explanation why it is easier to speak Pidgin even though I have been speaking English on the mainland now longer than I lived in Hawaii?</p>\n", "Id":"2238", "AcceptedAnswerId":"2240", "Title":"Why does Pidgin come easier than Standard English?", "CreationDate":"2012-07-11T00:56:51.813", "OwnerUserId":"1184", "Tags":"<american-english>", "PostTypeId":"1", "AnswerCount":"3", "comments":[], "ViewCount":"260", "LastActivityDate":"2012-07-14T04:26:48.033", "Score":"8", "CommentCount":"6", "OwnerUser":{"UpVotes":"4", "WebsiteUrl":"http://billynair.com", "Location":"Utah", "Id":"1184", "DownVotes":"2", "AccountId":"1281575", "Views":"0", "Reputation":"161", "CreationDate":"2012-07-12T22:47:28.323", "DisplayName":"BillyNair", "LastAccessDate":"2013-04-16T07:02:34.727", "AboutMe":"<p>web programming student, former code monkey of a HUGE international legal company that got too big for its own good...</p>\n"}}