{"Body":"<p>I am currently studying Amdo Tibetan. In this language the voiced velar fricative [ɣ] is reported to occur as the first sound in some syllable-initial consonant clusters. More specifically, this sound occurs only before voiced consonants. (Before voiceless consonants this phoneme surface as voiceless [χ] or [h].)</p>\n\n<p>Here are some examples of phonetic transcriptions of words starting with this sound (taken from various academic papers):</p>\n\n<ul>\n<li>[<sup>ɣ</sup>za <sup>ɦ</sup>da wa]</li>\n<li>[ɣ<sup>ə</sup>zɨm]</li>\n<li>[ɣgon pa]</li>\n<li>[ɣlab raŋ]</li>\n<li>[ɣgar]</li>\n<li>[ɣdʑak]</li>\n</ul>\n\n<p>There are many papers written on the phonology/phonetics of Amdo Tibetan and all of them use the IPA symbol [ɣ] for this sound. This so-called \"pre-initial\" sound is quite common in Amdo Tibetan and I hear it quite often when listening to the recording that accompanies my Colloquial Amdo Tibetan textbook, for example.</p>\n\n<p><strong>The problem is that no matter how hard I listen, I can't seem to hear that this is a velar fricative. In fact, I don't hear it as a fricative consonant at all. Instead, it just sounds like a very short [ə], or at least some other kind of central vowel. Thus, instead of [ɣlab raŋ] I hear something like [əlab raŋ].</strong> </p>\n\n<p>My native language is English and a voiced velar fricative is not a sound I can produce naturally, but I have read a description of it in \"A Course in Phonetics\" and I've listen to a recording of this sound on Wikipedia (see here: <a href=\"http://en.wikipedia.org/wiki/File:Voiced_velar_fricative.ogg\">http://en.wikipedia.org/wiki/File:Voiced_velar_fricative.ogg</a>). Yet to me this sound does not sound at all like the sound that Amdo Tibetan linguists are transcribing as [ɣ].</p>\n\n<p>My question is: Is this [ɣ] sound actually being pronounced more like a [ə] (or some similar vowel sound-- in which case the transcriptions are \"inaccurate\"), or do I just hear it as [ə] because I am unaccustomed to hearing a syllable-initial [ɣ]? Or perhaps this velar fricative is being pronounced so lightly that it's fricative nature is not easily heard? <strong>Can I use software such as Pratt or WaveSurfer to figure out which sound is actually being produced?</strong></p>\n\n<p><em>P.S. I can upload a sound file if that would help.</em></p>\n", "Id":"2269", "Title":"How can I differentiate between syllable-initial [ɣ] and [ə] using Praat or other software?", "CreationDate":"2012-07-18T22:01:30.807", "AnswerCount":"1", "PostTypeId":"1", "OwnerUserId":"1192", "Tags":"<phonetics><transcription><software><phonetic-symbols>", "comments":[], "ViewCount":"265", "LastActivityDate":"2012-07-19T14:02:40.573", "Score":"8", "CommentCount":"1", "OwnerUser":{"UpVotes":"7", "WebsiteUrl":"", "DownVotes":"0", "Id":"1192", "AccountId":"316670", "Views":"0", "Reputation":"161", "CreationDate":"2012-07-15T22:06:58.437", "DisplayName":"Joshua", "LastAccessDate":"2012-11-29T15:44:07.713", "AboutMe":"<p>medical student interested in Sino-Tibetan and Scandinavian languages</p>\n"}}