{"OwnerDisplayName":"zergylord", "Body":"<p>I've been closely following the work stemming from St. John and McClelland's <a href=\"http://www.dtic.mil/cgi-bin/GetTRDoc?AD=ADA218908&amp;Location=U2&amp;doc=GetTRDoc.pdf\" rel=\"nofollow\">Sentence Gestalt Model</a>, which uses a connectist model to extract semantic information about events from sentences without first specifying the syntactic structure.</p>\n\n<p>I've looked at the limitations of the model (see <a href=\"http://www.cs.colorado.edu/~homaei/research/files/TDLC07-content.pdf\" rel=\"nofollow\">here</a> for a high level overview), but nothing about them looks to be insoluble without the inclusion of syntax. This intuition has been supported by the followups done by <a href=\"http://www.stanford.edu/class/psych209a/ReadingsByDate/02_11/Rohde02Thesis.pdf\" rel=\"nofollow\">Rohde</a> at Stanford and <a href=\"http://nn.cs.utexas.edu/downloads/papers/bryant.utcstr98.pdf\" rel=\"nofollow\">Byrant and Miikkulaine</a> at UT Austin.</p>\n\n<p>So then, what's the point of syntax within the context of understanding events? Is it only epiphenomenal here or have I misunderstood the gravity of the objections to syntax free models of semantics? Does there currently exist a model of event semantics that includes syntax and produces results not reproducible by the models cited here?</p>\n", "Id":"2323", "Title":"What is the role of syntax in understanding event descriptive sentences?", "CreationDate":"2012-02-07T22:01:56.227", "OwnerUserId":"55", "PostTypeId":"1", "Tags":"<syntax><semantics>", "comments":[], "ViewCount":"95", "LastActivityDate":"2012-07-31T12:24:04.083", "Score":"6", "CommentCount":"0", "OwnerUser":{"UpVotes":"2", "Location":"Redwood City, CA", "DownVotes":"0", "Id":"55", "AccountId":"435292", "Views":"1", "Reputation":"158", "CreationDate":"2011-09-13T21:24:03.030", "DisplayName":"zergylord", "LastAccessDate":"2012-08-05T00:21:16.547", "AboutMe":"<p>1st first PhD student in Psychology at Stanford under Professor Jay McClelland. All neural network modeling, all of the time.</p>\n", "Age":"25"}}