{"OwnerDisplayName":"Zairja", "Body":"<p>After wondering about this today at work, I turned to the Internet.</p>\n\n<p><a href=\"http://homepage.ntlworld.com/vivian.c/Writings/Shorts/UniqueEnglishr.htm\">A short piece</a> that focuses on pronunciation points toward \"none\". I've scoured ELU and Google (perhaps not as thoroughly or effectively as some others might), but cannot find an answer specific to this question.</p>\n\n<p>I realize this may be considered a broad question, though, so let me clarify what I mean by \"unique\". I am not referring to words that only occur in English or one-off exceptions to grammatical rules, i.e. trivial language-specific features (that are innumerable and don't belong here anyway). I'd like to see something more along the lines of what is presented in <a href=\"http://www.lituanus.org/1984_3/84_3_05.htm\">this paper on unique features of Lithuanian</a>.</p>\n\n<p>The author gives nine unique traits to Lithuanian (I list some with my comments in parentheses):</p>\n\n<ol>\n<li>frequentative past tense</li>\n<li>13 participles in active use (<em>more than other languages?</em>)</li>\n<li>four functional locative cases (<em>more than others?</em>)</li>\n<li>no irregular, or suppletive forms in the comparative and superlative forms in adjective and adverbial systems</li>\n<li>uniform stressed syllable intonation</li>\n<li>preserved several words or forms exactly as they are reconstructed for the distant proto-language (PIE)</li>\n<li>all the basic possessive adjectives and possessive pronouns are expressed by genitive form</li>\n</ol>\n\n<p>I'm not sure if #2 and #3 are <em>unique</em> in the sense that English could also claim <em>X</em> participles where only the number is significant, not the existence of certain participles unique to the language.</p>\n\n<p>I am not looking for a thesis, but perhaps a short list along the same lines as the paper above. In short, <strong>what does English do that no other language does</strong>?</p>\n\n<p><strong>Edit 1:</strong> For anyone voting to close, perhaps you can help me rephrase my question or so that it's in line with the kind of succinct answer I'm hoping for (e.g. some \"unique features of Lithuanian\"). Comments/critiques are welcome.</p>\n\n<p><strong>Edit 2:</strong> John Lawler mentioned WALS, and it is the kind of features cataloged that I'm after. For instance, <a href=\"http://wals.info/feature/90G\">double-headed relative clauses</a> or <a href=\"http://wals.info/chapter/143#143D\">optional triple negation</a> are only found in a few languages. Again, it may be the case that English is too \"mixed\" with cross-linguistic features for it to have any unique quality.</p>\n", "Id":"2427", "LastEditorUserId":"1242", "FavoriteCount":"5", "AcceptedAnswerId":"2459", "Title":"What characteristics are unique to English (or at least rare among language as a whole)?", "CreationDate":"2012-08-15T18:30:24.147", "OwnerUserId":"1242", "PostTypeId":"1", "Tags":"<grammar><pronunciation><syntax>", "AnswerCount":"7", "comments":[], "LastEditDate":"2012-08-16T20:26:39.410", "LastEditedUser":{"UpVotes":"8", "WebsiteUrl":"http://n/a", "Id":"1242", "AccountId":"1438398", "CreationDate":"2012-08-08T18:41:37.320", "AboutMe":"<p>Here I am! The younger I get, the less I know.</p>\n", "Age":"83", "Location":"Computadora", "DownVotes":"4", "Views":"0", "Reputation":"381", "DisplayName":"Zairja", "LastAccessDate":"2014-01-10T14:19:44.970"}, "ViewCount":"2193", "LastActivityDate":"2013-06-11T19:45:18.133", "Score":"33", "CommentCount":"23", "OwnerUser":{"UpVotes":"8", "WebsiteUrl":"http://n/a", "Id":"1242", "AccountId":"1438398", "CreationDate":"2012-08-08T18:41:37.320", "AboutMe":"<p>Here I am! The younger I get, the less I know.</p>\n", "Age":"83", "Location":"Computadora", "DownVotes":"4", "Views":"0", "Reputation":"381", "DisplayName":"Zairja", "LastAccessDate":"2014-01-10T14:19:44.970"}}