{"OwnerDisplayName":"Zairja", "Body":"<p>Oftentimes while watching a subtitled foreign film, I find that reading the subtitles aloud (usually in my head) at the same<sup>1</sup> pace as the speaker takes less time than what's spoken in the native language. Is it possible that <strong>spoken English is more efficient than other languages</strong>?</p>\n\n<p>Like the question <em><a href=\"http://english.stackexchange.com/a/3022/24117\">Do most languages need more space than English?</a></em> I'm looking for hard data or relevant studies to support or discount my anecdotal hypothesis.</p>\n\n<p>At first I thought this might be an illusion, similar to what Peter Roach describes in <em><a href=\"http://www.personal.rdg.ac.uk/~llsroach/phon2/tempopr.htm\">Some Languages are Spoken More Quickly Than Others</a></em>. There are three possibilities he outlines:</p>\n\n<blockquote>\n  <ol>\n  <li>some languages really are spoken more rapidly, and some more slowly, than others as a natural result of the way their sounds are produced.<br></li>\n  <li>we get the impression that some languages are spoken more quickly than others because of some sort of illusion.<br></li>\n  <li>in some societies it is socially acceptable or approved to speak rapidly, and in others slow speaking is preferred.</li>\n  </ol>\n</blockquote>\n\n<p>Roach concludes that (emphasis mine):</p>\n\n<blockquote>\n  <p>[...] while at normal speaking speed the <strong>sounds-per-second rate for all languages may be effectively the same</strong>, some languages are characteristically using higher and lower speaking rates than other languages in particular social situations.</p>\n</blockquote>\n\n<p>Delving further, I was led to a <a href=\"http://lsadc.org/info/documents/2011/press-releases/pellegrino-et-al.pdf\">crosslinguistic study on speech information rates</a>. Their initial hypothesis is that information rates (IR) are the same across languages:</p>\n\n<blockquote>\n  <p>However, <em>IR<sub>L</sub></em> exhibits a greater than 30% degree of variation between Japanese (0.74) and English (1.08), invalidating the first hypothesis of a strict cross-language equality of rates of information.</p>\n</blockquote>\n\n<p>Out of the seven languages in the study<sup>2</sup>, <strong>English had the highest IR</strong>. This seems to tentatively confirm my intuition. Still, there's a good deal of research left to do and the paper discusses many of its shortcomings. </p>\n\n<p>Have there been similar studies that shed light on how English's \"efficiency\" (IR) stacks up? Also, is it possible that there is a wholly different explanation for my experience (e.g. subtitles are designed to be read quickly and actually \"cut off\" the full meaning of the speaker, <em>or</em> a confirmation bias)?</p>\n\n<hr>\n\n<p><sup>1: as best as I can approximate</sup><br>\n<sup>2: French, Italian, Spanish, German, English, Mandarin, Japanese</sup></p>\n", "Id":"2550", "LastEditorUserId":"51", "FavoriteCount":"2", "Title":"Is spoken English more efficient than other languages?", "CreationDate":"2012-09-10T20:55:45.790", "OwnerUserId":"1242", "PostTypeId":"1", "Tags":"<english><translation>", "AnswerCount":"6", "comments":[], "LastEditDate":"2012-09-15T12:52:54.193", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"990", "LastActivityDate":"2013-08-22T07:20:48.900", "Score":"15", "CommentCount":"21", "OwnerUser":{"UpVotes":"8", "WebsiteUrl":"http://n/a", "Id":"1242", "AccountId":"1438398", "CreationDate":"2012-08-08T18:41:37.320", "AboutMe":"<p>Here I am! The younger I get, the less I know.</p>\n", "Age":"83", "Location":"Computadora", "DownVotes":"4", "Views":"0", "Reputation":"381", "DisplayName":"Zairja", "LastAccessDate":"2014-01-10T14:19:44.970"}}