{"Body":"<p>It is clear that languages can borrow words and even <a href=\"http://linguistics.stackexchange.com/questions/190/are-some-languages-known-to-have-taken-grammatical-features-etc-rather-than-just\">syntax</a> from other languages but do they borrow morphemes?</p>\n\n<p>For example, the English morpheme <a href=\"http://www.merriam-webster.com/dictionary/-ation\"><em>-ation</em></a> has a very specific usage in Portuguese. It is specially seen in the word <em>embromation</em>, that comes from the verb <em>embromar</em>, something like “to deceive”. The morpheme <em>-ation</em> transforms it into a noun used to describe bad English. It can also be added to any other word to give it an “English quality”, always in a funny way and making reference to one's poor mastering of English. Although it is certainly not part of the standard Portuguese, it is recognized by almost any speaker and has been used in language school advertisement. (There are funny examples of <em>embromation</em> on YouTube, both <a href=\"http://www.youtube.com/watch?v=8Id5iC3GOrI\">here</a> and <a href=\"http://www.youtube.com/watch?v=fDQLDF8fjJQ\">here</a>.)</p>\n\n<p>Are there any other cases of morphemic borowing, be they jokes or part of the standard system of a language?</p>\n\n<hr>\n\n<h2>Edit: some theorical considerations</h2>\n\n<p>The very concept of morpheme was brought up several times throughout the answers and the comments to my question, so I would like to quickly address this point. My notion of morphology and consequently morphemes comes from Steven Pinker's pretheoretical <em>Words and Rules</em>. He considers morphology to be separated from syntax and responsible for the “rules for forming complex words, including regulars” (page 23). Its main job is to make it possible to join lexicon elements, such as words and morphemes, together, thus saving us from the trouble of memorizing the past form for every verb, for example. Rather than defining morphemes, I will only say that they are the set of memorized chunks that affixes such as <em>-ation</em> (as in “affiliation”), <em>un-</em> (“unthinkable”) and <em>-s</em> (“dogs”) belong to.</p>\n\n<p>Also, it is quite natural that a language will borrow morphemes (and lexicon, syntax etc.) from the language(s) it came from. I would say that my main interest are those cases in which the borrowing had little to do with political imposition of a language (like Ancient Rome did in most cases, or Spain in its colonies) or linguistic evolution and heritage. Rather, I'm looking for morphemes borrowed because of the need of expression that morpheme would cover.</p>\n\n<p>To conclude, I don't have any specific definition for morpheme, nor am I too concerned with the issues the concept brings; also, “pure” borrowings constitute stronger evidence than “forced” ones.</p>\n", "Id":"264", "LastEditorUserId":"155", "FavoriteCount":"1", "AcceptedAnswerId":"266", "Title":"Do languages borrow morphemes?", "CreationDate":"2011-09-18T04:32:07.730", "OwnerUserId":"155", "PostTypeId":"1", "Tags":"<morphology><language-change><language-contact>", "AnswerCount":"4", "comments":[], "LastEditDate":"2011-09-18T18:00:30.263", "LastEditedUser":{"UpVotes":"10", "WebsiteUrl":"http://cabaladada.org", "Id":"155", "AccountId":"508463", "CreationDate":"2011-09-18T03:32:35.427", "AboutMe":"<p>I study linguistics, English and literature at UNESP. My interests are typography, LaTeX, computational linguistics, programming languages, Linux and computers in general.</p>\n", "Age":"24", "Location":"Araraquara, Brazil", "DownVotes":"0", "Views":"10", "Reputation":"203", "DisplayName":"rberaldo", "LastAccessDate":"2013-01-31T19:08:56.943"}, "ViewCount":"753", "LastActivityDate":"2011-09-30T13:50:12.500", "Score":"7", "CommentCount":"3", "OwnerUser":{"UpVotes":"10", "WebsiteUrl":"http://cabaladada.org", "Id":"155", "AccountId":"508463", "CreationDate":"2011-09-18T03:32:35.427", "AboutMe":"<p>I study linguistics, English and literature at UNESP. My interests are typography, LaTeX, computational linguistics, programming languages, Linux and computers in general.</p>\n", "Age":"24", "Location":"Araraquara, Brazil", "DownVotes":"0", "Views":"10", "Reputation":"203", "DisplayName":"rberaldo", "LastAccessDate":"2013-01-31T19:08:56.943"}}