{"Body":"<p>One of the key tools of analysis in classical semantics is the concept of truth value. The content of a proposition, when contextualized in a particular world and a particular time, should have a truth value: it is either true or false, <em>tertium non datur.</em> </p>\n\n<p>However, the study of certain important classes of expressions, e.g., belief, reports, indirect discourse, hearsay evidentials, have raised some issues. While the problem of logical omniscience has been recognized, more recent work has challenged the fundamental distinction between content and context. </p>\n\n<p>What I am curious about specifically is the issue of whether truth value can meaningfully be attributed to a proverb. To better direct the discussion and provide a common point of reference, let's take the presumably contentful  proverb ``spare the rod and spoil the child,\" contextualized within the fictional universe of Charles Dickens' novel <em>Great Expectations</em>, I'd like to examine the question of whether a proverb can and should have truth value. If, for example, the proverb is considered as a belief report, do an individual's actions serve as data for demonstrating a contradiction between the reported belief and the individual's true beliefs? Or on the other hand, if the proverb is treated as a universal generalization about the world in which it is contextualized, which types of facts about this world would demonstrate its falseness?</p>\n", "Id":"2704", "LastEditorUserId":"483", "Title":"Truth value of a proverb", "CreationDate":"2012-10-18T09:30:46.637", "OwnerUserId":"1417", "PostTypeId":"1", "Tags":"<semantics><truth-value>", "AnswerCount":"1", "comments":[], "LastEditDate":"2012-10-18T12:57:54.383", "LastEditedUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "ViewCount":"202", "LastActivityDate":"2012-10-19T12:04:46.057", "Score":"3", "CommentCount":"8", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://eyewebz.com", "Id":"1417", "AccountId":"312507", "CreationDate":"2012-10-18T09:23:36.723", "AboutMe":"<p>Hello community,</p>\n\n<p>I am a young developer that has just started his own company, but also wants to play an active role as an opensource contributor. If you have any questions, feel free to contact me through my blog (http://michielstandaert.be/blog).</p>\n", "Age":"24", "Location":"Belgium", "DownVotes":"0", "Views":"5", "Reputation":"116", "DisplayName":"Michiel Standaert", "LastAccessDate":"2012-10-21T13:50:19.720"}}