{"Body":"<p>On <a href=\"http://en.wikipedia.org/wiki/International_Phonetic_Alphabet#Brackets_and_phonemes\" rel=\"nofollow\">the Wikipedia page for the International Phonetic Alphabet</a>, slashes for phonemes are mentioned quite casually, without getting into the discussion of how or if it makes sense to use a <em>phonetic</em> alphabet to transcribe <em>phonemes</em>.</p>\n\n<p>I can understand how it makes sense to have an international <em>phonetic</em> alphabet, since all humans have the same speech organs.</p>\n\n<p>However, phonemes are a completely different animal. They're an abstraction of one or more phones which are in some sense considered equivalent in a <em>specific</em> language. </p>\n\n<p>I would therefore think that such a thing as an international phonemic alphabet wouldn't make sense at all. Although there could be 2 languages having a phoneme that cover the same set of allophones realized in the same way in the same contexts in both languages, that would be due to relatedness or mere coincidence. It wouldn't work in the general case.</p>\n\n<p>Even if we simply consider a phoneme just a set of allophones, the characters in a truly international phonemic alphabet would potentially need to contain all <em>subsets</em> of the set of phones. There are exponentially many of these compared to phones.</p>\n\n<p>So is using IPA for phonemes completely bona fide? If so please explain how the above shortcomings are handled. Or are the above shortcomings understood, but IPA just used for phonemic transcriptions anyway because it turns out to be convenient?</p>\n", "Id":"2820", "FavoriteCount":"2", "AcceptedAnswerId":"2823", "Title":"IPA for phonemes - does this make sense at all?", "CreationDate":"2012-11-11T01:45:04.363", "AnswerCount":"1", "Tags":"<phonetics><ipa><phonemes>", "PostTypeId":"1", "OwnerUserId":"724", "comments":[], "ViewCount":"247", "LastActivityDate":"2012-11-11T04:23:42.033", "Score":"4", "CommentCount":"4", "OwnerUser":{"UpVotes":"33", "DownVotes":"8", "Id":"724", "AccountId":"482018", "Views":"10", "Reputation":"709", "CreationDate":"2012-01-29T05:39:01.393", "DisplayName":"dainichi", "LastAccessDate":"2014-01-16T02:01:24.110"}}