{"Body":"<p>I read in the <a href=\"http://en.wikipedia.org/wiki/American_Sign_Language#Linguistics\" rel=\"nofollow\">Linguistics section on the Wikipedia page for American Sign Language</a> that ASL was \"<em>proven [to be a natural language] to the satisfaction of the linguistic community by William Stokoe, and contains <strong>phonology</strong>, <strong>morphology</strong>, <strong>semantics</strong>, <strong>syntax</strong> and <strong>pragmatics</strong> just like spoken languages</em>\" (emphasis mine).</p>\n\n<p>Are these elements, of phonology, morphology, semantics, syntax, and pragmatics, generally accepted as the necessary and sufficient components of a natural language? Would a constructed language which developed such features be accepted as \"natural\"? (Note that <a href=\"http://en.wikipedia.org/wiki/American_Sign_Language\" rel=\"nofollow\">American Sign Language</a> itself would be an ambiguous case, being a systematically modified version of  <a href=\"http://en.wikipedia.org/wiki/Old_French_Sign_Language\" rel=\"nofollow\">Old French Sign Language</a>, a signing language which developed \"in the wild\", so to speak, in the deaf community in Paris well before the French Revolution.)</p>\n\n<p>To consider a somewhat flippant example: what would be the necessary conditions, linguistically (as opposed to sociologically) speaking, for either Esperanto or Klingon to develop dialects which would be considered natural?</p>\n\n<p><strong>Edited to add:</strong> I am accepting Alennano's answer as being the most factually correct with respect to what it means for a language to be \"natural\"; but I also think that, from the answers and comments, the question of whether a language is \"natural\" is completely beside the point on a matter of linguistics, except inasmuch as the vast majority of \"vernacular languages\" happened to evolve more-or-less organically most of the time from a prehistoric origin.</p>\n", "Id":"285", "LastEditorUserId":"56", "Title":"What are the criteria for deciding whether a language is \"natural\"?", "CreationDate":"2011-09-19T10:06:18.647", "OwnerUserId":"173", "PostTypeId":"1", "Tags":"<terminology>", "AnswerCount":"5", "comments":[], "LastEditDate":"2011-09-21T05:54:02.703", "LastEditedUser":{"UpVotes":"0", "WebsiteUrl":"http://rebecca.chernoff.com", "Id":"56", "AccountId":"60791", "CreationDate":"2011-09-13T21:24:26.900", "AboutMe":"<p>I'm <a href=\"http://twitter.com/rchern\" rel=\"nofollow\">@rchern</a> on Twitter.</p>\n\n<p>You can email me at rebecca.chernoff on gmail.</p>\n", "Age":"30", "Location":"St Louis, MO", "DownVotes":"0", "Views":"6", "Reputation":"101", "DisplayName":"Rebecca Chernoff", "LastAccessDate":"2012-05-30T17:07:47.653"}, "ViewCount":"301", "LastActivityDate":"2012-04-17T05:36:01.633", "Score":"6", "CommentCount":"7", "OwnerUser":{"UpVotes":"33", "Location":"Cambridge, United Kingdom", "DownVotes":"0", "Id":"173", "AccountId":"510241", "Views":"11", "Reputation":"135", "CreationDate":"2011-09-19T09:21:15.127", "DisplayName":"Niel de Beaudrap", "LastAccessDate":"2013-05-22T12:41:10.817", "AboutMe":"<p>Researcher in quantum information --- involving algebras over finite dimensional Hilbert spaces, graphs and combinatorics, and vector spaces over ℤ/pℤ.</p>\n\n<p>I habitually edit and re-edit anything I write, as long as I have the time, interest, and ability. I should probably apologize for this tendency, but you will probably have to be satisfied with being warned about it instead.</p>\n"}}