{"Body":"<p>Unlike Chinese and Japanese, Korean does employ spaces between words.</p>\n\n<p>What constitutes a lexical word differs from what constitutes an orthographic word. For instance, particles which can is some ways be compared to English prepositions, are written suffixed or cliticized to the end of a word.</p>\n\n<p>My Korean is very rudimentary to say the least but I believe I have seen in printed Korean the particle <code>의</code> (\"of\" or \"'s\") at the beginning of the next line when the noun it would normally be attached to came at the end of the previous line.</p>\n\n<p>I would like to know is this the only place that Korean orthographic words can be separated? Or can line breaks occur at any position in the middle of a word?</p>\n\n<p>(<a href=\"http://en.wikipedia.org/wiki/Line_breaking_rules_in_East_Asian_languages#Line_breaking_rules_in_Korean_text\" rel=\"nofollow\">There is a relevant article on Wikipedia</a>, but it lumps Chinese, Japanese, and Korean together, with Korean receiving the least specific attention.)</p>\n", "Id":"2903", "Title":"Where can orthographic Korean words be split at the end of a line?", "CreationDate":"2012-11-28T03:56:11.740", "AnswerCount":"1", "PostTypeId":"1", "OwnerUserId":"51", "Tags":"<orthography><korean>", "comments":[], "ViewCount":"115", "LastActivityDate":"2013-08-06T22:52:08.917", "Score":"4", "CommentCount":"6", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}