{"Body":"<p>Yesterday on ELU, the IPA sequence <strong>ˌoʊkeɪˈhiːɹjəˌgoʊ</strong> was posted <a href=\"http://english.stackexchange.com/a/96765/2637\">in a comment</a>. I'm not very familiar with IPA, so I thought the easiest way to \"decode\" that would be through a software speech synthesiser.</p>\n\n<p>I already use text-to-speech (TTS) in <a href=\"http://www.hydrogenaudio.org/forums/index.php?showtopic=85308&amp;hl=foo_tts\">my own plugin</a> for the Foobar2000 music player. But I couldn't quickly see how to tell the underlying software that the input text was IPA, rather than standard English, so I went looking for an online version.</p>\n\n<p>After several minutes Googling, all I could find was <a href=\"http://www2.research.att.com/~ttsweb/tts/demo.php\">this demo from AT&amp;T</a> - which, as it turned out, wasn't accurate enough for me to figure out what was being \"said\" by my target string above.</p>\n\n<p>I'd always assumed that if IPA is supposed to be a \"generic\" way of representing phonemes, it should be the ideal input format for TTS software. But if that's so, why was it so difficult to find even something that produced what seems to me an inadequate rendering?</p>\n\n<p>It seems unlikely to me that very few software developers are interested in TTS, so I'm guessing there's some reason why it's difficult for TTS software to handle IPA. Can anyone tell me why this might be so? Or is there maybe some other explanation as to why such software is at the very least \"uncommon\"?</p>\n", "Id":"3035", "FavoriteCount":"3", "Title":"Is it hard for software speech synthesisers to handle IPA? If so, why?", "CreationDate":"2013-01-05T14:56:27.227", "AnswerCount":"3", "PostTypeId":"1", "OwnerUserId":"282", "Tags":"<ipa><software>", "comments":[], "ViewCount":"1398", "LastActivityDate":"2013-03-04T18:19:44.137", "Score":"10", "CommentCount":"11", "OwnerUser":{"UpVotes":"21", "WebsiteUrl":"", "Id":"282", "AccountId":"234202", "CreationDate":"2011-09-24T14:53:50.813", "AboutMe":"<p>The handle isn't randomly-chosen. I still type with two fingers after over 30 years as a solo custom software supplier, and I still mis-hit the keys!</p>\n\n<p>Actually, I've been in (involuntary) retirement for a year or so - giving me too much time on my hands, much of which I spend on Language.se gaining rep I probably don't deserve. But I do have a keen interest in all aspects of English for my own edification, plus I get a buzz out of the way EL&amp;U enables me to actively participate in fostering that same interest in others.</p>\n", "Age":"60", "Location":"United Kingdom", "DownVotes":"3", "Views":"11", "Reputation":"377", "DisplayName":"FumbleFingers", "LastAccessDate":"2013-11-10T21:17:40.387"}}