{"Body":"<p>Would it not be nice to have a site from which people can listen to\ndifferent phrases in different languages with each phrase having the\nfollowing characteristics, in any combination:</p>\n\n<ul>\n<li>Sample Sentence (describes the meaning of the sentence)</li>\n<li>Name of Person Speaking (used to differentiate among speakers)</li>\n<li>Language and Dialect (defines the written form of the words in the sentence)</li>\n<li>Accent (local, or foreign and in the latter case original languages(s)\nand dialects(s) of the speaker, thus leading to mixed accents as well.\nMost importantly an accent defines not only the sound but also the rhythm\nof the words and letters therein pronounced within the sentence, again,\nsomething that can take some time to get used to.)</li>\n<li>Intonation (happy, sad, fed up, reassuring, complaining, enthusiastic, surprised, etc...)</li>\n<li>Sexuality of the speaker (such as, for instance, any combination of\nnot male, male-, male, male+ with not female, female-, female, female+)\nonce again defined in a somewhat flexible manner according to the speaker's\nself perception.</li>\n<li>Speaker pitch (soprano, alto, etc...)</li>\n<li>Other physical voice attributes (e.g. having caught a cold, having a sore throat, etc...)</li>\n<li>Sentence pronunciation in IPA or other phone/phoneme transliteration system</li>\n<li>Optionally, a list of sentences which are not the sentence being uttered\nbut that the listener could confuse in place of what is being said.</li>\n</ul>\n\n<p>On this site people could also be allowed to upload their mp3 or wav sound files so as\nto contribute sample sentences, or conversations, which the user of the site can then\nlisten to at a later time.</p>\n\n<p>Does anyone know of such a site? If not then it could be a good idea to construct one\nlike this? Such a site could be a great aid in allowing learners to practice with\ndifferent languages, dialects, and accents etc... as described above, one more step\ntowards preserving the linguistic diversity of our people, places, and world\nwhile learning about them in a fun, accessible, and easy manner.</p>\n", "Id":"3043", "LastEditorUserId":"783", "FavoriteCount":"1", "Title":"Getting familiar with accents", "CreationDate":"2013-01-07T14:19:29.510", "OwnerUserId":"1653", "PostTypeId":"1", "Tags":"<phonetics><language-acquisition><corpora><dialects>", "AnswerCount":"2", "comments":[], "LastEditDate":"2013-01-07T14:25:40.390", "LastEditedUser":{"UpVotes":"133", "WebsiteUrl":"http://None", "Id":"783", "AccountId":"1263184", "CreationDate":"2012-02-20T12:40:45.587", "AboutMe":"<p>English Language graduate.</p>\n", "Age":"24", "Location":"Wales", "DownVotes":"2", "Views":"16", "Reputation":"1036", "DisplayName":"Danger Fourpence", "LastAccessDate":"2014-01-16T19:41:06.517"}, "ViewCount":"143", "LastActivityDate":"2013-02-10T22:05:09.380", "Score":"3", "CommentCount":"3", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1653", "AccountId":"2214195", "Views":"0", "Reputation":"16", "CreationDate":"2013-01-07T14:19:29.510", "DisplayName":"user1653", "LastAccessDate":"2013-01-18T13:14:31.460"}}