{"Body":"<blockquote>\n  <p><strong>Possible Duplicate:</strong><br>\n  <a href=\"http://linguistics.stackexchange.com/questions/285/what-are-the-criteria-for-deciding-whether-a-language-is-natural\">What are the criteria for deciding whether a language is &ldquo;natural&rdquo;?</a>  </p>\n</blockquote>\n\n\n\n<p><strong>Edited to add:</strong> I've been directed by the moderators to revise my earlier question (<a href=\"http://linguistics.stackexchange.com/q/285/173\">What are the criteria for deciding whether a language is \"natural\"?</a>) rather than to post this one. Please go there. The only reason why I do not delete this question is because there is an answer to it. (It is a reasonably good answer, though.) If you are downvoting, please add a comment to indicate why, bearing in mind that I can no longer delete this duplicate question.</p>\n\n<hr>\n\n<p>This is a follow up to my previous question (<a href=\"http://linguistics.stackexchange.com/q/285/173\">What are the criteria for deciding whether a language is \"natural\"?</a>). The reason why I'm asking this question again is because I would like to dissociate this question from the purely historical question, for any particular language, of whether it has an identifiable origin. The fact that most languages of interest to linguists do not have an identifiable origin, and (dialects unwittingly created via enlightenment projects in received pronunciation and grammatical proscriptions notwithstanding) were not strongly affected by deliberate attempts to engineer, design, or otherwise modify the language, is not obviously pertinent.</p>\n\n<p>For the purposes of this question, \"a vernacular\" means a language which it makes sense to study in a descriptivist manner: a language which is or was actually <em>used</em>, as opposed to a mere rule-set. I choose this word based on remarks in the other question, where it's fairly clear that regular use by a community (for whom that language is a vernacular, as opposed to a formal or ritual, language) is likely to be a key criterion.</p>\n\n<p><a href=\"http://en.wikipedia.org/wiki/American_Sign_Language\" rel=\"nofollow\">American Sign Language</a> is an interesting case study: while derived in large part from a pre-existing sign language which evolved in the wild in Paris, it was viewed with disdain for some time, until it was \"<em>proven [to be a natural language] to the satisfaction of the linguistic community by William Stokoe</em>\". Ignoring the reference to \"natural language\", this demonstrates that, historically, there have been cases where there was doubt as to whether some particular language was a genuine vernacular (as opposed perhaps to some sort of \"bad gesturing imitation\", <em>i.e.</em>&nbsp;a manual pidgin) but that it was possible to convince others that it was a genuine example of a language suitable for linguistic study.</p>\n\n<p><strong>Question.</strong> Is there a consensus as to what criteria a language must have in order to be considered \"a vernacular\" (in the practical sense of being a language within the proper domain of the study of linguistics)? If there is some debate as to what criteria apply should, what are recent articles which discuss such criteria? </p>\n", "Id":"321", "ClosedDate":"2011-11-05T15:06:13.947", "LastEditorUserId":"173", "Title":"What are the criteria for deciding whether a language is “a vernacular”?", "CreationDate":"2011-09-20T17:12:17.657", "OwnerUserId":"173", "PostTypeId":"1", "Tags":"<terminology>", "AnswerCount":"1", "comments":[], "LastEditDate":"2011-09-20T21:18:39.987", "LastEditedUser":{"UpVotes":"33", "Location":"Cambridge, United Kingdom", "DownVotes":"0", "Id":"173", "AccountId":"510241", "Views":"11", "Reputation":"135", "CreationDate":"2011-09-19T09:21:15.127", "DisplayName":"Niel de Beaudrap", "LastAccessDate":"2013-05-22T12:41:10.817", "AboutMe":"<p>Researcher in quantum information --- involving algebras over finite dimensional Hilbert spaces, graphs and combinatorics, and vector spaces over ℤ/pℤ.</p>\n\n<p>I habitually edit and re-edit anything I write, as long as I have the time, interest, and ability. I should probably apologize for this tendency, but you will probably have to be satisfied with being warned about it instead.</p>\n"}, "ViewCount":"152", "LastActivityDate":"2011-09-20T21:18:39.987", "Score":"-1", "CommentCount":"4", "OwnerUser":{"UpVotes":"33", "Location":"Cambridge, United Kingdom", "DownVotes":"0", "Id":"173", "AccountId":"510241", "Views":"11", "Reputation":"135", "CreationDate":"2011-09-19T09:21:15.127", "DisplayName":"Niel de Beaudrap", "LastAccessDate":"2013-05-22T12:41:10.817", "AboutMe":"<p>Researcher in quantum information --- involving algebras over finite dimensional Hilbert spaces, graphs and combinatorics, and vector spaces over ℤ/pℤ.</p>\n\n<p>I habitually edit and re-edit anything I write, as long as I have the time, interest, and ability. I should probably apologize for this tendency, but you will probably have to be satisfied with being warned about it instead.</p>\n"}}