{"Body":"<p>In some discussions about the latest reform of the German orthography, it was claimed that a central language regulation body prevents people from writing as they like and thus prevents »natural« changes of orthography.</p>\n\n<p>In contrast to this, I would hypothesise the following:<br>\nThe establishment of spelling as a concept amongst the users of a given language automatically leads to the existence of conservative users who oppose spelling changes. The amount of these users and their “stubbornness” finally become so high that it prevents changes of spelling from reaching broad acceptance, unless accepted and propagated by a central regulation body for the language. This particularly applies for changes of a more general nature that affect more than just a small number of words, e.g., a hypothetical replacement of c by k, whenever it is pronounced as /k/ (as in <em>can),</em> for the English language.</p>\n\n<p>Two examples that stimulated my hypothesis:</p>\n\n<ul>\n<li>There is no central regulating body for the English language. As a result of this, there is some variety in spelling, e.g., the differences between British and American English or certain punctuation issues. However, the apart from this (and even within this), little to nothing has changed since the end of the 19th century (if I am not mistaken). Having read some of the works by H.P. Lovecraft, who is known for his archaic language, the only »old« spellings that caught my eye, were uses of the trema (e.g., in <em>coöperate)</em> and a few archaic vocables (e.g., <em>Esquimaux).</em></li>\n<li>For the German language, the <em>Orthographische Konferenz</em> (Orthographical Conference) of 1901 established an official orthography and at the same time reformed some aspects of spelling, for which a widespread convention existed at that time, e.g. the usage of the letter c. Though the next orthography reform (which most prominently changed the usage of the letter ß) happened not until 1996, the spelling of many words changed during this time, e.g., many alternative spellings allowed in 1901 came out of use (e.g, <em>Concern</em>), modern spellings were established (e.g., <em>Photo → Foto</em>) and even one rule changed (the triple-letter rule, which became increasingly bizarre) – all this being done by the Duden dictionary, which had an official monopoly on defining correct spelling. While both reforms met heavy opposition, their changes became accepted very quickly (in about 10 years) by most users.</li>\n</ul>\n\n<p>Finally, my question:\nIs there more to my hypothesis (given a certain establishment of orthography, central regulating bodies accelerate orthography changes) than the above two examples?</p>\n", "Id":"3324", "LastEditorUserId":"1822", "Title":"Do central language regulation bodies accelerate or inhibit orthography changes?", "CreationDate":"2013-03-07T22:56:03.830", "OwnerUserId":"1822", "PostTypeId":"1", "Tags":"<language-change><orthography>", "AnswerCount":"3", "comments":[], "LastEditDate":"2013-08-22T11:18:48.900", "LastEditedUser":{"UpVotes":"4", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/hFXzh.jpg", "Id":"1822", "AccountId":"2437491", "Views":"1", "Reputation":"164", "CreationDate":"2013-03-03T09:55:56.907", "DisplayName":"Wrzlprmft", "LastAccessDate":"2014-01-16T08:43:57.833"}, "ViewCount":"159", "LastActivityDate":"2013-11-24T10:33:25.450", "Score":"3", "CommentCount":"8", "OwnerUser":{"UpVotes":"4", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/hFXzh.jpg", "Id":"1822", "AccountId":"2437491", "Views":"1", "Reputation":"164", "CreationDate":"2013-03-03T09:55:56.907", "DisplayName":"Wrzlprmft", "LastAccessDate":"2014-01-16T08:43:57.833"}}