{"Body":"<p>It is well-known, or better said, well-accepted, that the ancestral language Proto-Indo-European (PIE) was a OV language with a very limited (or nonexistent) use of subordinate clauses. In Proto-Germanic, subordinates was more common (but not too much) but yet a OV language.\nHowever, both Old English (OE) and Old High German (OHG) had a VO structure in main clauses, and ancestral OV in subordinate clauses:</p>\n\n<pre><code>                                             |-&gt; OE (VO/OV) -&gt; English (VO/VO)\n   PIE (OV) --&gt; PGmc (OV/OV) --&gt; ¿?(VO/OV)--&gt;|\n                                             |-&gt; OHG (VO/OV) -&gt; German (V2)\n</code></pre>\n\n<p>If I'm right, a possible source of shift OV -> VO (in main clauses) is the original topicalization of the verb in PIE/PGmc. In PIE/PGmc the verb occupied the first (or second) position in the sentence to mark some special type of sentences, for example, to mark imperative sentences. This original topicalization of the verb could have became more frequent even changing completely the sentence word pattern.</p>\n\n<p>Question 1: What process created the appearance of subordinates and subsequently how and when did it change the structure in main clauses? And why were only main clauses affected?</p>\n\n<p>Question 2: What process caused English to be strict SVO and German to be strict V2?</p>\n\n<p>Question 3: Was OE really a V2 language like German, or only a left-peripherical language? (V in first or second position, that means, a not strict version of V2).</p>\n", "Id":"3439", "LastEditorUserId":"1055", "FavoriteCount":"2", "Title":"Origin of actual order pattern in English/German", "CreationDate":"2013-03-27T15:32:28.263", "OwnerUserId":"1902", "PostTypeId":"1", "Tags":"<english><proto-indo-european><word-order><germanic-languages><proto-germanic>", "comments":[], "LastEditDate":"2013-03-28T01:11:43.110", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "ViewCount":"94", "LastActivityDate":"2013-03-28T01:11:43.110", "Score":"4", "CommentCount":"1", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://freealgview.blogspot.com/", "DownVotes":"0", "Id":"1902", "AccountId":"1999735", "Views":"1", "Reputation":"121", "CreationDate":"2013-03-27T15:32:16.827", "DisplayName":"Peregring-lk", "LastAccessDate":"2013-03-28T14:40:21.470"}}