{"Body":"<p>We live in a world that is incredibly different to the one that was here 200 years ago. Literacy, in the developed world at least, is no longer an elite privilege, but rather almost taken for granted. English speakers are instructed in the rights and wrongs of things like spelling and basic sentence construction from an early age, and the same goes for many, many languages.</p>\n\n<p>At the same time, the growth of the internet, we see a huge increase in the level of communication between language communities that are far removed from one another (ie, the internet, media). It was, in the past, the physical separation that induced accent/dialect change, initially, and over longer periods of time, the development of new languages in their own right.</p>\n\n<p>My question is this: given that the rules of a language are taught prescriptively to young members of a language community, and the breakdown of the factors that lead to increased diversity between dialects, what impact will this modern age have on traditional language evolution. Will languages with standardised rules and a globally interconnected community of native speakers (e.g. USA-UK-Australia) see a slowing in divergence compared to what was observed in the past, or will it be a convergence, or will there be no tangible impact at all? </p>\n", "Id":"3495", "Title":"Impact of widespread literacy and global communication on language evolution", "CreationDate":"2013-04-06T14:36:20.173", "AnswerCount":"1", "PostTypeId":"1", "OwnerUserId":"1117", "Tags":"<evolution>", "comments":[], "ViewCount":"157", "LastActivityDate":"2013-12-05T17:54:58.437", "Score":"3", "CommentCount":"5", "OwnerUser":{"UpVotes":"4", "Location":"Dublin, Ireland", "DownVotes":"0", "Id":"1117", "AccountId":"1571138", "Views":"2", "Reputation":"152", "CreationDate":"2012-06-18T16:25:03.320", "DisplayName":"Richard King", "LastAccessDate":"2013-04-09T19:26:53.250", "AboutMe":"<p>Computational Linguist with an interest in Web Development. Graduate of TCD, and still Dublin based!</p>\n", "Age":"25"}}