{"Body":"<p>How can you/should you empirically distinguish between epistemic and circumstantial readings of modals? </p>\n\n<p>I (at least think I) understand how the two readings are supposed to be distinguished theoretically — i.e., that an epistemic reading is a modal claim given the speaker/attitude-holder's evidence/knowledge, whereas a circumstantial reading is supposed to be a modal claim given the circumstances/facts of the world. (...although there is always the problem of how to distinguish evidence from facts, because can't any fact count as evidence towards some claim?)</p>\n\n<p>But I've always had difficulty understanding how to empirically distinguish between the two readings. The standard example used to illustrate the difference is Kratzer 1991's 'hydrangeas' example:</p>\n\n<p><strong>(1) Context</strong>: You go to a new land, and test the climate and soil, finding out that it's pretty much the same as the climate and soil at home, where hydrangeas grow. You know, however, that this new land has had no contact with Asia or America (and thus hydrangeas could not have possibly spread to this new land)</p>\n\n<blockquote>\n  <p>a)    Hydrangeas can grow here.<br>\n    b)    There might be hydrangeas growing here.</p>\n</blockquote>\n\n<p>In the context, (1a) is true, but (1b) is false, showing that (1a) and (1b) have distinct meanings, which could be characterized in terms of the types of facts used to make the claims (i.e., that (1a) only is concerned with the physical facts, concerning the soil, climate and the physical properties of hydrangeas, and doesn't care about your evidence that the land in question has had no contact with Asia or America, whereas (1b) cannot discount this evidence). But the problem is that there is also a distinction between (1a) and (1b) with respect to the temporal orientation — the 'epistemic' reading is associated with present orientation (i.e., we're considering the possibility of a current hydrangea-growing-situation), while the 'circumstantial' is associated with future orientation (i.e., we're considering the possibility of a future hydrangea-growing situation). </p>\n\n<p><strong>So my question is as follows</strong>: are there any clear examples showing an epistemic-circumstantial distinction that do not also involve this temporal distinction? (Maybe in other words, what sorts of empirical data motivate the theoretical distinction between epistemic and circumstantial modals?)</p>\n\n<p><strong>Post-answer Reassessment:</strong></p>\n\n<p>Ah thanks, those are good examples! And I think that when I consider the universal \"in his office\" example, I can even get a backwards-looking circumstantial reading (er, unless this is deontic too). </p>\n\n<p>eg. given certain facts, John had to be in his office.</p>\n\n<p><strong>(2) Context:</strong> Everyone knows John spent all of last night in his office. John's girlfriend knows all of the extenuating circumstances, yet she is still miffed and is complaining somewhat unreasonably about this fact. John's co-worker attempts to justify John's overnight stay:</p>\n\n<p>\"Well, considering that John was alone in the department working late in his office when a thug broke in and broke his legs, and considering his weak upper-body strength, John had no choice. He had to be in his office last night.\"</p>\n\n<p>Which is quite different from an epistemic reading where the speaker doesn't know whether John stayed in his office last night, or whether he was actually out carousing with his buddies, but concludes on the basis of John's lack of hangover, that John had to be in his office last night.</p>\n", "Id":"362", "LastEditorUserId":"177", "FavoriteCount":"1", "AcceptedAnswerId":"587", "Title":"Distinguishing between epistemic and circumstantial readings (without recourse to temporality)?", "CreationDate":"2011-09-21T16:40:38.140", "OwnerUserId":"177", "PostTypeId":"1", "Tags":"<semantics>", "AnswerCount":"2", "comments":[], "LastEditDate":"2011-09-30T21:02:56.857", "LastEditedUser":{"UpVotes":"6", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/tqgTp.png", "Id":"177", "AccountId":"896176", "CreationDate":"2011-09-19T16:30:42.833", "AboutMe":"<p>Linguistics grad student. Research interests lie in formal semantics, the morphosyntax-semantics interface.</p>\n", "Location":"Canada", "DownVotes":"0", "Views":"9", "Reputation":"396", "DisplayName":"user177", "LastAccessDate":"2014-01-09T01:15:39.280"}, "ViewCount":"313", "LastActivityDate":"2011-09-30T21:02:56.857", "Score":"8", "OwnerUser":{"UpVotes":"6", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/tqgTp.png", "Id":"177", "AccountId":"896176", "CreationDate":"2011-09-19T16:30:42.833", "AboutMe":"<p>Linguistics grad student. Research interests lie in formal semantics, the morphosyntax-semantics interface.</p>\n", "Location":"Canada", "DownVotes":"0", "Views":"9", "Reputation":"396", "DisplayName":"user177", "LastAccessDate":"2014-01-09T01:15:39.280"}}