{"Body":"<p><em>Note: Please don't assume that because I'm asking about vocabulary, that my only method of language study is vocabulary memorization.</em></p>\n\n<p>I'm in the process of learning a couple of new languages, and am getting in the habit of using flash cards for vocabulary practice.  My primary goal is to be able to converse in the target languages.</p>\n\n<p>My question is whether it might be a better use of my time to use flash a word in my native language (L1), to practice remembering the translation to my second language (L2), or the other way; flash the L2 word and translate to the L1 word?</p>\n\n<p>The latter (L1 -> L2) seems to be the most common method I have seen in my various classes and language learning books.  But the former seems more natural, and to more mimic how a child learns his first language (he hears a word, learns that it is associated with a particular object, then over time the word comes to mind when he sees the object).  The latter is also far easier, in terms of getting the answer \"just right.\"</p>\n\n<p>It's easy, for instance, for a native English speaker learning Spanish to see the Spanish word \"banco\" and remember the English \"bank.\"  It can be a bit harder to see the English word \"bank\" and remember if the Spanish word is \"banco\", \"banko\" or \"banc\".  But that may also mean that the harder exercise is the more fruitful one.</p>\n\n<p>Have any studies or other relevant work been done that would shed any useful light on this?  Does the most effective method vary depending on other circumstances?</p>\n", "Id":"3669", "LastEditorUserId":"935", "FavoriteCount":"1", "Title":"Which makes more more effective vocabulary practice: L1 -> L2 or L2 -> L1?", "CreationDate":"2013-05-09T03:15:59.480", "OwnerUserId":"935", "PostTypeId":"1", "Tags":"<second-lang-acquisition>", "AnswerCount":"1", "comments":[], "LastEditDate":"2013-05-09T23:31:23.103", "LastEditedUser":{"UpVotes":"8", "WebsiteUrl":"http://verbally.flimzy.com", "Id":"935", "AccountId":"7879", "CreationDate":"2012-04-16T17:30:22.570", "AboutMe":"<p>I'm a full-time software developer, working from home for a company in Atlanta, GA.  I from Wichita, KS but have been living in Guadalajara, Mexico for the last year, and will stay here until sometime early 2012.</p>\n", "Age":"35", "Location":"Guadalajara, Mexico", "DownVotes":"2", "Views":"1", "Reputation":"165", "DisplayName":"Flimzy", "LastAccessDate":"2013-08-29T05:24:34.433"}, "ViewCount":"149", "LastActivityDate":"2013-07-23T01:23:21.457", "Score":"6", "CommentCount":"8", "OwnerUser":{"UpVotes":"8", "WebsiteUrl":"http://verbally.flimzy.com", "Id":"935", "AccountId":"7879", "CreationDate":"2012-04-16T17:30:22.570", "AboutMe":"<p>I'm a full-time software developer, working from home for a company in Atlanta, GA.  I from Wichita, KS but have been living in Guadalajara, Mexico for the last year, and will stay here until sometime early 2012.</p>\n", "Age":"35", "Location":"Guadalajara, Mexico", "DownVotes":"2", "Views":"1", "Reputation":"165", "DisplayName":"Flimzy", "LastAccessDate":"2013-08-29T05:24:34.433"}}