{"Body":"<p>As we all know, every language has open classes of morphemes.    If we discovered a new mineral whose natural florescence captured the public's attention, there would be no difficulty coining a new name for it in either technical or popular vocabulary.     Odds are, the new name would be derived from existing morphemes, yielding something like \"glo-stone.\"  But nothing theoretical could prevent the coinage of a new morpheme like \"fraz.\"     </p>\n\n<p>I have often heard that the number of morphemes in a language is finite because there are only so many morphemes in a language at a given time.    </p>\n\n<p>However, only so many sentences are being spoken in a given language at a given time.<br>\nIt simply isn't possible for there to be an <em>actual</em> infinity of sentences in a given language.     But because of recursion, we can rightly characterize the number of sentences in a language as non-finite in principle.     </p>\n\n<p>Can't we say the same about the number of morphemes?   There may be practical and cognitive limits on the lengths of morphemes, but not theoretical limits as far as I know.   </p>\n\n<p>If the numbers of both sentences and morphemes in a language are  <em>actually finite</em> but <em>non-finite in principle</em>,  then how could any language be characterized as having only a finite number of sentences in principle even if said language lacks recursion?    True, new morphemes are uttered with far lower frequency than new sentences are, but what theoretical difference would that make?   </p>\n", "Id":"3674", "AcceptedAnswerId":"3677", "Title":"Are lexicons finite in principle?", "CreationDate":"2013-05-09T04:04:34.573", "AnswerCount":"1", "Tags":"<lexicon><theoretical-linguistics>", "PostTypeId":"1", "OwnerUserId":"790", "comments":[], "ViewCount":"65", "LastActivityDate":"2013-05-09T05:31:53.787", "Score":"4", "CommentCount":"1", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}