{"Body":"<p>In discussions of language learning, multilingualism, and related topics, I hear references to \"thinking in a language.\"   Two questions on this stack exchange list have referenced this, namely \"What language, if any, do deaf people think in?\" and \"What language do children think in?\"   One can find lots of references to \"thinking in a language\" on the internet.   The following link is only one of many examples:   <a href=\"http://drenguin.hubpages.com/hub/How-does-thinking-in-a-certain-language-affect-us\">http://drenguin.hubpages.com/hub/How-does-thinking-in-a-certain-language-affect-us</a>    </p>\n\n<p>Since I experience internal monologue like everyone else, and that monologue is in my native English, I have an intuitive sense of what the phrase \"thinking in a language\" means.  </p>\n\n<p>But is internal monologue, aka thinking in a language, something that can be investigated scientifically?   Is there an operational definition of thinking in a language?   Does the phrase have empirical meaning? </p>\n", "Id":"3710", "LastEditorUserId":"22", "Title":"Does the phrase \"thinking in a language\" have empirical meaning?", "CreationDate":"2013-05-14T03:07:23.987", "OwnerUserId":"790", "PostTypeId":"1", "Tags":"<psycholinguistics><philosophy-of-language>", "AnswerCount":"1", "comments":[], "LastEditDate":"2013-05-14T11:46:38.283", "LastEditedUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "ViewCount":"140", "LastActivityDate":"2013-07-16T13:22:03.940", "Score":"6", "CommentCount":"7", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}