{"Body":"<p>In following when talking about 'native speaker' I refer to what is considered as 'mother tongue' rather than reaching a level of fluency.<br>\nFor the purpose of this question think of an average person who is not a prodigious infant who is talented in learning languages but also not being exceptionally incapable of learning languages.\nFurthermore, it shouldn't be of interest if languages X and Y are related, say, German and Dutch, or if they are completely different, say, Spanish and Japanese.</p>\n\n<p>As a native speaker of whichever language you are able to recognize other speakers as also being native. When someone learns a language as a second language he'll probably never reach the same level as those who speak that language as first language, even if they live in the foreign country for a long time. There'll (almost <sup>1</sup>) always be a few indicator which will distinguish them from native speakers. And I don't refer to accent or similar but only to the language skills and feel for a language, i.e. word-choice, grammar etc.</p>\n\n<p>I was thinking of what would happen if a child is born in country X into a native family of the respective language but being raised in country Y by a family whose native language is Y.</p>\n\n<p>Q1: Will this child ever 'perfectly' speak language Y and be recognized by other speakers of Y as native? Or does this child has an inborn ability to language X and, for that reason, will not be able to speak language Y good enough?</p>\n\n<p>Q2: What would happen if this child will have instructions in their 'inborn' language? Will they easily learn their <strike>second</strike> 'inborn' language? Similar, what would happen if this person would move to country X after growing up. Will they be able to learn language X good enough to be recognized as a native speaker of X?</p>\n\n<hr>\n\n<p><sup>1</sup>The exception that proves the rule.</p>\n", "Id":"3717", "LastEditorUserId":"51", "Title":"To what extent do children adapt to a language which is not their mother-tongue?", "CreationDate":"2013-05-15T12:59:36.153", "OwnerUserId":"1719", "PostTypeId":"1", "Tags":"<psycholinguistics><second-lang-acquisition>", "comments":[], "LastEditDate":"2013-05-15T21:15:53.290", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"101", "LastActivityDate":"2013-05-15T21:15:53.290", "Score":"1", "CommentCount":"2", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://n/a", "Id":"1719", "AccountId":"408616", "CreationDate":"2013-01-30T19:39:46.013", "AboutMe":"<p>I am a software engineer who is interested in improving his languages skills :)</p>\n", "Age":"29", "Location":"Germany", "DownVotes":"0", "Views":"2", "Reputation":"123", "DisplayName":"Em1", "LastAccessDate":"2013-11-08T12:47:23.997"}}