{"Body":"<p>I was just answering a question about the origins of English and Latin and wanted to talk about their common ancestors but ran into a surprising problem.</p>\n\n<p>So we know the majority of languages in Europe and the Indian subcontinent are related under the name \"Indo European\".</p>\n\n<p>If you just want to look at the languages in the subcontinent there is the name \"Indic\".</p>\n\n<p>But when you want to look at the other half, I can't seem to find a name.</p>\n\n<p>English is a member of the Germanic family. Latin is a member of the Italic family.</p>\n\n<p>Both are on close branches on the European side of the Indo European tree but \"European\" is not the name of a language family as far as I am aware. When we talk about European languages the terms covers an area including unrelated languages such as Basque, Finnish, and Hungarian.</p>\n\n<p>So if \"European\" is not a name of a language family and Indo-European is far too vast, is there a term I'm overlooking?</p>\n", "Id":"3850", "AcceptedAnswerId":"3851", "Title":"Is there a named common ancestor of Germanic and Latin besides \"Indo-European\"?", "CreationDate":"2013-06-12T01:54:14.573", "AnswerCount":"1", "Tags":"<terminology><latin><language-families><germanic-languages>", "PostTypeId":"1", "OwnerUserId":"51", "comments":[], "ViewCount":"248", "LastActivityDate":"2013-06-12T04:08:35.637", "Score":"5", "CommentCount":"4", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}