{"Body":"<p>I'm interested in the kinds of ambiguities which can be encountered when attempting to analyse the agglutinative verbs of Georgian into their component \"slots\".</p>\n\n<p>Georgian verbs may have an optional <a href=\"http://linguistics.stackexchange.com/questions/2011/do-languages-besides-the-kartvelian-family-have-a-property-of-verbs-called-vers\">\"version vowel\"</a> or \"pre-radical vowel\" in the position immediately preceding the verb stem. Of Georgian's five vowels only \"ა\" (a), \"ე\" (e), \"ი\" (i), and \"უ\" (u) are possible in this position. The vowel \"ო\" is never used in this function.</p>\n\n<p>I'm struggling with learning Georgian verbs. Different dictionaries use different forms as the citation form. The version vowel is sometimes used for things such as polypersonal agreement but textbooks tell you that you must learn each verb's version vowel when you learn a verb and they seem to be usually included in the citation forms used as dictionary headwords.</p>\n\n<p>So what I'm wondering is if there are also Georgian verbs whose stem begins with one of these same letters, which would necessitate extra care when reading new verb forms to allow for a vowel to be either a version marker or just part of the stem. Conversely you need to know these parts of a verb just to decide where in a dictionary to look them up.</p>\n\n<p><strong>Are there Georgian verb stems starting with ა- / ე- / ი- / უ- ?</strong></p>\n", "Id":"3901", "FavoriteCount":"1", "AcceptedAnswerId":"3951", "Title":"Can Georgian verb stems start with a vowel?", "CreationDate":"2013-06-24T00:44:02.257", "AnswerCount":"1", "Tags":"<morphology><verbs><georgian><ambiguity><stems>", "PostTypeId":"1", "OwnerUserId":"51", "comments":[], "ViewCount":"70", "LastActivityDate":"2013-07-02T14:03:05.117", "Score":"1", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}