{"Body":"<p>In my native language, Portuguese, numbers have officially been in various classes, from adjectives and nouns to \"quantifiers\" and determiners.</p>\n\n<p>I'm thinking that perhaps we can't group them all, simply because they behave differently. For example, \"ten\" works differently from \"million\". Multiplying by 2, you get \"twenty\" and \"<strong>two</strong> million<b>s</b>\". A million is a noun, like a potato or a third; while \"ten\" is different. \"Twelve\" and \"a dozen\" are the same in meaning, but grammatically behave in different ways. </p>\n\n<p>Why? In other languages, this happens with other words. Some may agree in gender/number with the object they quantify, like nouns do. Can we grammatically divide numbers in different classes? How would this work? Would another class be required? How would this system vary from language to language (I'd appreciate if you'd make a comparison between English and some other language of your choice)?</p>\n", "Id":"4143", "LastEditorUserId":"2328", "Title":"When are numbers nouns?", "CreationDate":"2013-08-09T23:09:00.410", "OwnerUserId":"2334", "PostTypeId":"1", "Tags":"<grammar><numbers><word-classes>", "comments":[], "LastEditDate":"2013-08-10T17:43:41.910", "LastEditedUser":{"UpVotes":"123", "WebsiteUrl":"https://sites.google.com/site/patrickdelliott/", "ProfileImageUrl":"http://i.stack.imgur.com/HGYBE.jpg", "Id":"2328", "AccountId":"3146009", "CreationDate":"2013-08-07T11:16:59.797", "AboutMe":"<p>I'm a PhD student in Linguistics at University College London. My primary area of interest is generative linguistics, and specifically syntactic and semantic theory. More narrowly still, i'm interested in ellipsis, comparatives, and binding theory. <a href=\"https://twitter.com/patrickdelliott\" rel=\"nofollow\">Follow me on twitter!</a></p>\n", "Location":"London, United Kingdom", "DownVotes":"43", "Views":"43", "Reputation":"970", "DisplayName":"P Elliott", "LastAccessDate":"2014-01-19T02:32:31.120"}, "ViewCount":"126", "LastActivityDate":"2013-08-10T17:43:41.910", "Score":"1", "CommentCount":"10", "OwnerUser":{"UpVotes":"28", "WebsiteUrl":"https://pt.wikipedia.org/wiki/Usu%C3%A1rio:JMCF125", "Id":"2334", "AccountId":"2441446", "CreationDate":"2013-08-09T21:02:30.707", "AboutMe":"<p>Hello passers-by.</p>\n\n<p>I'm a Portuguese socialist idealist, and a hobbyist in diverse areas, such as Programming, Mathematics, Linguistics, Politics, Philosophy, etc. I can also be found with this very name as an editor of Wikipedia.</p>\n\n<p>The flag you see is from an SVG I wrote, and I use it instead of the Portuguese flag for two reasons: first, the <a href=\"https://www.google.pt/search?safe=off&amp;hl=pt-PT&amp;site=imghp&amp;tbm=isch&amp;source=hp&amp;biw=1301&amp;bih=656&amp;q=bandeira+de+portugal\" rel=\"nofollow\">Portuguese flag</a> is hard to write in SVG; the second reason is that I am not only Portuguese, but an Esperantist and a left-wing citizen of the world. Besides, this one didn't exist in the internet yet. <strong>:D</strong></p>\n\n<p>In my opinion, the Stack Exchange Network has a lot of information, as Wikipedia does; but unlike Wikipedia, has a more low-context culture, which I dislike (although Portugal's culture is sadly heading that way - thank social networks). </p>\n\n<p>I use the Arch (Linux) distribution of GNU/Linux, as <a href=\"http://www.vanwensveen.nl/rants/microsoft/IhateMS.html\" rel=\"nofollow\">Windows sucks</a> and I hate Apple and their products (that yet somehow (!) are extremely expensive) made by underpaid starving Chinese children.</p>\n\n<p>You can contact me through jmcf|25@hotmail.com or jmcf|25@gmail.com (NOTE: the \"|\" represents a \"1\", this just avoids some spam).</p>\n", "Age":"16", "Location":"Funchal, Portugal", "DownVotes":"0", "Views":"11", "Reputation":"166", "DisplayName":"JMCF125", "LastAccessDate":"2013-12-30T15:58:00.133"}}