{"Body":"<p>The Arabic script is an <a href=\"https://en.wikipedia.org/wiki/Abjad\" rel=\"nofollow\">Abjad</a> writing system or consonantal alphabet. Most letters stand for a consonant, and short vowels are usually not indicated (but can exceptionally be indicated with diacritic symbols). Long vowels also have proper letters, which is why the Arabic script can be called an impure Abjad.</p>\n\n<p>The Arabic script is said to be well adapted to Arabic grammar (and more generally, Abjads are well adapted to Semitic languages) because roots usually consist of three consonants. Words derived from a common root still look fairly similar in writing because much morphology consists of changes in short vowels.</p>\n\n<blockquote>\n  <p>For instance, according to Classical Arabic and Modern Standard Arabic, the Arabic root ذ ب ح Ḏ-B-Ḥ (to sacrifice) can be derived the forms ذَبَح ḏabaḥa (he sacrificed), ذَبَحْتَ ḏabaḥta (you (masculine singular) sacrificed), ذَبَّحَ ḏabbaḥa (he slaughtered), يُذَبِّح yuḏabbiḥ (he slaughters), and مَذْبَح maḏbaḥ (slaughterhouse). <a href=\"https://en.wikipedia.org/wiki/Abjad\" rel=\"nofollow\">Source: Abjad</a></p>\n</blockquote>\n\n<p><em>(This is marked as disputed in the Wikipedia article, but sounds sensible to me and I think I've also read it elsewhere. Still, if you can cite sources disputing this feel free to rectify it.)</em></p>\n\n<p><strong>Question:</strong> The Arabic script is also used for a range of non-Semitic languages, such as Farsi/Persian and Urdu. Despite a fair degree of influence from Arabic, these languages do not follow the Arabic/Semitic system where roots rely on (three) consonants.</p>\n\n<p>Does this have any practical consequences? Is there any evidence that the use of the Arabic script for non-Semitic languages makes reading and writing harder? Or the use of other Abjads, such as the Hebrew script for Yiddish?</p>\n\n<p><strong>My attempt at an answer, so far:</strong></p>\n\n<ul>\n<li>On the one hand - as a learner of Arabic - I find the Arabic script troublesome enough even though consonantal roots are important in Arabic and short vowels less so. After all, short vowels carry morphological load (the passive of <em>kataba</em> - write - is <em>kutiba</em>, only distinguished by short vowels). But if authors feel this creates too much ambiguity they use diacritics to mark the crucial short vowels. </li>\n<li>Another problem when learning Arabic (caused by the Arabic script) is that I can't pronounce words I do not already know. But this is because I'm a learner, and publications for learners (whether native or non-native) typically include diacritics for short vowels depending on previous knowledge.</li>\n<li>On the other hand, even in English, it's n_t th_t h_rd t_ r__d _ s_nt_nc_ w_th__t v_w_ls. (see below)</li>\n<li>If the Arabic script really does cause so much trouble for non-Semitic languages one would expect these language communities to try and adopt another script. I don't know of any such cases where the community did that of it's on accord (some communities in the Soviet Union were forced to) and even if there are some they seem to be exceptions. I think this is not really a counter-argument to the Arabic script not being ideal for non-Semitic languages because once a community has adopted a script the opportunity costs implied by change would be fairly high (everybody has to learn a new script). Also, many communities using the Arabic script are also Muslim. As the language and script of the Qur'an, the Arabic language and script enjoy a lot of prestige.</li>\n</ul>\n\n<p>(The clause without vowels is supposed to read \"it's no that hard to read a sentence without vowels\". If you had to read this apparently it is harder than I thought.)</p>\n", "Id":"4365", "AcceptedAnswerId":"4370", "Title":"If the Arabic script is suited to Arabic grammar, how do speakers of non-Semitic languages cope with it?", "CreationDate":"2013-08-30T20:33:59.867", "AnswerCount":"2", "Tags":"<arabic><hebrew><alphabets><semitic-languages><abjads>", "PostTypeId":"1", "OwnerUserId":"2278", "comments":[], "ViewCount":"169", "LastActivityDate":"2013-09-08T07:28:42.777", "Score":"4", "CommentCount":"8", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}