{"Body":"<p>In Thai there are particles which can be used at the end of many sentences to make them more polite. Different particles are used by male and female speakers:</p>\n\n<ul>\n<li>\"ครับ\" (kráp) : male</li>\n<li>\"ค่ะ\" (kâ) : female</li>\n</ul>\n\n<p>Lao is so closely related to Thai that they are apparently mostly mutually comprehensible.</p>\n\n<p>Yet one of the first things I noticed in the speech when I crossed the border from Thailand to Laos is the complete lack of such particles in Lao. I never hear anybody say them and none of the materials I've seen on Lao describe them. In Thai it's one of the first things you are taught.</p>\n\n<ul>\n<li>Does Lao have etymologically related words that serve other functions?</li>\n<li>Did Lao have them formerly but they slipped out of usage in the remote or recent past?</li>\n<li>Are they an innovation in Thai since after the point in time the languages diverged from their common ancestor?</li>\n</ul>\n", "Id":"4420", "AcceptedAnswerId":"4423", "Title":"Do the Thai masculine & feminine \"polite particles\" have counterparts in Lao?", "CreationDate":"2013-09-10T18:45:22.433", "AnswerCount":"1", "Tags":"<comparative-linguistics><history><particles><thai><lao>", "PostTypeId":"1", "OwnerUserId":"51", "comments":[], "ViewCount":"71", "LastActivityDate":"2013-09-11T15:01:09.933", "Score":"2", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}