{"Body":"<p>Many languages associate the <code>t</code> sound with the second person and the <code>s</code> with the third. For example Spanish (<em>tu/tuyo</em>, <em>su/suyo</em>), French (<em>tu,ton/ta/tes,son/sa/ses</em>), Italian (<em>tu,tuo/tua/tuoi,suo/sua/suoi</em>) etc. Even English associates <em>t</em> with the second person (<em>thy,thine</em> etc). German does not <a href=\"http://www.german-database.supanet.com/page13.html\" rel=\"nofollow\">seem</a> to have <em>t</em> for the second person (though it has <em>d</em> which is close)  but does have third person adjectives beginning with <em>s</em> (<em>sein/seine</em>).</p>\n\n<p>Modern (and I would guess Ancient as well) Greek, however has the inverse.\nThe second person is associated with the <code>s</code> sound and the third with <code>t</code>. <em>Σου</em>, pronounced <em>su</em> just like in Spanish means <em>your(s)</em> and <em>του</em>, again pronounced exactly like the Spanish <em>tu</em>, means <em>his</em>. I can imagine that <em>του</em> may have originated from the word for <em>self</em> (ἑαυτού/τον/τος) but, in that case, why the third person?</p>\n\n<p>So, my question is about the history and origin of this association between <code>s</code> and <code>t</code> and the third and second person respectively. Is it a characteristic of Proto-Indo-European and, if so, what happened to Greek? Did PIE have such adjectives and, if so, did they also start with <code>t</code> and/or <code>s</code>? Any extra historical information on the origin and phylogeny of these possessives would also be very welcome.</p>\n", "Id":"4425", "LastEditorUserId":"1055", "FavoriteCount":"1", "AcceptedAnswerId":"4427", "Title":"What is the origin of 't-' and 's-' words for second and third person possesive adjectives?", "CreationDate":"2013-09-11T09:15:54.217", "OwnerUserId":"2458", "PostTypeId":"1", "Tags":"<proto-indo-european><evolution><history>", "AnswerCount":"2", "comments":[], "LastEditDate":"2013-09-11T10:13:13.600", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "ViewCount":"113", "LastActivityDate":"2013-09-13T07:38:34.670", "Score":"2", "CommentCount":"2", "OwnerUser":{"UpVotes":"1", "Location":"Marseille, France", "DownVotes":"0", "Id":"2458", "AccountId":"1086299", "Views":"0", "Reputation":"113", "CreationDate":"2013-09-11T08:43:04.023", "DisplayName":"terdon", "LastAccessDate":"2013-11-22T13:24:37.640", "AboutMe":"<p>Bioinformatician and long-time Linux geek.</p>\n", "Age":"34"}}