{"Body":"<p>Hmong is a dialect continuum spoken across several countries in Southeast Asia.</p>\n\n<p>One prominent characteristic is the \"aspirated m\" (IPA <code>m̥</code> or <code>mʰ</code>) found in some varieties. This is the reason behind the \"hm\" in the English spelling of their ethnonym.</p>\n\n<p>It's not hard to find sources stating that it exists, some like to include \"voiceless\" as well as \"aspirated\" when referring to it.</p>\n\n<p>But I can't seem to find a clear description of its nature.</p>\n\n<p>I know there are other languages with voiceless nasals, I believe some Celtic languages are examples. But I believe those do not also have the aspiration component.</p>\n\n<ul>\n<li>Does the aspiration come before the \"m\" as suggested in the English spelling?</li>\n<li>Does it come after the \"m\" as suggested in some IPA transcriptions?</li>\n<li>Are they somehow at the same time?</li>\n<li>Is this voicelessness as important as the aspiration? This component is not as often referred to though it is in <a href=\"https://en.wikipedia.org/wiki/Hmong_language#Consonants\" rel=\"nofollow\">the Wikipedia article</a>.</li>\n</ul>\n\n<p>One of the few discussions of this sound's nature I can find is <a href=\"http://www.personal.psu.edu/ejp10/blogs/thinking/2009/09/aspirated-nasal-in-gran-torino.html\" rel=\"nofollow\">a blog post from 2009 on the Clint Eastwood Movie <em>Gran Torino</em></a>, which featured Hmong characters. This blogger also seemed to have some trouble analysing this sound.</p>\n", "Id":"4485", "Title":"What is the nature of the (voiceless) aspirated \"m\" in Hmong?", "CreationDate":"2013-09-15T08:21:37.827", "OwnerUserId":"51", "PostTypeId":"1", "Tags":"<phonology><voicing><nasals><aspiration><hmong>", "comments":[], "ViewCount":"49", "LastActivityDate":"2013-09-15T08:21:37.827", "Score":"1", "CommentCount":"3", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}