{"Body":"<p>Language standardisation has variously been described, for example by <a href=\"http://www.jstor.org/stable/670407\" rel=\"nofollow\">Einar Haugen</a>, as a process involving the selection, codification, acceptance, and elaboration of a linguistic norm. I'm concerned here with the <strong>selection</strong> of a norm. Often this consists not of selecting a dialect that is already present in its entirety, but a process called koinéisation takes place - the levelling of differences between dialects.</p>\n\n<p>Apart from regional varieties (dialects), social varieties (sociolects) also play a role. I think I have heard/read repeatedly that linguistic structures/words etc. used by educated speakers are more likely to become part of the emerging standard than linguistic structures used by less educated speakers. This is, I think, because educated speakers play a role as gatekeepers due to their social, economic and political power. In consequence, the varieties used by uneducated speakers are often looked down upon.</p>\n\n<p>However, in the literature on language standardisation (such as <a href=\"http://books.google.de/books?id=8ciimg5gGqQC&amp;pg=PA1&amp;dq=%22language%20standardization%22%20educated&amp;hl=en&amp;sa=X&amp;ei=u9w9Urn2F6ja4AS-1oHwAg&amp;ved=0CC4Q6AEwAA#v=onepage&amp;q=%22language%20standardization%22%20educated&amp;f=false\" rel=\"nofollow\">Language Standardization and Language Change</a> I could not find any reference to the importance of educated speakers in language standardisation. </p>\n\n<p><strong>Can anybody provide academic references for this?</strong> (of course I would also be happy to consider references denying the role of educated speakers in language standardisation)</p>\n", "Id":"4520", "LastEditorUserId":"790", "AcceptedAnswerId":"4541", "Title":"Role of educated speakers in language standardisation", "CreationDate":"2013-09-21T17:53:47.990", "OwnerUserId":"2278", "PostTypeId":"1", "Tags":"<sociolinguistics><dialects><standardisation>", "AnswerCount":"1", "comments":[], "LastEditDate":"2013-09-21T18:47:58.283", "LastEditedUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}, "ViewCount":"122", "LastActivityDate":"2013-09-25T07:34:53.257", "Score":"3", "CommentCount":"5", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}