{"Body":"<p>I am conducting a small research on the usage of dual in the Czech language. Normally, the dual is used only when referring to body parts (legs, eyes, knees etc) and the number 200. However, in spoken Czech it is frequently used for other nouns, which is considered grammatically wrong, but still is pathologically wide-spread.</p>\n\n<p>My question is : can it after some language development be eventually considered a new grammatical norm? What are the main criteria for a very common mistake to be legalized? Is it some frequency limit, after reaching which the form is legalized? Or is all this much simpler : some person in the government who is in charge of education allows this form and requests to change the dictionaries and grammar reference books (happened in Russia, the famous \"coffee\" became neutral as well as masculine)? I would like to get some documented proof and statistical data, if that is possible.</p>\n\n<p>P.S. Until the XV. century this dual usage was actually grammatically correct.</p>\n", "Id":"4706", "LastEditorUserId":"3020", "Title":"What are the main criteria for a grammar mistake to become a new normative?", "CreationDate":"2013-10-11T22:38:43.487", "OwnerUserId":"1651", "PostTypeId":"1", "Tags":"<language-change><grammar><grammatical-number>", "AnswerCount":"2", "comments":[], "LastEditDate":"2014-01-15T15:39:41.970", "LastEditedUser":{"UpVotes":"3", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/Pc82Y.jpg?s=128&g=1", "Id":"3020", "AccountId":"2596734", "Views":"1", "Reputation":"167", "CreationDate":"2014-01-13T16:08:59.447", "DisplayName":"Marjeta", "LastAccessDate":"2014-01-17T20:16:21.790"}, "ViewCount":"88", "LastActivityDate":"2014-01-15T15:39:41.970", "Score":"2", "OwnerUser":{"UpVotes":"6", "Location":"Prague, Czech Republic", "DownVotes":"0", "Id":"1651", "ProfileImageUrl":"http://i.stack.imgur.com/ouOiS.jpg", "AccountId":"1387786", "Views":"3", "Reputation":"111", "CreationDate":"2013-01-06T22:16:16.950", "DisplayName":"petajamaja", "LastAccessDate":"2014-01-15T19:16:42.580"}}