{"Body":"<p>I had always thout agglutinative languages were inflected languages where the inflections to a greater degree are built up by multiple affixes, each having an atomic effect. (Unlike the <em>-s</em> on English verbs which denotes <code>3rd person</code> + <code>singular</code> + <code>present tense</code>.)</p>\n\n<p>On hearing Esperanto described as a \"highly agglutinating language\" I found this odd. I know Esperanto can add more than one affix to nouns and/or verbs to build up a grammatical ending. This makes it more agglutinating than English but not \"highly agglutinating\" according to my understanding.</p>\n\n<p>I might expect the term \"highly agglutinating\" to be used of languages like Finnish, Hungarian, Tamil, or Turkish.</p>\n\n<p>However, in a recently posted answer, user AJN states:</p>\n\n<blockquote>\n  <p>Esperanto is a highly agglutinative language, because it uses a word-building mechanisms to rapidly build new words from roots.</p>\n</blockquote>\n\n<p>In followup comments an example is given:</p>\n\n<blockquote>\n  <p>ex: from root word \"san\"(health) we obtain \"mal-san-ul-ej-o\" => (mal=inverse,ul=person,ej=place,o=substantif) as a result, mal-san-ul-ej-o = hospital, a name of a place where you find not healthy people.</p>\n</blockquote>\n\n<p>Are the terms \"agglutinating language\" and/or \"highly agglutinating language\" correctly applied to such word-building processes or only to the morphological processes I outlined above?</p>\n\n<p>If the terms are applicable to both, does accepted terminology exist to differentiate the two types of agglutination?</p>\n", "Id":"4856", "Title":"Does the term \"(highly) agglutinating language\" refer to inflecional endings, word-formation processes, or both?", "CreationDate":"2013-11-06T07:01:09.157", "AnswerCount":"2", "PostTypeId":"1", "OwnerUserId":"51", "Tags":"<terminology><morphology><agglutination><word-formation>", "comments":[], "ViewCount":"145", "LastActivityDate":"2014-01-06T06:22:10.497", "Score":"2", "CommentCount":"3", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}