{"Body":"<p>The various Wikipedia articles covering Standard Chinese all seem to agree that Mandarin does not have voiced plosives, fricatives, or affricates except for [ʐ] / [ɻ], written in Pinyin as \"r\".</p>\n\n<p>But many other sources cite voiced IPA symbols and when I get my native Mandarin speaking Chinese friend who lives in the Beijing region to demonstrate the alveolar, retroflex, and alveolo-palatal series, it really seems to my ear that he is making voicing distinctions where Wikipedia indicates only aspiration distinctions.</p>\n\n<p>Further, when I try to produce the sounds with only aspiration differences he corrects me until I give in and add voicing.</p>\n\n<p>I must make it clear that I'm just an armchair linguist with no official training.</p>\n\n<p>But what might I be observing? Could it be regional differences in Mandarin away from Standard Chinese? Could it be due to differing analyses of Chinese phonology? Could it be that Wikipedia is listing archiphonemes which commonly do have voiced realizations? Could it be that Wikipedia is just plain wrong? Or is it all down to my uneducated ear?</p>\n", "Id":"4860", "LastEditorUserId":"385", "Title":"Does Mandarin Chinese have phonetically voiced plosives, fricatives, or affricates (besides \"r\" = [ʐ] / [ɻ])?", "CreationDate":"2013-11-07T04:43:29.537", "OwnerUserId":"51", "PostTypeId":"1", "Tags":"<phonetics><chinese><voicing><mandarin>", "AnswerCount":"1", "comments":[], "LastEditDate":"2013-11-07T21:04:28.830", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "ViewCount":"133", "LastActivityDate":"2013-11-14T02:02:21.157", "Score":"2", "CommentCount":"7", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}