{"Body":"<p>In their <a href=\"http://www.sciencemag.org/content/324/5931/1165.short\" rel=\"nofollow\">2009 paper on the Indus Script</a>, Rao et al. describe a test for deciding whether a corpus of symbols is in fact a collection of texts in some language. Over-simplifying a bit, the approach they follow can be summarized as follows. They begin by restricting their attention to a given number of most frequently occurring symbols in the corpus, and calculate the conditional entropy of pairs of symbols for this subset. (Conditional entropy in this context quantifies how well one can predict the next symbol, given only the current symbol. Low conditional entropy means the current symbol is a good predictor of the next symbol.) They then plot the conditional entropy against the number of symbols included, and argue that symbol corpora that are linguistic in origin result in similar plots, while non-linguistic symbol systems result in plots that are very different from the plots for linguistic ones. </p>\n\n<p>The approach of Rao et al. and the justifications they gave have been strongly criticized by <a href=\"http://languagelog.ldc.upenn.edu/nll/?p=1374\" rel=\"nofollow\">various</a> <a href=\"http://cscs.umich.edu/~crshalizi/weblog/611.html\" rel=\"nofollow\">authors</a> and a heated discussion followed (there were even <a href=\"http://www.cslu.ogi.edu/~sproatr/newindex/response.pdf\" rel=\"nofollow\">rebuttals of rebuttals of rebuttals</a>). </p>\n\n<p>I am curious about other approaches to this fundamental problem. What are some of the specific methods proposed for testing whether a given corpus of symbols is in fact a collection of texts in some language?</p>\n", "Id":"580", "LastEditorUserId":"108", "FavoriteCount":"3", "Title":"What statistical methods are used to test whether a corpus of symbols is linguistic?", "CreationDate":"2011-09-28T04:05:42.097", "OwnerUserId":"108", "PostTypeId":"1", "Tags":"<computational-linguistics>", "AnswerCount":"1", "comments":[], "LastEditDate":"2011-10-05T03:28:25.253", "LastEditedUser":{"UpVotes":"8", "DownVotes":"0", "Id":"108", "AccountId":"542522", "Views":"3", "Reputation":"68", "CreationDate":"2011-09-14T08:22:47.957", "DisplayName":"Azo", "LastAccessDate":"2012-08-31T02:49:45.947"}, "ViewCount":"137", "LastActivityDate":"2011-10-05T03:28:25.253", "Score":"7", "CommentCount":"6", "OwnerUser":{"UpVotes":"8", "DownVotes":"0", "Id":"108", "AccountId":"542522", "Views":"3", "Reputation":"68", "CreationDate":"2011-09-14T08:22:47.957", "DisplayName":"Azo", "LastAccessDate":"2012-08-31T02:49:45.947"}}