{"Body":"<p>In the comments on <a href=\"http://linguistics.stackexchange.com/questions/5977\">a recent question of mine</a> about <a href=\"http://en.wikipedia.org/wiki/Copula_%28linguistics%29\" rel=\"nofollow\">copulas</a> and Chinese it has been stated:</p>\n\n<blockquote>\n  <p>... the concept of \"copula\" is a medieval invention of Latin grammarians, and not a modern linguistic term.</p>\n</blockquote>\n\n<p>Is this a generally accepted view in linguistics? I seem to read about copulae pretty frequently and I don't think I'm reading more mediaeval sources than modern ones lately.</p>\n\n<p>My understanding was that in theory copulas have specific functions which differentiate them from other verbs in languages such as English, and in fact I've been under the impression that cross-linguistically copulas exist which are not necessarily partilcularly verb-like at all.</p>\n\n<p>But perhaps I'm wrong, I'm not a trained or professional linguist after all, just an interested amatuer. Perhaps I have been noticing only articles at similar levels to Wikipedia and perhaps in real linguistics sources the concept of copula has been obsolete for some time.</p>\n\n<p>Can anybody clear this up? Is <strong><em>copula</em></strong> a live concept in modern linguistics, is it dead, or has it been superceded with one or more modern concepts?</p>\n", "Id":"5979", "Title":"Has the term or the concept of a \"copula\" ceased to be used/relevant in modern linguistics?", "CreationDate":"2013-11-23T18:10:56.373", "AnswerCount":"2", "PostTypeId":"1", "OwnerUserId":"51", "Tags":"<copula>", "comments":[], "ViewCount":"172", "LastActivityDate":"2013-12-02T15:37:28.100", "Score":"4", "CommentCount":"11", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}