{"Body":"<p>The question is: Would you classify apostrophes and hyphens as punctuation marks? Now, Webster and a lot of other sources define them as punctuation marks. I know for sure that in Russian linguistics they are not and their functions in Russian aren't different from those in English. My arguments for them not being punctuation marks are:</p>\n\n<ul>\n<li><p>both the apostrophe and the dash have very little, if anything, to do with syntax;</p></li>\n<li><p>the apostrophe is used for contractions or to express the grammatical form of a word (possessives) or connect two words (like \"we're\") rather than separate them like the other punctuation marks do (the latter function applies to the dash as well);</p></li>\n<li><p>punctuation marks indicate aspects of the intonation, i.e. whenever we have full stops, question marks, colons, dashes etc. in writing, we make pauses or have intonation changes in speaking. However, we don't do this for apostrophes and hyphens.</p></li>\n</ul>\n\n<p>Thus, I'd say that the apostrophe is a diacritical sign/ascending stroke used to indicate a missed vowel or for other purposes and the hyphen is a sign to connect two parts of a word.</p>\n\n<p>Whether you agree or disagree, please, leave your arguments!</p>\n", "Id":"5998", "LastEditorUserId":"51", "Title":"Are apostrophes and hyphens punctuation marks?", "CreationDate":"2013-11-25T02:46:25.640", "OwnerUserId":"2776", "PostTypeId":"1", "Tags":"<syntax><english><written-language><russian><punctuation>", "AnswerCount":"3", "comments":[], "LastEditDate":"2013-11-25T14:52:52.030", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"97", "LastActivityDate":"2013-11-26T01:05:33.867", "Score":"2", "CommentCount":"4", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2776", "AccountId":"3634333", "Views":"1", "Reputation":"11", "CreationDate":"2013-11-25T02:46:25.640", "DisplayName":"Andrew", "LastAccessDate":"2013-11-27T03:21:09.783"}}