{"Body":"<p>I have been searching around but as far as I can tell there is no established name for the aspect demonstrated by sentences such as:</p>\n\n<blockquote>\n  <p>\"I'll read this report over the weekend.\"</p>\n  \n  <p>\"The debt has grown over time...\"</p>\n  \n  <p>\"The negotiations took place over three days.\"</p>\n  \n  <p>\"Bob blinked repeatedly over the next few minutes.\"</p>\n</blockquote>\n\n<p>Contrast the last one with:</p>\n\n<blockquote>\n  <p>\"Bob blinked repeatedly <strong>for</strong> the next few minutes.\"</p>\n</blockquote>\n\n<p>Maybe there is more than one thing going on. Would you say \"durative\" is one of the qualities? I tried many variations of the last two sentences to try to get something that differed only by the preposition, without sounding strange. Does the first one sound more intentional to you? I am actually just trying to understand temporal uses of \"over\". I have noticed a telic sense, for example:</p>\n\n<blockquote>\n  <p>I read the entire book over five days. </p>\n  \n  <p>*I read the entire book for five days.</p>\n</blockquote>\n\n<p>So <em>for</em> and <em>over</em> can both be used for giving a sense of duration, but they seem to differ in telicity. Do they differ subtly in their duration sense too though? I feel like <em>for</em> has more of a sense of continuity than <em>over</em>. <em>Over</em> constructions sound like they could have stops and starts throughout the time period. I want to call it \"distributive aspect\" but apparently that is being used for something else: <a href=\"http://www-01.sil.org/linguistics/GlossaryOfLinguisticTerms/WhatIsDistributiveAspect.htm\" rel=\"nofollow\">http://www-01.sil.org/linguistics/GlossaryOfLinguisticTerms/WhatIsDistributiveAspect.htm</a>.</p>\n\n<p>Maybe there are just lots of things going on here that can't be given one label?</p>\n", "Id":"5999", "AcceptedAnswerId":"6087", "Title":"What aspect or feature do \"over TIME\" constructions have?", "CreationDate":"2013-11-25T05:39:58.223", "AnswerCount":"1", "Tags":"<english><semantics><aspect><prepositions>", "PostTypeId":"1", "OwnerUserId":"2373", "comments":[], "ViewCount":"54", "LastActivityDate":"2013-12-07T16:49:53.167", "Score":"3", "CommentCount":"3", "OwnerUser":{"UpVotes":"3", "DownVotes":"0", "ProfileImageUrl":"https://www.gravatar.com/avatar/?s=128&d=identicon&r=PG&f=1", "Id":"2373", "AccountId":"139820", "Views":"3", "Reputation":"196", "CreationDate":"2013-08-16T17:48:57.747", "DisplayName":"Moss", "LastAccessDate":"2013-12-18T02:51:26.983"}}