{"Body":"<p>I have noticed that there seem to be many words that have travelled the globe due to trade, such as the word orange or rice, which have plausible origins in proto-Dravidian. Meanwhile, it is hypothesized that the language (if it is a language, which some people argue against) recorded in the Indus script is a Dravidian one. All this makes me wonder if these numerous possibly-Dravidian Wanderworts are indicative of the Indus Valley Civilization's success in trade.</p>\n\n<p><a href=\"http://en.wikipedia.org/wiki/List_of_English_words_of_Sanskrit_origin\" rel=\"nofollow\">This page</a> of Wikipedia lists 7 English words with possible Dravidian origins, notably:</p>\n\n<ul>\n<li><strong>Orange</strong>, through Old French orenge, Medieval Latin orenge and Italian arancia from Arabic نارنج naranj, via Persian نارنگ narang and Sanskrit नारङ्ग naranga-s meaning \"an orange tree\", derived from proto-Dravidian.</li>\n<li><strong>Rice</strong>, via Old French ris and Italian riso from Latin oriza, which is from Greek ὄρυζα oryza, through an Indo-Iranian tongue finally from Sanskrit व्रीहिस् vrihi-s \"rice\", derived from proto-Dravidian.</li>\n<li><strong>Sugar</strong>, through Old French sucre, Italian zucchero, Medieval Latin succarum, Arabic: سكر sukkar and Persian: شکر shakar ultimately from Sanskrit शर्करा sharkara which means \"ground or candied sugar\" (originally \"grit\" or \"gravel\"), from proto-Dravidian.</li>\n</ul>\n\n<p>So, is it likely that the Dravidian language that these words came from is the language of the Indus Valley Civilization? Is this a poor, uninformed idea? or, alternatively, am I late to the party and this is already intuitively obvious to historians? What are your thoughts?</p>\n", "Id":"6147", "Title":"Wanderwort origins and the Indus Valley Civilization?", "CreationDate":"2013-12-14T18:07:40.567", "OwnerUserId":"1962", "PostTypeId":"1", "Tags":"<etymology><historical-linguistics><history><dravidian>", "comments":[], "ViewCount":"45", "LastActivityDate":"2013-12-14T18:07:40.567", "Score":"0", "CommentCount":"6", "OwnerUser":{"UpVotes":"1", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/mW0wC.jpg", "Id":"1962", "AccountId":"2640026", "CreationDate":"2013-04-15T19:13:19.320", "AboutMe":"", "Location":"Connecticut", "DownVotes":"0", "Views":"2", "Reputation":"21", "DisplayName":"mhenderson", "LastAccessDate":"2014-01-01T22:00:57.587"}}