{"Body":"<p>I am student at the English department at the Universityof Vienna. I am writing Master thesis on 'Linguistic creativity of Textspeak and Lolspeak'. The purpose of my study is to analyze linguistic aspects of Lolspeak (hilarious captions written to cat pictures) and Textspeak (the variant of English typically used in SMS messages). In order to be able to complete the empirical part of my thesis, I have to collect authentic text messages. Not much research has been conducted on the creativity of private text messages so far which, makes this study particularly interesting and useful for other researchers. . I am planning to collect a sample of private text messages of native speakers of English, because native speakers of English are more likely to use non-standard English, so we can predict that they are more sensitive to the nuances of the language style characteristics of Textspeak. All native speakers of English are invited to participate in my study. </p>\n\n<p>The aim of the questionnaire to collect authentic text messages and to gather sociolinguistic information about participants to examine how sociolinguistic factors (such as age, gender, level of education etc.) influence the linguistic creativity of Textspeak. All data collected will be anonymized before use. </p>\n\n<p>This survey is not a test and therefore there are no wrong answers. Please get in touch if you have any further questions or anything is unclear in regard to the questionnaire. I would be more than grateful for your help.</p>\n\n<p>Here is the link to the questionnaire:\n<a href=\"https://www.surveymonkey.com/s/K9T3N8N\" rel=\"nofollow\">https://www.surveymonkey.com/s/K9T3N8N</a></p>\n\n<p>Contact me at polakowska_22@hotmail.com.</p>\n\n<p>Best regards,\nKatarzyna </p>\n", "Id":"6378", "ClosedDate":"2014-01-12T10:54:58.477", "Title":"native speakers wanted in my questionnaire", "CreationDate":"2014-01-11T22:04:04.927", "OwnerUserId":"3011", "PostTypeId":"1", "Tags":"<cross-linguistic>", "comments":[], "ViewCount":"25", "LastActivityDate":"2014-01-11T22:04:04.927", "Score":"-3", "CommentCount":"2", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "ProfileImageUrl":"https://www.gravatar.com/avatar/0080fdb9c5fe7a084712572b662feba6?s=128&d=identicon&r=PG&f=1", "Id":"3011", "AccountId":"3843929", "Views":"1", "Reputation":"1", "CreationDate":"2014-01-11T22:04:04.927", "DisplayName":"Katarzyna", "LastAccessDate":"2014-01-11T22:04:04.927"}}