{"Body":"<p>I have been told that, in Chinese, terms for \"yes\" and \"no\" used as answers for questions are not needed because one answers yes-no questions by either repeating the verb in the question or adding a negative word to the repetition of the verb in the question.   So the answer to a question meaning \"Did the thief take the gold\" could be either \"take\" (the affirmative answer) or \"not take\" (the negative answer).  I am told that this type of answer to yes-no questions is also found in other languages.   </p>\n\n<p>It seems to me that this strategy makes for less ambiguity than we have in English, as we see here:  </p>\n\n<p>Q:   Did he NOT COME to the party?</p>\n\n<p>A1:  Yes. (affirming that he did not come to the party) </p>\n\n<p>A2:  Yes. (affirming that he did come to the party)  </p>\n\n<p>A3:  No.  (denying that that he came to the party)</p>\n\n<p>A4:  No.  (denying that he did not come to the party)</p>\n\n<p>Of course, we English speakers can disambiguate such answers in a number of ways, including a tag to the answer.   \"Yes, he did.\"  \"Yes, he didn't,\"  ... etc.  </p>\n\n<p>But aside from answering with a verb vs. a negated verb, or using tags as in English, what other grammatical or lexical strategies are commonly used in natural languages to avoid ambiguous answers to negative yes-no questions?    </p>\n", "Id":"6409", "AcceptedAnswerId":"6410", "Title":"What range of strategies are common in natural languages for providing unambiguous answers to negative yes-no questions?", "CreationDate":"2014-01-15T06:41:21.900", "AnswerCount":"2", "Tags":"<syntax><lexicon><pragmatics>", "PostTypeId":"1", "OwnerUserId":"790", "comments":[], "ViewCount":"65", "LastActivityDate":"2014-01-16T19:04:00.347", "Score":"3", "CommentCount":"1", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}