{"Body":"<p>There are lots of ways to indicate you disagree with some aspect of an utterance.  I'm thinking here of the spectrum that includes \"No, not-X,\" \"Well, not-X,\" \"Hey, wait a minute! Not-X!\" \"Yes, you're right about Y, but actually not-X,\" \"Have you considered the possibility that not-X?\" and so on.  I'm interested in the question of <strong>how speakers choose between these forms.</strong></p>\n\n<p>Intuitively there are a few different factors that go into the decision.  Politeness is a big one.  But I suspect it's not the only one.  <a href=\"http://christopherpotts.net/ling/data/waitaminute/potts-waitaminute.pdf\">Here's one paper</a> on a factor other than politeness that goes into the choice between \"No\" and \"Hey, wait a minute.\"</p>\n\n<p><strong>I'm looking for interesting articles or books on this phenomenon</strong>, from any disciplinary point of view: sociolinguistics, anthropology, semantics, pragmatics, whatever.  They don't have to be about English &mdash; actually, I'd really like some references that <em>aren't</em> about English.  Stuff on the role of politeness would be great.  Stuff on other factors besides politeness would be even better (though I'm not sure how much work like that exists outside the business in formal semantics about \"wait a minute\").  </p>\n", "Id":"814", "Title":"Reference request: ways of indicating disagreement", "CreationDate":"2011-10-14T20:24:49.750", "OwnerUserId":"306", "PostTypeId":"1", "Tags":"<sociolinguistics><pragmatics><negation>", "comments":[], "ViewCount":"123", "LastActivityDate":"2011-10-14T20:24:49.750", "Score":"5", "CommentCount":"5", "OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}}