{"Body":"<p>I'm wondering whether anyone knows of any machine parsable database of the geographical distribution of natural languages (for example the geographical distribution of (native) speakers)?</p>\n\n<p>I know WALS has some basic information (it assigns some kind of point of origin for each langauge), but this is not what I'm looking for (indeed, I would like to have such a database to cross reference with WALS).</p>\n\n<p>Edit: As the confusion in the comment section suggest my wording was rather unfortunate, as it sounded like I had a specific problem in mind. I'm not looking for anything very specfic, but I'm wondering generally about what (machine parsable) databases containing data about geographical aspects of natural langauges there are. Two very reasonable examples suggested in the comments are databases outlining the geographical regions languages are spoken and (dually) databases for querying what languages are spoken in any geographical region. Even more specific could be something along the lines of a database for querying (native?) speaker density of larger languages (for small ones I guess WALS would usually be enough).</p>\n\n<p>One thing I've thought of using such a database for is generating more informative maps from WALS, than those already supported by the web interface (having English be a point in England seems somewhat unintuitive).</p>\n", "Id":"828", "LastEditorUserId":"76", "FavoriteCount":"3", "AcceptedAnswerId":"868", "Title":"Are there any databases of geographical language distribution?", "CreationDate":"2011-10-16T13:41:49.570", "OwnerUserId":"321", "PostTypeId":"1", "Tags":"<linguistic-typology><online-resources><resources>", "AnswerCount":"1", "comments":[], "LastEditDate":"2011-11-03T19:20:35.770", "LastEditedUser":{"UpVotes":"35", "WebsiteUrl":"http://github.com/alekstorm", "Id":"76", "AccountId":"411223", "CreationDate":"2011-09-13T23:34:32.303", "AboutMe":"", "Age":"24", "Location":"Urbana, IL", "DownVotes":"17", "Views":"36", "Reputation":"1043", "DisplayName":"Alek Storm", "LastAccessDate":"2013-12-09T07:20:27.393"}, "ViewCount":"167", "LastActivityDate":"2011-11-03T19:20:35.770", "Score":"10", "CommentCount":"8", "OwnerUser":{"UpVotes":"14", "DownVotes":"1", "Id":"321", "AccountId":"281025", "Views":"7", "Reputation":"222", "CreationDate":"2011-09-27T21:40:27.360", "DisplayName":"Tilo Wiklund", "LastAccessDate":"2013-11-26T20:08:09.213", "Age":"25"}}