{"Body":"<p>I am reading John McWhorter’s \"<a href=\"http://rads.stackoverflow.com/amzn/click/1592403956\" rel=\"nofollow\">Our Magnificent Bastard Tongue</a>\". One thing called my attention in the book:  he spends a great deal of effort trying to show the reader how scholars have thoroughly examined the history of English and yet failed to explain why certain features have appeared in the language. He concentrates particularly on the arising of the do-support and the present progressive construction, two innovations not shared by any other Germanic language. In his own words:</p>\n\n<blockquote>\n  <p>You can page through countless books and articles on The History of English, and even on specifically the history of meaningless <em>do</em> or the <em>-ing</em> present, and find Celtic either not mentioned at all, actively dismissed, or, at best, mentioned in passing as a “a possible influence” (read: of no significant bearing upon the issue).</p>\n</blockquote>\n\n<p>His point being, of course, that these constructions were introduced into English by the indigenous Celtic speakers, who lived alongside the Anglo-Saxons for centuries. My first reaction to his criticism was: \"Yes, he is right! How could linguists have not seen this obvious causal relation?\" </p>\n\n<p>But, then, every science has to clearly define its scope. And, perhaps, it is not part of the field of Historical Linguistics to try to explain phenomena, but merely to describe them, based on direct evidence (which is not the case in the Celtic influence issue). So, is the job of a historical linguist to provide explanations as for <em>why</em> languages have developed this way or that? Or do they have to restrict themselves to describing only <em>how</em> languages develop over time?</p>\n", "Id":"893", "AcceptedAnswerId":"901", "Title":"Is explanation part of Historical Linguistics?", "CreationDate":"2011-10-28T00:38:43.567", "AnswerCount":"2", "Tags":"<historical-linguistics><philosophy-of-language><methodology>", "PostTypeId":"1", "OwnerUserId":"22", "comments":[], "ViewCount":"186", "LastActivityDate":"2011-10-28T21:36:03.850", "Score":"4", "CommentCount":"2", "OwnerUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}}