{
  "id": "/questions/2073488",
  "creationDate": "2014-01-18T09:21:21.783",
  "body": "\n\nEDIT: I stuck in a single call to manually retain the array right after initializing it, and that fixed it. Dur. Thanks.\n\nI keep an NSMutableArray in a UIScrollView subclass, and I add to it instances of a UIImageView subclass as each is added as a subview. It needs to be a mutable array, as I plan to rearrange their order in the array eventually; this bug is occurring before I even try to do so. I've used NSLogs to show that the array has count 10 up until and including applicationDidBecomeActive: is called in my AppDelegate, and added a timer to fire every 0.001s in the run loop. The first time it fires, it can't find the array anymore! I'm very confused and have been trying to track this down for hours.\n\nThe timer's working properly (i.e. when printCount: doesn't access the array, it's fine), it's only when I try to access the array there that it breaks. The regular call to printCount: below works, but the first time the timer fires I What could possibly be happening between these two calls to printCount:?\n\n\t- (void)applicationDidBecomeActive:(UIApplication *)application {\n\t    NSTimer *timer = [[NSTimer scheduledTimerWithTimeInterval:0.001f\n\t                                                       target:[viewController view]\n\t                                                     selector:@selector(printCount)\n\t                                                     userInfo:nil\n\t                                                      repeats:YES]\n\t                      retain];\n\t    [[NSRunLoop currentRunLoop] addTimer:timer forMode:NSDefaultRunLoopMode];\n\t    [[viewController view] printCount];\n\t}\n\t\n\nI've been endlessly stepping through the program with the debugger. The array is correct right up through this point, and its memory address is the same even after its contents are changed. However, there is only object in it afterwards -- its 10 elements get replaced by a single UITouchData instance. No idea where it comes from. None of my event-handling methods attempt to reassign the array or change it. Any ideas what could be going wrong? I'm completely mystified.",
  "lastActivityDate": "2014-01-18T09:41:41.150",
  "title": "iPhone - array lost between appDidBecomeActive: and run loop starting?",
  "tags": [
    "iphone",
    "nsmutablearray",
    "runtime-error",
    "nsrunloop",
    "runloop"
  ],
  "docScore": 0,
  "comments": [],
  "answers": [],
  "creationYearMonth": "201401",
  "itemTally": 0,
  "owner": null
}