{
  "id": "/questions/2265524",
  "creationDate": "2014-02-18T03:23:54.790",
  "body": "\n\nI seem to have a dilemma. I have an EXCEL 2003 template which users should use to fill in tabular information. I have validations on various cells and each row undergoes a rather complex VBA validation upon change and selection_change events. The sheet is protected to disallow formatting activities, insert and delete of rows and columns, etc.\n\nAs long as users fill in the table row by row, all works pretty fine. Things get worse if I want to allow user to copy/paste data into that sheet (which is a legitimate user demand in this case), because cell validation would disallow paste actions.\n\nSo I tried to allow users to turn off protection and cut/paste, a VBA marks the sheet to indicate the fact that it contains unvalidated entries. I have created a \"batch validation\" that validates all non-empty rows at once. Still copy/paste doesn't work too well (must directly jump from source sheet to destination, cannot paste from text files, etc.) \n\nCell Validation is also not good from the point of inserting rows, because depending on where you insert the row, cell validation may be missing completely. And if I copy cell validations down to row 65k the empty sheet gets over 2M in size - another most unwanted side effect.\n\nSo I thought one way to circumvent troubles would be to forget about cell validation alltogether and use only VBA. Then I would sacrifice user comfort of providing drop-down lists in some columns - some of which change as a function of entries in other columns, too.\n\nHas anyone been in the same situation before and can give me some (generic) tactical advises (coding VBA is not a problem)?\n\nKind regards\nMikeD",
  "lastActivityDate": "2014-07-16T18:05:49.900",
  "title": "Excel - tactics for complex validation",
  "tags": [
    "excel",
    "excel-vba"
  ],
  "docScore": 0,
  "comments": [],
  "answers": [],
  "creationYearMonth": "201407",
  "itemTally": 0,
  "owner": null
}