{
  "id": "/questions/2267398",
  "creationDate": "2014-02-18T08:37:57.960",
  "body": "\n\nI am working on a legacy Java Enterprise server project, trying to set up nightly builds. We are using Java 5, Maven 2, JBoss 4.2 and Atlassian Bamboo 2.1.5. The idea is that we have a Bamboo agent on one of our dev servers, and the Maven build is configured to hard deploy the resulting .ear file, then restart the server. (We can't use soft deploy because our legacy application uses a library which causes an exception during undeploy... we will get rid of that damn library at some point, but not just yet.) I am using the JBoss Maven plugin for this. It works nicely when I run a Maven build on my own machine (laptop, Win XP Professional): the server is stopped and restarted with the latest build, and the build finishes.\n\nHowever, when I try to run the nightly build on our server (Win 2003), after starting the JBoss server the build process halts. The Bamboo agent displays in the log:\n\n\tBuild MYPROJECT-NIGHTLY-44 completed.\n\t\n\nAnd then it waits there, the build never finishing - unless I shut down the JBoss server manually, at which point the Bamboo build process resumes and runs its post-build activities, then terminates with \n\n\tFinished building MYPROJECT-NIGHTLY-44.\n\t\n\nApparently the process to start the JBoss server somehow locks the parent process on Win 2003, while the same process runs independently on Win XP. The relevant code of the JBoss plugin looks like this (reformatted for brevity):\n\n\tprotected void launch( String fName, String params )\n\t    throws MojoExecutionException {\n\t\n\t    try {\n\t        checkConfig();\n\t        String osName = System.getProperty( \"os.name\" );\n\t        Runtime runtime = Runtime.getRuntime();\n\t\n\t        Process p = null;\n\t        if ( osName.startsWith( \"Windows\" ) ) {\n\t            String command[] = { \"cmd.exe\", \"/C\", \"cd \" + jbossHome + \"\\\\bin & \" + fName + \".bat \" + \" \" + params };\n\t            p = runtime.exec( command );\n\t            dump( p.getInputStream() );\n\t            dump( p.getErrorStream() );\n\t        } else {\n\t            String command[] = { \"sh\", \"-c\", \"cd \" + jbossHome + \"/bin; ./\" + fName + \".sh \" + \" \" + params };\n\t            p = runtime.exec( command );\n\t        }\n\t\n\t    } catch ( Exception e ) {\n\t        throw new MojoExecutionException( \"Mojo error occurred: \" + e.getMessage(), e );\n\t    }\n\t}\n\t\n\tprotected void dump( final InputStream input ) {\n\t    new Thread( new Runnable() {\n\t        public void run() {\n\t            try {\n\t                byte[] b = new byte[1000];\n\t                while ( ( input.read( b ) ) != -1 ) {\n\t                }\n\t            } catch ( IOException e ) {\n\t                e.printStackTrace();\n\t            }\n\t        }\n\t    } ).start();\n\t}\n\t\n\nThe `dump()` method is needed to flush the output buffers of the process - without it the process can't run, as is documented in the [API docs](http://java.sun.com/j2se/1.5.0/docs/api/java/lang/Process.html) too. However, this still doesn't work on Win 2003. Is there something missing or incorrect in this code? Is this a Bamboo issue? Any help is appreciated.\n\n**Update:** I tested the Maven build from command line on the server and it works perfectly. So it is apparently a Bamboo issue. Looks like the Bamboo agent ties all subprocesses forked from its build process directly or indirectly, and waits until all of them terminates before declaring the build to be finished. Which sounds sort of logical for a build agent... just has unfortunate consequences for me :-(\n\n**Update 2:** I posted the issue on the Bamboo discussion board too, got some responses from an Atlassian support guy but no decisive results yet.",
  "lastActivityDate": "2014-01-16T07:24:23.133",
  "title": "Why is my Bamboo build blocked by a Java subprocess?",
  "tags": [
    "java",
    "maven-2",
    "process",
    "locking",
    "bamboo"
  ],
  "docScore": 0,
  "comments": [],
  "answers": [],
  "creationYearMonth": "201401",
  "itemTally": 0,
  "owner": null
}