{
  "id": "/questions/2268791",
  "creationDate": "2014-02-18T12:48:42.407",
  "body": "\n\nMy application consists of three assemblies: a single EXE which references a couple of DLLs. The DLLs are private to my application - they are used only by this executable.\n\nShould these assemblies be given a strong name?\n\nFxCop suggests that they should - for all of the assemblies it currently produces:\n\n> CA2210: Sign <assembly> with a strong name key.\n\nHowever, [this advice](http://msdn.microsoft.com/en-us/library/h4fa028b%28VS.100%29.aspx) says:\n\n> In general, you should avoid strong-naming application EXE assemblies.\n\nand\n\n> you may want to avoid strong-naming components that are private to your application.\n\nShould I give these assemblies a strong name? What are the benefits of doing so (or not doing so) in this case?\n\n**Edit:**\n\nLooking at several applications with a similar structure, there seems to be no consensus on this issue. The binaries of [Paint.NET](http://www.getpaint.net/) and [Crack.NET](http://www.codeplex.com/cracknetproject) are not strong-named, whereas those of [.NET Reflector](http://www.red-gate.com/products/reflector/) and [Snoop](http://blois.us/Snoop/) are.\n\nInterestingly, with the Expression suite Microsoft have taken the latter approach: in Expression Blend, for example, they have chosen to strong-name sign both Blend.exe and the accompanying DLLs (such as Microsoft.Expression.Blend.dll).\n\nIt seems that I am unlikely to receive a simple answer to my first question: \"Should I give these assemblies a strong name?\". However, my second question still stands:\n\nAre there any benefits to strong-name signing binaries in this situation? Or, are there any benefits to not doing so?\n\n**Edit 2:**\n\nIf there are no overwhelming reasons to go either way, I am inclined towards giving my assemblies a strong name. I'd thus be interested in whether anyone can expand upon this (from the first link):\n\n\"strong-naming can make it more difficult to manage dependencies and add unnecessary overhead for private components.\"",
  "lastActivityDate": "2014-02-20T13:43:35.823",
  "title": ".NET: Should executables be strong-name signed? What about private DLLs?",
  "tags": [
    ".net",
    "assemblies",
    "strongname"
  ],
  "docScore": 0,
  "comments": [],
  "answers": [],
  "creationYearMonth": "201402",
  "itemTally": 0,
  "owner": null
}