{
  "id": "/questions/2839825",
  "creationDate": "2014-05-17T18:54:43.120",
  "body": "\n\nI know you don't like helping others in their homework but I have to make an XText grammar, write a sample code that matches this grammar and compile it to a html file.\n\nThe lecturer showed us the steps and everything worked for him... He said \"It's so simple it will be a 10 minute work for you\". And I believed that. However at home almost nothing works as expected. And of course no more lectures to go only the exam avaits me where I have to show what I done to pass. Moreover the e-mail I sent him bounced back by the mailer-demon...\n\nI got Xtext along with Eclipse IDE from the xtext website and I unpacked it and I followed the steps in the official tuturial to get the default project template to work. The tutorial is found here: [http://wiki.eclipse.org/Xtext/GettingStarted](http://wiki.eclipse.org/Xtext/GettingStarted)\n\nNow I'm at the step \"Model\". It says open the \"MyModel.mydsl\" I do that but the editor does not opened. It said:\n\n\"Could not open the editor: The editor class could not be instantiated. This usually indicates a missing no-arg constructor or that the editor's class name was mistyped in plugin.xml.\"\n\nSince everything is generated, the error message does not helped me...\nThere was an option to look at the stack trace (it was mile long) and on the top of it there was an exception:\n\njava.lang.IllegalStateException: The bundle has not yet been activated. Make sure the Manifest.MF contains 'Bundle-ActivationPolicy: lazy'.\n\nI opened Manifast.MF and Bundle-ActivationPolicy: lazy was set...\n\nI googled for the solution but no avail. It drove me nuts and I gave up.\n\nI have no experience with Eclipse and Java and XText, I just want to do my homework and forget everything until I will need it again...\n\nAnyone have experience with XText?\n\nAny help appreciated.\n\nps: I will be on it too and I might resolve the problem in several hours. But now I am at a loss.",
  "lastActivityDate": "2014-05-26T06:45:49.927",
  "title": "Getting XText to work",
  "tags": [
    "java",
    "eclipse",
    "eclipse-plugin",
    "xtext"
  ],
  "docScore": 0,
  "comments": [],
  "answers": [],
  "creationYearMonth": "201405",
  "itemTally": 0,
  "owner": null
}