{"OwnerUser":{"UpVotes":"25", "WebsiteUrl":"http://rintaun.tumblr.com", "Id":"30", "AccountId":"221520", "CreationDate":"2011-09-13T20:56:36.397", "AboutMe":"<p>I graduated from Ohio University in 2011 with a B.A. in Linguistics with a minor in Japanese. Nearly half of my time enrolled at Ohio was spent studying at Chubu University near Nagoya, Japan. I plan eventually to go to graduate school for foreign language education, to become certified to teach Japanese at the secondary level.</p>\n\n<p>In the mean time, however, I program (primarily in PHP and SQL). I also recently began working as a freelance Japanese-to-English translator, though I've translated anime and manga as a hobby in the past.</p>\n", "Age":"27", "Location":"Pittsburgh, PA", "DownVotes":"3", "Views":"10", "Reputation":"486", "DisplayName":"rintaun", "LastAccessDate":"2013-12-04T21:12:24.253"}, "comments":[], "Body":"<p>The only one which I have really used in that past is the <a href=\"http://www2.let.uu.nl/uil-ots/lexicon/\" rel=\"nofollow\">Lexicon of Linguistics</a>. There is also the <a href=\"http://www.sil.org/linguistics/GlossaryOflinguisticTerms/\" rel=\"nofollow\">Glossary of linguistic terms</a>, which does not seem to be as complete. A brief search also revealed this <a href=\"http://www.alphadictionary.com/articles/linguistics_glossary.html\" rel=\"nofollow\">Linguistics Glossary</a>, which has very few entries.</p>\n\n<p>In print, there are potentially more options, such as <a href=\"http://books.google.com/books/about/A_dictionary_of_linguistics_phonetics.html?id=3JtAOHLtlHoC\" rel=\"nofollow\">A Dictionary of Linguistics &amp; Phonetics</a>, but I imagine that these can become outdated rather quickly (which is not to say that websites do not, in practice, but they are theoretically easier to maintain). </p>\n", "Id":"100", "ParentId":"90", "CreationDate":"2011-09-14T11:01:19.053", "Score":"9", "PostTypeId":"2", "OwnerUserId":"30", "LastActivityDate":"2011-09-14T11:01:19.053", "CommentCount":"4"}