{"comments":[], "Body":"<p>The very first thing on the <a href=\"http://www.umich.edu/~jlawler/SyntaxTopics.pdf\"><em>Syntax Topics</em> handout</a> for my linguistics classes was: </p>\n\n<p>Syntax and morphology are the two parts of <strong><em>grammar</em></strong>. </p>\n\n<ol>\n<li><em>Morphology</em> deals with the <strong>internal</strong> economy of the word.   </li>\n<li><em>Syntax</em> deals with the <strong>external</strong> economy of the word.</li>\n</ol>\n\n<p>By which is meant that things that take place within the word are morphological, and things that take place between words are syntactic. Without a sense of \"word\", there would be no easy way to distinguish. But we'd need to distinguish anyway, because there are big differences between grammar as expressed morphologically and grammar as expressed syntactically. And plenty of examples to deal with.</p>\n\n<p>In particular, there are many analytic languages where grammar is almost all syntax, like English or Mandarin; and also many synthetic languages where grammar is almost all morphology, like Russian or Inuit. In an analytic language word order is terribly important, and there are many little auxiliaries and articles and particles to augment the word orders. In a synthetic language, word order is mostly a matter of style or taste, because the structure of the sentence is all tied up and color-coded with the agreement phenomena that morphology enables.</p>\n\n<p>There are other differences as well. Bound morphemes are very fussy about their order, and normally don't tolerate <strong>any</strong> variance. Syntax, however, spins off variation at the drop of a syllable, resulting in many competing patterns which frequently die off, but just as frequently fission into separate constructions. These are very different kinds of things, even if they do somehow \"cover the same ground\" semantically. It's not necessary to restrict one's observations to only the generalizations one wants to capture. Generalizations are nice, but facts are more useful.</p>\n\n<p>You may encounter people who insist that \"syntax\" <strong>means</strong> \"grammar\". That's just the theory talking; normally they're just parroting somebody else's dictum, and normally this marks them as generative theory adherents. That's harmless unless you think they mean what they say; really they just want you to use their terminology as a mark of its superiority. Sort of like saying that \"Mercedes-Benz\" <strong>means</strong> \"automobile\". I.e, it's not true, or even really helpful, but it lays out your allegiance clearly and that's the important thing.</p>\n", "Id":"1014", "ParentId":"836", "CreationDate":"2011-11-11T23:05:55.043", "Score":"6", "PostTypeId":"2", "OwnerUserId":"482", "LastActivityDate":"2011-11-11T23:05:55.043", "OwnerUser":{"UpVotes":"263", "WebsiteUrl":"http://www.umich.edu/~jlawler", "Id":"482", "AccountId":"1019614", "CreationDate":"2011-11-04T19:51:14.297", "AboutMe":"<p>I'm a retired linguistics professor. \nI enjoy answering questions.</p>\n\n<ol>\n<li>My <a href=\"http://www.umich.edu/~jlawler\" rel=\"nofollow\">Website</a> at the University of Michigan</li>\n<li>My <em>alt.usage.english</em> <a href=\"http://www.umich.edu/~jlawler/aue\" rel=\"nofollow\">English Grammar</a> pages</li>\n<li><a href=\"http://www.umich.edu/~jlawler/NorWesCon.html\" rel=\"nofollow\">Details and handouts</a> from some recent talks.</li>\n<li>A term paper about K-12 <a href=\"http://www.umich.edu/~jlawler/LanguageScience.pdf\" rel=\"nofollow\"><em>Language Science</em></a></li>\n<li>Two <a href=\"http://www.umich.edu/~jlawler/210CourspackPart1.pdf\" rel=\"nofollow\">scanned</a> <a href=\"http://www.umich.edu/~jlawler/210CourspackPart2.pdf\" rel=\"nofollow\">coursepacks</a> from my <a href=\"http://www.umich.edu/~jlawler/210.html\" rel=\"nofollow\">Intro Ling class</a>. (each ~100 pp)</li>\n<li>Scanned <a href=\"http://www.umich.edu/~jlawler/wow/scans/\" rel=\"nofollow\">teaching materials</a> from my <a href=\"http://www.umich.edu/~jlawler/wow\" rel=\"nofollow\">Etymology class</a></li>\n<li><a href=\"http://www.umich.edu/~jlawler/Subversive.pdf\" rel=\"nofollow\">Abstract</a> of a recent talk (4/12/12 in Denton, TX)</li>\n</ol>\n", "Age":"72", "Location":"Bellingham WA", "DownVotes":"2", "Views":"96", "Reputation":"4431", "DisplayName":"jlawler", "LastAccessDate":"2014-01-18T23:44:21.787"}}