{"OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://www.matsunoki.net", "Id":"93", "AccountId":"523692", "CreationDate":"2011-09-14T02:39:11.277", "AboutMe":"<p>Software developer in the NLP field.\nStudied Linguistics and Japanese at Tel Aviv University, Israel and Kyoto University, Japan.</p>\n", "Age":"36", "Location":"Tel Aviv, Israel", "DownVotes":"0", "Views":"4", "Reputation":"464", "DisplayName":"Oren Ronen", "LastAccessDate":"2011-12-12T12:22:21.660"}, "comments":[], "Body":"<p>As a linguist whose native language is Hebrew, I am somewhat qualified to answer this question.</p>\n\n<p>The fact that Modern Hebrew has heavy influences from both Semitic and European sources is pretty much universally accepted. That said, Zuckermann, who is a brilliant scholar otherwise, is also a known provocator who tends to overstate his ideas when writing for a non-academic audience. Hence his constant nagging about changing the language's name and the talk about mixed language genetics. There are even more extreme opinions around, such that Modern Hebrew is a fully slavic language with a relexified semitic vocabularly, but they are not taken seriously by most.</p>\n\n<p>Ignoring the extremist opinions, though - generally speaking, Modern Hebrew's is a complex beast with a syntax that is heavily slavic/germanic, but morphology that is distinctly semitic. The standard phonology used by most speakers also has its roots in germanic languages, but there are still groups of speakers (whose families are non-European immigrants) who retain other Hebrew phonology traditions. The vocabulary is mostly based on old Hebrew (though a lot of words were given new, modern meanings in a concious effort), with the usual large set of loan words found in languages spoken by a population consisting of a lot of immigrants.</p>\n", "Id":"102", "ParentId":"89", "CreationDate":"2011-09-14T11:17:02.550", "Score":"34", "PostTypeId":"2", "OwnerUserId":"93", "LastActivityDate":"2011-09-14T11:17:02.550", "CommentCount":"6"}