{"comments":[], "Body":"<p>The references in @Alex B.'s answer will do the job for a summary. <a href=\"http://pubman.mpdl.mpg.de/pubman/faces/viewItemFullPage.jsp?itemId=escidoc:273886\">Van Valin 2008</a> and ch.2 of Croft 2001 \"Radical Construction Grammar\" might also be useful. I'll try to summarize a family of views held by typologically oriented-linguists, but I couldn't guarantee that anyone other than myself accepts all of the statements made here.</p>\n\n<ol>\n<li>It is possible to find categories corresponding to nouns and verbs in different languages, but the approach will be a sophisticated version of the traditional grammar view. The prototypical noun is a referring expression (whence \"person, place, thing\"), and the prototypical verb is a predicating expression (whence \"action\"). It is then usually possible to pick out morphosyntactic properties associated with referring constructions and predicating constructions. </li>\n<li>But there are many languages where predicating and referring constructions do not always clearly distinguish two classes of words (i.e. \"nouns\" can also predicate, \"verbs\" can also refer). (Van Valin 2008 gives examples of this type of behavior from Nootka and Tagalog) However, it will be possible to find other types of constructions which can assist with the sorting. For example, I might find a language where an intransitive predicating construction does not make the distinction between nouns and verbs, but a transitive predicating construction does. Therefore, if you know roughly which types of word classes you are looking for, it is usually possible to pick out the right constructions that will give you the formal basis for distinguishing the desired number of word classes. Since the procedure is somewhat subjective, linguists will end up disagreeing on, say, whether a language has adjectives, since those who want adjectives can keep looking until they find the construction that distinguishes adjectives from intransitive verbs.</li>\n</ol>\n\n<p>The answer to the question is that \"noun\" and \"verb\" are comparative categories which are essential for typological studies, and all languages provide some formal basis for distinguishing them; The catch is that you have to start from meaning-based comparative categories, and the formal basis for distinguishing categories is subjective and language-specific. The chapter in the WALS on the order of Noun and Adjectives (<a href=\"http://wals.info/chapter/87\">Dryer 2011</a>), for example, includes a large number of languages for which most constructions do not distinguish adjectives and intransitive verbs; instead, \"adjective\" is understood as \"modifying expression\". An approximate meaning-based concept of \"adjective\" is needed if comparisons are to be made across languages of different grammatical profiles.</p>\n", "Id":"1036", "ParentId":"763", "CreationDate":"2011-11-17T00:10:56.907", "Score":"5", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2011-11-17T00:10:56.907", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}