{"comments":[], "Body":"<p>The Salishan language family (northwestern USA, southwestern Canada) is a famous locus of the debate about noun versus verb and lexical categories in general. The neighbouring Wakashan languages on Vancouver Island pose similar problems. Here are a few relatively recent references chronicling the arguments.</p>\n\n<ul>\n<li>Kinkade, M. Dale. 1983. Salish evidence against the universality of ‘noun’ and ‘verb’. <i>Lingua</i> 60.1: 25–40.</li>\n<li>van Eijk, Jan P. &amp; Hess, Thom. 1986. Noun and verb in Salish. <i>Lingua</i> 69: 319–331.</li>\n<li>Renker, Ann M. 1987. <i>Rethinking noun and verb: An investigation of AUX in a Southern Wakashan language</i>. Washington DC: American University, PhD dissertation.</li>\n<li>Birch, Barbara M. 1993. Another look at Salish nouns and verbs. <i>Papers for ICSNL XXVIII</i>: 19–26.</li>\n<li>Jelinek, Eloise &amp; Demers, Richard A. 1994. Predicates and pronominal arguments in Straits Salish. <i>Language</i> 70: 697–736.</li>\n<li>Demirdache, Hamida &amp; Matthewson, Lisa. 1995. On the universality of syntactic categories. <i>Proceedings of NELS</i> 25: 79–94.</li>\n<li>Mattina, Nancy. 1996. <i>Aspect and category in Okanagan word formation</i>. Burnaby BC: Simon Fraser University, PhD dissertation.</li>\n<li>Burton, Strang. 1997. Past tense on nouns as death, destruction, and loss. <i>Proceedings of NELS</i> 27: 65–77.</li>\n<li>Haag, Marcia. 1998. Word-level evidence for lexical categories in Salishan languages. <i>International Journal of American Linguistics</i> 64: 379–393.</li>\n<li>Davis, Henry &amp; Matthewson, Lisa. 1999. On the functional determination of lexical categories. <i>Revue Québecoise de linguistique</i> 27.2: 29–69.</li>\n<li>Davidson, Matthew. 2002. <i>Studies in Southern Wakashan (Nootkan) grammar</i>. Buffalo, NY: SUNY Buffalo, PhD dissertation.</li>\n<li>Davis, Henry. 2002. Categorial restrictions in Stʼátʼimcets (Lillooet) relative clauses. <i>Papers for ICSNL XXXVII</i>: 61–76.</li>\n<li>Nordlinger, Rachel &amp; Sadler, L. 2002. Nominal tense in cross-linguistic perspective. <i>Language</i> 80: 776–806.</li>\n<li>Montler, Timothy. 2003. Auxiliaries and other categories in Straits Salishan. <i>International Journal of American Linguistics</i> 69.2: 102–134.</li>\n<li>Stonham, John. 2004. <i>Linguistic theory and complex words: Nuuchahnulth word formation</i>, pp. 54–63. London: Palgrave Macmillan.</li>\n<li>Waldie, Ryan. 2004. <i>Nuu-chah-nulth denominal verbs</i>. Victoria BC: University of Victoria, master’s thesis.</li>\n<li>Davis, Henry. 2005. Constituency and coordination in Stʼátʼimcets (Lillooet Salish). Pp. 31–64 in Andrew Carnie, Sheila Anne Dooley, &amp; Heidi Harley (eds.), <i>Verb first: On the syntax of verb initial languages</i>. Amsterdam: John Benjamins.</li>\n<li>Wiltschko, Martina. 2005. The syntax of precategorial roots. <i>Proceedings of WSCLA 2005</i>.</li>\n<li>Davis, Henry &amp; Matthewson, Lisa. 2009. Issues in Salish syntax and semantics. <i>Languages &amp; linguistics compass</i> 3.4: 1097–1166.</li>\n<li>Koch, Karsten &amp; Matthewson, Lisa. 2009. <a href=\"http://www.linguistics.ubc.ca/sites/default/files/KochMatthewsonTL.pdf\" rel=\"nofollow\">The lexical category debate in Salish and its relevance for Tagalog</a>. <i>Theoretical linguistics</i> 35.1: 125–137.</li>\n<li>Wiltschko, Martina. 2009. Root incorporation: Evidence from lexical suffixes in Halkomelem. <i>Lingua</i> 119.2: 199–233.</li>\n</ul>\n\n<p>I think there is a newer paper by Henry Davis regarding lexical categories in Salishan but I don’t have the reference at hand.</p>\n", "Id":"1042", "ParentId":"763", "CreationDate":"2011-11-17T03:30:13.707", "Score":"4", "PostTypeId":"2", "OwnerUserId":"511", "LastActivityDate":"2011-11-17T03:30:13.707", "OwnerUser":{"UpVotes":"30", "WebsiteUrl":"http://www.drangle.com/~james", "Id":"511", "AccountId":"513739", "CreationDate":"2011-11-16T02:03:12.387", "AboutMe":"<p>I’m a PhD student in linguistics at the University of British Columbia. I work on Tlingit, a critically endangered language of northern British Columbia, the Yukon, and southeast Alaska. I also have extensive interests in the related Athabaskan languages, language documentation theory and practice, orthography design, morphological theory, phonological theory, and the syntax of noun phrases and relativization.</p>\n\n<p>I’ve been using TeX and friends for more than a decade. I use Xe(La)TeX, fontspec, memoir, and BibLaTeX extensively, and I am working on a BibLaTeX style for linguistics publications. Other packages I use frequently include pst-jtree, expex, and booktabs. I’m learning PGF/TikZ and considering developing a library to produce autosegmental representation diagrams. I do my writing in TeXShop, and my TeX programming in MacVim, having abandoned FSF Emacs and XEmacs due to their perpetually disappointing Unicode rendering.</p>\n", "Age":"35", "Location":"Vancouver, Canada", "DownVotes":"5", "Views":"13", "Reputation":"866", "DisplayName":"James C.", "LastAccessDate":"2013-11-03T19:13:48.097"}}