{"Body":"<p>An auxiliary issue is the point that number is a property of morphologial subsystems, rather than of languages themselves. Most languages only distinguish number on nouns and noun-indexing inflectional morphemes, and do so in a consistent way. Some languages, especially Oceanic languages, have different number-marking systems for different morphological subsystems. </p>\n\n<p>In Wala, lexical nouns have only a two-way distinction between singular and non-singular (i.e. two or more), but possessive suffixes show a four-way distinction between singular, dual, paucal and plural. (data is from a sketch I am preparing)</p>\n\n<p>In Hiw it gets even more interesting. Subject pronouns can be singular, dual, or plural. Object suffixes can be only singular or non-singular, and non-human NP's show no number contrast at all. Hiw also has verbal number, and the contrast is between plural and non-plural (i.e. one or two). So the verb meaning 'kill' has two suppletive stems, <strong>not</strong>, meaning to kill one or two people, and <strong>qetnog</strong>, to kill three or more people. This is a rare case of a subsystem where there is no singular number. (Hiw data is from <a href=\"http://alex.francois.free.fr/data/AlexFrancois_11ical_Vb-suppletion_handout.pdf\" rel=\"nofollow\">Francois 2009</a>)</p>\n", "Id":"1043", "ParentId":"57", "LastEditorUserId":"483", "CreationDate":"2011-11-17T23:28:33.250", "OwnerUserId":"483", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-11-18T01:25:08.787", "LastEditedUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "LastActivityDate":"2011-11-18T01:25:08.787", "Score":"5", "CommentCount":"1", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}