{"OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "comments":[], "Body":"<p>Something similar shows up in some of the Italian dialects.  The relevant dialects are the ones with the following two features:</p>\n\n<p>1) The <a href=\"http://en.wikipedia.org/wiki/Tuscan_gorgia\">Gorgia Toscana</a>:  After a vowel, <em>p, t</em> and <em>k</em> go to [ɸ], [θ] and [h].  This happens even when the triggering vowel is in the preceding word: <em>la casa</em> is [la'hasa] in dialects with this feature.  But it only affects single <i>p, t</i> and <i>k</i>, not the geminate consonants <i>pp, tt</i> and <i>kk</i>. </p>\n\n<p>2) <a href=\"http://en.wikipedia.org/wiki/Syntactic_doubling\">Syntactic doubling</a>: There are some specific words that, idiosyncratically, trigger gemination on the first consonant of the following word.  This has the effect of blocking the preceding sound change.  So <em>a casa</em> is [ak'kasa], and not [a'hasa]. </p>\n\n<p>If a Celticist were describing this sort of Italian they might say it had two mutation classes.  Some words trigger \"lenition\" or \"spirant mutation,\" others trigger \"hard mutation.\"   </p>\n\n<p>If I understand correctly, there are even minimal pairs of words that <i>only</i> differ in which mutation they cause.  So for instance, the clitic pronoun <em>si</em> doesn't trigger fortition, but the particle <em>sì</em>, meaning \"if,\" does.  This is a little like how, in Irish, <em>a</em> means \"his\" if it's followed by lenition, and \"hers\" if it isn't.  The Italian examples are not as dramatic as the Irish ones, though &mdash; my perception is that there are a <em>lot fewer</em> minimal pairs like this in Italian.</p>\n", "Id":"1044", "ParentId":"9", "CreationDate":"2011-11-18T18:14:16.800", "Score":"7", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2011-11-18T18:14:16.800", "CommentCount":"1"}