{"comments":[], "Body":"<p>The best article I've found on this so far is:</p>\n\n<p><em>Anderson, Diane and Judy Reilly (2002) \"The MacArthur communicative development inventory: Normative data for American sign language.\" Journalof Deaf Studies and Deaf Education, 7 (2): 83-106.</em></p>\n\n<p>This article is about the MacArthur report, which they created to allow parents to easily report their children's early signs in American Sign Language (ASL). With data from 69 children. The study only included deaf children with deaf parents. To skip to the pertinent information - children were documented as producing signs as early as 8 months, but until the age of 12 months they only produced concrete nouns. </p>\n\n<p>The study lists the first 35 words that signing children produce (averaged out across the sample - at least 50% of them had to be saying it before it was accepted) and compared it to a list of English speaking children from a similar study: The first seven items were identical and went <em>daddy, mummy, bye, ball, baby, no, shoe.</em> From there it's still very similar, lots of concrete nouns relating to clothing, food, animals and family members. So we see a similarity between English and Sign in terms of the content, even if it's not identical. For example English speaking children have words like <em>moo, woof, yumyum</em> and <em>uh oh</em> in their vocabulary whereas such sounds aren't so relevant to non-hearing children.</p>\n\n<p>In another study <em>Petitto, L.A. (2000). On The Biological Foundations of Human Language. In K. Emmorey and H.Lane (Eds.) The signs of language revisted: An anthology in honor of Ursula Bellugi and Edward Klima. Mahway, N.J.: Lawrence Erlbaum Assoc. Inc</em> (A PDF version of a similar paper can be found here  <a href=\"http://petitto.gallaudet.edu/~petitto/archive/biof.pdf\">http://petitto.gallaudet.edu/~petitto/archive/biof.pdf</a>) it is mentioned that children who grow up English/ASL bilingual and French/LSQ bilingual don't necessarily produce the same first words in both modalities. So a child's first spoken word might be <em>more</em> and their first sign might be DOG, but that's not to say that their first word might not overlap. Petitto gives the example of <em>chapeau</em>/CHAPEAU (hat) for the French/LSQ bilingual child.</p>\n\n<p>So although there has been very little cross-linguistic research done into children's first signs cross linguistically we can see from a comparison of ASL and spoken English that the exact words might not be the same, but that they generally fall into similar categories.</p>\n", "Id":"1073", "ParentId":"1046", "CreationDate":"2011-11-25T22:06:26.743", "Score":"10", "PostTypeId":"2", "OwnerUserId":"64", "LastActivityDate":"2011-11-25T22:06:26.743", "OwnerUser":{"UpVotes":"126", "WebsiteUrl":"http://www.superlinguo.com", "Id":"64", "AccountId":"900445", "CreationDate":"2011-09-13T21:45:12.903", "AboutMe":"<p>I have a PhD in linguistics. My areas of interest include language documentation, Tibeto-Burman linguistics, gesture, language play, LOLspeak, evidentiality and making bad puns. I blog about language and linguistics at www.superlinguo.com</p>\n", "Age":"29", "Location":"Australia", "DownVotes":"6", "Views":"40", "Reputation":"2016", "DisplayName":"LaurenG", "LastAccessDate":"2013-10-26T00:28:12.653"}}