{"OwnerUser":{"UpVotes":"30", "WebsiteUrl":"http://www.drangle.com/~james", "Id":"511", "AccountId":"513739", "CreationDate":"2011-11-16T02:03:12.387", "AboutMe":"<p>I’m a PhD student in linguistics at the University of British Columbia. I work on Tlingit, a critically endangered language of northern British Columbia, the Yukon, and southeast Alaska. I also have extensive interests in the related Athabaskan languages, language documentation theory and practice, orthography design, morphological theory, phonological theory, and the syntax of noun phrases and relativization.</p>\n\n<p>I’ve been using TeX and friends for more than a decade. I use Xe(La)TeX, fontspec, memoir, and BibLaTeX extensively, and I am working on a BibLaTeX style for linguistics publications. Other packages I use frequently include pst-jtree, expex, and booktabs. I’m learning PGF/TikZ and considering developing a library to produce autosegmental representation diagrams. I do my writing in TeXShop, and my TeX programming in MacVim, having abandoned FSF Emacs and XEmacs due to their perpetually disappointing Unicode rendering.</p>\n", "Age":"35", "Location":"Vancouver, Canada", "DownVotes":"5", "Views":"13", "Reputation":"866", "DisplayName":"James C.", "LastAccessDate":"2013-11-03T19:13:48.097"}, "comments":[], "Body":"<p>Your wanting a constraint against “trivial contours” ignores the fact that these may not be as trivial as you might suppose. Suppose you have a language with tones {L, LH, HL, H} and no vowel length. Then you could have a vowel like [V̌] which would be something like</p>\n\n<pre><code>  V\n / \\\nL   H\n</code></pre>\n\n<p>Now suppose you have another vowel in this language that has two high tone features.</p>\n\n<pre><code>  V\n / \\\nH   H\n</code></pre>\n\n<p>Since there’s no vowel length, we would expect this to be something like [V́], i.e. just a vowel with a high tone. Our description predicts this should be equivalent to</p>\n\n<pre><code>V\n|\nH\n</code></pre>\n\n<p>right? The language shouldn’t have any difference between one and two features. But suppose the language also said that it was okay to spread the second part of the contour onto a subsequent sonorant.</p>\n\n<pre><code>  V R\n / \\|\nL   H\n</code></pre>\n\n<p>So there should be a sequence like [V̀Ŕ] or [V̌Ŕ] arising from the above structure. If L is the unmarked tone then this should be a marked form with high tone on the sonorant. Contrast this with the following:</p>\n\n<pre><code>V R\n|\nH\n</code></pre>\n\n<p>Here the R gets the default tone which is L, so producing [V́R̀]. Now with L unmarked but a vowel with two H features then with a following sonorant we’d get</p>\n\n<pre><code>  V R\n / \\|\nH   H\n</code></pre>\n\n<p>which would show up as [V́Ŕ]. That’s a marked form, different from the unmarked [V́R̀] that should happen if L is the default, unmarked tone. This context is not exactly trivial but it does result from the “trivial contours” you describe if you expand the situation to include tone spread to sonorants which is a fairly common phenomenon.</p>\n\n<p>I know this isn’t really an answer for you. I can’t point to any literature offhand, but I think that you’d need some good data to justify prohibiting such forms. Just because they seem trivial in the trivial case doesn’t mean that they continue to be trivial in nontrivial situations. To test your hypothesis I’d look for something in western Africa where the Bantu and Bantoid languages have tone systems like this.</p>\n\n<p>(I’m handwaving about ‘marked’ and ‘unmarked’ because everybody does, but in a real article these terms would need to be well defined.)</p>\n", "Id":"1093", "ParentId":"1089", "CreationDate":"2011-11-30T01:45:52.253", "Score":"2", "PostTypeId":"2", "OwnerUserId":"511", "LastActivityDate":"2011-11-30T01:45:52.253", "CommentCount":"1"}