{"comments":[], "Body":"<p>Compound words are really complex, even if we limit it to noun-noun compounds. </p>\n\n<p>It looks like you're concerned with \"open\" compound nouns, not \"closed\" or hyphenated or <a href=\"http://www.sciencedirect.com/science/article/pii/0024384168900521\">idiomatic</a> compound nouns <a href=\"http://www.rickwalton.com/curricul/compound.htm\">like these</a> (what a list! right? corpus alert!). So - </p>\n\n<p>The syntactic definition of a compound noun is when the rule N -> N N can be recursively applied. Anything with more than two nouns is ambiguous in structure. ((coffee mug) holder) vs. (coffee (mug holder)) or whatever. </p>\n\n<p>Most languages are more predictable than English when it comes to \"headedness\" or left/right branching of closed noun compounds; Downing's conclusion to <a href=\"http://www.jstor.org/pss/412913\">\"On the Creation and Use of English Compound Nouns\"</a> is basically that the relationship is unpredictable from the semantics of the two words.</p>\n\n<p>My instinct (very scientific!) is that the concatenation vs. use of prepositions for noun-noun compounds is predictable by typology. My guess is that the form of compound nouns is correlated to <a href=\"http://wals.info/chapter/87\">the Adj/N word order</a> tendency of a language. Of course, this isn't really an answer, but I think the answer you're looking for is too big. It's sort of like asking why a language is SVO or SOV.</p>\n", "Id":"1126", "ParentId":"1116", "CreationDate":"2011-12-07T22:32:41.307", "Score":"5", "PostTypeId":"2", "OwnerUserId":"42", "LastActivityDate":"2011-12-07T22:32:41.307", "OwnerUser":{"UpVotes":"108", "WebsiteUrl":"http://twitter.com/mollyocr", "Id":"42", "AccountId":"896571", "CreationDate":"2011-09-13T21:04:13.347", "AboutMe":"<p>BA in Linguistics. Currently working as a localization &amp; QA specialist at a translation company in Minneapolis. Studied: Latin, Spanish, French, Arabic, Polish, Mandarin. Conlanger. Sci fi &amp; fantasy nerd, experimental cook, songwriter, artist and craftist. Also, I have a dog.</p>\n", "Age":"28", "Location":"Minneapolis, MN", "DownVotes":"8", "Views":"24", "Reputation":"933", "DisplayName":"mollyocr", "LastAccessDate":"2012-09-13T19:49:49.973"}}