{"OwnerUser":{"UpVotes":"35", "WebsiteUrl":"http://github.com/alekstorm", "Id":"76", "AccountId":"411223", "CreationDate":"2011-09-13T23:34:32.303", "AboutMe":"", "Age":"24", "Location":"Urbana, IL", "DownVotes":"17", "Views":"36", "Reputation":"1043", "DisplayName":"Alek Storm", "LastAccessDate":"2013-12-09T07:20:27.393"}, "comments":[], "Body":"<ol>\n<li>A diphthong is one sound segment created by a smooth transition between two targets within the same syllable. As a phonetic definition, this makes no theoretical claims about which phoneme(s) represent the articulation in the mind of the speaker.</li>\n<li>This statement is a bit vague, but is, as far as I can tell, true in some situations; see below.</li>\n<li><p>The number and character of underlying phonemes that a diphthong corresponds to varies by language and which researcher you talk to. Different kinds of evidence for a particular interpretation of field data are evaluated differently by each specialists, and mainstream phonology has yet to produce a theoretical framework that gives one clear answer to this question for each language.</p>\n\n<p>In English, for example, the diphthong [e͡ɪ] could be represented underlyingly as either the single phoneme /e͡ɪ/ or a sequence of two phonemes /ej/, where /j/ is the same segment that appears in /jɛs/ \"yes\". The latter analysis is tempting, since it would reduce the size of the phonemic inventory (all possible underlying segments) of English, but would have to explain the phonetic differences between the /j/ in \"yes\" and the /j/ in \"made\", which is much more like an [ɪ]. Of course, the addition of a transformation rule would be standard practice when faced with this situation, but we are then left with the basic question of which is simpler (and thus, more likely to be adopted as a strategy by native speakers): fewer phonemes, or fewer rules?</p></li>\n</ol>\n", "Id":"1151", "ParentId":"1149", "CreationDate":"2011-12-14T16:45:56.103", "Score":"3", "PostTypeId":"2", "OwnerUserId":"76", "LastActivityDate":"2011-12-14T16:45:56.103", "CommentCount":"11"}