{"Body":"<p>Let's say that a future participle is a non-finite form of a verb which is marked for future tense. For a language to have a chance of having a future participle, there must be:</p>\n\n<ol>\n<li>Verbal inflection for tense in addition to some other category, viz. subject agreement</li>\n<li>A process for forming non-finite forms</li>\n</ol>\n\n<p>These two requirements will narrow down the set of candidate languages quite significantly. Looking at the languages that meet these criteria, the question is whether it is more common for non-finite verb forms of this type to have neither subject nor tense marking, or to have one or the other, and whether it is more common for non-finite verbs to be marked only for subject agreement or only for tense when they are marked for at least one category. So what is more common? Tensed forms without subject marking, as in present, future, past participles; OR Tenseless forms with subject marking, as in the Portuguese \"personal infinitives.\"</p>\n\n<p>Some interesting possibly relevant data comes from Cristofaro (2007: 112), where a survey is made of marking on verbs in dependent clauses. What is found is that when subject or object agreement is not expressed on the verb, tense/aspect/mood tends not to be marked either.</p>\n\n<pre><code>                                T/A/M not expressed    T/A/M expressed\n\nArguments not expressed                127                49\nArguments expressed                    117                150\n</code></pre>\n\n<p>What I have no intuitions about is whether in non-finite verb forms which are tensed but lack agreement marking, there should be a reason for some tenses not to be expressed (e.g., future) when others (e.g., past) can be expressed.</p>\n\n<p>Cristofaro, S. (2007) \"Deconstructing categories: finiteness in a functional-typological \nperspective.\" in Nikolaeva, I. ed. <em>Finiteness</em>. OUP, pp.91--114.</p>\n", "Id":"1157", "ParentId":"1156", "LastEditorUserId":"483", "CreationDate":"2011-12-15T03:49:11.030", "OwnerUserId":"483", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-12-16T15:47:35.267", "LastEditedUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "LastActivityDate":"2011-12-16T15:47:35.267", "Score":"9", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}