{"Body":"<p><em>Segment</em> in its most general sense can be taken to mean something along the lines of \"small, discretely identifiable chunk of speech\", but it is used in all three of the ways you wondered about.</p>\n\n<p>It is often used as a synonym for both <em>phone</em> and <em>phoneme</em>, by people subscribing to the concepts of phones and phonemes; these people may use it with a directly equivalent meaning to <em>phone</em> or possibly even <em>phoneme</em>, but the latter usage perhaps more often appears clarified as <em>phonemic/contrastive segment</em>.</p>\n\n<p>It's also used as a way of avoiding those terms, either because your analysis is still in its early stages and you are not making any claims about the phonemic or otherwise status of any observed phones, or because, as @jlovegren suggested, you are trying to avoid committing to these concepts altogether.</p>\n\n<p>However, there is a third concept that is important to the idea of a <em>segment</em> that I think is worth noting here. <em>Segment</em> on its own generally refers to a bit of speech within a linear sequence of other bits of speech, but the development of autosegmental theory <a href=\"http://hum.uchicago.edu/~jagoldsm/Papers/AimsAutosegmental.pdf\" rel=\"nofollow\">(see pretty much anything by John Goldsmith)</a> basicallly allowed for speech to be represented on a series of tiers, instead of just a linear sequence, with things on higher-level tiers connecting to different parts of the tiers below them. A simple example would would be to have a tier that has the tones, and then another tier that has the phonemes/phones, with association lines showing which tones apply to which phonemes/phones.</p>\n\n<p><img src=\"http://i.stack.imgur.com/9Mwn0.gif\" alt=\"Simple example of tones with association lines to segments\"></p>\n\n<p><em>Autosegment</em> comes from <em>autonomous</em> + <em>segment</em>, because segments were more autonomous once they were freed from purely linear representations (which would have all the tones and everything bundled together). </p>\n\n<p>So, <em>segment</em> can be used to mean 'segment in a linear sequence', in opposition to <em>autosegment</em>, which means 'segment in a tiered, hierarchical representation'. <em>Autosegments</em> can therefore include tones, nasalization, and various other things that would not usually be considered stand-alone <em>segments</em>.</p>\n\n<p>Similarly, beyond autosegmental phonology, <em>segment</em> can also be used to mean 'the segmental (e.g. phonemic) material of a word/utterance', in opposition to <em>suprasegmental material</em>, which would be the tones etc. that exist 'above' the segmental material. This provides one distinction between segments and phonemes, if you work on a language in which tone is phonemic; the segments would be the consonant and vowel phonemes, while the tone phonemes (tonemes) would be described as suprasegmental features, or perhaps autosegments if you are using that approach.</p>\n\n<p>In my own experience, I most often encounter <em>segment</em> used in these last two ways, to make a distinction between either <em>autosegments</em> or <em>suprasegmental features</em>. But, <em>segment</em> is used in very diverse ways by different linguists.</p>\n", "Id":"1167", "ParentId":"1158", "LastEditorUserId":"51", "CreationDate":"2011-12-17T01:01:09.743", "OwnerUserId":"153", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-12-17T07:38:04.767", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2011-12-17T07:38:04.767", "Score":"6", "OwnerUser":{"UpVotes":"47", "WebsiteUrl":"", "DownVotes":"1", "Id":"153", "AccountId":"871764", "Views":"33", "Reputation":"1445", "CreationDate":"2011-09-18T03:14:58.320", "DisplayName":"Floating Tone", "LastAccessDate":"2012-05-27T05:07:04.410", "AboutMe":"<p>I'm a PhD candidate in linguistics, with diverse interests including phonetics, phonology, morphology, language documentation, historical linguistics and sociolinguistics. I am particularly interested in the languages of Africa, Papua New Guinea and Australia. I'm also very interested in methods of making linguistic knowledge and materials more accessible and available to linguists and non-linguists alike.</p>\n"}}