{"OwnerDisplayName":"user325", "LastEditDate":"2012-01-15T07:02:01.300", "Body":"<p>I am not aware of any particular reduplication process that lends itself to reiteration. It is worth pointing out that jlawler's example contains two different morphological processes utilizing reduplication which can combine, but it is not the same reduplicative process reiterated again, which might be what you're after. Your example shows, I think, that reduplication for intensity/contrast <em>could</em> be iterative; but whether other types of reduplication can be so, I am not sure.</p>\n\n<p>There might not be robust reduplication in English per se, but there are similar types of recursive structures which might interest you, which I've pointed out below.</p>\n\n<p>One example is anti-anti-anti-missile-missile-missile. I.e. to defeat your enemy's missile you need anti-missile, then they'll need an anti-(anti-missile)-missile, at which point you'll have to build anti-(anti-(anti-missile)-missile)-missiles. Another is: The mouse the cat the dog chased bit ran. That is, the mouse (that) the cat (that) the dog chased bit ran.</p>\n\n<p>There are processing limitations, which is why these center-embedded strings sound funny and are not common (if they are present at all) in natural speech. Ability to easily interpret them rapidly diminishes beyond one embedding; the same limit, it seems, for reduplication. Reduplication like center embedding strains our ability to keep track of structural relations between words, by forcing us to keep a word \"active\" in memory longer before we know its full context. So it's not surprising that in speech people rarely produce them. But, as you write, they can be processed with effort -- just like you can write out and do a complex math equation on paper that you couldn't solve in your head. And people will recognize them as grammatical after the parsing.</p>\n\n<p>Here is a paper on this type of reduplication in English:</p>\n\n<blockquote>\n  <p><a href=\"http://www.jstor.org/stable/4048061\" rel=\"nofollow\">Contrastive Focus Reduplication in English (The Salad-Salad Paper)</a>\n  Jila Ghomeshi, Ray Jackendoff, Nicole Rosen and Kevin Russell Natural\n  Language &amp; Linguistic Theory Vol. 22, No. 2 (May, 2004), pp. 307-357 \n  (article consists of 51 pages) Published by: Springer.</p>\n</blockquote>\n\n<p><em>(Update 1/15)</em> Here's a relevant LL post on the subject: <a href=\"http://languagelog.ldc.upenn.edu/nll/?p=3701#more-3701\" rel=\"nofollow\">Ask Language Log: Raped-Raped-Raped</a>. This post gives several more examples of the recursiveness of this process, as well as more  links to articles, for those interested.</p>\n", "Id":"1179", "ParentId":"1168", "CreationDate":"2011-12-17T21:49:45.580", "Score":"6", "PostTypeId":"2", "LastEditorDisplayName":"user325", "LastActivityDate":"2012-01-15T07:02:01.300", "comments":[]}