{"Body":"<p>In French, adjectives have been used in both orders for at least 250 years, with similar meaning differences as observed today.</p>\n\n<p>Since almost all adjectives in French can appear in both positions, it is not a good hypothesis to treat them all as homophonous words. It is also not a good idea to account for the possibility of two orders in French by assuming that N moves between the two ADJs, whereas it doesn't in English: this just restates the facts, and fails to account for the mirror order of French postnominal ADJs and English prenominal ADJs as in <em>\"un vase chinois bleu\"</em>, and <em>\"a Chinese blue vase\"</em>. </p>\n\n<p>The analysis I propose accounts for a lot of details, so it cannot be exposed in a 30 second jingle here. I don't say that order changes the semantics of the adjectives, but rather that ADJs in the two positions modify different elements of the N (a different form/order corresponds to a different meaning): a French postnominal ADJ modifies the whole semantics of the N whereas a prenominal ADJ modifies a subelement of the N. For example, in <em>\"une église ancienne\"</em> the ADJ bears on the whole N, hence the meaning of a church that is old; but in <em>\"une ancienne église\"</em> the ADJ only bears on the time interval in the semantics of the N, hence the meaning of something that had the characteristics of a church at some time in the past (but doesn't anymore). In English, nouns are introduced in syntax with Number, so the only postnominal ADJs are from a very restricted class that can modify the complex N+NUM.</p>\n\n<p>French ADJs are often claimed to be predominantly postnominal. The claim is unclear. As a first impression, there is a greater number of different ADJs that occur in postnominal position than in prenominal position. But ADJs that are typically prenominal tend to have much higher frequency of use than any particular postnominal ADJ. Since there are many more individual ADJs that are postnominal, on the whole, occurrences of postnominal ADJs outnumber occurrences of prenominal ADJs by a margin of about two to one. The higher percentage of occurrences of ADJs in postnominal position and the greater diversity of ADJs appearing postnominally are probably the reason why postnominal placement of ADJs is often assumed to be the “normal” surface position for ADJs in Romance languages. The foregoing discussion should make it clear that this assumption of a “normal” position does not reflect a linguistically valid property.</p>\n\n<p>Moreover, almost all ADJs can appear in either position in French. It\"s just that some resulting meanings are pragmatically less likely to correspond to some world situation, so they occur infrequently. But pragmatic likeliness is not a measure of grammaticality.</p>\n", "Id":"1181", "ParentId":"1163", "LastEditorUserId":"111", "CreationDate":"2011-12-19T14:51:23.193", "OwnerUserId":"603", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-02-24T14:49:26.507", "LastEditedUser":{"UpVotes":"308", "DownVotes":"10", "Id":"111", "AccountId":"514008", "Views":"172", "Reputation":"5430", "CreationDate":"2011-09-14T09:33:29.710", "DisplayName":"Alenanno", "LastAccessDate":"2014-01-19T00:38:35.883", "AboutMe":"<p>I'm a student majoring in Languages (branch: Linguistics), currently working as a freelance translator. I've recently discovered <a href=\"http://db.tt/WpiKeReH\" rel=\"nofollow\">Dropbox</a> and I'm going to use it for my needs! :)</p>\n\n<p><em><strong>I love</em></strong><br>\nLanguages, Movies (Fantasy, Sci-Fi, Tarantino, etc.), Music, 3D Graphics, books and so on. </p>\n\n<p>Appointed ♦ Moderator Pro Tempore on <a href=\"http://area51.stackexchange.com/proposals/6673/linguistics?referrer=GlDGLdkDYNxMg1X13CJ1vg2\">Linguistics SE</a>, <a href=\"http://area51.stackexchange.com/proposals/6388/chinese-language-usage?referrer=XzTG1Nz01tc01sJEhak_6g2\">Chinese SE</a> and the <a href=\"http://area51.stackexchange.com/proposals/10848/russian-language-usage?referrer=J7IYS3ZUomUDvVVb-6SmDQ2\">Russian SE</a> site. If you're interested in other Stack Exchanges, try the <a href=\"http://area51.stackexchange.com/proposals/42949/italian-language-usage?referrer=ALVtGpK0tjLp1Lw15QCaUA2\">Italian SE</a> site.</p>\n\n<p>I like to lurk on other sites' Metas. <em>Meta is fun!</em> </p>\n\n<p><strong>My feature requests</strong>:</p>\n\n<ol>\n<li><a href=\"http://meta.stackoverflow.com/q/135786/176533\">Alert a moderator when an answer is improved after a post notice</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/138273/176533\">Automatically add chat event to the community bulletin (or make it easier)</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/121363/176533\">Give 10k users the ability to see the total count of flags they've handled</a></li>\n</ol>\n\n<p><strong>Moderator issues</strong>: If you have concerns or want to contact me about my moderation, you can find/ping me either in the <a href=\"http://chat.stackexchange.com/rooms/1336/linguistics\">Linguistics SE chat room</a> or <a href=\"http://chat.stackexchange.com/rooms/1984/chinese-language-and-usage\">CL&amp;U chat room</a>; if I'm not there or I'm \"idle\", just ping me! Please <em>avoid</em> using my personal email for such things. Use the chat rooms.</p>\n\n<hr>\n\n<p><strong>Languages List</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <sup>Languages with  * = learning on my own</sup></p>\n\n<p><strong>Mother Tongue:</strong> Italian, Sardinian;<br>\n<strong>Fluent:</strong> English, Spanish;<br>\n<strong>Less Fluent:</strong> French, German, Russian;<br>\n<strong>Learning:</strong> Japanese*, Chinese*, Swedish*, Greek*, Finnish*;<br>\n<strong>Willing to learn:</strong> Welsh, Korean, Dutch, Arabic, Hebrew, Hindi [to be continued]</p>\n\n<p>Me gusta el Español.<br>\nJ'aime le Français.<br>\nDeutsch gefällt mir.<br>\nМне нравится Русский язык.<br>\n私は日本語が好きです。<br>\n我爱中文。<br>\nJag älskar Svenska.</p>\n"}, "LastActivityDate":"2012-02-24T14:49:26.507", "Score":"9", "CommentCount":"3", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"603", "AccountId":"1117006", "Views":"4", "Reputation":"114", "CreationDate":"2011-12-19T14:51:23.193", "DisplayName":"Denis Bouchard", "LastAccessDate":"2011-12-19T14:51:23.193"}}