{"OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "comments":[], "Body":"<p>I'll answer according to a theory of language change mostly associated with Croft, according to which change comes from intra-speaker variation. In an evolutionary model of language change, changes may be propagated via neutral selection (linguistic variants randomly come in and out of existence, but more frequent ones should be the most durable) and via replicator selection (where variants produced by certain prestigious groups people have a better chance of enduring).</p>\n\n<p>We expect innovation (upheaval in customary forms) to happen more frequently when there is greater variation in the community, and when there are groups of people with whom prestige is associated. An urban setting doesn't necessarily have to have both of these, things but they tend to. We should expect innovation in urban settings especially when (i) the residents are coming in from various parts of the country where different varieties are spoken (more variation), (ii) within the urban center itself, there are people who are considered prestigious, and whose speech tends to get disproportionately emulated. If these two conditions are met (and additionally we assume relatively free interaction between speakers), then, according to the theory, we should expect the relatively rapid emergence of a new urban speech variety.</p>\n\n<p>So I think the answer to the question is that this is a valid assumption, since the factors encouraging language change tend to be very frequently present when new urban centers form.</p>\n\n<p>Some downloadable papers:<br>\nCroft (2010): <a href=\"http://www.mendeley.com/research/origins-grammaticalization-verbalization-experience/\">The Origins of grammaticalization in the verbalization of experience</a></p>\n\n<p>Baxter et al (2009): <a href=\"http://www.phy.umist.ac.uk/~ajm/bbcm09.pdf\">Modeling language change: An evaluation of Trudgill's theory of the development of New Zealand English</a></p>\n", "Id":"1192", "ParentId":"1188", "CreationDate":"2011-12-22T01:15:29.677", "Score":"8", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2011-12-22T01:15:29.677", "CommentCount":"5"}