{"OwnerUser":{"UpVotes":"1", "DownVotes":"0", "Id":"619", "AccountId":"158415", "Views":"0", "Reputation":"141", "CreationDate":"2011-12-26T16:51:02.143", "DisplayName":"Aant", "LastAccessDate":"2013-01-30T14:36:26.420"}, "comments":[], "Body":"<p>In these days of computational linguistics it would be possible, given the right corpora, to assign quantitative frequencies for false friends between arbitrary languages (at least in theory). However, since I don't have access to any remotely suitable tools, I'll approach this as a thought-experiment.</p>\n\n<p>Certainly closely related languages are by definition more likely to have cognates, but then you need to account for the probability that their meanings have diverged sufficiently to count. (That is, I agree with you when you say</p>\n\n<blockquote>\n  <p>when they do sound similar, they're more likely to\n  have the same meaning compared to similar sounding words in closely\n  related languages</p>\n</blockquote>\n\n<p>but I would have thought this was an argument for false friends in closely related languages being <em>less</em> common than in distantly related ones!)</p>\n\n<p>As you say, another reason that closely related languages are a fertile source of false friends is that their phonologies are often similar. Here the phonological similarity is the crucial point, and one would expect just as many false friends for this reason as in any pair of languages, related or otherwise, with such similarity. Larry Trask's book on historical linguistics gives a table of apparently uncanny similarities between Ancient Greek and Hawaiian (IIRC - I don't have it in front of me) that arise out of pure coincidence. Some of the glosses are identical while others are similar but distinct enough to be considered false friends. His point in the context of the book is that such similarities are not sufficient to posit common ancestry, so he's not specifically looking for false friends, but it's not difficult to believe he could have found many false friends if he set out to do so.</p>\n\n<p>To summarise: as I said I have no data to back up these assertions, but my intuition is that - particularly if, given one language, you are allowed to pick \"close\" and \"distant\" languages by hand rather than at random - it would not surprise me if you could come up with examples where the distant language had as many or more false friends as the close one.</p>\n", "Id":"1200", "ParentId":"1199", "CreationDate":"2011-12-26T17:49:31.443", "Score":"4", "PostTypeId":"2", "OwnerUserId":"619", "LastActivityDate":"2011-12-26T17:49:31.443", "CommentCount":"3"}