{"Body":"<p>I think that the concept of false friends is only useful in the case of pairs of words which can induce confusion in second language learners. If we take this perspective, then false friends is only a useful concept for pairs of languages which have a significant portion of vocabulary with shared origin. So a Japanese person learning Korean might try to rely on their knowledge of Sino-Japanese vocabulary to guess at the meanings of Sino-Korean words, since both languages have a significant number of Chinese loans. But a Japanese person learning, say, Malagasy would not develop any sort of viable strategy for guessing the meanings of Malagasy words by relying on Japanese vocabulary, since there is not any significant vocabulary of shared origin between the two languages.</p>\n\n<p>Under this perspective, the important factor is not necessarily how closely two languages are related, but the antiquity of their shared vocabulary set. While English and Spanish are related only at the level of Indo-European, English has many learned Latin borrowings from medieval times that have close cognates in Spanish. So you get false friends like 'traduce' and 'traducir'. False friends of this type are likely to trip up beginning learners, but the differences in meaning are enough that a more advanced learner will not be deceived. The kinds of false friends that trip up advanced learners are the ones where the difference in meanings is very subtle. An interesting example is given in Weinreich (1954/1974:54) of a word in the variety of Italian spoken in New York City, <em>giobba</em>, meaning \"work that is found, and for which one has no attachment and no spiritual interest.\" Presumably, an American English speaker learning this dialect of Italian could be confused into thinking that <em>giobba</em> and <em>job</em> have the same meaning, and might not have the occasion to discover their error for a long time. But this kind of slight error is something that a beginning learner will probably accept and not bother to adjust for.</p>\n\n<p>Another factor would be the reliability of the connection between pairs of words in two languages. If a learner figures out early on that pairs of related words do not have a reliable meaning correspondence, then he/she will be less likely to get deceived by false friends. If meaning correspondences tend to be regular and reliable, then the false friends that do arise will trick learners more easily.</p>\n\n<p>I think then that in absolute terms, there will be more false friends in closely related languages, but if we only count false friends where the difference in meaning is very sharp, then there will be more false friends in languages whose shared vocabulary is more antiquated.</p>\n\n<p>Weinreich U. (1974) Languages in Contact. Mouton (originally published in 1954)</p>\n", "Id":"1201", "ParentId":"1199", "LastEditorUserId":"22", "CreationDate":"2011-12-26T20:24:59.843", "OwnerUserId":"483", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-12-26T20:55:14.177", "LastEditedUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "LastActivityDate":"2011-12-26T20:55:14.177", "Score":"5", "CommentCount":"1", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}