{"comments":[], "Body":"<p>You are probably thinking of the section \"Acoustic analysis of Vowels\" in the chapter called \"Acoustic Phonetics\" (pp.170--1 in the 4th ed. of \"A course in Phonetics\"). Here are the tricks Ladefoged discusses</p>\n\n<ol>\n<li>Whispering the vowels makes F2 sound apparent.</li>\n<li>For the highest pitch whistle, your tongue and lips are shaped as for high front rounded [y], for the lowest whistle, your tongue and lips are shaped as for [u].</li>\n<li>Speaking with a creaky voice makes F1 apparent.</li>\n<li>Make a vowel articulation and hold your glottis shut, then flick your finger against the skin on your throat just above the larynx, and you will hear a sound where F1 is apparent.</li>\n</ol>\n\n<p>Ladefoged has also written in his (1967, p.86) \"Three areas of experimental phonetics\" something that I think is very useful to bear in mind as you start to track formants with a computer:</p>\n\n<blockquote>\n  <p>...the procedure for determining formant frequencies used in the current\n  research consists of (1) listening to the sound and estimating from\n  experience of analysing and synthesizing similar sounds the possible\n  parts of the spectrum in which the formants might be located and\n  (2) examining the spectrographic analyses and finding the centre\n  frequencies of the regions within those parts that have a relatively\n  high intensity. The essential weakness of this procedure is its\n  circularity---the necessity of having to prejudge the answer before\n  examining the acoustic data.</p>\n</blockquote>\n", "Id":"1205", "ParentId":"1203", "CreationDate":"2011-12-27T16:13:47.130", "Score":"11", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2011-12-27T16:13:47.130", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}