{"OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "comments":[], "Body":"<p>I think that the main factors are going to be language external. Japanese people do not know English very well for reasons having to do with how English is used in Japan, and reasons having to do with the general language ecology in Japan. </p>\n\n<p>Scandinavians tend to have very good English, and there are language-internal reasons (their native language has a large number of vowels, there are many Germanic cognates, etc.) as well as external reasons (English has become established as a lingua Franca in Northern Europe, there is intensive English education and ample opportunities to practice, living in a multilingual society, they are comfortable communicating in a language that they don't master, etc.). So it could be debatable whether the language-internal or the language-external reasons are more important in determining the English skills of Scandinavians. </p>\n\n<p>But consider English in Nigeria. Roughly 400 languages are spoken in Nigeria, most of which are as different from English as Japanese is from English, but educated Nigerians tend to have a high success rate in learning English as a second language. In this case, there is nothing about their native languages that helps to explain their success in learning English. The status English has in government and business in that country, as well as the multilingual nature of the society, have to play a large role.</p>\n\n<p>My hunch then is that grammar is not the main barrier for Japanese people to learn English, because grammar is not a barrier for English learning in countries where the sociolinguistic situation is favorable for English learning; I think that all of the main barriers have to do with the sociolinguistic situation in Japan: that the society is basically monolingual, and that languages other than Japanese do not have an important status in any major public sphere.</p>\n", "Id":"1214", "ParentId":"1208", "CreationDate":"2011-12-29T02:28:21.497", "Score":"11", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2011-12-29T02:28:21.497", "CommentCount":"1"}