{"comments":[], "Body":"<p>Evidently the source you may want for this is the collection \"<a href=\"http://scholar.google.com/scholar?cluster=15090604949887269810&amp;hl=en&amp;as_sdt=5,36&amp;sciodt=0,36\" rel=\"nofollow\">Paradigms: the economy of inflection</a>\" edited by Frans Plank, 1991. I don't have access to the full text in electronic form, but in particular the article \"Rasmus Rask's Dilemma\" provides a list of criteria for distinguishing cases from postpositions. If it's of interest I can request the book from the library and summarize it here.  Also see \"Noun phrase structure in the languages of Europe\" by Plank, 2003. </p>\n\n<hr>\n\n<p>Also: \nFriedman in Studia gramatyczne, 1991 has a paper titled <a href=\"http://mahimahi.uchicago.edu/media/faculty/vfriedm/064Friedman91.pdf\" rel=\"nofollow\">\"Romani nominal inflection: Cases or postpositions\"</a> where he examines this question in Romani (and uses Georgian as one of his models).</p>\n\n<p>Romani is strictly prepositional -- with the exception of five postpositions, which have nearly exactly replaced five original Sanskrit cases. Scholars over the years have variously described these as cases or postpositions. Friedman presents the arguments in favor of and against each interpretation. His conclusion with Romani is that it is best to treat these as case suffixes since (1) they undergo assimilation, (2) the language is otherwise prepositional, (3) the case suffixes have no independent lexical meaning and (4) just because their origin was as postpositions does not matter synchronically. But I recommend reading the whole paper for an excellent example of the reasoning and evidence that went into his conclusions, which is what I believe you are asking for.</p>\n", "Id":"1216", "ParentId":"1178", "CreationDate":"2011-12-29T05:00:03.110", "Score":"4", "PostTypeId":"2", "OwnerUserId":"537", "LastActivityDate":"2011-12-29T05:00:03.110", "OwnerUser":{"UpVotes":"556", "WebsiteUrl":"http://www.markbeadles.com/", "Id":"537", "AccountId":"297827", "CreationDate":"2011-11-27T02:50:39.717", "AboutMe":"<p>Polymathic renaissance redneck</p>\n", "Age":"47", "Location":"Columbus, OH", "DownVotes":"22", "Views":"30", "Reputation":"3876", "DisplayName":"Mark Beadles", "LastAccessDate":"2013-02-02T04:23:30.703"}}