{"comments":[], "Body":"<p>As mentioned above, anything that is related to the study of handwriting in <em>historical</em> documents is part of <a href=\"http://en.wikipedia.org/wiki/Paleography\">paleography</a>. Paleography is a large discipline that covers all kinds of writing systems from widely different periods, and it includes the study of handwritten (as opposed to printed or epigraphical) writing. Handwritten forms of writing are often labelled as <a href=\"http://en.wikipedia.org/wiki/Cursive\">cursive or running writing</a>, i.e. scripts typically used for everday purposes and/or for private correspondence. The letters of cursive writing tend to be \"sloppier\" than printed ones and they tend to be interconnected much more frequently.</p>\n\n<p>For the scientific study of (past and present) writing systems in general there are the terms <em>graphemics</em> and <em>graphetics</em>. As in <em>phonemics</em> vs. <em>phonetics</em>, the former one is mainly concerned with the system of distinctive signs, while the second one is concerned with how those distinctive signs appear in actual scripts. </p>\n\n<p>Graphemics and graphetics are not to be confused with graphology, the latter being a pseudo-scientific method of drawing conclusions about someone's psychology by analysing their personal handwriting.</p>\n\n<p>There is to my knowledge no specific term for the scientific analysis of handwritten (as opposed to printed) writing. If you are looking for more information, your best bet is probably to search for <em>cursive writing</em> of whatever script you are interested in.</p>\n", "Id":"1217", "ParentId":"1197", "CreationDate":"2011-12-29T17:18:36.517", "Score":"6", "PostTypeId":"2", "OwnerUserId":"631", "LastActivityDate":"2011-12-29T17:18:36.517", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"631", "AccountId":"375129", "Views":"1", "Reputation":"61", "CreationDate":"2011-12-29T16:45:59.550", "DisplayName":"Ulmo", "LastAccessDate":"2013-05-17T08:16:41.393"}}