{"Body":"<p>Despite the existence of a name for a subfield ('graphetics') and a reasonable expectation of study, the currently accepted faculty of linguistics as practiced in most universities these days does not consider handwriting as part of their domain; that is, linguists on the whole do not tend to study and discuss handwriting. Linguistics as currently practiced deals only with  spoken language). </p>\n\n<p>The faculties where handwriting is studied in general are cognitive psychology (with respect to how people read it) or clinical psychiatry (evidence of problems shown in handwriting phenomena (the respectable arm of graphology), computer vision (recognition of handwritten characters), or history/archaeology (deciphering of old scripts). Written language (where handwritten script is a special, but not specially considered, case, is studied in literature departments.</p>\n\n<p>If you want to find out about handwriting academically, I suggest looking to foreign language teaching literature for the individual scripts concerned. For example, look in instruction material for Hebrew, in English, that describes how one is supposed to draw the script version of characters. As that might be too practical, more scholarly discussion of handwriting will probably be limited to a foreign language teacher's special monograph, that is, most likely -not- a linguist but a specialist in one particular language/writing system.</p>\n", "Id":"1219", "ParentId":"1197", "LastEditorUserId":"4", "CreationDate":"2011-12-31T22:59:53.657", "OwnerUserId":"4", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-12-31T23:06:55.690", "LastEditedUser":{"UpVotes":"432", "WebsiteUrl":"", "Location":"United States", "Id":"4", "DownVotes":"2", "AccountId":"167219", "Views":"42", "Reputation":"1906", "CreationDate":"2011-09-13T20:24:01.087", "DisplayName":"Mitch", "LastAccessDate":"2014-01-15T11:56:51.610", "AboutMe":"<p>Native speaker of American English (AmE) with touches of Southern AmE.\nProficient in French and German. Elementary knowledge of Mandarin. Basic knowledge of linguistics.</p>\n"}, "LastActivityDate":"2011-12-31T23:06:55.690", "Score":"2", "OwnerUser":{"UpVotes":"432", "WebsiteUrl":"", "Location":"United States", "Id":"4", "DownVotes":"2", "AccountId":"167219", "Views":"42", "Reputation":"1906", "CreationDate":"2011-09-13T20:24:01.087", "DisplayName":"Mitch", "LastAccessDate":"2014-01-15T11:56:51.610", "AboutMe":"<p>Native speaker of American English (AmE) with touches of Southern AmE.\nProficient in French and German. Elementary knowledge of Mandarin. Basic knowledge of linguistics.</p>\n"}}