{"OwnerUser":{"UpVotes":"0", "Location":"United States", "DownVotes":"0", "Id":"642", "AccountId":"1051369", "Views":"1", "Reputation":"176", "CreationDate":"2012-01-03T09:14:32.700", "DisplayName":"sarah", "LastAccessDate":"2012-01-08T08:52:32.500", "AboutMe":"<p>The English language is a relative strength for me, and I'm often \"offended\" by what seem to me to be mistakes in written or spoken language in a way I believe is similar to the way my husband is \"offended\" by an out of tune string on a guitar.</p>\n\n<p>Although I usually can't specifically define, certainly not with the appropriate jargon, the perceived language clunker, research tells me that when I think something is \"out of tune\" language-wise, it usually is.  </p>\n\n<p>While on the one hand, I wish I could experience the bliss of ignorance, on the other, I've always had a great affection for English and a strong desire to improve my grasp of it.  Now, due to a notable health-related degradation, my previously slightly-greater-then-average-yet-unquestionably-less-than-stellar language skills need work. I'm thinking EL&amp;U may be helpful.</p>\n\n<p>EL&amp;U has forced me to face up to my filthy procriptivist ways and I have begun the painful purging process. </p>\n\n<p>Other than a bit of Brit speak symptomatic of a touch of Anglophilia, my non-English language skills consist of shaky pronunciations and vague comprehension of the following words and phrases: croissant, bon voyage, quiche, laissez les bons temps rouler, que pasa, hola, and hasta la vista, bambino. </p>\n"}, "comments":[], "Body":"<p>As I posted on <a href=\"http://english.stackexchange.com/posts/51252/edit\">english.stackexchange</a>, in response to essentially the same question (along with a protracted jumble of further results of my inexpert research), the short answer can be found in <a href=\"http://www4.uwm.edu/FLL/linguistics/dialect/staticmaps/q_19.html\">these maps</a> from Professor <a href=\"http://www4.uwm.edu/FLL/linguistics/dialect/index.html\">Bert Vaux's Dialect Survey</a>:</p>\n\n<p><img src=\"http://i.stack.imgur.com/hNHgV.png\" alt=\"the final vowel in &quot;Monday,&quot; &quot;Friday&quot;, etc. \"></p>\n\n<p>Also, <a href=\"http://accent.gmu.edu/browse_maps/namerica.php\">the speech accent archive</a>, suggests that the [i] (?) ending is popular in the American Southeast, particularly in <a href=\"http://accent.gmu.edu/searchsaa.php?function=detail&amp;speakerid=76\">Louisville, Kentucky</a>; <a href=\"http://accent.gmu.edu/searchsaa.php?function=detail&amp;speakerid=83\">Atlanta, Georgia</a>; <a href=\"http://accent.gmu.edu/browse_language.php?function=detail&amp;speakerid=556\">Belmont, Mississippi</a>; <a href=\"http://plantersville,%20arkansas\">Plantersville, Arkansas</a>; <a href=\"http://accent.gmu.edu/browse_language.php?function=detail&amp;speakerid=445\">Elmore, Alabama</a>; and <a href=\"http://accent.gmu.edu/searchsaa.php?function=detail&amp;speakerid=159\">Pensacola, Florida</a>. </p>\n\n<p>I hope this helps.</p>\n", "Id":"1222", "ParentId":"1195", "CreationDate":"2012-01-03T09:27:15.050", "Score":"6", "PostTypeId":"2", "OwnerUserId":"642", "LastActivityDate":"2012-01-03T09:27:15.050", "CommentCount":"3"}