{"OwnerUser":{"UpVotes":"30", "WebsiteUrl":"http://www.drangle.com/~james", "Id":"511", "AccountId":"513739", "CreationDate":"2011-11-16T02:03:12.387", "AboutMe":"<p>I’m a PhD student in linguistics at the University of British Columbia. I work on Tlingit, a critically endangered language of northern British Columbia, the Yukon, and southeast Alaska. I also have extensive interests in the related Athabaskan languages, language documentation theory and practice, orthography design, morphological theory, phonological theory, and the syntax of noun phrases and relativization.</p>\n\n<p>I’ve been using TeX and friends for more than a decade. I use Xe(La)TeX, fontspec, memoir, and BibLaTeX extensively, and I am working on a BibLaTeX style for linguistics publications. Other packages I use frequently include pst-jtree, expex, and booktabs. I’m learning PGF/TikZ and considering developing a library to produce autosegmental representation diagrams. I do my writing in TeXShop, and my TeX programming in MacVim, having abandoned FSF Emacs and XEmacs due to their perpetually disappointing Unicode rendering.</p>\n", "Age":"35", "Location":"Vancouver, Canada", "DownVotes":"5", "Views":"13", "Reputation":"866", "DisplayName":"James C.", "LastAccessDate":"2013-11-03T19:13:48.097"}, "comments":[], "Body":"<p>“The Americas” is a really large area and the languages within it are as diverse as Asia. You can make some strong generalizations about certain subparts though. The area I work in is the Pacific Northwest Coast of North America. This area has a number of interesting shared phonological features: large consonant inventories, asymmetric vowel inventories, large inventories of ejectives, few labials and nasals, complex onsets and codas, vowelless syllables, tendency for velars to be palatalized, lots of unusual morphophonological interactions, etc., and all this across more than eight unrelated families. Although those features are somewhat common to the rest of western North America, none of these apply in the eastern half of North America. So your requirement for traits that are shared across both continents and the Caribbean is hard to fulfill since you’d need to do extensive research and would still find only a few things in common. That would throw into doubt the usefulness of the few features you do find in common, since when weighed against all the unshared features they begin to look like statistical noise and coincidence.</p>\n", "Id":"1242", "ParentId":"1236", "CreationDate":"2012-01-08T19:54:42.620", "Score":"3", "PostTypeId":"2", "OwnerUserId":"511", "LastActivityDate":"2012-01-08T19:54:42.620", "CommentCount":"2"}