{"comments":[], "Body":"<p>If you want a very quick and simple program to slow down a sound file of speech, use VLC Player. It is one of the best free media players at any rate. It cannot transcribe anything, though; but you could get your audio files for the sounds or words you want to study from elsewhere.</p>\n\n<p>Press - (minus) to go slower, + (plus) for faster. It keeps the pitch intact; that is, it keeps the frequency of the short waves (high frequency) in instrumental music and voices at the same pitch for the human ear. That is what it is designed to do.</p>\n\n<p>It does a very good job at slowing voices down, though speeding them up is not always as smooth (but still reasonable). Especially speeding up vibrato in classical music goes wrong, which was only to be expected: the program only takes into account the frequency at the higher frequencies, while each vibration in vibrato takes much longer to complete than the normal vibrations that result in pitch for the human ear. At 200 %, vibrato results in high-pitched bleeps, though the underlying pitch is still audible.</p>\n\n<p>But for slowing down voices it works very well. You can decrement to 67, 50, 33, 25, 12, 6, and 3 %. A regular song at 128 kbps and 44kHz sounds OK at 50 %, is still reasonably audible (but lots of noise) at 25 %, fails at 12 % and lower. This most probably depends on the quality of the file: the more information there is per second, the more smoothly the file will still sound when slowed down.</p>\n", "Id":"1250", "ParentId":"1247", "CreationDate":"2012-01-10T03:41:52.383", "Score":"5", "PostTypeId":"2", "OwnerUserId":"82", "LastActivityDate":"2012-01-10T03:41:52.383", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}