{"OwnerDisplayName":"user325", "LastEditDate":"2012-01-13T03:06:50.480", "Body":"<p>As far as I know, there is no real objective criteria for diglossia. Like the terms pidgin and creole, it is understandable as a concept, but there are noticeable gray areas that will challenge any definition.</p>\n\n<p>Generally, the criteria I've seen for diglossia involve a stable linguistic community with (at least) two languages or dialects* in which 1) one of the two varieties is of a higher or more prestigious register than than the other; 2) each variety has defined and separate spheres of use, for example the H(igh) variety might be used in formal contexts like education, business, writing, or formal spoken contexts like speeches, while the L(ow) variety might be used in informal contexts, between friends, in everyday spoken conversation; and 3) the H variety is often not the native tongue but acquired later through formal instruction, e.g. in school, and it is strictly codified. The H and L varieties do not have to be related, though they often are.</p>\n\n<p>It is true for most if not all languages that there are artificial conventions in the formal register of the language, often archaisms or rules arbitrarily superposed by grammarians. So, when does a situation become diglossic? Generally, the term is reserved for cases in which there is a significant degree of unintelligibility between the two varieties, such that speakers need formal instruction and training to understand and communicate in the H variety. Just like English speakers, many speakers in diglossic communities will maintain that the high and low varieties are the same language. However, in the case of a diglossic community, there are so many differences in the syntax/phonology/lexicon that there is reason to consider the varieties separate -- though it is worth pointing out that that is subjective. Again, too, an important criterion is that each variety in diglossia has a strictly defined domain of use. Contrast this with English, in which \"correct\" English according to prescriptivists is notably rare in even much of the literary language anymore.</p>\n\n<p>There are gray areas of course. Even though for most American English speakers the written/oral and formal/informal languages are highly similar, it is arguable that, for example, for a native speaker of African-American Vernacular English (AAVE), learning \"standard\" English (SE), especially learning to write, <em>is</em> something of a diglossic situation, because of the many differences between AAVE and SE despite their general mutual intelligibility, and also because AAVE is particularly frowned upon by nonspeakers compared to other somewhat nonstandard dialects, resulting in a restricted domain and difference in prestige.</p>\n\n<p>*Of course, where to draw the boundary between dialects versus languages becomes muddled, but that's another question.</p>\n", "Id":"1266", "ParentId":"1240", "comments":[], "CreationDate":"2012-01-12T23:01:15.797", "Score":"7", "PostTypeId":"2", "LastEditorDisplayName":"user325", "LastActivityDate":"2012-01-13T03:06:50.480", "CommentCount":"2"}