{"comments":[], "Body":"<p>It's quite a big claim to say that \"literate people - most of them speaking the standard variety - tend to conform their speech to the written form\", and there are two main reasons why this can not be taken as a given.</p>\n\n<p>Firstly, there is an enormous amount of research showing that speakers generally command a range of ways of speaking their native language, some of which are closer to the standard, and others which are less standard, and these are used at different times and in different contexts. This may include regional or non-standard varieties, which tend to be spoken only, and not written, and speakers of these varieties may at the same time be perfectly literate in the standard.</p>\n\n<p>Secondly, while literate people may use a given country's \"standard variety\" for all literacy-related activities, this does not mean they speak that same language at home. In heavily colonized regions such as the Americas, Africa, and Australia, 'literacy' usually means 'literacy in the dominant language', generally English, French or Spanish. While some of the Indigenous languages may now have literacy traditions, these are rarely the countrywide 'standard', conventions tend to be less standardized, and statistics on literacy rates in non-dominant languages are usually lacking.</p>\n\n<p>Because of this, we can't assume that literate people conform their speech to the written form, because these might involve completely different languages or dialects. So, we need to separate out whether we are asking about:</p>\n\n<ul>\n<li>The literacy of individuals in their native language, and differences in language change rates between literate and non-literate individuals speaking the same language</li>\n<li>The literacy of a cultural group in the native language of that cultural group, i.e. whether there are differences in the rates of language change once a critical mass of literate people is reached in the group (compared to other cultural groups with different literacy rates)</li>\n<li>Literacy in general, i.e. whether there are effects on the rates of language change that can be traced to the influences of literacy in general, regardless of the language, because literacy can influence how people package, process, and think about language.</li>\n</ul>\n\n<p>The idea that literacy may slow the process of language change has been around for a while, but as far as I know there is no comprehensive study of this, partly because there are lots of issues with finding groups which are otherwise comparable except for literacy rates. There is a key paper on the topic called <a href=\"http://onlinelibrary.wiley.com/doi/10.1525/aa.1962.64.1.02a00120/pdf\">Literacy as a Factor in Language Change (Zengel 1962)</a> which hypothesizes about this but doesn't actually provide any real evidence for it - Zengel is basically surprised by the higher-than-expected rate of retention of vocabulary items in a small sample of English and Latin over 1000 years, and suggests that this could be because literacy was primary and integral in these languages and therefore added extra stability. This study excluded natural phonetic change and structural change in the words because, of course, this was rampant, so Zengel just looked at word stems. (A glance at just about any English sentence is good evidence for the fact that sound change stampedes on ahead, regardless of spelling systems).</p>\n\n<p>Some arguments against the literacy-slows-change idea are contained in <a href=\"http://books.google.com.au/books?hl=en&amp;lr=&amp;id=8Ben0lE61msC&amp;oi=fnd&amp;pg=PA61&amp;dq=related%3ab8crS7xLz4EJ%3ascholar.google.com/&amp;ots=I1Fz_sxsL9&amp;sig=Tyf1n23qlOh3DZ2cBb-5WP01wxY#v=onepage&amp;q&amp;f=false\">Chapter 3 of this book on Literacy and Lexical Diffusion.</a> It's an accessible discussion, basically arguing that literacy actually <em>introduces</em> rapid and widespread language change, and that literacy itself is diverse and variable rather than uniform and stable. Furthermore, even in so-called literate cultures, <em>widespread</em> literacy is generally still a relatively recent phenomenon.</p>\n\n<p>An additional point to think about is all of the types of changes that can be observed in English usage through the use of new digital mediums of communication - these occur very rapidly, directly mediated by literacy.</p>\n", "Id":"1273", "ParentId":"1254", "CreationDate":"2012-01-13T12:50:00.527", "Score":"8", "PostTypeId":"2", "OwnerUserId":"153", "LastActivityDate":"2012-01-13T12:50:00.527", "OwnerUser":{"UpVotes":"47", "WebsiteUrl":"", "DownVotes":"1", "Id":"153", "AccountId":"871764", "Views":"33", "Reputation":"1445", "CreationDate":"2011-09-18T03:14:58.320", "DisplayName":"Floating Tone", "LastAccessDate":"2012-05-27T05:07:04.410", "AboutMe":"<p>I'm a PhD candidate in linguistics, with diverse interests including phonetics, phonology, morphology, language documentation, historical linguistics and sociolinguistics. I am particularly interested in the languages of Africa, Papua New Guinea and Australia. I'm also very interested in methods of making linguistic knowledge and materials more accessible and available to linguists and non-linguists alike.</p>\n"}}