{"Body":"<p>Yes, Icelandic is quite conservative compared to many other Indo-European languages - it could be compared to Latin in terms of the complex morphology it retains.</p>\n\n<p>There are a number of explanations for this. The geographical isolation of Iceland (being an island) means that speakers of Icelandic had less direct contact with speakers of other languages, and therefore there were fewer competing influences from other languages. Prolonged contact with languages that have very different features is generally considered to have a role in the stripping-down of inflectional systems - English is a good example of this.\n(Though there was, apparently, a <a href=\"http://en.wikipedia.org/wiki/Basque-Icelandic_pidgin\">Basque-Icelandic pidgin</a> spoken in the 17th century.)</p>\n\n<p>Similarly, the population of Iceland is mostly made up of people who are Icelandic, and the number of Icelandic-speaking people living outside of Iceland is relatively small. Iceland is also a relatively small geographical area, with the majority of the population concentrated around the <a href=\"http://en.wikipedia.org/wiki/Reykjav%C3%ADk\">Reykjavik area</a> (200,000 out of 320,000). The dialectal differences are minimal, because the population is not dispersed in the same way as in other countries, and homogeneity in a language can be self-reinforcing of its characteristics. </p>\n\n<p>Other factors may also contribute to the conservative nature of the language - there is a recent <a href=\"https://130.241.16.4/dspace/bitstream/2077/18713/1/gupea_2077_18713_1.pdf\">dissertation on language change and stability in Icelandic</a> which suggests that \"strong linguistic nationalism and a stability-oriented language policy, are instrumental in creating the sociolinguistic conditions in Iceland which support language stability\". This is interesting, because while 'language academies' such as the <a href=\"http://en.wikipedia.org/wiki/French_academy\">Académie française</a> and similar policy-creating bodies generally hold little sway against the tide of language change, the attitudes of speakers themselves can be very influential, and this may be of particular relevance in Iceland.</p>\n\n<p>Lastly, while Icelandic is still remarkably similar to Old Icelandic (which is essentially Old Norse), the ability of speakers to easily read the old sagas is usually exaggerated (so i've been told by Icelandic people). It's a bit like English speakers reading Shakespeare - you usually have to read a modern version with lots of footnotes and explanations and modernized spelling (because the pronunciation has changed quite a bit over the centuries). Even so, this is pretty impressive - Shakespeare is only four hundred years worth of change for English speakers, while the Icelandic sagas are about twice as old.</p>\n", "Id":"1276", "ParentId":"1275", "LastEditorUserId":"153", "CreationDate":"2012-01-14T00:42:00.897", "OwnerUserId":"153", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-03-10T08:04:46.707", "LastEditedUser":{"UpVotes":"47", "WebsiteUrl":"", "DownVotes":"1", "Id":"153", "AccountId":"871764", "Views":"33", "Reputation":"1445", "CreationDate":"2011-09-18T03:14:58.320", "DisplayName":"Floating Tone", "LastAccessDate":"2012-05-27T05:07:04.410", "AboutMe":"<p>I'm a PhD candidate in linguistics, with diverse interests including phonetics, phonology, morphology, language documentation, historical linguistics and sociolinguistics. I am particularly interested in the languages of Africa, Papua New Guinea and Australia. I'm also very interested in methods of making linguistic knowledge and materials more accessible and available to linguists and non-linguists alike.</p>\n"}, "LastActivityDate":"2012-03-10T08:04:46.707", "Score":"15", "CommentCount":"2", "OwnerUser":{"UpVotes":"47", "WebsiteUrl":"", "DownVotes":"1", "Id":"153", "AccountId":"871764", "Views":"33", "Reputation":"1445", "CreationDate":"2011-09-18T03:14:58.320", "DisplayName":"Floating Tone", "LastAccessDate":"2012-05-27T05:07:04.410", "AboutMe":"<p>I'm a PhD candidate in linguistics, with diverse interests including phonetics, phonology, morphology, language documentation, historical linguistics and sociolinguistics. I am particularly interested in the languages of Africa, Papua New Guinea and Australia. I'm also very interested in methods of making linguistic knowledge and materials more accessible and available to linguists and non-linguists alike.</p>\n"}}