{"OwnerUser":{"UpVotes":"18", "DownVotes":"1", "Id":"667", "AccountId":"897918", "Views":"3", "Reputation":"328", "CreationDate":"2012-01-13T03:55:05.270", "DisplayName":"Askalon", "LastAccessDate":"2012-07-04T22:20:47.023"}, "comments":[], "Body":"<p>Native \"accent acquisition\" means successful acquisition of the language's phonology (i.e. the system of sounds in a language).  The cutoff you're referring to is the critical period hypothesis, which claims that there's a critical period (from birth up to around 7-ish or puberty, give or take) during which a person is capable of acquiring a language and achieving native-like competence, but after this critical period it becomes very difficult or impossible to achieve fully native-like competence.  It's thought that there isn't one single cutoff point though, but rather that it varies depending on what part of language you're talking about: phonology is thought to have the earliest cutoff age, while syntax is thought to have the latest (it's much more common to see non-native speakers with excellent syntax but errors in their phonology than vice versa).  The phonology is therefore most often the place where unsuccessful native-like acquisition most often manifests itself, in the form of a non-native accent.</p>\n\n<p>So to get to your question about evidence for this.  There is some evidence, but it's limited, and some of the proposed evidence has been criticized as not valid.  There are some cases of feral or deaf children/adults who grew up without a language (surpassing at least part of the critical period before they were discovered).  These people are often used as evidence that the difficulty with successfully acquiring a language (including phonology) is biologically linked to age.  It's rather clear that normal adults have trouble acquiring a new language and gaining native-like competence as well, but one could claim that that's perhaps because of interference caused by the language they already know.  With feral or non-lingual deaf people though, they don't know <em>any</em> language (so there's clearly no interference from a native language), so some linguists claim that their lack of or limited success in acquiring a language must be linked to their age.</p>\n\n<p>A frequently mentioned case is that of Genie, a girl that was brought up in isolation by abusive parents and never learned a language as a child.  She was found at age 13, after which a linguist worked with her and she started to learn English.  She was never able to learn English beyond a rudimentary level.  Studies with deaf children who started learning a sign language later in their childhood (and having never learned the spoken language of their parents) have also shown a correlation with age and the level of their success in their acquisition of the language.</p>\n\n<p>Some of this evidence has been criticized.  For example, feral children such as Genie have also obviously suffered traumatic experiences that have affected them psychologically, which could be a factor in their unsuccessful language acquisition.  Cases of late learners of sign language provide better evidence because they were generally well cared for, despite lacking a language.</p>\n", "Id":"1281", "ParentId":"1280", "CreationDate":"2012-01-14T21:04:45.033", "Score":"5", "PostTypeId":"2", "OwnerUserId":"667", "LastActivityDate":"2012-01-14T21:04:45.033", "CommentCount":"3"}