{"OwnerDisplayName":"user325", "Body":"<p>One of the reasons the feral children data are difficult to assess is that the brains of these children are often underdeveloped or have developed differently because they weren't stimulated with language at a young age. (For a more scientific explanation of the how of this, see Curtiss et al 544-545+.) As I mentioned in my comment to Askalon, while that data supports the idea that there is a critical period for acquiring a faculty for language, it doesn't say much about what factors influence how successful you will be in acquiring native-like competence in a second language. Although age is often speculated to be a factor in acquiring native competence, estimates on the cutoff have ranged from as low as 3-4 to as high as puberty.</p>\n\n<p><strong>Infant Studies of Phoneme Perception</strong>  <br>\nAn important question to keep in mind is, why should skill in acquiring a new phonological system decrease because of age? Most cognitive abilities get remarkably better with age, assuming typical development. Of course, there are obvious factors like motivation (generally not as high for L2 learners), phonological interference, or different method of acquisition (generally by analytical study and reflection than immersion for L2 learners), but the biggest theory seems to be currently that it is because, while young infants are like a phonological tabula rasa, after exposure to their native language, they narrow their focus to only pay attention to the contrasts which differentiate meaning -- what are traditionally called phonemes. They lose the ability to learn how to produce and differentiate any sound.</p>\n\n<p>Even very young children show decreased sensitivity to contrasts not present in their native language. For example, Hindi has many contrasts that English doesn't, for example differentiating aspirated and unaspirated stops like [pʰal] and [pal]. Werker and Tees (1984) trained infants to expect a reward (a little puppet show) when they heard aspirated syllables (this is called a conditioned head turn technique). Then, they tested them, playing aspirated and unaspirated stops and measuring how often the infants turned at the appropriate times. If they failed to turn after hearing an aspirated stop, this was counted as a miss, and if they turned after hearing an unaspirated sound, this was counted as a false alarm. At 6-8 months, infants scored well -- they had fewer than 2/10 misses or false alarms -- while those in the 10-12 month group did remarkably poorly -- approximately only 2/10 correct hits. I cannot find the citation, but I have heard vocalic categories are cemented even earlier. And keep in mind that this is before these infants are even babbling!</p>\n\n<p><strong>Immigrant and Foreign Language Learner Studies</strong>  <br>\nThere <em>have</em> been studies looking at the acquisition of foreign language by people of varying ages, or by immigrants with varying age-of-arrival, and some (Johnson and Newport 1989) support the idea of a critical period and others (Snow and Hoefnagel-Höhle 1978) do not. It is important to note that these studies often look at both knowledge of grammar and pronunciation and I have unfortunately not found any studies specifically related to accent -- though I will add them if I come across them. These studies generally rely on a battery of tests to assess grammatical competence (e.g. grammaticality judgments) and native speakers to rate the degree of the subjects' accent. In general, it seems that a critical period for phonology is much more supported than a critical period for grammar -- acquisition of grammar is much more linked to cognitive ability in adults, although in young children, cognitive ability has no effect (e.g. Flege et al 1999, DeKeyser 2000).</p>\n\n<p><strong>Conclusion</strong> <br>\nSo yes, there does seem to be evidence for a cutoff in acquiring native-like phonology, from immigrant studies and SLA studies backed up by infant perception studies. What I would take from this, though, is that in addition to lost competence in implicit learning mechanisms, when we already have one language to work with, we will rely more on overt analysis and comparison to learn a foreign language. And while grammars are very good at detailing correct syntax and morphology, they are often abysmally poor and lazy at instructing learners in pronouncing and distinguishing foreign phonemes. (This is because they are often not written by linguists.) Add to that the fact that having an accent is not terribly stigmatized (but poor grammar is) and it's no surprise that L2 learners will often not develop a great accent.</p>\n\n<ul>\n<li><p><a href=\"http://www.jstor.org/stable/412222\">The Linguistic Development of Genie</a> <br> Author(s): Susan Curtiss, Victoria Fromkin,\nStephen Krashen, David Rigler and Marilyn Rigler <br> Source: Language, Vol. 50,\nNo. 3 (Sep., 1974), pp. 528-554 Published by: Linguistic Society of\nAmerica Article</p></li>\n<li><p><a href=\"http://www.kennethreeds.com/uploads/2/3/3/0/2330615/article.pdf\">The Critical Period for Language Acquisition: Evidence from Second\nLanguage Learning</a> <br> Author(s): Catherine E. Snow and Marian\nHoefnagel-Höhle <br> Source: Child Development, Vol. 49, No. 4 (Dec.,\n1978), pp. 1114-1128 Published by: Blackwell Publishing on behalf of\nthe Society for Research in Child Development</p></li>\n<li><p><a href=\"http://www.sciencedirect.com/science/article/pii/0010028589900030\">Critical period effects in second language learning: The influence\nof maturational state on the acquisition of English as a second\nlanguage</a> <br> Author(s): Jacqueline S Johnson, Elissa L Newport, \n<br> Source: Cognitive Psychology, Volume 21, Issue 1, January 1989, Pages\n60-99, ISSN 0010-0285, 10.1016/0010-0285(89)90003-0.</p></li>\n<li><p><a href=\"http://www.sciencedirect.com/science/article/pii/S0749596X99926384\">Age Constraints on Second-Language Acquisition</a> <br> Author(s): James Emil Flege, Grace H. Yeni-Komshian, Serena Liu <br> Source: Journal of Memory and Language,\nVolume 41, Issue 1, July 1999, Pages 78-104</p></li>\n<li><p><a href=\"http://journals.cambridge.org/action/displayAbstract?fromPage=online&amp;aid=67465\">The Robustness of Critical Period Effects in Second Language Acquisition</a>. <br> Author(s): Robert M. DeKeyser <br>  Source: Studies in Second Language Acquisition, 22 , 2000, pp 499-533</p></li>\n</ul>\n", "Id":"1284", "ParentId":"1280", "CreationDate":"2012-01-16T00:17:13.437", "Score":"7", "PostTypeId":"2", "LastActivityDate":"2012-01-16T00:17:13.437", "CommentCount":"3", "comments":[]}