{"Body":"<p>Icelandic is less conservative than it used to be-- it has started taking loan words from English. There is some immigration where there used to be virtually none (before a hundred years ago)-- but as far as this hobbyist can tell, a population of Icelandic-as-a-second-language speakers hasn't done anything to simplify the grammar.  I predict the first distinction to go if immigration were to expand would be the difference between the definite article suffixes \"-inn\" \"-in\", which for an adult learner like me is about impossible to hear. (And this change already happened in modern Swedish)</p>\n\n<p>I wouldn't attribute any of Iceland's conservationism to nationalism because nationalism has only been an important factor in the last hundred years. If you enjoy Icelandic movies, set a good number of years ago, in <em>Seagull's Laughter</em>, you will see that characters very clearly saw Danish and Denmark as the prestigious culture and language -- which certainly is not the case at the moment.</p>\n\n<p>For the other 900 years of Iceland's history, the isolating geography has been the driving force in the evolution of the language. No immigrants, not much trade, an imperial government that mostly ignored the island, a small island where people routinely would move to far corners of the island to intermix and marry, all led to a homogeneous language with language change, but only of the internal variety.</p>\n", "Id":"1291", "ParentId":"1275", "LastEditorUserId":"51", "CreationDate":"2012-01-17T14:09:36.093", "OwnerUserId":"20", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-12-06T03:12:48.677", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2013-12-06T03:12:48.677", "Score":"4", "CommentCount":"3", "OwnerUser":{"UpVotes":"72", "WebsiteUrl":"http://suburbandestiny.com/conlang", "Id":"20", "AccountId":"15651", "CreationDate":"2011-09-13T20:53:42.550", "AboutMe":"<p>I'm a programmer by day and an amateur linguist by night.</p>\n\n<p>I organize the Arlington Linguistics Book Club, where we read a wide variety of books that make the science of linguistic accessible to a popular audience.</p>\n", "Age":"41", "Location":"United States", "DownVotes":"6", "Views":"39", "Reputation":"1657", "DisplayName":"MatthewMartin", "LastAccessDate":"2014-01-08T19:46:09.130"}}