{"comments":[], "Body":"<p>After all the comments above, there's not much left to say. I didn't really want to post it as an answer but the quotes from Bhat 2004 (since you wanted references) are too long for a comment.</p>\n\n<p>\"Interrogative proforms are used primarily for <strong>obtaining information</strong> from the addressee <strong>regarding an unknown entity</strong>, and hence the speaker can provide only a general indication of its identity. He is therefore forced to use a general term for referring to it. Even when interrogative pronouns have some of their extended uses like testing the knowledge of the addressee, there would still be a need to use a general term.\"</p>\n\n<p>and</p>\n\n<p>\"Proforms [...] are general terms that are used for carrying out different functions like (i) identifying the participants of an event by locating them with reference to the spatio-temporal location of the speech act participants (or indicating the location, time, manner, etc. of the event itself in a similar fashion), (ii) referring back (or forward) to other expressions that occur in the utterance or in previous utterances, or (iii) indicating the scope of a question, negation, or exclamation. They are generally made up of two different elements of which one indicates the function of the preform (demonstrative, interrogative,\nindefinite, or anaphoric (relative) ) and the other one denotes their category or\nscope (person, thing, place, manner, quality, quantity, etc.).\"</p>\n\n<p>\"<strong>All proforms</strong> share a set of general concepts and hence <strong>expressing a general concept</strong> can be regarded as the first set of their main functions.\"</p>\n", "Id":"1299", "ParentId":"1297", "CreationDate":"2012-01-18T18:06:23.523", "Score":"3", "PostTypeId":"2", "OwnerUserId":"445", "LastActivityDate":"2012-01-18T18:06:23.523", "OwnerUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}}