{"Body":"<p>I can maybe answer some of the questions raised above. Although I probably won't provide the kinds of examples you are looking for. There are at least two ways that people go about representing the semantics of plurality, sets or sums.</p>\n\n<p>Link 1983 introduces the notion of a sum to the ontology. So in addition to having individual objects in the ontology, eg. b which stands for the dog Bingo, and a, which stands for the dog Angel, you have sum, or plural individuals, which correspond, eg., to a+b, the sum of Bruno and Angel. So the singular word 'dog' would denote the set of singular dog individuals, {a, b}, and the plural form 'dogs' would denote then set of singular AND sum/plural dog individuals, {a, b, a+b}.(Well, some people would say it denotes the set of just plural/sum individuals, {a+b}, but this is a controversial issue.) Usually you would have more individuals in your model, eg. a singular noun could denote {a, b, c, d}, and the pluralized noun denotes {a, b, c, d, a+b, a+c, a+d, b+c, b+d, c+d, a+b+c, ..., a+b+c+d}. When you have what you are calling class-uses of the noun (Carlson called this a kind-use), eg. \"The bear is a carnivore\", the noun is often formalized as denoting the maximal individual in the set, i.e., the individual that is the sum of all of the elements in the set, a+b+c+d. </p>\n\n<p>As for 'forest', I think most approaches would not say that it is the semantic plural of 'tree' (which would be 'trees') - but that there are singular individuals in our ontology which correspond to things that we would call a forest. So 'forest' would have a denotation like 'dog', but a corresponds to The Black Forest, b corresponds to The Haunted Forest, etc. There might be operations (like Landman's Group operator) that map plural individuals in the denotation of 'trees' to the singular individuals in the denotation of 'forest', but these are still represented as distinct individuals semantically. </p>\n\n<p>As for (morphologically) irregular plurals, Link introduces this * notation. So the plural 'dogs' would be semantically represented as *dog, where this *-operator is what maps from a singular's denotation to a plural/sum denotation. This * need not be confined to the presence of a specific plural morpheme, however, so even forms which have suppletive plural forms would be represented with the *, i.e., the denotation of 'children' would be *child. So I think morphological plurality, in English at least, differs from semantic plurality. (And of course we have pluralia tantum like 'pants' and 'scissors', which really suggest against having no difference between morphological and semantic plurality, as noted by Knitter above).</p>\n\n<p>The set approach, I am not as familiar with, but think it is one where the singular noun 'dog' again denotes the set of singular individual dogs {a, b}, but there is no new type of individual introduced to the ontology. Instead, the plural form 'dogs' denotes the set of all the possible sets of dogs (the power set), {{a}, {b}, {a, b}}. (again, I guess some people would argue that it is this set minus the singleton set members). (Schwarzschild 1996 is what I ought to have consulted previous to answering this, but...)</p>\n\n<p>Under either approach to plurality, a singular and plural form have distinct denotations, so I don't think they would be considered the same word semantically (assuming that the notion of a semantic word would correspond to a denotation, although I don't know if that is what's usually done.)</p>\n", "Id":"1301", "ParentId":"1296", "LastEditorUserId":"177", "CreationDate":"2012-01-18T23:50:38.360", "OwnerUserId":"177", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-01-19T02:50:37.440", "LastEditedUser":{"UpVotes":"6", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/tqgTp.png", "Id":"177", "AccountId":"896176", "CreationDate":"2011-09-19T16:30:42.833", "AboutMe":"<p>Linguistics grad student. Research interests lie in formal semantics, the morphosyntax-semantics interface.</p>\n", "Location":"Canada", "DownVotes":"0", "Views":"9", "Reputation":"396", "DisplayName":"user177", "LastAccessDate":"2014-01-09T01:15:39.280"}, "LastActivityDate":"2012-01-19T02:50:37.440", "Score":"5", "CommentCount":"2", "OwnerUser":{"UpVotes":"6", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/tqgTp.png", "Id":"177", "AccountId":"896176", "CreationDate":"2011-09-19T16:30:42.833", "AboutMe":"<p>Linguistics grad student. Research interests lie in formal semantics, the morphosyntax-semantics interface.</p>\n", "Location":"Canada", "DownVotes":"0", "Views":"9", "Reputation":"396", "DisplayName":"user177", "LastAccessDate":"2014-01-09T01:15:39.280"}}