{"comments":[], "Body":"<p>Some more references, neither positive nor negative, just impartial analysis, that it exists and what issues there are to think about it.:</p>\n\n<ul>\n<li><p>Vagueness, by Timothy Williamson, 1994. Starts with the Heap/Sorites paradox (1 grain is not a heap, 2 grains are not a heap..., if n grains are not a heap then n+1 still do not make a heap, therefore there are no heaps (an obvious contradiction). Eventually touches on multivalued logics and fuzzy sets.</p></li>\n<li><p><a href=\"http://plato.stanford.edu/entries/vagueness/\" rel=\"nofollow\">Vagueness</a>, Stanford Encyclopedia of Philosophy. particularly the last section , <a href=\"http://plato.stanford.edu/entries/vagueness/#7\" rel=\"nofollow\">Is All Vagueness Linguistic?</a>.</p></li>\n</ul>\n\n<p>Clarity of a convincing argument or in transfer of information has been a major desired goal  in Western philosophy forever, and departures from it have been seen primarily as negative. The use of amphiboly, deliberate or not, is usually seen as a fallacy or error. So I feel that any intended use of vagueness would be considered misleading and manipulative, and so not likely in a positive light. </p>\n\n<p>The above references don't do their analyses from an obviously tendentious, negative direction, so they may suffice for you, even though they don't attempt to make something explicitly positive about vagueness.</p>\n", "Id":"1306", "ParentId":"1243", "CreationDate":"2012-01-19T14:38:56.210", "Score":"2", "PostTypeId":"2", "OwnerUserId":"4", "LastActivityDate":"2012-01-19T14:38:56.210", "OwnerUser":{"UpVotes":"432", "WebsiteUrl":"", "Location":"United States", "Id":"4", "DownVotes":"2", "AccountId":"167219", "Views":"42", "Reputation":"1906", "CreationDate":"2011-09-13T20:24:01.087", "DisplayName":"Mitch", "LastAccessDate":"2014-01-15T11:56:51.610", "AboutMe":"<p>Native speaker of American English (AmE) with touches of Southern AmE.\nProficient in French and German. Elementary knowledge of Mandarin. Basic knowledge of linguistics.</p>\n"}}