{"OwnerUser":{"UpVotes":"1", "DownVotes":"0", "Id":"732", "AccountId":"1214090", "Views":"4", "Reputation":"127", "CreationDate":"2012-02-01T06:19:16.837", "DisplayName":"Tom Sugnetic", "LastAccessDate":"2013-05-05T21:16:40.087"}, "comments":[], "Body":"<p>Sociolinguistically, many talk of diglossia when the spoken language of middle and upper classes is very different from the language used in formal writing: Tamil, Arabic, Kannada, Sinhalese are the most given examples, as for Western languages: Czech, Swiss German, Belgian Dutch, Greek in Cyprus and Portuguese in Brazil have been mentioned in this context.</p>\n\n<p>When languages were standardized back in the 19th century, Czechs chose a very conservative form as their standard language (based on the 17th century literary usage). The same thing happened in Brazil, the elites preferred Continental Portuguese with some orthographic differences to the way most Brazilians spoke. With diglossia, you get a high level of linguistic insecurity and ''Schizoglossia'' (see the scandal from last year,with a Brazilian textbook Por uma Vida Melhor which revived the old tensions of two languages of Brazil: ''spoken Brazilian and written Portuguese'' (described as such by Mário de Andrade in his novel ''Macunaíma'' 100 years ago).</p>\n\n<p>The tension in Norway is not between Bokmål and Nynorsk, but between\na conservative Bokmål (Danonorwegian), and a modern Bokmål (called ''radical'').\nThe differences divide even the city of Oslo in two parts: West Oslo (which is the center of Dano-Norwegian) and East Oslo (where dialect close to ''radical'' Bokmål are spoken).\nEven though it's perfectly acceptable to use a feminine gender in Bokmål, some people think treating female nouns as masculine nouns gives a text a more sophisticated feel, so Danish-made usage is prestigious, the same thing happens in Brazil, while most Brazilians would say: Me chamo, Se diz, Te ver, Chegar em... most of them think that usage imported from Portugal looks more sophisticated in writing: Chamo-me, diz-se, ver-te, chegar a...</p>\n\n<p>Argentinian Spanish is quite opposite to Brazilian Portuguese. The difference between the spoken and the written language is minimal. Argentinians achieved this by upgrading their colloquial usage to the status of the national standard. No Argentinians say ''We speak Spanish so incorrectly''.  They accepted voseo, different verbal usage, vocabulary as parts of their identity. In Brazil, you still see Portuguese professors making big bucks selling books like ''Como evitar erros'' (how to avoid mistakes) or ''Fale melhor sua língua'' (speak your language better).</p>\n\n<p>To cut a long story short:</p>\n\n<p>if the language used in movies, sitcoms, soap operas is very different from the language used in narration of novels, magazines, newspapers, then there is something fishy and there may be a diglossish situation. In Mexican soap operas the language used is standard Mexican Spanish [no grammar errors], in Argentinian soap operas the language used is standard Argentinian Spanish [no grammar errors], but in Brazilian soap operas, the language used is NOT standard Brazilian Portuguese, but a substandard Brazilian Portuguese: you can't write things like: ME CHAMO, VI ELE, CHEGAR NO RIO, FUI NA PRAIA, ENTRE EU E VOCÊ, VOCÊ SABE QUE TE AMO in a magazine.\nBrazilian elites benefit from the gap between the written and the spoken language, because it's one of the way they can control the society. Were colloquial forms fully accepted as a part of the new standard language (as it's been happening in Argentina), Portuguese language would no longer be one of the most difficult subjects in university entrance process, and virtually everyone could get enrolled (for the time being, the elites want only students from private high schools to enter Universities, that's why they benefit from the diglossia and like the status quo).</p>\n\n<p>I haven't really seen ''A grammar of spoken Spanish'' or ''A grammar of spoken Slovak'' but I've seen ''A grammar of spoken Brazilian Portuguese'' and ''A grammar of spoken Tamil''...You don't normally get books like these unless there is a huge gap between the written and spoken grammar.</p>\n", "Id":"1350", "ParentId":"1240", "CreationDate":"2012-02-01T07:22:39.853", "Score":"4", "PostTypeId":"2", "OwnerUserId":"732", "LastActivityDate":"2012-02-01T07:22:39.853", "CommentCount":"1"}