{"Body":"<p>Words in different part of speech (POS) categories are considered different words even if they have the same form. Thus /bank/ (noun) and /bank/ (verb) are different words that simply happen to have the same form. This means, for example that they will each have their own entry in dictionaries. They also seem to function as distinct items in our mental lexicons.</p>\n\n<p>Other answers have suggested that this situation may be connected to the  lowish amount of morphology in English, but Kastovsky (in Bauer and Valera 2005) argues that this is not correct and gives examples of languages with much more inflectional morphology than English that still have this situation.</p>\n\n<p>In English there is a productive process called 'zero-derivation' (or 'conversion') which results in identical forms in different POS categories. This process creates a new word from an old one without any change in form. Thus English speakers regularly use zero-derivation to create  new verbs from nouns. Zero-derivation between other part of speech categories also happens, but is less common.</p>\n\n<p>Another source of identical forms across multiple POS categories is historical change. English has lost many inflections and this loss has in some cases produced words in different POS categories that have the same form. An example here is 'talk' (noun) and 'talk' (verb).</p>\n", "Id":"1364", "ParentId":"1360", "LastEditorUserId":"363", "CreationDate":"2012-02-04T03:22:50.120", "OwnerUserId":"363", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-02-04T07:00:59.850", "LastEditedUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}, "LastActivityDate":"2012-02-04T07:00:59.850", "Score":"3", "OwnerUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}}