{"Body":"<p>Creoles tends to have three ways of marking noun phrases for definiteness: </p>\n\n<ul>\n<li><p>definite, for already known, specific information ({the} in English) </p></li>\n<li><p>indefinite, for new, unknown but still specific information ({a/an} in English)</p></li>\n<li><p>not specific, usually unmarked (also {a/an} in English, or unmarked)</p></li>\n</ul>\n\n<p>The first time you mention something you mark it indefinite, later you use the definite marker and if it is not specific or important you use the third option. Naturally I can't remember the reference for it (book used in grammaticalization-class I think) but apparently there can be two types of nonspecificness too, for new and old nonspecific information: In such a system \"dogs bark but foxes bark too\" the nouns would be marked differently. IIRC no more than three of the four possibilities are marked in any one language though.</p>\n\n<p>Then there are the languages with only one article of course... or none, but opinions differ on whether all languages always mark definiteness (needn't be with an article!) or not. </p>\n\n<p>For those interested in definiteness there's the book \"Definiteness\" by Christopher Lyons. I haven't read it myself as I'm not very interested in the subject. The other books I have read in the series it is part of though, <em>Cambridge Textbooks in Linguistics</em>, have never disappointed even though of course some linguists just can't write and needs to be read in small doses lest your eyeballs bleed ;)</p>\n", "Id":"138", "ParentId":"16", "LastEditorUserId":"119", "CreationDate":"2011-09-14T20:07:22.777", "OwnerUserId":"119", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-17T00:28:46.093", "LastEditedUser":{"UpVotes":"302", "DownVotes":"1", "Id":"119", "AccountId":"14652", "Views":"52", "Reputation":"3065", "CreationDate":"2011-09-14T14:24:24.227", "DisplayName":"kaleissin", "LastAccessDate":"2014-01-18T22:21:33.313", "AboutMe":"<p>Sysadmin/programmer by day, linguist by night.</p>\n"}, "LastActivityDate":"2011-09-17T00:28:46.093", "Score":"2", "CommentCount":"1", "OwnerUser":{"UpVotes":"302", "DownVotes":"1", "Id":"119", "AccountId":"14652", "Views":"52", "Reputation":"3065", "CreationDate":"2011-09-14T14:24:24.227", "DisplayName":"kaleissin", "LastAccessDate":"2014-01-18T22:21:33.313", "AboutMe":"<p>Sysadmin/programmer by day, linguist by night.</p>\n"}}