{"comments":[], "Body":"<p>Tibeto-Burman languages are an interesting example of copula verbs that are 'regular' across all person and number forms. I'll share an example from Lamjung Yolmo, because that's what I am documenting at the moment, but you can find similar things in Sherpa, Lhasa Tibetan and other languages of this family. </p>\n\n<p>In Yolmo there are actually a number of copula verbs, all of which can be used regardless of person or number, but that's because they're marking something other than tense or aspect. I'll just highlight the difference between two of them.</p>\n\n<p>There is <em>yè</em> which is used where an English copula is used for \"X be adjective\" where X is any person number. This can be contrasted with <em>dù</em> which can also be used for \"X be adjective\" constructions. The difference is nothing to do with person, but an evidential distinction, with <em>yè</em> being used for information that someone already knows to be true and <em>dù</em> being used for information that the person has recent direct perception of. So in the case of \"she is tall\" if I saw her every day I'd use <em>yè</em> but if I walked down the street and saw someone who was tall I might point them out and use <em>dù</em>. </p>\n\n<p>Obviously, certain persons go with certain constructions - it's unusual to use direct perception <em>dù</em> for yourself because you already know what you're doing without evidence. But there are cases where it's appropriate to use it, so it's not a true person distinction. </p>\n\n<p>So the take-home message from that is that not all of the world's languages require the copula verb to mark person and/or number, making it perfectly easy to have a regular form and no need for conjugation. </p>\n", "Id":"1387", "ParentId":"1380", "CreationDate":"2012-02-07T15:11:51.147", "Score":"4", "PostTypeId":"2", "OwnerUserId":"64", "LastActivityDate":"2012-02-07T15:11:51.147", "OwnerUser":{"UpVotes":"126", "WebsiteUrl":"http://www.superlinguo.com", "Id":"64", "AccountId":"900445", "CreationDate":"2011-09-13T21:45:12.903", "AboutMe":"<p>I have a PhD in linguistics. My areas of interest include language documentation, Tibeto-Burman linguistics, gesture, language play, LOLspeak, evidentiality and making bad puns. I blog about language and linguistics at www.superlinguo.com</p>\n", "Age":"29", "Location":"Australia", "DownVotes":"6", "Views":"40", "Reputation":"2016", "DisplayName":"LaurenG", "LastAccessDate":"2013-10-26T00:28:12.653"}}