{"Body":"<p>What those \"childish errors\" really show are that children are <em>generating</em> language, not just repeating it. Think \"This is a <em>wug</em>. There are two <em>_</em>_.\" (Sorry, kids, the answer is \"wuggen.\" There's more than one way to pluralize a wug.) </p>\n\n<p>I would definitely argue that, particularly in verbs, the generative rules that children learn and then unlearn for irregular verbs is a factor in language change. It might not come directly from children, but the <a href=\"http://scienceblogs.com/notrocketscience/2009/09/the_evolution_of_the_past_tense_-_how_verbs_change_over_time.php\" rel=\"nofollow\">regularization of verbs</a> happens: </p>\n\n<blockquote>\n  <p>Lieberman charted the progress of 177 irregular verbs from the 9th\n  century Old English of Beowulf, to the 13th century Middle English of\n  Chaucer's Canterbury Tales, to the modern 21st century English of\n  Harry Potter. Today, only 98 of these are still irregular...</p>\n</blockquote>\n\n<p>Intuitively, </p>\n\n<blockquote>\n  <p>They regularise in a way that is 'inversely proportional to the square\n  root of their frequency'.</p>\n</blockquote>\n\n<p>That is, the more infrequently they are used, the less likely it is that somebody's going to remember the irregular form so they just follow the rules they know.</p>\n\n<p>These are \"early modern English\" verbal forms (about 400 years ago):</p>\n\n<ul>\n<li>help, holp, have holpen</li>\n<li>swell, swole, have swollen</li>\n<li>melt, molt, have molten</li>\n<li>slide, slid, have slidden</li>\n<li>abide, abode, have abidden</li>\n<li>strike, struck, have stricken</li>\n<li>shear, shore; have shorn</li>\n</ul>\n\n<p>Some of these forms survive as adjectives (\"shorn,\" \"stricken\", \"swollen\"), but \"have holpen\"? Yeah, right.</p>\n\n<p>Interestingly, there are a few of verbs particularly in American English that have gone the other direction: where past participle form (\"have __ed\") <em>was</em> regular, but because there was a very common, phonologically similar word, it was \"irregularized.\"</p>\n\n<ul>\n<li>dive, dove, have dived; \"dove\" like \"drove\"</li>\n<li>sneak, snuck, have sneaked; \"<a href=\"http://andromeda.rutgers.edu/~jlynch/Writing/s.html#sneak\" rel=\"nofollow\">snuck</a>\" like ...idk.</li>\n</ul>\n\n<p>This is not very common, probably hypergrammaticalization, a very \"grown up\" occurrence. I mean, adults get things \"wrong\" all the time. (My peeve is phenomenon/phenomena.) English in particular is a confusing mess of different verbal paradigms and borrowed words with borrowed plurals from a half-dozen other languages. (Phenomenon/phenomena is Greek, but radius/radii is Latin, etc.) Point is: you still know exactly what the kid means when she says \"gooses\" or \"thesises\" or, as my niece is attributed, referring to a babydoll whose eyes would open and close: \"She oped her eyes!\"</p>\n\n<p>The key concepts for verb regularization are economy and analogy. Why remember forms when instead you could remember one simple rule? Think about programming a vocabulary into a computer: would you rather program every form of every word, or just tell it to concatenate the verb with \"ed\" to form the past tense and concatenate the noun with \"s\" to form the plural? Child (and adult) speakers' brains are just as lazy as the programmer-you is in this scenario. We'd all rather things be simple, neh?</p>\n", "Id":"1394", "ParentId":"1392", "LastEditorUserId":"42", "CreationDate":"2012-02-08T22:44:02.563", "OwnerUserId":"42", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-02-09T22:55:47.537", "LastEditedUser":{"UpVotes":"108", "WebsiteUrl":"http://twitter.com/mollyocr", "Id":"42", "AccountId":"896571", "CreationDate":"2011-09-13T21:04:13.347", "AboutMe":"<p>BA in Linguistics. Currently working as a localization &amp; QA specialist at a translation company in Minneapolis. Studied: Latin, Spanish, French, Arabic, Polish, Mandarin. Conlanger. Sci fi &amp; fantasy nerd, experimental cook, songwriter, artist and craftist. Also, I have a dog.</p>\n", "Age":"28", "Location":"Minneapolis, MN", "DownVotes":"8", "Views":"24", "Reputation":"933", "DisplayName":"mollyocr", "LastAccessDate":"2012-09-13T19:49:49.973"}, "LastActivityDate":"2012-02-09T22:55:47.537", "Score":"4", "CommentCount":"8", "OwnerUser":{"UpVotes":"108", "WebsiteUrl":"http://twitter.com/mollyocr", "Id":"42", "AccountId":"896571", "CreationDate":"2011-09-13T21:04:13.347", "AboutMe":"<p>BA in Linguistics. Currently working as a localization &amp; QA specialist at a translation company in Minneapolis. Studied: Latin, Spanish, French, Arabic, Polish, Mandarin. Conlanger. Sci fi &amp; fantasy nerd, experimental cook, songwriter, artist and craftist. Also, I have a dog.</p>\n", "Age":"28", "Location":"Minneapolis, MN", "DownVotes":"8", "Views":"24", "Reputation":"933", "DisplayName":"mollyocr", "LastAccessDate":"2012-09-13T19:49:49.973"}}