{"Body":"<p>This issue has recently caught the attention of typologists and historical linguists, with a recent publication by <a href=\"http://codrinarsene.com/wp-content/uploads/2011/04/Science-Atkinson.pdf\" rel=\"nofollow\">Atkinson (2011)</a>, where it is claimed not only that a language's phoneme inventory size correlates positively with its speaker population, but that population bottlenecks in the course of human expansion out of Africa 50-70k years ago are reflected in the phoneme inventory sizes of modern languages. According to Atkinson's proposal, population sizes should have some role in explaining the differences in numbers of consonants in modern IE languages. </p>\n\n<p>The proposal is, to say the least, controversial among linguists. The current issue of the journal <a href=\"http://www.degruyter.com/view/j/lity.2011.15.issue-2/issue-files/lity.2011.15.issue-2.xml\" rel=\"nofollow\"><em>Linguistic Typology</em> (2011, vol. 15, no.2)</a> contains a number of critical evaluations of Atkinson's proposal. Most relevant to the present question is Ringe's commentary (pp. 223--231). Ringe catalogs the sound changes leading to the development of Proto-Indo-Iranian, Sanskrit, Proto-Germanic, Old English, Greek and Latin and makes three main conclusions about the gain and loss of contrasts in IE lineages: (1) new contrasts were usually not due to borrowing, (2) most new contrasts were due to a reorganization of syllable structure or prosodic structure, and (3) the overall trend is neither a loss or gain of phonemes, although individual languages vary. </p>\n\n<p>Ringe contrasts IE with Oceanic, where most of the modern languages have similar phonotactics, and supposes that the reason for the progressive loss of contrasting segments as one goes deeper into the Oceanic phylogenetic tree is that the usual process for gaining segments, phonotactic changes, has for some reason not happened in most languages. </p>\n\n<p>What I don't know is how Ringe's proposal plays out for other branches of IE, including Lithuanian. I don't know whether many new consonants in Lithuanian were due to reorganization of syllable or metrical structure in the proto-language, or more straightforward conditioned splits that did not alter the phonotactics by much, but it would be interesting to check out. (Possible starting points for reading would be <a href=\"http://www.kortlandt.nl/publications/art253e.pdf\" rel=\"nofollow\">Kortlandt 2008</a> as well as other contributions to the journal <em><a href=\"http://www.leidykla.vu.lt/en/journals/baltistica/\" rel=\"nofollow\">Baltistica</a></em>, which appears to be open access) For bonus reading, see <a href=\"http://alex.francois.free.fr/data/AlexFrancois_VowelsNorthernVanuatu_OL44-2.pdf\" rel=\"nofollow\">Francois 2005</a> for a discussion on how several Oceanic languages of North Vanuatu developed unusually large vowel systems, bearing in mind that most present-day Oceanic languages (along with POc) have small (5 or fewer qualities) vowel systems.</p>\n", "Id":"1396", "ParentId":"1377", "LastEditorUserId":"445", "CreationDate":"2012-02-09T04:34:38.850", "OwnerUserId":"483", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-02-09T17:35:25.130", "LastEditedUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}, "LastActivityDate":"2012-02-09T17:35:25.130", "Score":"4", "CommentCount":"2", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}