{"OwnerUser":{"UpVotes":"15", "DownVotes":"2", "Id":"28", "AccountId":"53332", "Views":"31", "Reputation":"1410", "CreationDate":"2011-09-13T20:55:31.697", "DisplayName":"JoFrhwld", "LastAccessDate":"2013-10-22T11:47:47.293"}, "comments":[], "Body":"<p>There are, in fact, some rough and ready acoustic measures for analyzing vowels. We call them formants, and their acoustic theory is a little heavy to get into right here. Roughly, they are bundles of re-enforced harmonics: <a href=\"http://en.wikipedia.org/wiki/Formant\">http://en.wikipedia.org/wiki/Formant</a>. It's harmonics that make the same note sound different when played on a violin, a viola, and a piano, and it's harmonics that make /i/ sound different from /u/.</p>\n\n<p>The first two formants, abbreviated F1 and F2, correspond roughly to vowel height (F1) and vowel backness/rounding (F2). Automatic formant estimation from raw audio is a tricky business, but it's a project that <a href=\"https://github.com/JoFrhwld/FAAV/tree/master/extractFormants\">I myself have been involved in</a>. </p>\n\n<p>So, the way I analyse vowels now is</p>\n\n<ol>\n<li>Obtain a relatively long speech sample from a speaker.</li>\n<li>Transcribe the speech sample.</li>\n<li>Run the speech sample + my transcription through our software, which produces estimates for F1 and F2.</li>\n<li>Attempt to normalize the acoustic measurements to account for differences caused by different head and body sizes. Anatomical differences like these cause big differences in the raw measurements.</li>\n<li>Make a plot.</li>\n</ol>\n\n<p>Now, that's probably a little different from how phonological descriptions like the one you posted work. I'd imagine most of these plots with apparently precisely placed points are based partially on acoustic data like I just described, and partially on the phonologist's view of the systematic character of the sound system. I say that because plots of acoustic data are rarely ever so clean as that plot, with perfectly parallel /i/ and /u/, /e/ and /o/.</p>\n", "Id":"140", "ParentId":"137", "CreationDate":"2011-09-14T20:15:04.480", "Score":"21", "PostTypeId":"2", "OwnerUserId":"28", "LastActivityDate":"2011-09-14T20:15:04.480", "CommentCount":"9"}