{"OwnerUser":{"UpVotes":"21", "WebsiteUrl":"", "Id":"282", "AccountId":"234202", "CreationDate":"2011-09-24T14:53:50.813", "AboutMe":"<p>The handle isn't randomly-chosen. I still type with two fingers after over 30 years as a solo custom software supplier, and I still mis-hit the keys!</p>\n\n<p>Actually, I've been in (involuntary) retirement for a year or so - giving me too much time on my hands, much of which I spend on Language.se gaining rep I probably don't deserve. But I do have a keen interest in all aspects of English for my own edification, plus I get a buzz out of the way EL&amp;U enables me to actively participate in fostering that same interest in others.</p>\n", "Age":"60", "Location":"United Kingdom", "DownVotes":"3", "Views":"11", "Reputation":"377", "DisplayName":"FumbleFingers", "LastAccessDate":"2013-11-10T21:17:40.387"}, "comments":[], "Body":"<p>With due regard to @mollyocr's answer, I shall answer my own question.</p>\n\n<p>The errors children make include a high proportion of utterances where they've <em>correctly</em> identified a \"general principle\", but haven't yet learnt that it doesn't apply <em>in some particular case</em>. Common errors obviously being to apply the rules for regular verbs/plurals to irregular words.</p>\n\n<p>Collectively we have a vested interest in discarding existing irregular forms (also in preventing new ones appearing, but that's so easy we barely notice we're doing it). Of the existing irregular forms, only a few intractable ones still survive (intractable because they're so common it's difficult to change them).</p>\n\n<p>Every time a child makes a mistake in the \"right\" direction in respect of irregular/illogical forms, they raise awareness of how we'd like things to be. Like biological evolution, language change can take a <em>very</em> long time - but language, unlike biology, is guided by our own rational thoughts. Be it ever so slowly, adults gradually come to adopt the \"logical\" errors made by people (including children), while correcting the \"illogical\" ones.</p>\n\n<p>I don't think childish errors <em>directly</em> influence language change, but some (the ones we judge logical) constantly <em>remind us</em> of certain illogicalities. Plus they provide a mechanism for adults to increasingly adopt those \"errors\" in appropriate circumstances, which may eventually become <em>all</em> circumstances.</p>\n", "Id":"1402", "ParentId":"1392", "CreationDate":"2012-02-10T02:00:32.250", "Score":"-2", "PostTypeId":"2", "OwnerUserId":"282", "LastActivityDate":"2012-02-10T02:00:32.250", "CommentCount":"5"}