{"OwnerUser":{"UpVotes":"556", "WebsiteUrl":"http://www.markbeadles.com/", "Id":"537", "AccountId":"297827", "CreationDate":"2011-11-27T02:50:39.717", "AboutMe":"<p>Polymathic renaissance redneck</p>\n", "Age":"47", "Location":"Columbus, OH", "DownVotes":"22", "Views":"30", "Reputation":"3876", "DisplayName":"Mark Beadles", "LastAccessDate":"2013-02-02T04:23:30.703"}, "comments":[], "Body":"<p>In <a href=\"http://books.google.com/books?id=8vqm1zozD18C&amp;pg=PA270&amp;dq=errors%20in%20language%20acquisition%20effect%20on%20%22language%20change%22&amp;hl=en&amp;sa=X&amp;ei=03M1T_28MKaM2gWS76T3AQ&amp;ved=0CGUQ6AEwCQ#v=onepage&amp;q=errors%20in%20language%20acquisition%20effect%20on%20%22language%20change%22&amp;f=false\" rel=\"nofollow\">Understanding Language Change</a> (McMahon, 1994) there's a great statement: </p>\n\n<blockquote>\n  <p>\"Historical linguists have so far had little success in assuming that\n  children learning language initiate language change, since there is\n  very limited overlap between changes and characteristics of child\n  language.... How the child learns therefore seems more relevant to the\n  historical linguist than the performance errors she makes.\"</p>\n</blockquote>\n\n<p>Here are a couple papers that may help illustrate the point. </p>\n\n<p>Kerswil, in \"<a href=\"http://journals.cambridge.org/action/displayFulltext?type=1&amp;fid=2713488&amp;jid=LVC&amp;volumeId=8&amp;issueId=02&amp;aid=2713480\" rel=\"nofollow\">Children, Adolescents, and Language Change</a>\", directly and extensively tackles your question of whether linguistic innovation comes from the speech of children. (He does restrict his study to language change resulting from language contact.) His findings are basically that <strong>different age groups are responsible for different types of language change in accordance with the usual order of language acquisition</strong>, which he gives as:</p>\n\n<ol>\n<li>New phonological rules by age 3 </li>\n<li>New phonological oppositions  by age 3-13</li>\n<li>New grammatical parameters by age 8 </li>\n<li>Changes to prosody by age 12</li>\n<li>New morphological classes in adolescence</li>\n<li>Morphologically conditioned changes after age 4-7</li>\n<li>All other linguistic changes at any age</li>\n</ol>\n\n<p>I think this is important since it doesn't restrict itself to morphology and syntax errors, but to phonology, prosody, etc. as well. It also takes into account that adults can learn changes to vocabulary fairly easily; but changes in phonology are almost impossible to acquire past early childhood.</p>\n\n<hr>\n\n<p>Verhoef &amp; de Boer in \"<a href=\"http://www.linguisticsinamsterdam.nl/cgi/t/text/get-pdf?idno=m0401a02;c=aclc\" rel=\"nofollow\">Language acquisition age effects and their role in the \npreservation and change of communication system</a>s\" found that, if anything, language learning by children tends to help <strong>resist language change</strong>:</p>\n\n<blockquote>\n  <p>Recent advances in  sociolinguistics indicate that changes in language\n  learning ability while growing  up can account for the different ways\n  that linguistic changes spread from  community to community. They\n  found that the structure of the system is better  preserved when\n  speakers of all ages are involved in language contact as opposed  to\n  only adult to adult contact.</p>\n</blockquote>\n\n<p>This last is an important point, in my opinion: nearly all authorities agree that <strong>language change is driven by social groups, not individuals</strong>; so the ability of children to influence change depends on sociolinguistic factors. E.g. modern Western high school students may be an important group due to their wide social influence, but babies are seldom likely to drive change since they have little to no social influence.</p>\n\n<p>I think looking at all these the overall effect is that performance errors by children don't have very great effects - but that the process of language acquisition by children influences the type and scope of change. </p>\n", "Id":"1404", "ParentId":"1392", "CreationDate":"2012-02-10T19:59:00.010", "Score":"4", "PostTypeId":"2", "OwnerUserId":"537", "LastActivityDate":"2012-02-10T19:59:00.010", "CommentCount":"3"}