{"comments":[], "Body":"<p>Imagine a simple system where there are two possible language types, A and B, and the total number of languages remains constant. Further assume that languages of type A change to type B with (<strong>stable</strong>) probability k(a), and languages of type B change to type A with probability k(b). When the system reaches a steady-state, the proportion of languages of type A will be</p>\n\n<pre><code>k(b) / ( k(a) + k(b) )\n</code></pre>\n\n<p><em>regardless of the relative frequences of types A and B at the initial state.</em> A glance at a college chemistry book on first-order reactions might prove informative, but see <a href=\"http://www.degruyter.com/view/j/lity.2011.15.issue-2/lity.2011.028/lity.2011.028.xml\" rel=\"nofollow\">Cysouw (2011)</a> for a more thorough introduction to transition probabilities as typological variables. </p>\n\n<p>Now imagine that k(a) is 4 times as large as k(b) (<em>i.e.</em> type A is diachronically unstable). This means that at steady-state, we expect for 20% of languages to be of type A, and 80% of languages to be of type B. This also means that on average, we should expect that for every language that changes from type B to type A, there are four languages that change from type A to type B. If we follow the uniformitarian principle, then there is no problem in proposing a transition from B-->A as a historical reconstruction, provided that B-->A transitions over languages are not proposed as being out of line with the proposed values of k(a) and k(b).</p>\n", "Id":"1405", "ParentId":"1398", "CreationDate":"2012-02-11T01:09:10.767", "Score":"3", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2012-02-11T01:09:10.767", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}