{"comments":[], "Body":"<p>@jlawler in the comments of your question is right - but I'll try and expand a bit because I think it's a lovely example of how we often under-estimate the complexity of the languages we speak. A dictionary is a useful tool for what it's good at, giving people a basic idea of what a word means and its basic function. To integrate the data from a dictionary into a parsing machine requires the addition of a while lot more information. </p>\n\n<p>Firstly, a dictionary gives the parts of speech (which is a good start) but nowhere in a dictionary will you find sentence-building information like \"subjects go before verbs in basic declarative sentences,\" or any of the hundreds of other syntactic rules that allow speakers to produce plausible utterances. So that's your <strong>syntactic</strong> limitation.</p>\n\n<p>Secondly, there's a <strong>lexico-semantic</strong> limitation. Think about a word like sand. We know form the dictionary that it's a noun, but we need more. We need to know it's a mass noun, not a count noun so putting a number with it is not good unless there's something to turn it into a count noun (eg. buckets of sand). Also, dictionaries don't include Proper Nouns so they're not going to be good at recognising large chunks of text (\"Lauren mentioned Chomsky on Stack Exchange\" - for example), not to mention the incredible creativity English-speakers show in creating neologisms (\"I Chomsky'd that post\").</p>\n\n<p>Thirdly, there's a <strong>phonological</strong> limitation. To give a dull but illustrative example, when do you use a\\an? You'll have to build a rule for that on top of your dictionary, but you'll need to include inter-dialect and inter-speaker variation (in fact, the same goes for all of the above).</p>\n\n<p>Dictionaries are great at what they do, and sometimes can be absorbed into computational processes in interesting ways, but it's just a small component of what you'll need to create a sentence checker!</p>\n", "Id":"1422", "ParentId":"1420", "CreationDate":"2012-02-14T08:04:23.380", "Score":"5", "PostTypeId":"2", "OwnerUserId":"64", "LastActivityDate":"2012-02-14T08:04:23.380", "OwnerUser":{"UpVotes":"126", "WebsiteUrl":"http://www.superlinguo.com", "Id":"64", "AccountId":"900445", "CreationDate":"2011-09-13T21:45:12.903", "AboutMe":"<p>I have a PhD in linguistics. My areas of interest include language documentation, Tibeto-Burman linguistics, gesture, language play, LOLspeak, evidentiality and making bad puns. I blog about language and linguistics at www.superlinguo.com</p>\n", "Age":"29", "Location":"Australia", "DownVotes":"6", "Views":"40", "Reputation":"2016", "DisplayName":"LaurenG", "LastAccessDate":"2013-10-26T00:28:12.653"}}