{"Body":"<p>I think the question being raised is whether there is a sharp line in inflectional morphology between lexemes (usually verbs) which have defective paradigms, and verbs which exhibit suppletion in their paradigms. (For an approach to inflectional morphology centered around paradigms, see Stump 2001).</p>\n\n<p>I think that to a certain extent it <em>is</em> a matter of definition, but nonetheless there are a large number of uncontroversial cases that furnish examples of suppletion and of defective paradigms. Traditionally, the term suppletion has been applied to alternations in a paradigm between verb forms which are etymologically unrelated (cf. Rudes 1980), although most modern analysts would say that the real question is whether the forms are <em>phonologically</em> related or not (cf. Corbett 2007; Fertig 1998; Mel'cuk 1994). Textbook examples of suppletion, however, almost always draw upon etymologically unrelated forms. A defective paradigm, on the other hand, is one where an expected alternation (expected based on the behavior of other verbs in the language) is simply unavailable.</p>\n\n<p>While I am not familiar with the Japanese facts, I'll go through two simple examples from English and Latin so that you can get a flavor of the type of argumentation required, and then probably make a judgment on the Japanese for yourself. Because you refer to conventional forms that seem to fill a hole in the paradigm, my first guess would be that these <em>are</em> suppletive.</p>\n\n<p>First, take the English forms <em>go, went, going, gone</em>. Under a defective paradigm analysis, we would claim that there is simply no past tense form corresponding to present tense <em>go</em>. There is, however, another verb, <em>went</em>, with a severely defective paradigm (having only this one form), which tends to get used where a past-tense analogue of <em>go</em> is needed. (See OED entries for <em>go, wend</em>, for more details) What makes this analysis improbable is that the alternation between <em>go</em> and <em>went</em> is very robust and regular, and the two words have no appreciable meaning difference other than a difference in tense. Phrasal verbs using <em>go</em>, for example, for their past tense with <em>went</em>. (e.g. <em>go crazy</em> ~ <em>went crazy</em>).</p>\n\n<p>Now consider the Latin deponent verbs (e.g. <em>locutus sum</em> \"I have talked\"), which have passive-voice forms, but active voice meanings. For these verbs, there are no forms corresponding to a passive voice meaning, related or otherwise. From glancing at the meanings of some deponent verbs (<em>conor</em> \"to attempt\"; <em>polliceor</em> \"to promise\"; <em>orior</em> \"to arise\"), we see that passive meanings corresponding to these verbs probably would not arise very often in the course of language use. Verbs having suppletive paradigms, on the other hand, tend to have a high frequency (see Veselinova 2006 for details), and the meanings expressed by the suppletive forms tend to arise frequently.</p>\n\n<p>Greville G Corbett. Canonical typology, suppletion, and\npossible words. <a href=\"http://muse.jhu.edu/journals/language/v083/83.1corbett.pdf\" rel=\"nofollow\">Language, 83(1):8–42</a>, 2007.</p>\n\n<p>David Fertig. Suppletion, natural morphology, and\ndiagrammaticity. <a href=\"http://dx.doi.org/10.1515/ling.1998.36.6.1065\" rel=\"nofollow\">Linguistics, 36(6):1065–1091</a>, 1998.</p>\n\n<p>Igor Mel’cuk. Suppletion: Toward a logical analysis of the\nconcept. <a href=\"http://dx.doi.org/10.1075/sl.18.2.03mel\" rel=\"nofollow\">Studies in Language, 18(2):339–410</a>, 1994.</p>\n\n<p>Blaire A Rudes. On the nature of verbal suppletion.\n<a href=\"http://dx.doi.org/10.1515/ling.1980.18.7-8.655\" rel=\"nofollow\">Linguistics, 18:655–676</a>, 1980.</p>\n\n<p>Gregory Stump. <a href=\"http://www.cambridge.org/gb/knowledge/isbn/item1166768/?site_locale=en_GB\" rel=\"nofollow\">Inflectional Morphology: A theory of paradigm\nstructure.</a> Cambridge: CUP, 2001.</p>\n\n<p>Ljuba N Veselinova. <a href=\"http://www.benjamins.com/#catalog/books/tsl.67\" rel=\"nofollow\">Suppletion in Verb Paradigms: Bits and\npieces of the puzzle.</a> John Benjamins, Amsterdam, 2006.</p>\n", "Id":"1429", "ParentId":"1421", "LastEditorUserId":"445", "CreationDate":"2012-02-14T23:02:28.507", "OwnerUserId":"483", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-02-14T23:26:54.843", "LastEditedUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}, "LastActivityDate":"2012-02-14T23:26:54.843", "Score":"3", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}