{"Body":"<p>As someone who does language documentation and isn't too crash hot at analysing formants there is another way to analyse vowels - which is based on the perception of the listener rather than the production of the speaker. </p>\n\n<p>The easiest way to do this is to find minimal pairs or sets - so in English we know that /a/ and /i/ are separate vowels because people have the words \"pat\" and \"pit\" so they're separate vowels. You can also do this for consonants - \"pat\" and \"bat\" are different words so /p/ and /b/ must be different. </p>\n\n<p>Of course, this measures something slightly different to production - we call the production stuff \"phonetics\" which sets out to give an inventory of all sounds but what I'm doing is something  called \"phonology\" which only looks at the sounds speakers can tell the difference between. A quick example - put your hand to your mouth and say \"pin\" and then \"spin.\" Notice that \"pin\" gives you a little puff of breath but \"spin\" doesn't? That's because technically they're slightly different sounds - which someone interested in the phonetics would case about. To speakers though the /p/ in both \"spin\" and \"pin\" sound the same so I'd treat them as one sound. </p>\n", "Id":"144", "ParentId":"137", "LastEditorUserId":"64", "CreationDate":"2011-09-14T21:53:15.863", "OwnerUserId":"64", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-14T22:41:05.167", "LastEditedUser":{"UpVotes":"126", "WebsiteUrl":"http://www.superlinguo.com", "Id":"64", "AccountId":"900445", "CreationDate":"2011-09-13T21:45:12.903", "AboutMe":"<p>I have a PhD in linguistics. My areas of interest include language documentation, Tibeto-Burman linguistics, gesture, language play, LOLspeak, evidentiality and making bad puns. I blog about language and linguistics at www.superlinguo.com</p>\n", "Age":"29", "Location":"Australia", "DownVotes":"6", "Views":"40", "Reputation":"2016", "DisplayName":"LaurenG", "LastAccessDate":"2013-10-26T00:28:12.653"}, "LastActivityDate":"2011-09-14T22:41:05.167", "Score":"2", "OwnerUser":{"UpVotes":"126", "WebsiteUrl":"http://www.superlinguo.com", "Id":"64", "AccountId":"900445", "CreationDate":"2011-09-13T21:45:12.903", "AboutMe":"<p>I have a PhD in linguistics. My areas of interest include language documentation, Tibeto-Burman linguistics, gesture, language play, LOLspeak, evidentiality and making bad puns. I blog about language and linguistics at www.superlinguo.com</p>\n", "Age":"29", "Location":"Australia", "DownVotes":"6", "Views":"40", "Reputation":"2016", "DisplayName":"LaurenG", "LastAccessDate":"2013-10-26T00:28:12.653"}}