{"OwnerUser":{"UpVotes":"47", "WebsiteUrl":"", "DownVotes":"1", "Id":"153", "AccountId":"871764", "Views":"33", "Reputation":"1445", "CreationDate":"2011-09-18T03:14:58.320", "DisplayName":"Floating Tone", "LastAccessDate":"2012-05-27T05:07:04.410", "AboutMe":"<p>I'm a PhD candidate in linguistics, with diverse interests including phonetics, phonology, morphology, language documentation, historical linguistics and sociolinguistics. I am particularly interested in the languages of Africa, Papua New Guinea and Australia. I'm also very interested in methods of making linguistic knowledge and materials more accessible and available to linguists and non-linguists alike.</p>\n"}, "comments":[], "Body":"<p>This is a very broad question, and you are seeking information on two different topics. The first is about which language people actually use, and the second is about whether or not a given language being used is less (or more) susceptible to change due to its use online. Here are a few things to think about that may help you to narrow down your question to something that <em>can</em> be answered more easily :)</p>\n\n<p>There is no work that will give you an answer like \"A 2005 study showed that the decline in number of people speaking minority dialects is highly correlated with the number of internet users\", as per your example. It's too soon for us to know about a lot of these things, and even though there are many pieces of research that touch on these issues, it is not something that can easily be directly addressed because there are so many variables. A raw number of internet users wouldn't tell us much, especially about users of minority dialects; while internet access is pervasive in the Western world, in many places it is patchy or nonexistent, particularly in linguistically diverse parts of, say, Africa or Papua New Guinea, where a great many minority languages are spoken. People investigating a correlation between internet use and the use of a minority dialect would need to look at it from a very localized perspective. (Also, there are bigger threats to minority languages than the internet - the use of dominant languages in educational and professional contexts exerts quite an influence on people's choices about which language to use.)</p>\n\n<p>It's certainly true that a number of dominant languages have a big presence on the internet, and are in many cases preferred for online communication for various reasons (because the content is  in those languages, or the scripts used for the orthography are better supported, or the people you network with use that language). But, at the same time, the internet provides minority languages the opportunity to have a presence that would not be possible if we still relied on print media (books, letters, etc.) With the internet, it's possible for anyone to publish anything, in any language, at no cost. Language documentation and language revitalization projects often make the most of this by putting language materials (stories, online dictionaries, etc.) on the web, so that the people who speak the language can access them. Of course, this doesn't necessarily mean that people will be using the language online, but anyone can start a blog, discussion group, facebook page, or whatever, in any language they like. There is a large amount of freedom here, and all that is required is that speakers of a given language are still actively using it, have other speakers to communicate with online, and that their writing system is supported by whatever technology they use. For example, online forums and websites are credited with encouraging and facilitating the increased use of Welsh during its revival (which continues), particularly because it gave people opportunities to continue to use their Welsh even if they lived in the diaspora.</p>\n\n<p>Regarding the question of whether or not the internet 'fixes' current forms of a language, well, this is another thing entirely (and too much to address in detail in this already long post!). But, I would be interested to hear why you think that the internet would 'fix' language - generally, people claim the opposite, and think that the internet is leading to the rapid evolution and degeneration of English, at least.</p>\n\n<p>Again, it's something that we can't make any big claims about yet, because it's still early to be observing any lasting effects of the internet on a given language. There are various changes that arise because of the nature of the medium (number of characters allowed in various contexts, types of writing systems allowed, the immediacy of communication) and various innovations that are internet-born (slang specific to certain user groups like World of Warcraft, use of hashtags to indicate topics) but we can't yet know whether these will last.</p>\n\n<p>Languages are constantly evolving, and this process is natural and generally pretty hard to stop. While putting things in print can contribute to the standardization of a written language, and provide 'norms', the internet is unlikely to do this - there is too much variation in how people communicate online. Think about all the different varieties of English (American English, British English, Indian English, Singapore English), the skill levels in these (i.e. many people using English are not native speakers), the varying levels of formality (many people write in a way that is closer to spoken language), and the diversity of topics and users (different corners of the internet have different slang, jargon, conventions, and standards).</p>\n\n<p>In sum: 1) too soon to know about a correlation between internet use and minority language use (other factors have bigger influences on this, and are difficult to separate out), and 2) too soon to know about the relationship between the internet and language change, but it's pretty unlikely that the internet will hold back the normal tides of change.</p>\n", "Id":"1447", "ParentId":"1419", "CreationDate":"2012-02-18T10:40:24.433", "Score":"2", "PostTypeId":"2", "OwnerUserId":"153", "LastActivityDate":"2012-02-18T10:40:24.433", "CommentCount":"1"}