{"Body":"<p>There was a study done some time in the 1970s where Dutch speaking children in the Netherlands were exposed to German children's television programming for several hours a day with on other German input. These children acquired no German. Likewise, deaf parents used to get their hearing children to watch spoken language programming to give them spoken language skills and these children didn't learn anything. So children can't learn a second language (or, technically, a second first language) without rich interactional input that isn't television.</p>\n\n<p>Adults can learn from television or CDs as long as they're geared towards language learning. That's because adults -and older children - are already literate and have had experience constantly learning things.</p>\n\n<p>Of course, children and adults can learn a second language perfectly well without native speakers - but with near native speakers as teachers. The majority of English teachers in Europe are rarely \"native speakers\" in a true sense of the word but still teach the language very well.</p>\n", "Id":"146", "ParentId":"119", "LastEditorUserId":"64", "CreationDate":"2011-09-14T22:23:25.947", "OwnerUserId":"64", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-14T22:40:25.013", "LastEditedUser":{"UpVotes":"126", "WebsiteUrl":"http://www.superlinguo.com", "Id":"64", "AccountId":"900445", "CreationDate":"2011-09-13T21:45:12.903", "AboutMe":"<p>I have a PhD in linguistics. My areas of interest include language documentation, Tibeto-Burman linguistics, gesture, language play, LOLspeak, evidentiality and making bad puns. I blog about language and linguistics at www.superlinguo.com</p>\n", "Age":"29", "Location":"Australia", "DownVotes":"6", "Views":"40", "Reputation":"2016", "DisplayName":"LaurenG", "LastAccessDate":"2013-10-26T00:28:12.653"}, "LastActivityDate":"2011-09-14T22:40:25.013", "Score":"5", "CommentCount":"3", "OwnerUser":{"UpVotes":"126", "WebsiteUrl":"http://www.superlinguo.com", "Id":"64", "AccountId":"900445", "CreationDate":"2011-09-13T21:45:12.903", "AboutMe":"<p>I have a PhD in linguistics. My areas of interest include language documentation, Tibeto-Burman linguistics, gesture, language play, LOLspeak, evidentiality and making bad puns. I blog about language and linguistics at www.superlinguo.com</p>\n", "Age":"29", "Location":"Australia", "DownVotes":"6", "Views":"40", "Reputation":"2016", "DisplayName":"LaurenG", "LastAccessDate":"2013-10-26T00:28:12.653"}}