{"comments":[], "Body":"<p>I presume your first example contains and error and you mean this:</p>\n\n<blockquote>\n  <p>What book did you return without which <strong>you</strong> can't finish the report?</p>\n</blockquote>\n\n<p>I see nothing special here. It is just a relative clause where the relative pronoun functions as a prepositional phrase within the relative clause—that is, the relative pronoun is modified by the preposition <em>without</em> in the relative clause. Relative pronouns can be modified by anything that regular pronouns can. The preposition makes it look slightly less regular, perhaps, because normally the relative pronoun is the first word in a relative clause? That is just not the case when it is modified by a preposition. It is the same in most other Indo-European languages, I believe.</p>\n\n<blockquote>\n  <p>You can't finish the report without [what book] ?</p>\n</blockquote>\n\n<p>Is fused with this:</p>\n\n<blockquote>\n  <p>[What book] did you return?</p>\n</blockquote>\n\n<p>And the result is your sentence. Fusing sentences with identical noun phrases is what relative pronouns are for. You could use a personal pronoun if you don't want to repeat the noun phrase but still want to keep the two separate sentences:</p>\n\n<blockquote>\n  <p>What book did you return? You can't finish the report <strong>without it</strong>.</p>\n</blockquote>\n\n<p>This conveys the same semantic information as the fused sentence, but it is pragmatically quite different.</p>\n\n<hr>\n\n<blockquote>\n  <p>That's a good computer <strong>on which</strong> to play games.</p>\n</blockquote>\n\n<p>This one is more complicated. The simple form (without a relative clause) would be this:</p>\n\n<blockquote>\n  <p>That's a good computer <em>to play games <strong>on</em></strong>.</p>\n</blockquote>\n\n<p>I think that is basically the same construction as this:</p>\n\n<blockquote>\n  <p>That's a good computer <em>to buy</em>.</p>\n</blockquote>\n\n<p>The only difference is that <em>a good computer</em> is the direct object of <em>buy</em>, while the prepositional object of <em>play games on</em>. I'd call these italicised infinitive constructions <strong>attributive</strong>, because they depend on the noun phrase. I don't know all the latest linguistics terms, but you know what I mean.</p>\n\n<p>What's peculiar about this is that the noun phrase functions as the object of the infinitive, while normally the word that comes before the verb is the subject, like this:</p>\n\n<blockquote>\n  <p><em>The only Frenchman</em> <strong>ever to conquer</strong> England was William the Conqueror.</p>\n</blockquote>\n\n<p>Here the <strong>subject</strong> of <em>conquer</em> is <em>the only Frenchmen</em>; in <em>a good computer to buy</em>, the preceding noun phrase is the <strong>object</strong>. That is what makes this (albeit common) use of the attributive infinitive special.</p>\n\n<p>It seems the relation between the noun and the infinitive is better considered [noun]—[postpositional adjective] than [object]—[governing verb], although functionally it is both: if one treats it as a postpositional adjective, the word order makes sense, which it does not if you look at it as subject and verb.</p>\n\n<hr>\n\n<p>Another special thing about your sentence is that the <em>on which</em> phrase is not a full clause: there is no finite verb—only an attributive infinitive to the \"noun\" that is the relative pronoun. But that exists in other languages too: relative pronouns can basically introduce anything that modifies a noun, at least in theory. Normally an elliptic clause can be imagined:</p>\n\n<blockquote>\n  <p>We've heard three sad songs now, of which [we will have] no more. Give us a merrier song!</p>\n  \n  <p>You must visit the countess next week, to whom [please convey] my compliments.</p>\n</blockquote>\n\n<p>It is hard to imagine such an elliptical clause in your example, which shows how extraordinary the noun-phrase-cum-object with attributive infinitive is. The preposition <em>on</em> (instead of a simple direct object) is a red herring that makes it looks even more complicated.</p>\n", "Id":"1475", "ParentId":"1472", "CreationDate":"2012-02-22T22:55:32.243", "Score":"1", "PostTypeId":"2", "OwnerUserId":"82", "LastActivityDate":"2012-02-22T22:55:32.243", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}