{"comments":[], "Body":"<p>In the accompanying text to chapter 81, Dryer notes that some languages are treated as lacking a dominant order because two different word orders are conditioned by <strong>syntactic</strong> factors. German and Dutch are thus treated as lacking a dominant word order because main clauses containing an auxiliary have SOV order, while main clauses without an auxiliary have SVO order. (In languages where two different word orders are conditioned by the main/subordinate clause distinction, the language is assigned the value found in main clauses) </p>\n\n<p>To take another example, Idoma (Nigeria) is treated as lacking a dominant order because (according Dryer's source, Abraham 1951: 18) in the <em>past tense</em> the object may come either before or after the verb. </p>\n\n<p>I suspect that a modern-day analyst might try to investigate whether the word order difference in terms of information structure (where the form with the object before the verb would show focus on the verb rather than on the object). When certain word orders can be tied to focus-like properties, Dryer does not treat these as competing for dominant order (they are said to be \"pragmatically marked\").\nAghem (Cameroon), for example, is treated as SVO because even though various word orders are attested, Dryer's source (Watters 1979) gives detailed arguments for why word order changes are tied to focus. Since the non-SVO orders are all \"pragmatically marked,\" they are treated as non-dominant orders, and the language is treated as being SVO-dominant. </p>\n\n<p>Like a main clause/subordinate clause split, word order changes conditioned by a polarity split also do not appear to cause a language to be treated as lacking a dominant order. Leggbo (Nigeria), Bafut and Mbili (both Cameroon) are treated as SVO-dominant, even though they have non-SVO word orders in negated clauses (see chapter 144C). Apparently, negated clauses are also treated as \"pragmatically marked.\"</p>\n", "Id":"1478", "ParentId":"1476", "CreationDate":"2012-02-24T01:05:30.133", "Score":"6", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2012-02-24T01:05:30.133", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}