{"comments":[], "Body":"<p>I think we should look at this problem in a different way. Change in language is to a considerable degree a random phenomenon and, for the sake of this answer, it can be likened to coin throwing. If you end with 51 heads and 49 tails, you don't ask what happened to throw number 51 that it landed on tails rather than heads. It just did, and all we can do is capture the general tendency for the results to distribute closely to half-half.</p>\n\n<p>It's the same thing with consonant inventories: in every language a certain number of changes has happened which resulted in its inventory being the size it is. All we can do is capture the general tendency for languages to have ca. 22 consonants. If you ask what happened to a particular language, all that can be answered to this is a list of changes that happened in it and influenced the size of its inventory.</p>\n\n<p>Atknison's 2011 idea is obviously wrong in every way but even if it weren't, it wouldn't have answered your question, either. It would have only captured a tendency.</p>\n\n<p>So, there isn't a single thing that made some languages distinguish more consonants and others less. It's always the cumulative result of different changes that took place in the language, and we can observe that on average these changes more or less cancel each other out, i.e. in most cases the inventory is changed throughout ages but its size remains approximately the same.</p>\n\n<p>It only seems that anything particular must have happened because that's the kind of impression statistic tendencies make on us. Most people who buy beer also buy chips. But one thing this doesn't mean is that someone who buys beer is also supposed to buy chips. More often than not, they will, and that's all there is to it.</p>\n", "Id":"1483", "ParentId":"1377", "CreationDate":"2012-02-24T10:56:31.060", "Score":"3", "PostTypeId":"2", "OwnerUserId":"794", "LastActivityDate":"2012-02-24T10:56:31.060", "OwnerUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}}