{"Body":"<p>As Cerberus hints in his comment on Aspinea's answer, it's quite common to use word order to convey <em>information structure</em>.  (Sadly, Wikipedia doesn't have an article on the relevant sense of the phrase \"information structure,\" and I can't find a good nontechnical introduction elsewhere. The article <em>\"<a href=\"http://amor.cms.hu-berlin.de/~h2816i3x/Publications/Krifka_InformationStructure.pdf\">Basic Notions of Information Structure</a>\"</em> by Manfred Krifka is a good survey of the subject for linguists.)</p>\n\n<p>Information structure is a pretty broad subject, but there are two basic ideas that are especially important when you're talking about word order: <em>topic</em> and <em>focus</em>. The topic of a sentence is, roughly speaking, \"what the sentence is about\". Usually, a sequence of sentences will have the same topic, or at least closely related topics. But sometimes you'll want to change topics between sentences, or to contrast two topics with one another — and speakers will tend to <em>mark</em> the new topic in some way when they do this. </p>\n\n<p>English actually does mark topic changes using word order, at least some of the time. In passages like these...</p>\n\n<blockquote>\n  <p>Mary likes beans.  Me, I can't stand them.</p>\n  \n  <p>Mary likes beans.  Lentils, she doesn't like so much.</p>\n</blockquote>\n\n<p>...the <em>left-dislocated</em> word in the second sentence (\"me\" or \"lentils\") is marking a change in topic: \"Okay, we were talking about beans before, but <em>now</em> we're gonna switch gears and talk about lentils for a while.\"</p>\n\n<p>The other important idea is <em>focus</em>.  Focus actually has a bunch of different uses (see the Krifka article I linked up above for the gory details) but one of the biggest uses is to mark <em>the answers to questions.</em>  In English we use prosody to mark focus, like so:</p>\n\n<blockquote>\n  <p>\"Who likes beans?\"<br>\n  \"MARY likes beans.\"</p>\n  \n  <p>\"How does Mary feel about beans?\"<br>\n  \"Mary LIKES beans.\"</p>\n  \n  <p>\"What does Mary like to eat?\"<br>\n  \"Mary likes BEANS.\"</p>\n</blockquote>\n\n<p>But some languages use word order to mark focus too.</p>\n\n<p>So let me give some examples from K'ichee', which is a \"free word order\" language that I've studied for a while. Default word order in K'ichee' is VOS, so the standard way of saying \"Mary likes beans\" would look like this:</p>\n\n<blockquote>\n  <p>Karaj kinaq' ra'l Mari'y  \"Mary likes beans\" (literally \"Likes beans miss Mary\")</p>\n</blockquote>\n\n<p>In K'ichee', both topics <em>and</em> foci can move to the left of the clause. After a topic, you get a pause; there's no pause after a focus; and if both the topic and focus move, the topic goes first.  You can also move words to the <em>end</em> of the clause, which makes them sound a bit like an afterthought.  So the \"real\" word order in K'iche' is more like \"Topic (pause) focus V normal-O normal-S (pause) afterthought,\" though of course you won't get all those slots filled in a single clause.    </p>\n\n<p>Anyway, this lets you say things like these:</p>\n\n<blockquote>\n  <p>Kinaq' karaj ra'l Mari'y \"Mary likes BEANS\" </p>\n</blockquote>\n\n<p>(This answers the question \"what does Mary like?\")</p>\n\n<blockquote>\n  <p>Ra'l Mari'y (pause) karaj kinaq'  \"As for Mary, she likes beans.\"</p>\n</blockquote>\n\n<p>(This changes the topic: we were talking about someone else, now we're talking about Mary)</p>\n\n<blockquote>\n  <p>Ra'l Mari'y (pause) kinaq' karaj \"As for Mary, she likes BEANS.\"</p>\n</blockquote>\n\n<p>(This changes the topic <em>and</em> answers a question. For instance, maybe you asked a minute ago about what someone else likes, but now you're asking what Mary likes, and I'm answering the second question)</p>\n\n<blockquote>\n  <p>Karaj ra'l Mari'y (pause) kinaq \"Mary likes 'em.... likes beans, that is.\"</p>\n</blockquote>\n\n<p>(This makes \"beans\" an afterthought. You might use it when you've been talking on the topic of beans for a while, but you want to <em>remind</em> your listener that that's what you're talking about.)</p>\n\n<p>And so on. The upshot is, all six permutations of subject, verb and object are possible in K'ichee', given the right combination of topic, focus and afterthought.  </p>\n\n<p>For what it's worth too, I don't speak Polish but it looks like something similar is going on in Kamil Stachowski's Polish examples. Note that sometimes he says that a particular word order <em>answers a specific question</em>. This suggests to me that those word orders are being used for focus-marking in Polish — and a little Googling turns up <a href=\"http://books.google.com/books?id=07Eu0Gzi_nIC&amp;pg=PA23&amp;lpg=PA23&amp;dq=polish%20word%20order%20focus&amp;source=bl&amp;ots=8OEVIX0uQL&amp;sig=MEvssP8ymUel_CPG1VIbMd9utfw&amp;hl=en&amp;sa=X&amp;ei=3KZHT867OIi3sQLAy93qCA&amp;ved=0CCsQ6AEwAQ#v=onepage&amp;q=polish%20word%20order%20focus&amp;f=false\">this article on Polish focus-marking</a> claiming that word order is indeed relevant.</p>\n", "Id":"1484", "ParentId":"1476", "LastEditorUserId":"306", "CreationDate":"2012-02-24T15:20:23.790", "OwnerUserId":"306", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-02-27T05:22:49.127", "LastEditedUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "LastActivityDate":"2012-02-27T05:22:49.127", "Score":"15", "CommentCount":"3", "OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}}