{"Body":"<p>A small addition to the above answers: I believe psycholinguistics in general is perhaps the field where the opposition to the notion of phoneme is the strongest. I once read a summary of a number of psychological studies which were supposed to prove that phonemes don't really exist in our minds and what speakers typically consider to be phonemes are in fact letters. I can't remember very well but I'm almost sure it was <a href=\"http://cs.indiana.edu/~port/HDphonol/Port.graphical.basis.phones.pdf\" rel=\"nofollow\">a paper by Robert F. Port</a>. I can also remember seeing a few phonological theories which attempted to do away with the phoneme completely.</p>\n\n<p>I don't want to evaluate all these ideas here. I think they might be indeed true but I surely can't prove it. This way or another, even despite its notorious indefinability, phoneme is a very handy concept in linguistic research and I guess most linguists use it many times each day, whether they believe in its psychological reality or not.</p>\n\n<p>I certainly believe in the case you mention. There are probably many cases where it is very difficult to determine whether a certain sound is a phoneme or not, see e.g. Slavonic [y] (as in Russian  ‹ы›) or Turkic [ḱ]. Nevertheless, on the whole, phoneme is a handy terminological tool and still widely used — just like we talk about nouns and verbs in English even though separating one from the other is often impossible.</p>\n", "Id":"1485", "ParentId":"212", "LastEditorUserId":"483", "CreationDate":"2012-02-24T15:22:27.267", "OwnerUserId":"794", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-02-25T13:21:16.450", "LastEditedUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "LastActivityDate":"2012-02-25T13:21:16.450", "Score":"3", "CommentCount":"3", "OwnerUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}}