{"comments":[], "Body":"<p>Contrary to some of the other answerers, I do think \"intuition blurring\" is a real thing.  It's a bit like what happens if you say the word \"zebra\" a few dozen times in a row and suddenly it stops sounding like an English word and starts sounding like a meaningless noise.  If you read dozens of complicated, multiply embedded sentences to yourself, they'll all start sounding equally good or equally funny after a while.</p>\n\n<p>But:</p>\n\n<ul>\n<li>This isn't a permanent loss of ability.  It's more like temporary sensory overload.  Going out for a walk or having a conversation that isn't about linguistics usually fixes it in my experience.</li>\n<li>Like Knitter says, it's a bit different from what you're experiencing, because you're looking at processing effects.  You can definitely teach yourself to process some \"hard\" sentences faster than a normal person.  But researchers who do language processing tend to work with controlled experiments rather than intuitive data, so it's not a huge issue for them.</li>\n<li>If you need grammaticality data and you really feel like your intuition is hopelessly fuzzy, you can ask your friends.  Hang out in a linguistics department long enough and someone will come running out of their office and ask \"Hey, you speak English, right?  Can you say X?\"</li>\n</ul>\n", "Id":"1486", "ParentId":"1439", "CreationDate":"2012-02-24T15:33:06.690", "Score":"5", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2012-02-24T15:33:06.690", "OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}}