{"Body":"<p>This is a very good question and I'm really happy I stumbled upon it. In general, however, I think there is here a very serious misunderstanding. The frequency of a typological feature is a statistical description of the occurrence of a certain phenomenon. Thus, we have the right to say that \"since F(x) is more frequent than F(y) or F(z), it is more likely to have existed in W\". But, and it is a very imporant but indeed, this does not in any way allow as to say that F(x) is really what W had. W is more <em>likely</em> to have had it, in the sense of probablistics, but we have no idea what it really had, in the actual linguistic sense.</p>\n\n<p>Let me give you a small analogy: if I tell you I threw a coin five times and the last four throws it landed on tails, can you guess how it landed the first time? No. Maybe it landed on heads because that would be statistically more likely. But maybe it landed on tails because it's not perfectly balanced. All you can say is that the four heads in a row are a little odd and not likely to happen again soon if I use a proper coin.</p>\n\n<p>One cannot draw conclusions about individual cases based on statistics. Statistics are constructed based on individual cases but they don't work backwards.  They describe the result but say nothing about the cause. Statistics are a nice conclusion of a study but they're probably useless as a beginning. Most of the times, typology can't be used to solve a specific problem in historical linguistics.</p>\n\n<p>To answer your question directly:</p>\n\n<ol>\n<li><p>Croft 2003 might perhaps be right -- if and only if this conclusion follows directly from studies on reconstructed languages. But if I understand you correctly, he is trying to impose modern typology onto reconstruction. In that case his result may possibly be right but his methodology surely isn't. A bit like the ancient Greeks came up with atomism.</p></li>\n<li><p>If frequency of F(x) &amp;c. is all we have, then we simply have no way of telling what existed in W. Maybe some seemingly unrelated data can help; maybe there was strong external influence on Y and Z or maybe F(x) and F(y) have only been attested recently, while F(z) is very old? At any rate, more data is necessary because typology alone solves nothing here.</p></li>\n</ol>\n", "Id":"1487", "ParentId":"1398", "LastEditorUserId":"794", "CreationDate":"2012-02-24T17:42:48.463", "OwnerUserId":"794", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-02-24T20:40:23.030", "LastEditedUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}, "LastActivityDate":"2012-02-24T20:40:23.030", "Score":"2", "CommentCount":"2", "OwnerUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}}