{"Body":"<p>My previous answer (see edit history) concerned signed languages generally, as they all form content words (eg. nouns, verbs, ) with the hands and use facial expression and body movements to form grammatical function words as in Alenanno's example, adverbial <em>“not”</em> formed by puffed cheeks, or my example, the complementizer <em>“that”</em> that signals a relative clause and takes the form of a raised lip in both ASL and TID.</p>\n\n<p><em>“[relative clause] constructions are accompanied by special non-manual markers: tensed cheeks and tensed upper lip”</em></p>\n\n<p>From a lecture  \"Relative Clause Constructions in Turkish Sign Language” given by Okan Kubus at the Nijmegen Gesture Centre, 2 February 2011:                 M\n<a href=\"http://www.mpi.nl/research/research-consortia/nijmegen-gesture-centre-1/events/past-series\" rel=\"nofollow\">http://www.mpi.nl/research/research-consortia/nijmegen-gesture-centre-1/events/past-series</a></p>\n\n<p>These uses of the mouth are part of TID grammar and are distinct from mouthing words of spoken Turkish while signing TID. (My gestures when speaking English are often signs from ASL, but no one suggests these are part of English.)<br>\nThose mouthed words can be borrowed, sort of. Non-visible phonetic features like voicing or velarization obviously won't be, but any visible features of spoken words can be borrowed into the signed language if they don't interfere with the grammatical usage discussed above. In that case the borrowed features will change to conform with the regular phonological constraints of the borrowing signed language, and may end up looking totally unlike the original spoken word, and may become an obligatory part of the lexical sign. </p>\n\n<p>This lexical use of mouth movements are also distinct from the grammatical usage above. Zeshan, cited above, gives an example.</p>\n\n<p><em>The sign ‘Deaf’ is used in combination with two diﬀerent mouthings that both  consist  of  two  Turkish  words  coordinated  with  the  double contact of the index ﬁnger at the corner of the mouth and then at the ear. The ﬁrst mouthing, /sag ˘ır dilsiz/ ‘deaf dumb’ (lit. ‘deaf without-tongue/language’) is the older, more traditional term, whereas younger people, under the inﬂuence of more recent political correctness, often use the term  /is¸itme engelli/ ‘hearing impaired’ instead.</em> (page 48)</p>\n\n<p>Here we see a lexical, not grammatical, use of mouthing: two forms of a TID word whose meaning, “deaf”, is distinct from either of the Turkish substrate phrases that contributed to it.  In English, Turkish or TID,  the word's meaning “deaf” is complete, and if you want to say “not deaf” you add the grammatical function word, <em>/not/, /degil,/ or /puffed cheeks/</em>, respectively.<br>\nHere is a whole book on this topic</p>\n\n<p><em>Boyes-Braem, Penny, and Sutton-Spence, Rachel eds. 2001. The Hands are the Head of  the Mouth: The Mouth as Articulator in Sign Languages. International Studies on Sign Language and Communication of  the Deaf ; 39. Hamburg: Signum Verlag.</em> </p>\n", "Id":"1510", "ParentId":"1508", "LastEditorUserId":"111", "CreationDate":"2012-02-28T18:05:10.473", "OwnerUserId":"803", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-03-28T10:03:37.100", "LastEditedUser":{"UpVotes":"308", "DownVotes":"10", "Id":"111", "AccountId":"514008", "Views":"172", "Reputation":"5430", "CreationDate":"2011-09-14T09:33:29.710", "DisplayName":"Alenanno", "LastAccessDate":"2014-01-19T00:38:35.883", "AboutMe":"<p>I'm a student majoring in Languages (branch: Linguistics), currently working as a freelance translator. I've recently discovered <a href=\"http://db.tt/WpiKeReH\" rel=\"nofollow\">Dropbox</a> and I'm going to use it for my needs! :)</p>\n\n<p><em><strong>I love</em></strong><br>\nLanguages, Movies (Fantasy, Sci-Fi, Tarantino, etc.), Music, 3D Graphics, books and so on. </p>\n\n<p>Appointed ♦ Moderator Pro Tempore on <a href=\"http://area51.stackexchange.com/proposals/6673/linguistics?referrer=GlDGLdkDYNxMg1X13CJ1vg2\">Linguistics SE</a>, <a href=\"http://area51.stackexchange.com/proposals/6388/chinese-language-usage?referrer=XzTG1Nz01tc01sJEhak_6g2\">Chinese SE</a> and the <a href=\"http://area51.stackexchange.com/proposals/10848/russian-language-usage?referrer=J7IYS3ZUomUDvVVb-6SmDQ2\">Russian SE</a> site. If you're interested in other Stack Exchanges, try the <a href=\"http://area51.stackexchange.com/proposals/42949/italian-language-usage?referrer=ALVtGpK0tjLp1Lw15QCaUA2\">Italian SE</a> site.</p>\n\n<p>I like to lurk on other sites' Metas. <em>Meta is fun!</em> </p>\n\n<p><strong>My feature requests</strong>:</p>\n\n<ol>\n<li><a href=\"http://meta.stackoverflow.com/q/135786/176533\">Alert a moderator when an answer is improved after a post notice</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/138273/176533\">Automatically add chat event to the community bulletin (or make it easier)</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/121363/176533\">Give 10k users the ability to see the total count of flags they've handled</a></li>\n</ol>\n\n<p><strong>Moderator issues</strong>: If you have concerns or want to contact me about my moderation, you can find/ping me either in the <a href=\"http://chat.stackexchange.com/rooms/1336/linguistics\">Linguistics SE chat room</a> or <a href=\"http://chat.stackexchange.com/rooms/1984/chinese-language-and-usage\">CL&amp;U chat room</a>; if I'm not there or I'm \"idle\", just ping me! Please <em>avoid</em> using my personal email for such things. Use the chat rooms.</p>\n\n<hr>\n\n<p><strong>Languages List</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <sup>Languages with  * = learning on my own</sup></p>\n\n<p><strong>Mother Tongue:</strong> Italian, Sardinian;<br>\n<strong>Fluent:</strong> English, Spanish;<br>\n<strong>Less Fluent:</strong> French, German, Russian;<br>\n<strong>Learning:</strong> Japanese*, Chinese*, Swedish*, Greek*, Finnish*;<br>\n<strong>Willing to learn:</strong> Welsh, Korean, Dutch, Arabic, Hebrew, Hindi [to be continued]</p>\n\n<p>Me gusta el Español.<br>\nJ'aime le Français.<br>\nDeutsch gefällt mir.<br>\nМне нравится Русский язык.<br>\n私は日本語が好きです。<br>\n我爱中文。<br>\nJag älskar Svenska.</p>\n"}, "LastActivityDate":"2012-03-28T10:03:37.100", "Score":"6", "CommentCount":"1", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"803", "AccountId":"1285298", "Views":"7", "Reputation":"408", "CreationDate":"2012-02-28T18:05:10.473", "DisplayName":"Joe Martin", "LastAccessDate":"2012-04-17T06:20:47.550"}}