{"comments":[], "Body":"<p>I don't quite see the link between your question about word boundaries and what syllables the language permits. Could you elaborate?</p>\n\n<p>As for one versus two words, I don't think there is a universal method. It mostly depends on what the particular language does to its words and affixes, e.g.</p>\n\n<ol>\n<li>Stress is perhaps the most universal method, as almost all languages have it, and in your example it must be either one or two. Counterexamples: 1. one can always claim <em>li</em> is a separate word which might lose its accent in certain combinations; 2. stress solves nothing in cases such as Polish <em>w</em> 'in' or <em>z</em> 'from' which are only made up of a single consonant and so can't be stressed anyway (they count as separate words, in case you're interested).</li>\n<li>The possibility to insert a separate word in between can also help answer your question. How would you say 'the smart dog' in your language? Can 'smart' go between <em>li</em> and <em>stulu</em>? Counterexamples: German, Dutch, Hungarian &amp;c. separable verbs are typically counted as one word, although they can be separated, their order swapped, and other words inserted in between.</li>\n<li>Vowel harmony is a good method in languages which have it. Counterexamples: Hungarian <em>-kor</em> temporalis does not harmonize with the stem, yet it is counted as a suffix rather than a separate word.</li>\n<li>Mutations which only happen on morpheme boundaries. Unfortunately, no ready example comes to my mind.</li>\n<li>Native speaker intuition would be a great method if it only weren't so shaky. It's a sort of chicken and egg problem with NS intuition and spelling, e.g. Russian <em>v</em> 'in' was first written together with the word, and later the spelling was changed to separate.</li>\n</ol>\n", "Id":"1539", "ParentId":"1536", "CreationDate":"2012-03-02T08:06:36.713", "Score":"5", "PostTypeId":"2", "OwnerUserId":"794", "LastActivityDate":"2012-03-02T08:06:36.713", "OwnerUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}}