{"Body":"<p>The example of Piraha shows that Chomsky's basic claim about language is incorrect, and that's it. There are no legitimate debates to be had here, it is just a falsification, plain and simple. The fact that linguists are denying it bears sad testimony to the sorry state of the field.</p>\n\n<p>Chomsky retrenched position is essentially a vacuous tautology, that people are able to learn language, and that they have a brain facility that helps them do this. This is a pity, because the original idea of universal grammar is the most powerful unifying principle ever devised for linguistics, and it is important to investigate how it fails. This is not going to happen as long as the field of linguistics doesn't acknowledge that it fails.</p>\n\n<p>The only predictive statement commonly associated with the idea of universal grammar is that sentences in a language should be able to make clause-embedded parse trees of arbitrary depth. Here is an example in English:</p>\n\n<ul>\n<li>John put the cat on the bed</li>\n<li>John put the cat who put the mouse in its mouth on the bed.</li>\n<li>John put the cat who put the mouse who booked the plane to Chicago in its mouth on the * bed.</li>\n<li>John put the girl who placed the cat who put the mouse who booked the plane to Chicago in its mouth on her lap on the bed.</li>\n</ul>\n\n<p>And so on, always grammatical, but with ever diminishing clarity. The existence of this type of recursive sentence structure occurs in English, in French, in modern Hebrew, in Chinese, and in all the languages the reader of this sentence is likely to speak. The construction is called recursive, because it allows embeddings arbitrarily far (in principle), and it allows infinite length sentences, so that there are infinitely many sentences that can be produced even when the vocabulary is restricted to one verb (put), two nouns (cat and mouse) and the necessary function words.</p>\n\n<p>This type of recursion is the most difficult to parse, because it is \"center embedding\", meaning that you need to push stuff down on a stack and restore the context later, to unravel the nested implicit parentheses. Other examples of potentially infinite length sentences don't require as much effort:</p>\n\n<ul>\n<li>Jack gave the book to Bobby</li>\n<li>Jack gave the book to Bobby, then to Jane</li>\n<li>Jack gave the book to Bobby, then to Jane, then to Mary.</li>\n</ul>\n\n<p>Etc. The sentence doesn't become harder to understand. This is just a list. You don't have to push context and restore to make sense of this, you just add stuff to a list.</p>\n\n<p>Here is another example of a list</p>\n\n<ul>\n<li>John and Bill and Mary and Martha and Zoe and Alberta and Jane and Willy went to the store.</li>\n</ul>\n\n<p>Again, no effort required. It's just a list. Here is another example</p>\n\n<ul>\n<li>I have one hundred million million billion letters.</li>\n</ul>\n\n<p>So numbers are automatically recursive.</p>\n\n<p>Here is an example of nested clauses that don't require massive effort (unlike the cat with the mouse on the bed).</p>\n\n<ul>\n<li>Jack went to Rio which is the best city in Brazil, which is the best country on the planet which is the best planet in the solar system which is the best solar system in the galaxy.</li>\n</ul>\n\n<p>This is recursive, but it doesn't require popping the stack. It's tail-recursion in CS jargon. You can just flush the stack when you are done parsing the sentence, and you never need to restore the original context to make sense of what is relating to what and how.</p>\n\n<h3>Chomsky's claims</h3>\n\n<p>Chomsky's original claim is that all languages recurse in the same way. This is incredibly predictive. I will share a personal anecdote.</p>\n\n<p>When I first got Chomsky's stuff (from reading CS, I only read a little Chomsky later), I went to a friend of mine who spoke Chinese. I then asked her to parse the cat-bed sentence with 4 levels of recursion. This is difficult for a native speaker, and for a non-native speaker, it's basically hopeless. She couldn't understand it, and when she did, she <em>assured</em> me, with confidence, that this type of sentence would have no corresponding Chinese equivalent. Her claim is that Chinese does not embed this way (center embedding four levels deep).</p>\n\n<p>I assured her that it <em>did</em> (using Chomsky's hypothesis of universal grammar). Then I laboriously asked her for the word-for-word Chinese translation of the simpler versions (with only one and two levels of recursion), and wrote down what the Chinese 4-level recursive version should be, given this data. I presented it to her, she is a native speaker, and asked her if it was grammatical.</p>\n\n<p>She looked at it for a <em>long</em> time, and finally said \"Yes. It is grammatical.\" She was <em>surprised</em> that you could say it in Chinese, but she understood that you could say it, by intuition. This means that she had internalized the recursive rules of sentence construction without consciously knowing what they were, or even that they were tree recursive. In fact, she consciously believed that they were not tree recursive, even when they clearly are. This verifies the idea, associated with Chomsky's name, that all children learn the grammar unconsciously and without conscious awareness of absorbing the rules, or even of the character of the rules, suggesting that the grammatical recursive sentence structure is hard-wired into the brain.</p>\n\n<p>So here is a nontrivial test of Chomsky's hypothesis, between two of the most distantly related old world languages. You can do it too. People have been doing this for 50 years. It is really remarkable how simple it is to translate the sentences once you know some simple word order and embedding rules. There is no sentence you can't translate with at least a roughly corresponding grammatical construction between any two of the modern common languages.</p>\n\n<p>The homogeneity of the grammar of the major old-world langauges is ridiculously compelling evidence that Chomsky is right, that all languages share an essential recursive structure which is fundamentally isomorphic, underneath the superficial word-order differences.</p>\n\n<p>This is the strong Chomsky thesis--- all languages share a common grammar which only differs in superficial ways, and allows center embedding and embedding of arbitrary depth. It is a remarkable idea, because it immediately suggests that language grammar was the central fundamental property of human beings that made us intelligent. It suggests that this recursive stuff is at least about 40,000 years old.</p>\n\n<p>So recursion in language is the fundamental faculty of the human mind. Further, all human beings have an innate mathematical sophistication which is largely independent of culture or history, that is just in our genes, that allows us to absorb stack-recursion ideas unconsciously.</p>\n\n<p>These ideas are so central to mid-twentieth century thinking, that denying that they were proposed by Chomsky is an egregious falsification of history. Further, even if this idea is <em>wrong</em>, it is still an incredibly <em>good</em> idea. It is also not too far off the mark in terms of what type of mathematical structures the human brain can intuitively readily accept. These are the tree-structured recursive grammars that are parsed by a stack, using pushing and popping.</p>\n\n<p>If Chomsky is now saying the above ideas aren't due to him, then who are they due to? They are certainly of the period 1950-1980, this is the period when Bacchus's team developed recursive grammar specifications for FORTRAN, to make natural-sounding computer languages. It is the time that recursion theory became recognized as fundamentally equivalent to thinking. It is also the time that Skinnerian models of regular language grammars were shown to be total failures, and Skinnerian type positvist models that deny internal computations were rejected because they were too impoverished. All these things have Chomsky written all over them.</p>\n\n<p>If it wasn't Chomsky, somebody else would have come up with the ideas above at about the same time. But if it wasn't Chomsky, this person wouldn't have been able to publish these ideas, because everyone knows these ideas are due to Chomsky. When I read Chomsky, I certainly get the sense that this is what he means. Even if he now says that this isn't what he meant, it is certainly what everyone else thought he meant, so it is what \"Chomskian linguistics\" means to me, and what it should mean to everybody, no matter what Chomsky says today.</p>\n\n<h3>Exceptions</h3>\n\n<p>As exceptions to the grammar universality piled up, Chomsky retrenched. The surprising and counterintuitive fact is, that if you look at isolated cultures, you don't find examples of center recursion or complex many-level embeddings. This known to be true of Warlpiri, and now it is claimed for Piraha.</p>\n\n<p>In Warlpiri, people say that you just would never ever make a sentence like</p>\n\n<ul>\n<li>The cat put the mouse who put the moldy cheese in its mouth in its mouth.</li>\n</ul>\n\n<p>Note that this is center embedding, but not too deep, so it is still comprehensible without effort. You just don't do that in Warlpiri. You make separate sentences.</p>\n\n<p>This is a bit of a shocker, because the Warlpiri, if brought up in an English speaking culture, will understand and produce center-recursive sentences. But they just don't do it in their language. People said this in the 1970s, and claimed it falsified Chomsky, but nobody listened to them.</p>\n\n<p>But although Warlpiri might not allow sophisticated recursion, there might be some form of recursion (I don't know, I never studied Warlpiri). Something simple, like</p>\n\n<ul>\n<li>John and Mary and Martha and James went to the store</li>\n</ul>\n\n<p>These are not center embeddings, so they don't give you the most ambitious idea of universal grammar, but they allow you to believe that the list-making operation \"merge\" operates in all languages, and might be the central feature of human thinking.</p>\n\n<h3>Surprise! Wrong-O!</h3>\n\n<p>This is where Everett comes in. He shows that Piraha's grammar is <em>completely</em> nonrecursive. That means it truly has a finite number of sentences.</p>\n\n<p>This means: no \"and\" recursion, no \"or\" recursion, no possessive recursion, no number words, no list recursion of any form. Further, no tail recursion, no central recursion. In fact, <em>no clause embedding at all</em>.</p>\n\n<p>This, to me, is as stunning as finding life on Mars. It completely overturns the ideas of Chomskian linguistics, in their predictive and powerful form, explained above. It establishes that recursion is <em>not</em> an evolved feature of humans dating back 40,000 years, but it probably far more recent. It perhaps dates to about the invention of writing, in which case we might be able to trace the evolution of recursive grammar in historical texts.</p>\n\n<p>The lack of number words, and-lists and so on is a remarkable feature of Piraha. It seems that it survived for no other reason than to completely knock down Chomsky.</p>\n\n<h3>Skeptics' absurd claims</h3>\n\n<p>Some skeptics have criticized Everett's analysis of Piraha. This despite the fact that they don't speak Piraha, and Everett does. They use Everett's previous published analysis of the language, made when he held Chomskian beliefs, that held that there is a word \"sai\" that is used for clause embedding.</p>\n\n<p>But Everett noticed that \"sai\" never center embeds. He also noticed that it always occurs between what could be construed as stand-alone sentences. Further, once he gained full fluency, he realized that sai was not a clause constructor at all, but something else which I don't understand (Everett's examples are reasonable and persuasive that it is not embedding).</p>\n\n<p>But even if you grant the skeptics that sai is an embedding, it only embeds one level deep! This means that there are still a finite number of Piraha sentences, even with sai, period. Because there certainly is no other form of recusion, no lists, no tails, and sai never works twice, as even the skeptics admit.</p>\n\n<p>So Chomsky's claim of \"merge\" being recursive fails for Piraha with certainty, even using the manifestly incorrect analysis of the skeptics. So it is a counterexample to the strong claims above for sure.</p>\n\n<p>This means that Chomskian ideas are wrong. Its an astonishing falsification of a powerful thesis, and I think there is no shame in having made such a powerful prediction, even if it does turn out to be wrong. If Chomsky decides to disown this idea, he should really say whose ideas they are, because they certainly aren't mine (although that would be nice).</p>\n", "Id":"1545", "ParentId":"1515", "LastEditorUserId":"810", "CreationDate":"2012-03-03T05:11:58.517", "OwnerUserId":"810", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-03-03T06:23:50.940", "LastEditedUser":{"UpVotes":"39", "WebsiteUrl":"", "Id":"810", "AccountId":"528458", "CreationDate":"2012-03-03T03:39:07.707", "AboutMe":"<p>Everett is right. Chomsky was wrong. I want to know how recursion spread from Greece through the old world, and it seems we will find out. I am also curious about simpler examples of recursion, like list making.</p>\n\n<p>I mostly blindly follow Gell-Mann and agree with Joseph Greenberg about superfamilies and mass-comparison. I don't see any reason that the mass-comparison method cannot be made rigorous with good statistics.</p>\n\n<p>I like formal grammars, and I don't believe I understand something unless I can program a computer to understand it the same as me. My linguistic goal today is to write a good English parser. I think I can do at least marginally better than current parsers, which seem to be weighed down with theoretical cruft. Maybe it'll read a newspaper, maybe not. I hope to find out soon enough.</p>\n", "Age":"41", "Location":"New York City", "DownVotes":"0", "Views":"92", "Reputation":"481", "DisplayName":"Ron Maimon", "LastAccessDate":"2014-01-02T00:11:46.293"}, "LastActivityDate":"2012-03-03T06:23:50.940", "Score":"2", "CommentCount":"14", "OwnerUser":{"UpVotes":"39", "WebsiteUrl":"", "Id":"810", "AccountId":"528458", "CreationDate":"2012-03-03T03:39:07.707", "AboutMe":"<p>Everett is right. Chomsky was wrong. I want to know how recursion spread from Greece through the old world, and it seems we will find out. I am also curious about simpler examples of recursion, like list making.</p>\n\n<p>I mostly blindly follow Gell-Mann and agree with Joseph Greenberg about superfamilies and mass-comparison. I don't see any reason that the mass-comparison method cannot be made rigorous with good statistics.</p>\n\n<p>I like formal grammars, and I don't believe I understand something unless I can program a computer to understand it the same as me. My linguistic goal today is to write a good English parser. I think I can do at least marginally better than current parsers, which seem to be weighed down with theoretical cruft. Maybe it'll read a newspaper, maybe not. I hope to find out soon enough.</p>\n", "Age":"41", "Location":"New York City", "DownVotes":"0", "Views":"92", "Reputation":"481", "DisplayName":"Ron Maimon", "LastAccessDate":"2014-01-02T00:11:46.293"}}