{"Body":"<p>I have read the latest edited version of your question, and I think I understand what you mean now.</p>\n\n<p>It is important to make a distinction between an ordinary suffix and a case ending (which could be considered a special kind of suffix). Consider the following two examples:</p>\n\n<blockquote>\n  <p><em><strong>Magni viri</em></strong> liber est in mensa.</p>\n  \n  <p>\"<em>The large <strong>man's</em></strong> book is on the table.\"</p>\n</blockquote>\n\n<p>The Latin sentence means exactly the same as the English one. The word <em>liber</em> (\"book\") is the subject of the sentence, and so it is in the nominative; <em>viri</em> (\"of the man\") is in the genitive, as indicated by the case ending <em>-i</em> (the nominative would be <em>vir</em>). The adjective <em>magni</em> (\"large\") is also in the genitive (nominative <em>magnus</em>). The head word (<em>viri</em>) of the noun phrase (<em>magni viri</em>) determines the case, number, and sex of the whole noun phrase; the adjective must always be in the exact same case, number, and sex.</p>\n\n<p>This is a central principle in most of the case-heavy languages, including Latin, Greek, and German. Perhaps it would be better to characterise them as heavy in noun inflection, as this includes number and sex too. This principle is called <em>concord</em> or <em>agreement</em>, as you may know.</p>\n\n<p>Consider the contrast with the English phrase: only the head of the noun phrase, the noun itself, is marked (with <em>'s</em>). Because the English suffix does not involve concord, I would not call it a case ending. The principal remaining concord in English is between subject and verb (<em>I am</em> v. <em>he is</em>). How about Biblical Hebrew? Is only the head marked, or adjectives as well?</p>\n\n<p>Can you see now how easy it is to add a relative clause to an inflected noun phrase?</p>\n\n<blockquote>\n  <p>Pater  <strong>magnum virum</strong> in urbe <strong>captum</strong>,   qui pius erat, servavit.</p>\n  \n  <p>[Father <strong>large  man</strong> in city <strong>having-been-captured</strong>, who pious was, saved.]</p>\n  \n  <p>\"Father saved a large man captured in the city, who was pious.\"</p>\n</blockquote>\n\n<p>This time <em>virum</em> (\"man\") is in the accusative, because it is object. I have marked all words agreeing in case/number/sex with <em>virum</em> in bold. The word <em>pater</em> (\"father\") is marked as subject by the nominative. The finite verb of the main clause is <em>servavit</em> (\"saved\").</p>\n\n<p>The parsing difficulties in your <em>the wide open sheep grazing field-from-ly</em> are not present in the Latin, simply because the first word of the noun phrase (<em>magnum</em>) is already marked as object. Imagine if the word <em>the</em> in your <em>field</em> phrase were already marked as \"from-ly\". It would look like this:</p>\n\n<blockquote>\n  <p>I walked the-<em>from-ly</em> wide-open-<em>from-ly</em> sheep-grazing-<em>from-ly</em> field-<em>from-ly,</em> where John slaughtered the goat, store-<em>ward</em>.</p>\n</blockquote>\n\n<p>See how the parsing problem disappears? You don't need to hold your breath for the function of the noun phrase to appear.</p>\n\n<p>German works the same way, and Ancient Greek too. The latter does have a few suffixes that serve as case endings but are only attached to the head word; and you are right, those can normally only be used when the noun phrase consists of a single word, no dependencies or embedding. But I can only think of two such suffixes, and they are rare and/or semi-archaic.</p>\n\n<blockquote>\n  <p><strong>οἶκόνδε</strong> νέεσθαι</p>\n  \n  <p>[<strong>house-ward</strong> to return]</p>\n</blockquote>\n\n<p>The word οἶκός (/oi.kos/) means \"house\"; the suffix δε (/de/) means \"towards\"; νέεσθαι (/ne.e.stai/) means \"to return\". (The accusative ending -όν (/on/) is used because the suffix -δε requires the accusative.) So the whole means \"to return home\". This suffix cannot be used with complex noun phrases, as you suggested.</p>\n\n<hr>\n\n<p>As to your suggestion that embedding a clause in the middle of another clause did not happen until the Hellenistic period, that is just not correct. It took me a whole two minutes to find a counter example, in lines 11 and 12 of the Odyssey. Homer's work comprises the oldest European literature in existence, probably composed in the 8th century BC.</p>\n\n<blockquote>\n  <p>ἔνθ᾽ ἄλλοι μὲν πάντες, <strong>ὅσοι φύγον αἰπὺν ὄλεθρον</strong>,</p>\n  \n  <p>οἴκοι ἔσαν, [πόλεμόν τε πεφευγότες ἠδὲ θάλασσαν]</p>\n  \n  <p>\"then all others, <strong>whoever escaped sheer destruction</strong>,</p>\n  \n  <p>were home, [the war having escaped already over sea]\"</p>\n</blockquote>\n\n<p>The word ὅσοι is a relative pronoun referring back to ἄλλοι μὲν πάντες, \"all the others\"; it introduces a subordinate clause with the finite verb φύγον, \"escaped\". The main clause has ἄλλοι μὲν πάντες as its subject, and ἔσαν (\"were\") as its finite verb.</p>\n\n<p>The Homeric poems were meant to be recited out loud in the correct rhythm (metre). In fact, nearly all literature of Antiquity was meant to be read out loud up until the emergence of novels, around the first century AD. So people were able to use and understand (centrally) embedded clauses in speech throughout European history. I agree that they are generally less easy to parse than embedding at the end of a sentence, so there were obviously some restrictions, just as now; but central embedding was used. It is probably very, very old.</p>\n\n<p>One thing to note is that relative pronouns were relatively new: it can be observed in Homer that relative pronouns were still in the process of developing out of demonstrative/personal pronouns of the third person (there never was a strong distinction between demonstrative and personal pronouns of the third person in Latin and Greek throughout Antiquity). However, participles are much older, as are conjunctions; and both can be used to embed verbs with complements just as well, and were in fact so used (e.g. in Homer).</p>\n", "Id":"1550", "ParentId":"1548", "LastEditorUserId":"82", "CreationDate":"2012-03-03T06:59:51.473", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-06-17T02:29:27.040", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2012-06-17T02:29:27.040", "Score":"9", "CommentCount":"8", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}