{"Body":"<p>From a purely linguistic scientific point of view, i.e. abstracting from all humane feelings such as compassion &amp;c., I would say the most important reason to care about languages dying out is <strong>data</strong>. Generally, those languages that die out, are also the least attested and least researched ones. Since written material and recordings are usually scarce, with the death of the last native speaker, we irreversibly lose the possibility to ever properly investigate the language. This is bad because linguists care about languages (or at least they should), and they care about parallels, cognates, reflexes and other things that can help them study other languages.</p>\n\n<p>The real reason, however, why so many linguists are nowadays interested in dying languages is <strong>fashion</strong>, in my opinion. The trend goes hand in hand with ecology, manifesting appreciation for other cultures and other typically late 20th c. points of view, and brutally speaking it has become fashionable in some centres to conduct field research. This is not to say field research hasn't been done earlier; just not in that scale.</p>\n\n<p>Also, not all people interested in languages are necessarily <strong>sit-at-home</strong> type of people. Field research gives them a great opportunity to study what they like the way they like it.</p>\n\n<p>But the phenomenon is not without a <strong>dark side</strong>, either. Field research is a costly enterprise and requires a specific set of mind, which does not cooccur terribly often with a scientific attitude. As a result, a great deal of field research nowadays is done by 'curiosity hoppers', i.e. collectors of linguistic pecularities (and their own fame) from a multitude of randomly chosen exotic languages, none of which they ever become specialists in. Sort of cabinet of curiosities kind of attitude. As a consequence, a lot of data thus collected is totally unreliable and next to useless, and proper linguists find it very difficult to obtain further funding because the languages they want to investigate are, in theory, already described. <strong>Edit:</strong> removed a specific example because apparently some users consider a warning against dilettantism to be equivalent to wishing a language to die out. My aim was not to start a flame so just see the history of this post if you're interested.</p>\n", "Id":"1552", "ParentId":"1549", "LastEditorUserId":"794", "CreationDate":"2012-03-03T08:10:30.480", "OwnerUserId":"794", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-03-05T20:58:30.380", "LastEditedUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}, "LastActivityDate":"2012-03-05T20:58:30.380", "Score":"11", "OwnerUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}}