{"OwnerUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}, "comments":[], "Body":"<p>This is a good observation and a good question, and the comments below it make a valid point, as well.</p>\n\n<p>In short, I would say that there is no such thing as a solid cross-linguistic concept of 'proper nouns' -- or at least, none commonly accepted and adhered to. My own experience is that the term is primarily used to refer to what you could call prototypical proper nouns (<em>Coca-Cola</em>, <em>Berlin</em>, <em>John Brown</em> &amp;c.), and rarely to not so clear cases.</p>\n\n<p>I suppose there might have been more than one attempt at a proper definition, but neither has gained enough following to be even known of by the majority of linguists. Here a long and passionate rant is in order on the attitude towards properly defined terms in linguistics, but instead I'll just say that you might not be able to even find a single term which <em>every</em> linguist understands the same way for <em>every</em> language. You will, however, have no difficulty finding a linguist who can't give a proper and cross-linguistically solid definition for virtually any term he or she's used while talking to you.</p>\n\n<p>Basing a definition on language-specific spelling is obviously not a great idea, although in some cases it might be the best we have. 'Whatever's written between spaces' remains the best definition of <em>word</em> I know. </p>\n\n<p>If you were to create a definition of your own, I suppose you should try to capture the common and distinctive features of the prototypical cases. You should not, however, get your hopes up about how many linguists will memorize it and adhere to it. It's a hopeless bunch in this regard.</p>\n", "Id":"1557", "ParentId":"1529", "CreationDate":"2012-03-03T15:59:36.737", "Score":"3", "PostTypeId":"2", "OwnerUserId":"794", "LastActivityDate":"2012-03-03T15:59:36.737", "CommentCount":"4"}