{"OwnerUser":{"UpVotes":"10", "WebsiteUrl":"http://loyc-etc.blogspot.com", "Location":"Alberta, Canada", "Id":"519", "DownVotes":"0", "AccountId":"11756", "Views":"4", "Reputation":"149", "CreationDate":"2011-11-19T00:30:16.290", "DisplayName":"Qwertie", "LastAccessDate":"2013-03-04T20:45:15.840"}, "comments":[], "Body":"<p>As I was commenting above, English has a possessive \"case\" marker that can apply to phrases and it exhibits an \"allergy\" to recursion.</p>\n\n<p>On the other hand, if \"cases\" just refer to context-sensitive form variations like \"be is am are was were\", I see no clash with recursion there (likewise in Spanish, which has plenty of recursion but vastly more verb forms than English.) Esperanto has a simple two-noun-case system and a very productive system of affixes, but when you're used to it, it feels very natural even though the affixes can't mark phrases.</p>\n\n<p>If we're simply talking about morphology that changes word meaning, I don't see a real issue there either. For example, in Esperanto I can say manĝaĵujo, a food container, with the \"container\" suffix -ujo, but ruĝa fruktujo \"red fruit container\" should mean \"a fruit container that is red\", not \"a container of red fruit\"... basically what I'm getting at is that affixes ordinarily apply only to words, not phrases, and this is no different from English affixes. Yet this doesn't feel like an incompatibility between recursion and morphology, merely a limitation on the complexity of morphological changes. If I want to say \"container of red fruit\" then I simply give up on affixes and say \"ujo de ruĝa frukto\", \"container of red fruit\".</p>\n\n<p>Now I can only talk about the languages I know about (English, Spanish and Esperanto, all in the same family I'm afraid) but it seems to me that word-level variations such as case markers and affixes can be thought of as providing shortcuts for standalone words like \"of\", \"that\", \"female\" (stewardess) etc. Yes, word-level changes don't play well with recursion but that doesn't necessarily encourage them to disappear. As long as they provide some utility that the stand-alone alternatives don't, they will tend to stay. For example, English will keep \"'s\" for the foreseeable future because it is more concise than \"of\" (and because \"of\" is more ambiguous, having more meanings than just the possessive); and this would probably be true even if \"'s\" were strictly applicable onto to words and not phrases. If Esperanto ever became really popular, the accusative case \"-n\" might disappear for most sentences, yet would probably remain whereever it provides information concisely, e.g. \"hejmen\" = homeward, to home.</p>\n\n<p>Anyway, I'm a linguistic 'newb' myself. I suspect there are lots of forces acting on languages that neither of us appreciate very well, forces that probably outweigh the hypothesis of this question.</p>\n", "Id":"1561", "ParentId":"1548", "CreationDate":"2012-03-03T19:32:02.477", "Score":"1", "PostTypeId":"2", "OwnerUserId":"519", "LastActivityDate":"2012-03-03T19:32:02.477", "CommentCount":"2"}