{"Body":"<p>Tlingit has a four-way system of deixis in its demonstratives (which are more like determiners because they cannot encode entities when used alone).</p>\n\n<p><em>yá</em> — proximal: near speaker, usually within reach</p>\n\n<p><em>hé</em> — mesioproximal: near speaker but usually closer to listener than speaker</p>\n\n<p><em>wé</em> — mesiodistal: near listener and out of reach of speaker, or out of reach of both listener and speaker but still easily reachable</p>\n\n<p><em>yú</em> — distal: distant, well beyond the reach of either listener or speaker</p>\n\n<p>To demonstrate:</p>\n\n<p><em>yá ax̱ jín</em> ‘this, my hand’ (speaker gestures to own hand)</p>\n\n<p><em>hé i káaxweiyí</em> ‘this, your coffee’ (speaker gestures to listener’s coffee cup)</p>\n\n<p><em>wé x̱ʼaháat</em> ‘that door’ (speaker gestures to door on other side of the room)</p>\n\n<p><em>yú hít</em> ‘that building’ (speaker gestures to building visible through window)</p>\n\n<p>The most common pair, according to my intuitive experience, are <em>yá</em> and <em>wé</em> parallelling English ‘this’ and ‘that’. <em>Yú</em> is used somewhat less often than <em>wé</em>. <em>Hé</em> is not used as much as the other three because it is often an irrelevant distinction, but it does occur in a number of conventionalized oppositions such as <em>yá</em> ‘right’ vs. <em>hé</em> ‘left’, <em>yá</em> ‘starboard’ vs. <em>hé</em> ‘port’, or <em>yá</em> ‘fore’ vs. <em>hé</em> ‘back’. All Tlingit speakers I have met demonstrate full competency with the entire system despite any frequency issues, and given its understanding by the semi-speakers and relearners I have talked to, it is probably something acquired fairly early in childhood.</p>\n\n<p>I think the speaker could say <em>yá i káaxweiyí</em> only if they touched or were otherwise close to the listener’s coffee cup somehow. If the speaker wanted to differentiate their hands, they could wave their right hand and say <em>yá ax̱ sheeynax̱.aanáx̱ jín</em> and then wave their left hand and say <em>hé ax̱ sʼátnax̱.aanáx̱ jín</em> ‘this my left hand’.</p>\n\n<p>All of these demonstratives can be used for discourse purposes as well, to locate notional things like propositions, utterances, and situations in positions relative to the spatiotemporal centre of the discourse. Thus one can distance oneself from another’s words by saying <em>yú hasdu yoo x̱ʼatángi</em> ‘that (distal) their speech’, or align oneself with another’s words by saying <em>yá hasdu yoo x̱ʼatángi</em> ‘this (proximal) their speech’. The subtle differences between these, and indeed the discursive uses of the deixis system in general, have yet to be explored in any sort of detail.</p>\n\n<p>None of this system really has anything to do with visibility or other forms of evidentiality, as has been described in a lot of deictic ‘complex’ systems. It’s instead strictly deixis, encoding the relative distance from the origo. Also note that it has nothing to do with personal exclusivity, since Tlingit has no encoding of inclusive versus exclusive person.</p>\n", "Id":"1568", "ParentId":"378", "LastEditorUserId":"511", "CreationDate":"2012-03-04T21:52:44.317", "OwnerUserId":"511", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-03-04T22:08:00.930", "LastEditedUser":{"UpVotes":"30", "WebsiteUrl":"http://www.drangle.com/~james", "Id":"511", "AccountId":"513739", "CreationDate":"2011-11-16T02:03:12.387", "AboutMe":"<p>I’m a PhD student in linguistics at the University of British Columbia. I work on Tlingit, a critically endangered language of northern British Columbia, the Yukon, and southeast Alaska. I also have extensive interests in the related Athabaskan languages, language documentation theory and practice, orthography design, morphological theory, phonological theory, and the syntax of noun phrases and relativization.</p>\n\n<p>I’ve been using TeX and friends for more than a decade. I use Xe(La)TeX, fontspec, memoir, and BibLaTeX extensively, and I am working on a BibLaTeX style for linguistics publications. Other packages I use frequently include pst-jtree, expex, and booktabs. I’m learning PGF/TikZ and considering developing a library to produce autosegmental representation diagrams. I do my writing in TeXShop, and my TeX programming in MacVim, having abandoned FSF Emacs and XEmacs due to their perpetually disappointing Unicode rendering.</p>\n", "Age":"35", "Location":"Vancouver, Canada", "DownVotes":"5", "Views":"13", "Reputation":"866", "DisplayName":"James C.", "LastAccessDate":"2013-11-03T19:13:48.097"}, "LastActivityDate":"2012-03-04T22:08:00.930", "Score":"13", "OwnerUser":{"UpVotes":"30", "WebsiteUrl":"http://www.drangle.com/~james", "Id":"511", "AccountId":"513739", "CreationDate":"2011-11-16T02:03:12.387", "AboutMe":"<p>I’m a PhD student in linguistics at the University of British Columbia. I work on Tlingit, a critically endangered language of northern British Columbia, the Yukon, and southeast Alaska. I also have extensive interests in the related Athabaskan languages, language documentation theory and practice, orthography design, morphological theory, phonological theory, and the syntax of noun phrases and relativization.</p>\n\n<p>I’ve been using TeX and friends for more than a decade. I use Xe(La)TeX, fontspec, memoir, and BibLaTeX extensively, and I am working on a BibLaTeX style for linguistics publications. Other packages I use frequently include pst-jtree, expex, and booktabs. I’m learning PGF/TikZ and considering developing a library to produce autosegmental representation diagrams. I do my writing in TeXShop, and my TeX programming in MacVim, having abandoned FSF Emacs and XEmacs due to their perpetually disappointing Unicode rendering.</p>\n", "Age":"35", "Location":"Vancouver, Canada", "DownVotes":"5", "Views":"13", "Reputation":"866", "DisplayName":"James C.", "LastAccessDate":"2013-11-03T19:13:48.097"}}