{"Body":"<p>First, the definition: a triphone is a sequence of three phonemes. This is equivalent to saying it is a 3rd order Markov chain or a trigram over phonemes. The application of such a model is usually to ask \"what is the probability of the third given the first two?\" in a chain as long as the utterance. Such a model assumes that all previous phonemes other than the preceding two are irrelevant. This is called a <em>Markov assumption.</em></p>\n\n<p>So, here's an example in English. I wrote a quick script to calculate triphones from CMUDict data. Let's look at the highest probability segments that follow <em>ɪŋ</em>. I'll use # for a word boundary:</p>\n\n<pre><code># 73.18% (bring, running)\nk 6.02% (think)\nz 5.88% (things)\nɚ 4.04% (singer)\n</code></pre>\n\n<p>So from this we get that most likely if we've heard <em>ɪŋ</em>, we're about to hear a word boundary, which makes sense because -<em>ɪŋ</em> is a suffix but also because /ŋ/ is generally only allowed in codas (ends of syllables) in English. The next most likely segment is /k/, which is to be expected given place of articulation  assimilation for nasals in English (e.g., /n/ before /k/ becomes /ŋ/). -<em>z</em> and -<em>ɚ</em> are suffixes in English, so we'd expect them where word boundaries are likely. So you see that this simple model has captured a bit of phonotactics, phonology, and morphology. This is why it's handy in speech recognition.</p>\n\n<p>So you can see that whenever the memory required to make a good prediction is short, such models work well. Basically, performance in a language is affected by the fit between the phonotactics of the language and Markov assumptions; the more a language defines short, linear relationships between phonemes, the better this model will perform. Also, it often depends on how often such relationships help resolve possible ambiguities or \"mis-hearings.\"</p>\n\n<p>Now, as to how they use sentence information, this is getting into what's called language modeling in speech recognition. What that particular technique is doing is taking some guesses at the words, assigning part of speech tags to those guesses, and then using a grammar to validate the recognition. For example, consider these two possible recognitions (with likely part of speech tag assignments in slashes):</p>\n\n<ol>\n<li>Bob/noun likes/verb Mary/noun.</li>\n<li>Bob/noun likes/verb wary/adj.</li>\n</ol>\n\n<p>There is some grammar that tells us that an adjective complement for a verb is not going to work, and that only #1 is going to make sense as a sentence.</p>\n\n<p>It should be noted that no modern speech dictation system operates with hand-coded grammars like this. The complexity of maintaining such grammars is too high, and much of the performance comes from lexical information (what kind of objects does \"like\" prefer?) that is lost if you change all words into part of speech tags as the link suggests. So word-based n-gram models are usually used, with little concern for parts of speech or grammaticality. For further reading, see <a href=\"http://rads.stackoverflow.com/amzn/click/0130226165\" rel=\"nofollow\">Spoken Language Processing: A Guide to Theory, Algorithm and System Development</a> or <a href=\"http://rads.stackoverflow.com/amzn/click/0131873210\" rel=\"nofollow\">Speech and Language Processing</a>.</p>\n\n<p>Edit: Added some real triphone data instead of the hypothetical example.</p>\n", "Id":"157", "ParentId":"118", "LastEditorUserId":"106", "CreationDate":"2011-09-15T01:57:23.057", "OwnerUserId":"106", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-15T16:41:05.943", "LastEditedUser":{"UpVotes":"30", "WebsiteUrl":"http://www.seas.upenn.edu/~lignos", "DownVotes":"6", "Id":"106", "AccountId":"896149", "Views":"16", "Reputation":"381", "CreationDate":"2011-09-14T05:56:35.697", "DisplayName":"Constantine", "LastAccessDate":"2013-12-29T05:06:56.547", "AboutMe":"<p>I am a PhD student at the University of Pennsylvania. I work on language acquisition/processing and computational linguistics.</p>\n"}, "LastActivityDate":"2011-09-15T16:41:05.943", "Score":"3", "CommentCount":"3", "OwnerUser":{"UpVotes":"30", "WebsiteUrl":"http://www.seas.upenn.edu/~lignos", "DownVotes":"6", "Id":"106", "AccountId":"896149", "Views":"16", "Reputation":"381", "CreationDate":"2011-09-14T05:56:35.697", "DisplayName":"Constantine", "LastAccessDate":"2013-12-29T05:06:56.547", "AboutMe":"<p>I am a PhD student at the University of Pennsylvania. I work on language acquisition/processing and computational linguistics.</p>\n"}}