{"Body":"<p>Let me first get the definitions straight. A descriptivist text merely describes language, without itself assigning values like beauty or morality to it, though it may describe how <em>others</em> assign such values. A prescriptivist text assigns values. So far, so good.</p>\n\n<p>Most problems arise, in my view, when one approach is applied to the domain of the other. Oftentimes, you will see uneducated prescriptivists make claims like, \"no-one says <em>data is</em>, and therefore it should not be used\", even though many people do in fact say <em>data is</em>. The prescriptivist confuses what is and what ought to be: he should say, \"no-one should say <em>data is</em>\", but he says \"no-one says <em>data is</em>\", thereby making a prescriptivist statement disguised as a descriptive one. Moreover, many uneducated prescriptivists presuppose that there is an objectively \"right\" language, discounting the fact that language is forever changing under the influence of various social and other factors.</p>\n\n<p>Another problem, just as frequent, is that someone will say, \"most people say <em>data is</em>, and therefore you should not tell people to say <em>data are</em>, Mr Styleguide\". That is prescriptivist talk, disguised as descriptivism: this person says, \"you can't tell people to use language that is in fact not used much\". It may be true that it is not used much; but why can't a styleguide tell people to use rare language? Granted, it is absolutely valid to say that a styleguide gives bad advice; but saying so is decidedly prescriptivist. And yet this person will often consider himself a descriptivist.</p>\n\n<p>I think there is no place for a prescriptivist perspective in a scientific text; that is why style guides and linguistics should be kept strictly separate. Certainly, a style guide may use data found in linguistic research as an argument for or against a certain construction; and a linguist may describe what different style guides say about this construction, etc., ad infinitum; but each should stick with his own trade and not criticize the other—unless his domain is encroached upon.</p>\n\n<p>That doesn't mean that a single text cannot switch between descriptivist and prescriptivist statements; but the status of each statement should be clear beyond doubt.</p>\n\n<p>As the erudite PLL has said before, on English.Stackexchange, a good prescriptivist account of a phenomenon will be very similar to a good descriptivist account of the same. The former will explain what different people use and why, and give advice to its readers neatly ordered according to who they are and what they want. The latter will explain the same things more elaborately, and refrain from giving advice. But if you work in field x and the descriptivist account says that 80 % of your colleagues write <em>data are</em>, that is very close to (moderate) prescriptivist advice.</p>\n\n<hr>\n\n<p>As concerns the use of high-brow academic language in linguistic treatises, there is no escape: linguists are only humans too, and they nearly always choose this type of language consciously. They defer to social pressures and a sense of aesthetics. But that is no problem: most linguists can switch perspectives very well, between the choice they make for the <em>form</em> of their work on the one hand and the linguistic phenomena they describe in the <em>content</em> on the other.</p>\n\n<hr>\n\n<p>On a side note, some linguists, who are in their linguistic works absolutely descriptive, display a scathing prescriptivism elsewhere, against what they see as \"elitist\" language. They despise the advice of style guides who do not base their advice on the language of the majority, etc. That is a strong political statement.</p>\n\n<p>In my prescriptivist view, some of those people fail to consider that language is not just a tool that people use subconsciously for communication and consciously to further their position in society, but also a conscious medium of art. Most people find certain forms of language more beautiful than others and choose to change their own language accordingly, by discarding ugly forms and adopting beautiful ones. This might sound like a platitude, but it is often casually assumed that language is exclusively a subconscious tool. Of course our sense of beauty is highly influenced by social factors, but it is beauty nonetheless. In their political quest for egalitarianism, some prescriptivists risk compromising art.</p>\n\n<p>If a style guide cries absurdities, the problem will solve itself, because no-one will listen; if not, the objecting linguist should perhaps take a good look at his own language, and the way he will teach his daughters to speak, before scolding the elitism of others. I doubt any of them will teach their precious Charlotte \"<em>ain't</em> is fine, period\".</p>\n\n<p>On the other hand, it is absolutely fair to criticize people who make others feel miserable about their own use of language without good reason. But you are not helping people emancipate by telling them that their <em>ain't</em> is \"fine\": society is not so tolerant, and they will benefit more from a realistic description of the stigma, however arbitrary, that will still cling to it for some time.</p>\n", "Id":"158", "ParentId":"155", "LastEditorUserId":"82", "CreationDate":"2011-09-15T03:20:27.237", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-10-07T06:11:07.020", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2012-10-07T06:11:07.020", "Score":"13", "CommentCount":"12", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}