{"OwnerUser":{"UpVotes":"21", "WebsiteUrl":"http://andrewjgrimm.wordpress.com/", "Id":"421", "AccountId":"17355", "CreationDate":"2011-10-14T12:12:21.327", "AboutMe":"<p>I work at the University of New South Wales, where I use Ruby to analyze biological data.</p>\n\n<p>In part of my spare time, I work on fun programming projects. One was trying to analyze what underlies Wikipedia's <a href=\"http://en.wikipedia.org/wiki/Wikipedia:Get_to_Philosophy\" rel=\"nofollow\">Get to Philosophy</a> game. I also worked on one called the \"Small Eigen Collider\".</p>\n\n<p>I'm currently learning Japanese, and I'm an active participant in <a href=\"http://lang-8.com\" rel=\"nofollow\">lang-8.com</a>, a website where you write journal entries in a language you're learning, and get corrected by native speakers of that language. In return, you correct people writing entries in your native language. Recently, I've been asking a few questions prompted by slightly incorrect English I've encountered on lang-8.</p>\n", "Age":"35", "Location":"Sydney, Australia", "DownVotes":"0", "Views":"13", "Reputation":"320", "DisplayName":"Andrew Grimm", "LastAccessDate":"2013-09-30T12:58:51.183"}, "comments":[], "Body":"<p>I am not a linguist. I'm merely a person who sometimes talks, listens, writes and reads.</p>\n\n<p>Many languages die because some government invades an area, and discriminates against the indigenous people there. They ban the language outright, or don't teach it at school, instead imposing their own language on them.</p>\n\n<p>Usually such governments discriminate against these people in other ways. For example, they may not give them the vote, they may ban some of their customs, they may discriminate in terms of employment, farming, marriage, etc. This kind of discrimination is seen as bad.</p>\n\n<p>Some people, some of whom may be linguists, are affected by what Wikipedia calls the <a href=\"http://en.wikipedia.org/wiki/Association_fallacy\" rel=\"nofollow\">association fallacy</a> (and TV tropes calls <a href=\"http://tvtropes.org/pmwiki/pmwiki.php/Main/HitlerAteSugar\" rel=\"nofollow\">Hitler Ate Sugar</a>). If discrimination in X, Y, and Z, and also language death, are all the result of a government's policy against a certain race, then since the discrimination in X, Y, and Z are bad, then the association fallacy will lead some people to think language death must also be bad, merely because they were all the result of the same over-arching policy.</p>\n\n<p>Is this logical? No. But linguists are not totally logical, any more than the rest of us are.</p>\n", "Id":"1581", "ParentId":"1549", "CreationDate":"2012-03-06T12:54:38.530", "Score":"-4", "PostTypeId":"2", "OwnerUserId":"421", "LastActivityDate":"2012-03-06T12:54:38.530", "CommentCount":"9"}