{"OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "comments":[], "Body":"<p>Jlovegren is right to distinguish between documentation and conservation.  In fact, increasingly we're seeing a <em>three</em>-way distinction being made:</p>\n\n<ol>\n<li><p>In <strong>language description</strong>, the goal is to develop generalizations about the grammar of a particular language.  This leads to results like \"This language has an iambic stress pattern,\" \"The basic word order in this language is SVO,\" or \"This language has twenty demonstrative pronouns, distinguished by the shape, position and location of the referent.\"  On this approach, data is valuable mainly as <em>evidence</em> for a particular generalization: e.g. \"See, you can tell that there's a shape distinction among the demonstrative pronouns, because <em>this</em> one is only used to refer to round things [examples] and <em>that</em> one is only used to refer to flat things [more examples].\"  Often, negative data is especially important: e.g. \"If I try to use this pronoun to refer to round things, speakers tell me that I'm using it wrong.\"  </p></li>\n<li><p>In <strong>language documentation</strong>, the goal is to record <em>examples of the language in use</em>, ranging from everyday conversation to oral literature, formal or ritual language, special terminology such as plant names, and so on.  On this approach, data is seen as valuable in its own right, whether or not it serves as evidence for some sort of descriptive claim.  The result of language documentation is often a collection of texts or recordings: e.g. \"Here's ten hours of video of traditional epic poetry being performed.  We've also transcribed the poems in the original language, translated them into English, and added a few notes about the grammar.\"  But documentary work can lead to descriptive claims as well: e.g. \"The distal demonstratives are rarely used in conversation in this language, but we've noticed that they're very common in traditional poetry.\"</p></li>\n<li><p>In <strong>language conservation</strong>, the goal is to help keep the language from dying out.  This often means starting up development projects or getting involved in local politics: building a school, training teachers, founding a radio station, lobbying for a bill that protects indigenous rights.  It doesn't necessarily involve any sort of data collection.  When you do collect data, it's generally in order to write textbooks or teaching grammars, or to build up teaching materials to use in school: e.g. \"This poem has some great examples of the distal demonstratives in use.  Let's read it for the sixth-grade class when we teach that unit.\"</p></li>\n</ol>\n\n<p>These three sorts of work aren't totally separate.  For instance, if you want to write a textbook for language learners (#3), then you need to know some things about the grammar of the language first (#1), and it would be good to have some literature to cover in class as well (#2).  But the distinction is still relevant to the question, because <strong>each of the three is valuable for a different reason.</strong></p>\n\n<p>It sounds like Louis Rhys is asking about #3: language conservation.  For what it's worth, this sort of work can actually be quite controversial &mdash; not necessarily among linguists, but among the speakers of endangered languages themselves.  Some communities are very interested in teaching their heritage language to their children or grandchildren and bringing it back into daily use.  Some communities are <em>actively uninterested</em> in their heritage language &mdash; they feel that it marks them as \"old-fashioned\" or uneducated, or that it prevents them from getting education or jobs, and they would much prefer that their children or grandchildren just switch to the local majority language.  And in some communities, there's intense debate between the two points of view.</p>\n\n<p><strong>But <em>if</em> a community <em>wants</em> to make sure that their children keep learning their heritage language, then a skilled linguist can help,</strong> by preparing educational materials and helping organize classes and so on.  The community still has to do the bulk of the work; our job is to serve as a resource.  The linguists who do this sort of work tend to see it as community service: it's valuable because it helps a community achieve their goals, and helping people is a good thing.  Of course, if a community is dead-set against using their heritage language, and a linguist tries to badger them into using it anyway, that <em>isn't</em> particularly helpful or valuable.  (And anyway, it isn't likely to succeed.)</p>\n\n<p>For language description, the value is largely scientific: we have theories about these languages that we want to test, and the data won't be available in 20 years, so we have to test them now.  For language documentation, there are several sources of value.  It can be valuable for science, by preserving data that would otherwise be lost.  But it can also mitigate the sort of cultural damage that kaleissin and Alenanno are talking about: even if a child doesn't grow up speaking his parents' or grandparents' first language, he can still read the stories they told &mdash; either in translation or, with effort, in the original language &mdash; and that gives him a connection to his heritage that he might not have otherwise.  And finally, it can be valuable in the same way that restoring old artwork is valuable.  There are some truly wonderful pieces of literature that are being passed down orally in small language communities, and if the members of those communities want to share them with a larger audience, then it would be a shame if they were just lost.</p>\n", "Id":"1582", "ParentId":"1549", "CreationDate":"2012-03-06T15:55:16.670", "Score":"9", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2012-03-06T15:55:16.670", "CommentCount":"2"}