{"OwnerUser":{"UpVotes":"556", "WebsiteUrl":"http://www.markbeadles.com/", "Id":"537", "AccountId":"297827", "CreationDate":"2011-11-27T02:50:39.717", "AboutMe":"<p>Polymathic renaissance redneck</p>\n", "Age":"47", "Location":"Columbus, OH", "DownVotes":"22", "Views":"30", "Reputation":"3876", "DisplayName":"Mark Beadles", "LastAccessDate":"2013-02-02T04:23:30.703"}, "comments":[], "Body":"<p>I'll concentrate on the historical part of your question as others are doing well on the modern work. As you've suspected from the etymology, the term <strong>δίφθογγος</strong> is Ancient Greek (diphthongos, borrowed into LL as <strong>diphthongus</strong>) and was already in broad use by the 2nd century CE - e.g., <a href=\"http://books.google.com/books?id=Q_E9AAAAcAAJ&amp;lpg=PA104&amp;ots=30_s_iWbfN&amp;dq=Unde%20diphthongos%20eas&amp;pg=PA104#v=onepage&amp;q=Unde%20diphthongos%20eas&amp;f=false\" rel=\"nofollow\">Terentianus writes</a>:</p>\n\n<blockquote>\n  <p>Porro vocalem secuta vim tenet vocalium<br>\n  Et sonos utrosque jungit, unde diphthongos eas<br>\n  Græciæ dicunt magistri, quod duæ junctæ simul<br>\n  Syllabam sonant in unam </p>\n  \n  <p>Moreover the following vowel has the force of a vowel<br>\n  And joins both sounds; whence the <em>diphthong</em>,<br>\n  The Greek masters say: the two joined together<br>\n  Sound as one syllable.  </p>\n</blockquote>\n\n<p>...and just as old are arguments about it. Is the diphthong two, or is it one? Is it a single sound regarded as a unit, or two sounds yoked together? Pennington's 1844 <a href=\"http://books.google.com/books?id=gH2j6kg2h4kC&amp;pg=PA42&amp;lpg=PA42wB#v=onepage&amp;q&amp;f=false\" rel=\"nofollow\">An Essay on the Pronunciation of the Greek Language</a> reveals this term has provoked long disagreement since classical times.</p>\n\n<p>Now, because there has been a single term for the diphthong, we can say that it has been regarded as a single entity (of some type) since classical times, though its nature has been disputed. The ancients did know that a diphthong was sounded in a single syllable; they typically regarded as the syllable as the smallest unit of sound. So I think that our own usage today of diphthong as being in some sense a 'single sound' is a relic (correct or incorrect, as others discuss) of that time. </p>\n", "Id":"1584", "ParentId":"1577", "CreationDate":"2012-03-06T17:47:55.280", "Score":"2", "PostTypeId":"2", "OwnerUserId":"537", "LastActivityDate":"2012-03-06T17:47:55.280", "CommentCount":"2"}