{"OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "comments":[], "Body":"<p>There probably is some sort of practice effect here.  But I suspect it goes beyond that.</p>\n\n<p>I think it's telling that you had to set that godawful multiply-embedded sentence up in a story.  And what's more, you had to build it up throughout the story &mdash; starting with the deepest two clauses, \"who my mother, God bless her, admired,\" and adding on more layers from there.  Even still, I find it only vaguely comprehensible.  You say you find it fully comprehensible, and you speculate that it's because you've read the full sentence too many times.  I think there may be another reason &mdash; I think you've read <em>the inner clauses</em> too many times <em>in unembedded form</em>, and you've gotten yourself to a point where you can feel like you understand those inner clauses without actually having to parse them or pay attention to their structure.</p>\n\n<p>Here's a hypothesis: the constraint against quadruple center embedding only applies to constituents that the hearer (or reader) actually tries to parse.  If the hearer <em>treats</em> a constituent as an unanalyzable unit, then that unit can then be embedded two or three times without confusion, even if it <em>actually</em> has inner structure that the hearer is ignoring in treating it that way.</p>\n\n<p>Suppose I tell you the following: </p>\n\n<p>(1) [Sentences [that <i>bop-squee-fim-blork-pings</i> utter] are easier to understand.] </p>\n\n<p>I'm guessing you find the English part of that sentence to be perfectly parseable &mdash; though, of course, you'd have to know what <em>bop-squee-fim-blork-pings</em> meant in order to fully interpret it.  Now suppose I were to tell you that <em>bop-squee-fim-blork-pings</em> was a doubly center-embedded structure in some foreign language; maybe it means \"women that people you've met dislike.\"  Would you take that as evidence that you had just managed to parse a quadruply center embedded sentence?  Probably not &mdash; since, after all, you didn't actually have to parse <em>bop-squee-fim-blork-pings</em> when you read (1).  Indeed, you couldn't have parsed it if you'd tried, so your brain didn't expend any effort at all on trying.  That particular rabbit hole wasn't even available for you to fall down.</p>\n\n<p>Now suppose that you've heard the phrase <em>women that people you've met dislike</em> often enough that you've just started treating it as a single unit instead of actually parsing it on hearing it.  Maybe you've even created a lexical entry for <em>womenthatpeopleyouvemetdislike</em> as if it were a single compound noun of some sort.  In that case, my suspicion is that (2) would be just as parseable as (1) for you.  But crucially, at that point, you wouldn't be parsing the quadruply-embedded structure in (2b), you'd be parsing the much simpler structure in (2a).</p>\n\n<p>(2) Sentences that womenthatpeopleyouvemetdislike utter are easier to understand.</p>\n\n<p>(2a) [Sentences [that womenthatpeopleyouvemetdislike utter] are easier to understand.]</p>\n\n<p>(2b) [Sentences [that women [that people [you've met] dislike] utter] are easier to understand.]</p>\n\n<p>I think this is what you're doing, incrementally, when you work yourself up to reading the final sentence in your story.  You convince yourself to treat <em>mymothergodblessher</em> as a single unit; then you convince yourself to treat <em>thewomanmymothergodblessheradmires</em> as a single unit; and so on up.  If you hadn't been rehearsing those smaller units and learning to read them without really parsing them, I'm betting you'd be entirely baffled by that seven-layer sentence when you encountered it.</p>\n", "Id":"1595", "ParentId":"1590", "CreationDate":"2012-03-07T18:42:19.440", "Score":"5", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2012-03-07T18:42:19.440", "CommentCount":"3"}