{"Body":"<p>Commenters above are right in pointing out that the question is not entirely linguistic, but since it's already been asked and the linguistic part answered, I'll complete it with the non-linguistic bit.</p>\n\n<p>It's very uncommon for people in Poland to use VAD. It's not really faster than choosing the person from the list and is usually considered showing off, sort of like using a mobile in the early nineties. But whenever anyone does use it, the phones usually let them record their own call, so they end saying <em>(za)dzwoń do Dawida</em>, or just simply <em>Dawid</em>. (The <em>za-</em> bit is aspect; with it, it's perfective, without it, it's imperfective. In this particular situation both can be used.)</p>\n\n<p>I will admit, however, that I did see a good couple of years ago someone say <em>zadzwoń Dawid</em>. I presume his phone required the <em>call</em> and <em>David</em> bits to be recorded separately, and he preferred to say <em>zadzwoń Dawid</em> than <em>zadzwoń Dawida</em> because somehow it seems less ungrammatical, and he simply didn't think of recording <em>do Dawida</em> for 'David'.</p>\n", "Id":"1613", "ParentId":"1611", "LastEditorUserId":"22", "CreationDate":"2012-03-10T08:30:57.877", "OwnerUserId":"794", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-03-10T10:47:23.587", "LastEditedUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "LastActivityDate":"2012-03-10T10:47:23.587", "Score":"2", "CommentCount":"2", "OwnerUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}}