{"Body":"<p>The short answer: they don't.</p>\n\n<p>The long answer:</p>\n\n<p>It isn't black and white. Some phrases certainly are grammatical (attested many times in different places and different contexts), some (almost) certainly aren't (never attested in a huge and diversified corpus), and all the rest is somewhere in between.</p>\n\n<p>English continuous tense is in the former category. But if English died out today and future archaeologists only discovered, say, the Bible, they wouldn't be sure that the structure was also stylistically acceptable in a secular context. If they only discovered a transcript of an IRC chat, they could think it was limited to slang. And so on.</p>\n\n<p>For example, for Old Turkic we have almost nothing more than official stelae. Plenty of constructions and words are missing, and we can't be sure that they did really exist at that time. We can reconstruct them based on what we find in later texts, but this isn't as certain as if they had been actually written down. Sadly, no widely accepted method of quantifying this probability exists.</p>\n\n<p>The situation is similar with languages which are at the verge of extinction right now. If there are only, say, three speakers left, we can't go too far in making claims about the entire language. Usually in such cases, however, we simply consider the lect of these three people to <em>be</em> the language. Everyone knows this isn't exactly true, and everyone knows we simply can't do any better. It's just easier to give it a short name than to note every time when we refer to it, that it's only based on the evidence of three speakers.</p>\n\n<p>Asking a native speaker directly usually isn't a good idea. It's better to just make them talk as much as possible and record everything, and only ask to explain the unclear parts. Various cultural rules might interfere, such as e.g. the informer might consider it impolite to point out to strangers (= guests) that they made a mistake, and he or she will confirm the grammaticality of an ungrammatical construction merely not to offend.</p>\n\n<p>Summing up, everything comes down to quantity and proportions. But regrettably, everything is evaluated by intuition. There is no official scale that would determine a certain phrase is 60% grammatical or anything of the sort. However, when you think about it, I suppose you might find it difficult to judge precisely how grammatical/acceptable/natural e.g. <em>long time no see</em> is in modern English.</p>\n", "Id":"1629", "ParentId":"1628", "LastEditorUserId":"794", "CreationDate":"2012-03-13T20:18:48.140", "OwnerUserId":"794", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-03-13T20:46:05.267", "LastEditedUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}, "LastActivityDate":"2012-03-13T20:46:05.267", "Score":"6", "OwnerUser":{"UpVotes":"46", "WebsiteUrl":"http://www2.filg.uj.edu.pl/ifo/kjasis/~stachowski.kamil", "Location":"Cracow, Poland", "Id":"794", "DownVotes":"2", "AccountId":"414249", "Views":"49", "Reputation":"1128", "CreationDate":"2012-02-24T07:50:20.713", "DisplayName":"kamil-s", "LastAccessDate":"2013-12-23T10:10:41.103", "AboutMe":""}}