{"OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "comments":[], "Body":"<p>[n] and [l] are similar acoustically and aerodynamically, in that both are made with periodic vibration and no buildup of pressure, but have more complex formant structures than vowels due to the presence of antiformants. They are also similar articulatory, both being made with the front of the tongue raised towards the alveolar ridge. The only difference in tongue shape is that the tongue body is narrowed laterally in the production of [l] to allow air to flow over the edges of the tongue. Given their phonetic similarity, it is not surprising if they change into one another.\nInteresting work on phonetic similarity can be found in Jeff Mielke's <a href=\"http://137.122.133.199/~Jeff/phonetic_similarity/\">phonetic similarity database</a>. A more technical treatment will be found in Stevens' (1998) <em>Acoustic Phonetics</em>.</p>\n\n<p>Unfortunately I cannot find a good database of attested sound changes in the languages of the world. Maybe the closest thing that can be found is a <a href=\"http://137.122.133.199/~Jeff/pbase\">database of phonological alternations</a>, which are themselves \"sound changes in progress.\" The sound change is however quite frequent cross-linguistically in my estimation. What is unusual about the Cantonese case is that the change has resulted in massive homophony, which typically doesn't happen to such an extent.</p>\n\n<p>The most interesting part of the question concerns the transition probabilities of the change and its reverse. I have no idea about this but the question could be answered with a rich enough database.</p>\n", "Id":"1647", "ParentId":"1642", "CreationDate":"2012-03-15T18:50:18.350", "Score":"5", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2012-03-15T18:50:18.350", "CommentCount":"4"}