{"Body":"<p>I'd actually been preparing the latter part of your question myself: <strong>what diachronic sound changes are common cross-linguistically, and are there databases documenting their occurrence?</strong> (I was prompted by remarks about identifying common changes from personal experience working with the comparative method). I haven't gotten around to posting the question, but I did stumble upon a database which is relevant:</p>\n\n<p><em><a href=\"http://www.diadm.ish-lyon.cnrs.fr/\" rel=\"nofollow\">The DiaDM Project: A web-based platform for Diachronic Data and Models</a></em>, with one of the three sub-projects covering historical sound change: <a href=\"http://www.diadm.ish-lyon.cnrs.fr/unidia/index.php\" rel=\"nofollow\">UniDia</a>.</p>\n\n<blockquote>\n  <p>Although determining to the elaboration of models that are directly\n  applicable to (real) case studies, there are no compendia that\n  explicitly survey the types of sound changes, their directionality,\n  their relative prevalence, their immutable tendencies and the\n  dimensions structuring their specific behaviours. All this is\n  admittedly of common knowledge, but for someone external to the field\n  - mathematicians, biologists or physicists that could inspire new quantitative approaches to recurrent issues in historical linguistics\n  - it is not. Moreover, accessing this knowledge can prove difficult and excessively time consuming as it is scattered in a multilingual\n  literature and transcribed under various and diverging symbolisms.</p>\n  \n  <p>UniDia targets this gap by associating the compilation of published\n  sound change hypotheses from a large geographically and genetically\n  diverse sample to distribution and tendency analysis methods. The\n  symbolism is unified and all transcriptions are harmonized to the IPA\n  – transcription conventions are presented on the left-hand menu bar.\n  No prior typology is imposed on the data but rather, it is the aim of\n  UniDia to explore the overall consistency of the sound change\n  hypothesized across language areas and families and to distinguish the\n  specific from the ‘universal’.</p>\n</blockquote>\n\n<p>This of course doesn't (yet) cover all language families (and the interface isn't ideal), but it looks interesting.</p>\n\n<p>P.S. <a href=\"http://meta.linguistics.stackexchange.com/q/305/444\">meta - does this more general question merit a separate post or should it be answered here?</a></p>\n", "Id":"1653", "ParentId":"1642", "LastEditorUserId":"444", "CreationDate":"2012-03-16T00:00:27.290", "OwnerUserId":"444", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-03-16T00:15:34.463", "LastEditedUser":{"UpVotes":"127", "WebsiteUrl":"", "Location":"Netherlands", "Id":"444", "DownVotes":"2", "AccountId":"902812", "Views":"19", "Reputation":"934", "CreationDate":"2011-10-23T14:14:27.380", "DisplayName":"arjan", "LastAccessDate":"2014-01-14T14:07:55.473", "AboutMe":""}, "LastActivityDate":"2012-03-16T00:15:34.463", "Score":"3", "CommentCount":"2", "OwnerUser":{"UpVotes":"127", "WebsiteUrl":"", "Location":"Netherlands", "Id":"444", "DownVotes":"2", "AccountId":"902812", "Views":"19", "Reputation":"934", "CreationDate":"2011-10-23T14:14:27.380", "DisplayName":"arjan", "LastAccessDate":"2014-01-14T14:07:55.473", "AboutMe":""}}