{"Body":"<p>First it is important to realise that linguistic labels do not really \"exist\" objectively: they are just words that can be more or less convenient.</p>\n\n<hr>\n\n<p>Now let's see how things would work out if we assumed that a copula was a kind of transitive verb, and its secondary complement a direct object (the subject being the primary complement of the verb). The following are a few of the properties that <strong><em>direct objects</em></strong> are normally expected to possess—and a transitive verb is defined as having a direct object:</p>\n\n<ol>\n<li><p>A direct object must always be in the <strong>accusative/objective case</strong> (<em>that man was I</em> v. *<em>that man fears I</em> — the fact that the nominative/subjective case \"I\" is possible with copulae shows how they are to many people different from transitive verbs; an object can never be in the nominative case. The number of people who would use \"I\" in certain registers prevent us from simply regarding it as an object in all respects.).</p></li>\n<li><p>It allows for the transitive verb to be <strong>passivized</strong>, and it then becomes the subject if the meaning of the sentence is to remain intact (<em>the cat likes me</em> => <em>I am liked by the cat,</em> but <em>she remained a cat</em> => *<em>a cat was remained by her</em> ).</p></li>\n<li><p>Only a phrase that acts like a (substantive) noun—a \"<strong>noun phrase</strong>\"—can be a direct object. Normally, this includes only words that can have an article without changing their meaning, unlike common adjectives (<em>the chair is expensive</em> v. *<em>the chair costs expensive</em> ).</p></li>\n</ol>\n\n<p>It can be seen that copulae + subject complements fail at least one of these tests, which is why they are normally not considered transitive verbs + direct objects.</p>\n\n<hr>\n\n<p>So what are the commonly used criteria for calling a verb a <strong><em>copula</em></strong>?</p>\n\n<ul>\n<li><p>A. It must be capable of taking an <strong>adjective</strong> as its secondary complement in a simple sentence, like <em>I am angry</em>, and the adjective cannot be replaced with an adverb without change of meaning. A complement is a word or phrase without which the predicate/sentence is incomplete.</p></li>\n<li><p>B. The adjective must assign a <strong>property</strong> to the subject. This is a semantic criterion (having to do with meaning), not a morpho-syntactic one (form). <em>The apple is red; the number turned out larger than expected.</em></p></li>\n<li><p>C. If a noun is used as the secondary complement, it must be used to <strong>identify</strong> the subject (another semantic criterion). <em>I am a man; the caterpillar became a butterfly.</em></p></li>\n<li><p>D. It <strong>cannot take an object</strong>. Note that the same verb can be a copula in one sentence and a transitive verb in another, if it is used with a different meaning / predicate frame.</p></li>\n<li><p>E. It <strong>cannot be passivized</strong>—as transitive verbs can—such that the subject becomes a \"by\" prepositional phrase and the object the new subject, and that without change of meaning. It excludes examples like this: <em>Do they prefer the small or the large car? — They prefer small.</em> => <em>Small is preferred by them</em> (this should not be possible with copulae).</p></li>\n<li><p>F. If it can take a personal pronoun as a secondary complement, a copula must be capable of taking it in the <strong>nominative case</strong> in certain contexts, i.e. for the significant minority who choose to do so, especially in writing. In other words: if absolutely everyone would always use the accusative, it's not a copula.</p></li>\n</ul>\n\n<p>Normally a copula should fulfil all these criteria. I think it is safe to say that this is quite a reliable test to exclude transitive verbs.</p>\n\n<hr>\n\n<p>You may have noticed that not all of these criteria are easy to check beyond doubt, especially the semantic criteria. Take this example:</p>\n\n<blockquote>\n  <p>I walked fast.</p>\n</blockquote>\n\n<ul>\n<li><p>Here the fact that <em>fast</em> can be both adjective and adverb obscures criterion A (can take adjective).</p></li>\n<li><p>Criterion D (has no object) is a bit circular, so perhaps that should be removed from the list all together and merged with criterion E (passivize): the latter will serve to prove that something is or is not an object in any case. If I use \"a mile\" as secondary complement, the sentence can be passivized, so perhaps it is not a copula; however, one could argue that the verb is used with a different meaning there, so that D/E do not apply at all, if we accept that <em>walk</em> cannot take a noun as a secondary complement.</p></li>\n<li><p>Criterion F (nominative pronoun) does not apply at all, because one cannot walk a person. </p></li>\n<li><p>This leaves criterion B (adjective property) to do the job, because C (noun identity) only works if the verb can take a noun as a secondary complement at all, which was shown to be dubious above. As to B—does \"fast\" assign a property to the subject? One could say it does, since \"I\" am \"fast\" when I'm walking fast. However, this should also be the case with other adjectives, then: *<em>I walked rapid</em>. This proves that \"fast\" was not an adjective in the original example, which had the same construction and the same meaning.</p></li>\n</ul>\n\n<p>So all criteria together are a fairly tight test; but it must be noted that the boundary between copulae and non-copulae is not without weak spots. There are bound to be dubious cases. Even so, this is a useful distinction in many situations.</p>\n\n<hr>\n\n<p>Why is \"copula\" a useful category? First of all, because copulae generally behave differently from transitive verbs and verbs that take adverbs as secondary complements.</p>\n\n<p>Secondly, because subject complements used to be clearly marked as such by being in the nominative case when the precursors to modern English still used cases consistently; this makes it easier to maintain a consistent set of labels for the same construction through the ages. It is the same construction, because <em>that man was I</em> has not changed essentially between then and now: it is rather that the case endings of nouns were dropped gradually. So we would have to take an arbitrary point in time at which we suddenly start using a different label for this construction. In addition, the gender of the subject could be used to identify subject complements too, before endings were dropped. An adjective would agree with the gender of the subject if used as a subject complement.</p>\n\n<p>Thirdly, many foreign languages still have clearly marked cases or genders, like German, in which subject complements are easier to identify than in English. The construction and the criteria I set out above are the same. Should we then call the same construction by different names in different languages? That is possible, but it obscures interlingual connections, and I would prefer to do that only if we have a very pressing reason to do so.</p>\n\n<p>Fourthly, people have been using this label for ages: why change it now, and bother them to learn yet another term without a strong reason? </p>\n", "Id":"1676", "ParentId":"1669", "LastEditorUserId":"82", "CreationDate":"2012-03-21T03:43:47.153", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-03-21T03:59:21.300", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2012-03-21T03:59:21.300", "Score":"14", "CommentCount":"11", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}