{"comments":[], "Body":"<p>You would like to find an analysis where, in the first sentence, <em>permit</em> \"fits the syntactic category of being a noun, but is occupying the syntactic slot of a verb.\" Commenters are for good reason thinking you are talking about zero-derivation. To take it from a neutral perspective, we can assume that the analysis you are interested in is diagrammed roughly as follows. </p>\n\n<p><img src=\"http://i.stack.imgur.com/P7uZ0.png\" alt=\"enter image description here\"></p>\n\n<p>A word which is normally a noun is behaving as a verb. We can find more dramatic examples of this kind of behavior outside of English.  Consider this pair of Tagalog sentences:</p>\n\n<pre><code>Nagtrabajo ang lalaki\nworked     NOM man\n\"The man worked.\"\n\nLalaki ang nagtrabajo\nman    NOM worked\n\"The one who worked is a man.\"\n</code></pre>\n\n<p>The first sentence is a basic intransitive clause, where the subject comes after the verb, and <em>ang</em> marks the subject as such. In the second one, things got flipped. What seems like it should be a verb is getting marked with <em>ang</em>, and <em>lalaki</em>, which seems like it should be a noun, is showing up in the verb's usual position. It is no longer clear what is a noun and what is a verb. The problem is that \"noun\" and \"verb\" are being taken to mean two different things at once. A noun is something that refers, and something that generally refers to an object. A verb is something that predicates, and generally refers to an action. \nThe approach <a href=\"http://pubman.mpdl.mpg.de/pubman/faces/viewItemFullPage.jsp?itemId=escidoc:273886\" rel=\"nofollow\">Van Valin (2008)</a> takes in analyzing the Tagalog sentences is to do away with categories like NP and VP in favor of RP (\"referential phrase\") and Pred (\"predicate\"), so that only one of the typical functions of nouns and verbs is implied in the higher levels of the structure. A simplified version is like this:</p>\n\n<p><img src=\"http://i.stack.imgur.com/wEsxm.png\" alt=\"enter image description here\"></p>\n\n<p>For the English example, it will be harder to pull this kind of analysis off with the example you have chosen, because the semantics aren't very regular. The Tagalog example works because any noun can predicate and the meaning is \"to be a N.\" It is hard to think of other nouns that could be analyzed like your <em>permit</em> example in English, where the noun predicates and takes a subject, an object and an infinitival complement. On the other hand, you might be able to analyze in this way a kind of aversive construction where just about any noun acts as a transitive verb, e.g.,</p>\n\n<ul>\n<li>Thomas pantsed Henry.</li>\n<li>Thomas knifed Henry.</li>\n<li>Thomas baseballed Henry.</li>\n<li>Thomas netflixed Henry.</li>\n</ul>\n\n<p>Meaning \"Thomas did something which negatively affected Henry, involving N.\"</p>\n", "Id":"1680", "ParentId":"1671", "CreationDate":"2012-03-21T21:54:00.370", "Score":"1", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2012-03-21T21:54:00.370", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}