{"Body":"<p>Russian definitely has dialects with pronounciation specifics (e.g. one can distinguish south accents, as mine, from the Moscow one), but at least among cities language it's very \"smoothed\" due to huge migrations and radio/TV influence. Experts can distinguish urban dialects for hundreds of properties, but most of them aren't detectable by people without special training. Nowadays one can hear original dialects with their full specifics only in villages.</p>\n\n<p>Some examples of original differences:</p>\n\n<ul>\n<li><p><a href=\"http://www.gramota.ru/book/village/map14.html\" rel=\"nofollow\">type of \"g\" (plosive, fricative)</a></p></li>\n<li><p><a href=\"http://www.gramota.ru/book/village/map15.html\" rel=\"nofollow\">type of \"v\" before consonants or at word end (labiodental or bilabial)</a></p></li>\n</ul>\n\n<p>Sentence intonation is almost equal for most Russian dialects in the sense that in simple sentences only one logically stressed word has changed tone of stressed syllable. Complex sentences with subordinate clauses get smoothed intonation floating. (The notable exception is Olonets region which keeps some reflexes of the old tonal stress system.) The same is true for east Ukrainian dialects, as opposed to west ones, where intonations are closer to common European style (the boundary is approximately between Ternopil and Zhytomir). So, if you want to hear sentence intonation style known in English, German, etc., study west Ukrainian dialects:)</p>\n", "Id":"1693", "ParentId":"1113", "LastEditorUserId":"51", "CreationDate":"2012-03-24T16:38:17.203", "OwnerUserId":"865", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-04-15T00:12:35.313", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2013-04-15T00:12:35.313", "Score":"6", "OwnerUser":{"UpVotes":"20", "Location":"Kiev, Ukraine", "DownVotes":"0", "Id":"865", "AccountId":"1343107", "Views":"3", "Reputation":"284", "CreationDate":"2012-03-24T16:20:02.170", "DisplayName":"Netch", "LastAccessDate":"2014-01-06T20:38:36.213", "Age":"41"}}