{"Body":"<p>I think you might be going at this the wrong way. Naughty words are naughty because they are used in a naughty manner, not because of what they actually mean, or used to mean. If we look at general swearwords, where they're taken from depends very much on culture. Where I am from, the bad, native swearwords are religious in theme: satan, hell, damn you etc. Swearwords realted to  bodily functions and sex are much rarer, many borrowed from English actually. In Brussels, some use the word \"architect\" as a swearword. Considering some of the architecture there and the history of how those buildings came about, that is very understandable. Due to some of the architecture that have turned up where I live, I've started using \"architect\" as a swearword myself.</p>\n\n<p>What I think you are looking for is <em>euphemisms</em>, inoffensive words being used as stand-ins for offensive words. Euphemisms is a rich source of new naughty words, as the offensive meaning \"rubs off\", and then the euphemism needs a euphemism of its own. You'd need some way of discovering words that mean soft, words for anything that resembles a stick, and words for temperatures above normal at least, but this is fascinatingly unpredictable really.</p>\n\n<p>The simplest would probably be to find porn-sites in various languages, sort them on language, get the text-content and use that to train a learning spam-filter. (You'll need text from non-porn sites too). Then see if you can pick out words or preferrably several word-pairs or word-triplets from that that are good indicators of \"porniness\".</p>\n\n<p>And now for the obligatory reference in this case ;)</p>\n\n<p>Quang Phúc Ðông: \"<a href=\"http://douglemoine.com/english-sentences-without-overt-grammatical-subjects/\">English sentences without overt grammatical subject</a>\", South Hanoi Institute of Technology, Hanoi, 1967</p>\n", "Id":"1716", "ParentId":"1715", "LastEditorUserId":"483", "CreationDate":"2012-03-28T11:04:32.263", "OwnerUserId":"119", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-03-28T12:33:10.997", "LastEditedUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "LastActivityDate":"2012-03-28T12:33:10.997", "Score":"7", "CommentCount":"1", "OwnerUser":{"UpVotes":"302", "DownVotes":"1", "Id":"119", "AccountId":"14652", "Views":"52", "Reputation":"3065", "CreationDate":"2011-09-14T14:24:24.227", "DisplayName":"kaleissin", "LastAccessDate":"2014-01-18T22:21:33.313", "AboutMe":"<p>Sysadmin/programmer by day, linguist by night.</p>\n"}}