{"Body":"<p>The <strong>monogenesis hypothesis</strong>, which holds that there was <em>a single language from which all other languages of the world came out</em>, is false.  The languages of the world include several hundred signed languages, which one can no more ignore than Austronesian or Agglutinating languages.  It is beyond doubt that these signed languages arise spontaneously under certain conditions and have done so many times<sup><strong>1,</strong></sup><sup><strong>2</strong></sup>.  In at least one case, ISN of Nicaragua, researchers have documented every step of the mechanism of language creation, not “from nothing”, but by reanalyzing and reorganizing gestural communication into the hierarchical linguistic structure of human language<sup><strong>3</strong></sup>. At bare minimum, language provably arose without input from any existing human language, signed or spoken<sup><strong>4</strong></sup>, once in the 1980s and once in prehistory. </p>\n\n<p>A weaker version of monogenesis for spoken languages only, would be more interesting and would:</p>\n\n<ol>\n<li>explain how this known mechanism of language genesis would generate spoken language, with its obligatory gestural components; or</li>\n<li>propose some alternative to this known mechanism, and</li>\n<li>explain why it would only operate once in the case of spoken language. </li>\n</ol>\n\n<hr>\n\n<p><sup><strong>1</strong>: Goldin-Meadow, S. The resilience of language: What gesture creation in deaf children can tell us about how all children learn language. New York: Psychology Press, 2003.<br> \n<strong>2</strong>: Tomasello, M (2003) Constructing a Language: A Usage-Based Theory of Language Acquisition, Harvard University Press.\n<br>\n<strong>3</strong> Hurford, James, 2001. The Origins of Grammar: Language in the Light of Evolution II. Oxford University Press.\n<br>\n<strong>4</strong> Kegl, J., A. Senghas, and M. Coppola 1999 Creation through contact: Sign language emergence and sign language change in Nicaragua In M. DeGraff, (Ed.), Language Creation and Language Change: Creolization, Diachrony, and Development. Cambridge MIT Press, 179-237. </sup>\n</p>\n", "Id":"1719", "ParentId":"682", "LastEditorUserId":"803", "CreationDate":"2012-03-28T18:07:05.970", "OwnerUserId":"803", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-04-15T19:30:10.877", "LastEditedUser":{"UpVotes":"0", "DownVotes":"0", "Id":"803", "AccountId":"1285298", "Views":"7", "Reputation":"408", "CreationDate":"2012-02-28T18:05:10.473", "DisplayName":"Joe Martin", "LastAccessDate":"2012-04-17T06:20:47.550"}, "LastActivityDate":"2012-04-15T19:30:10.877", "Score":"4", "CommentCount":"8", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"803", "AccountId":"1285298", "Views":"7", "Reputation":"408", "CreationDate":"2012-02-28T18:05:10.473", "DisplayName":"Joe Martin", "LastAccessDate":"2012-04-17T06:20:47.550"}}