{"OwnerUser":{"UpVotes":"302", "DownVotes":"1", "Id":"119", "AccountId":"14652", "Views":"52", "Reputation":"3065", "CreationDate":"2011-09-14T14:24:24.227", "DisplayName":"kaleissin", "LastAccessDate":"2014-01-18T22:21:33.313", "AboutMe":"<p>Sysadmin/programmer by day, linguist by night.</p>\n"}, "comments":[], "Body":"<p>You are correct about Swedish. But a non-Swedish text may contain Swedish parts, dialogue by a Swede for instance, and then you might find ä and ö.</p>\n\n<p>Danish uses \"at\" where Norwegian (both forms) uses \"å\". It is the infinitive marker, used much as \"to\" in English. Danish isn't very fond of diphthongs either.</p>\n\n<p>Nynorsk and Bokmål is harder. The vocabulary of bokmål and nynorsk are not identical. The personal pronouns for instance are not all the same, here's some of the differences:</p>\n\n<pre><code>         1st sing 1st plural 2rd plural 3rd plural\nBokmål:  jeg      vi         dere       de\nNynorsk: eg       vi/me/oss  de/dykk    dei\n</code></pre>\n\n<p>Some users of Bokmål collapse the feminine and masculine genders into a common gender, using the inflections of the masculine.</p>\n\n<p>Nynorsk inflected words are less likely to end with -n, or -t and more likely to end with a vowel.</p>\n\n<p>Nynorsk in general uses more diphthongs, and different diphthongs in some places. For instance in some strong verbs the past tense forms uses different diphthongs: </p>\n\n<pre><code>         infinitive present    simple past   past perfect\nBokmål:  å krype -  kryper   - krøyp/krøp  - har krøpet\nNynorsk: å krype -  kryp(er) - kraup       - har krope/kropi\n</code></pre>\n\n<p>(The dialect I <em>speak</em> most of the time uses</p>\n\n<pre><code>         å krype -  kryper   - krøyp       - har krypi\n</code></pre>\n\n<p>Some might consider this to reveal my political stance :)\n)</p>\n\n<p>Good Nynorsk can be quite different from Bokmål grammatically but Nynorsk translated from Bokmål uses Bokmål grammar. I know good Nynorsk when I see it but I don't get to see it very often so I can't give you any \"look for this\" tips :)</p>\n\n<p>Disclaimer: I am Norwegian and have not studied Norwegian after high school. I <em>have</em> read a reference grammar though, in order to write a recognizer: Faarlund, J.T. Norsk Referansegrammatikk. Universitetsforlaget, 1997.</p>\n", "Id":"1726", "ParentId":"1723", "CreationDate":"2012-03-30T08:07:38.930", "Score":"8", "PostTypeId":"2", "OwnerUserId":"119", "LastActivityDate":"2012-03-30T08:07:38.930", "CommentCount":"5"}