{"OwnerUser":{"UpVotes":"302", "DownVotes":"1", "Id":"119", "AccountId":"14652", "Views":"52", "Reputation":"3065", "CreationDate":"2011-09-14T14:24:24.227", "DisplayName":"kaleissin", "LastAccessDate":"2014-01-18T22:21:33.313", "AboutMe":"<p>Sysadmin/programmer by day, linguist by night.</p>\n"}, "comments":[], "Body":"<p>For the record, Norwegian doesn't have a codified spoken form, which is probably why pronunciation-dictionaries are hard to come by. Some people from some areas like to imagine that their dialect is the standard, unfortunately for them the rest of the population does not oblige. What I find very revealing is that it seems common to regard dialects spoken far away as sounding nice, but those not one's own that is spoken just across the river as sounding horrible. I doubt that is solely a Norwegian phenomenon though...</p>\n\n<p>I've lived in many parts of Norway thanks to being a \"military brat\" so I've been exposed to a lot of dialects. (I've also lived abroad for the same reason which is probably why I am fluent in English) So, my perspective might not be the same as somebody who's lived in the same region all their lives. For one, I don't consider any dialect to truly be ugly, and I tend to automatically adapt quite a bit to the dialect of the speaker.</p>\n\n<p>Politically, Nynorsk is associated with SP (center party, conservative and still dominated by farmers) and KrF (christian people's party, conservative and dominated by people from the south and west, wherefrom Nynorsk originally hails anyway). H (right, conservative) tends toward very conservative and sometimes reactionary Bokmål. V (left, liberal) use Bokmål. A former leader from V attempted to be folksy and hobnob with SP and KrF by moving his inflections nearer to Nynorsk but since he bungled it, hilarity ensued and the standup comedians had material for months. FrP (progress party, populist): I think the death of Nynorsk is part of their party program. AP (workers party, social democrats) and SV (social left, slightly more left-leaning social democrats), I associate them with Nynorsk-like  Bokmål and dialects. Then there's, hm, they used to be called RV (red election alliance, far left) and are now called Rødt (red, after they gobbled up more of the endless amount of tiny communist splinter parties) go for Radikal(t) Bokmål: the worker lingo of the eastern parts of Oslo, with lots of feminine gender (nouns ending in -a in the definite) and forms like \"krypi\". In many ways it feels half way between Nynorsk and Bokmål. I don't have any language-associations for De Grønne (the greens). Other Norwegians will no doubt protest these associations, perhaps even loudly.</p>\n\n<p>Radikalt Bokmål is the form I tend towards, and even tend to write in if I don't need to adapt to an audience. I can't speak any dialect cleanly anyway so it feels like a workable compromise to me. When I write to customers I normalize but when I write to colleagues I don't. Normalizing towards the written standards I guess is a way of showing distance, in the same way that it seems only the employees at the tax office and judges use \"De\" (3rd person plural pronoun being used for 2nd person singular) instead of \"du\" (2nd person singular). \"De\" adds <em>a lot</em> more distance than conservative Bokmål though.</p>\n\n<p>There used to be a campaign for Samnorsk, that is: the blending of Nynorsk and Bokmål. AFAIK that's been abandoned. It must have been pushed by the bureaucracy because I don't know of anyone who actually wanted Samnorsk.</p>\n\n<p>What is not particularly accepted is mixing the forms. Mixing krypi (nonstandard), krypte (weak form, nonstandard), krope/kropi (Nynorsk) and krøpet (Bokmål) while writing or speaking is taken for a lot of bad things: poor education, stupidity, low self-esteem, laziness etc.</p>\n\n<p>Obligatory joke: During the second world war one of the ship convoys to Murmansk was attacked by German submarines. As the subs leave, it is discovered that one of the Norwegian ships is dead in the water and everybody expect the worst. A group is sent over, there's nobody on deck. Turns out the crew is all inside, and alive, though a bit worse for the wear. Asked what had been going on the reply was that they (the crew) hadn't really noticed any attack by any submarines as they had been busy \"discussing\" the spelling reform of 1938.</p>\n", "Id":"1729", "ParentId":"1727", "CreationDate":"2012-03-31T10:15:30.180", "Score":"3", "PostTypeId":"2", "OwnerUserId":"119", "LastActivityDate":"2012-03-31T10:15:30.180", "CommentCount":"4"}