{"comments":[], "Body":"<p>Signed languages don't have <em>counterparts to</em> phones and phonetics, they have phones and phonetics.  We quit using “chereme” because it was found to be inaccurate. Stokoe (1965) coined the term for the combinatorial parts of signs in his original analysis—location, handshape and movement—and these have since been taken as “phonemes” of signed language, but this is a misconception.  Phonemes are temporal segments; location, handshape and movement happen at the same time, so cheremes and phonemes were two different things.  </p>\n\n<p>If we were to use  “chereme” to replace a word used with speech, the word would be “parameter”,  Phonemes are described in terms of parameters, e.g. place, manner, voicing ...  that are satisfied by specific phonetic features, and Stokoe's parameters are basically the same.<br>\nPlace or Location—in the mouth or on the body; \nConfiguration—of the articulator, hand shape or tongue shape; \nManner—of movement, mainly. </p>\n\n<p>The phonetic features that fulfill these parameters occur simultaneously in bundles: English /L/ = {alveolar, lateral, aproximant}; ASL “black” = {forehead, index finger, move sideways}.  A narrow phonetic description of the sign would include a [+/- bent] feature for each finger; if I produced that sign, you would see a phone. </p>\n\n<p>A lot of research has been done on this. Besides the M&amp;H Model of sign phonology, several others are<br>\nHand Tier Model, Sandler &amp; Lillo-Martin 2006,<br>\nDependency Model, van der Hulst 1993,<br>\nProsodic Model, Brentari, 1998  </p>\n\n<p><a href=\"http://rads.stackoverflow.com/amzn/click/0521482488\">http://www.amazon.com/Language-Linguistic-Universals-Wendy-Sandler/dp/0521482488</a></p>\n", "Id":"1735", "ParentId":"243", "CreationDate":"2012-04-02T05:19:23.197", "Score":"6", "PostTypeId":"2", "OwnerUserId":"803", "LastActivityDate":"2012-04-02T05:19:23.197", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"803", "AccountId":"1285298", "Views":"7", "Reputation":"408", "CreationDate":"2012-02-28T18:05:10.473", "DisplayName":"Joe Martin", "LastAccessDate":"2012-04-17T06:20:47.550"}}