{"comments":[], "Body":"<p>First,  <a href=\"http://linguistics.stackexchange.com/questions/1502/definitions-of-phoneme\">“Definitions of phoneme”</a> in the context of a spoken language is not unanimous.\nSIL's definition above is good, but if the language has no sound system, do like Steven says, find the contrastive units.  But there are problems. </p>\n\n<p><img src=\"http://i.stack.imgur.com/8yzZO.png\" alt=\"enter image description here\"></p>\n\n<p>Here are two ASL signs formed by putting a pointer finger on the forehead and moving it sideways, where bending the finger at the end changes the meaning.  Each sign consists of an initial position, a movement and a final position. The contrastive feature is the +/- bent finger in the final segment.  </p>\n\n<p>The modern notion of a phoneme is a temporal segment, so one can't say the finger, or just the handshape is a phoneme, we have to include the entire feature bundle: orientation;palm down, location;forehead, and everything else that happens simultaneously in that segment, would all be included as one phoneme. \nWith around a hundred contrastive handshapes, and the same number of locations, plus orientation, movement and facial expressions, there would be literally millions of such “phonemes”, and this sort of defeats the purpose of having them.</p>\n\n<p>If one takes an older, Bloomfieldian definition of “phoneme” any contrastive element counts (e.g. Chinese tones), so just the bent index finger alone would be a “phoneme”. But that's even worse!  </p>\n\n<p>Mostly, phoneme theory has nothing to offer sign linguistics, and every <a href=\"http://www.google.com/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=10&amp;sqi=2&amp;ved=0CH4QFjAJ&amp;url=http://ureca.recherche.univ-lille3.fr/sparrow/docs/phonolog_signed_language.pdf&amp;ei=JEd5T79yjLe3B9DxwC8&amp;usg=AFQjCNHuLY0h8KFOc73F2usVCMNQ40IERw&amp;sig2=xCbDKTlwTiTT8F2zrZDaTQ\" rel=\"nofollow\">model of signed structure</a> is feature-based and uses autosegmental or other non-linear phonology.  Upshot is, no phonemes in signed languages. </p>\n", "Id":"1736", "ParentId":"237", "CreationDate":"2012-04-02T06:35:33.460", "Score":"2", "PostTypeId":"2", "OwnerUserId":"803", "LastActivityDate":"2012-04-02T06:35:33.460", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"803", "AccountId":"1285298", "Views":"7", "Reputation":"408", "CreationDate":"2012-02-28T18:05:10.473", "DisplayName":"Joe Martin", "LastAccessDate":"2012-04-17T06:20:47.550"}}