{"OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}, "comments":[], "Body":"<p>I'm not a linguist, so please double check my answer.   To the best of my knowledge, you are more-or-less correct.   Though grammatical rules can change over time, and new words are added to a language over time, at any given moment,  speakers of a given variety of a language use a finite set of grammatical rules and a finite set of morphemes (meaningful parts of words such as roots and affixes) to generate a potentially limitless number of new utterances.   </p>\n\n<p>The reason that the number of new utterances is potentially limitless is because languages allow certain structures to be added to the same structures over and over again indefinitely.  For example, in English, relative clauses can occur within relative clauses ad infinitum.  Thus, \"the cat that ate the rat\" can be revised to \"the cat that ate the rat that ate the cheese\" to \"the cat that ate the rat that ate the cheese that stank up the kitchen\" to \"the cat that ate the rat that ate the cheese that stank up the kitchen in which I was trying to eat the pudding\" and so on indefinitely.</p>\n\n<p>It is difficult for lay people like myself to understand the details of this generative view of language.  However, it is worth noting that, in the course of everyday conversation, we would all be taken aback if we conversed with someone who used a small set of stock sentences to communicate with.  In fact, we <em>are</em> all taken aback for this reason when we verbally interact with automated answering systems.   This just goes to show that all of us expect novel utterances when we converse with other people, aside from certain stock utterances like \"Yes!\" and \"Here we go again.\"     </p>\n", "Id":"1743", "ParentId":"1734", "CreationDate":"2012-04-03T04:18:57.197", "Score":"0", "PostTypeId":"2", "OwnerUserId":"790", "LastActivityDate":"2012-04-03T04:18:57.197", "CommentCount":"2"}