{"Body":"<p>I've done a couple of little experiments on the identification of stop consonants in whispered speech, though I haven't published the results or even fully analyzed the data, and don't know if I ever will. One of them was with a single Gengbe speaker, and the other was with 15 Korean speakers (if my memory serves me correctly). With that caveat in mind, I'll venture some guesses about whispered speech. </p>\n\n<p>It seems that whisperers articulate stop consonants in such a way that the aerodynamic effect of producing them is similar to normal speech. In normal speech voiced consonants have less pressure buildup behind the closure than do voiceless consonants phonation will not occur with too high of a transglottal flowrate. In whispered speech I think that talkers produce a voiced stop so that it has a pressure gradient across the constriction similar to what would be experienced if phonation were occurring. Listeners can then identify a voicing contrast by the intensity of the release burst. I think this is true because for both the Gengbe and Korean participants, identification of voicing/laryngeal contrasts was best for velar stops. Velar stops have a higher burst intensity overall than stops at other places of articulation, so differences between more and less intense bursts will be more palpable. Identification for Gengbe was worst for labial velar stops, which have a very faint burst release, and Korean labial stops were also poorly distinguished. Korean listeners were also able to distinguish at better than chance rates the fortis-lenis distinction, and I think that they were able to make use of duration differences to help with this.</p>\n\n<p>Place of articulation is determined by spectral properties of the speech signal which do not require periodic excitation of the oral cavity, so we would predict that vowel and consonant place of articulation information is well preserved in whispered speech, and I didn't find anything to contradict this. Gengbe makes a distinction between lamino-dental and apico-alveolar voiced stops, and these two were never confused by my participant.</p>\n\n<p>As expected, tonal contrasts are very poorly preserved, and my Gengbe participant could not distinguish at better than chance rates high and low tones. I don't think tonal contrasts should be ruled out altogether: one could in principle differentiate tones by altering the tension of the pharyngeal walls, making the airflow more or less turbulent, though this is just speculation.</p>\n\n<p>If anyone can contribute any references to published work on perception of whispered speech, I'd love to see them.</p>\n", "Id":"1748", "ParentId":"1745", "LastEditorUserId":"483", "CreationDate":"2012-04-03T23:14:38.093", "OwnerUserId":"483", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-04-04T01:00:24.500", "LastEditedUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "LastActivityDate":"2012-04-04T01:00:24.500", "Score":"10", "CommentCount":"1", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}