{"OwnerUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "comments":[], "Body":"<p>The type of airstream mechanism you describe (air flowing  through the mouth and nose <em>into</em> the lungs rather than the other way around), is known as <em><a href=\"http://en.wikipedia.org/wiki/Ingressive_sound\">ingressive</a></em>. It is denoted in IPA by a down arrow (↓) placed next to the consonant that has this feature. </p>\n\n<p>By your description of the sound, I suppose it could be considered a pulmonic ingressive voiceless alveolar fricative and its symbol in the IPA would be [s↓]. But I don't think there is any language in which that sound is used for linguistic purposes, as opposed to paralinguistic purposes, such as reacting to a story.</p>\n\n<p>According to the Wikipedia:</p>\n\n<blockquote>\n  <p>The only attested use of a phonemic pulmonic ingressive is a lateral fricative in Damin, a ritual language formerly used by speakers of Lardil in Australia. This can be written with the extended version of the International Phonetic Alphabet as [ɬ↓].</p>\n</blockquote>\n", "Id":"1758", "ParentId":"1756", "CreationDate":"2012-04-05T16:45:15.410", "Score":"10", "PostTypeId":"2", "OwnerUserId":"22", "LastActivityDate":"2012-04-05T16:45:15.410", "CommentCount":"3"}