{"OwnerUser":{"UpVotes":"13", "WebsiteUrl":"http://stevenxu.ca", "Id":"9", "AccountId":"69900", "CreationDate":"2011-09-13T20:51:36.750", "AboutMe":"<p>Hi friends! I'm <a href=\"http://stevenxu.ca\" rel=\"nofollow\">Steven Xu</a>. I'm an enthusiastic San Francisco software engineer focused on the Web. </p>\n\n<p>In my spare time, I like to play and coach volleyball and dabble in linguistics, especially phonetics.</p>\n", "Age":"24", "Location":"Canada", "DownVotes":"0", "Views":"74", "Reputation":"1326", "DisplayName":"Steven Xu", "LastAccessDate":"2013-09-27T23:39:20.960"}, "comments":[], "Body":"<p>The short answer is that they are different. The former refers to alveolo-palatal articulation. The latter refers to palatal release of the consonant.</p>\n\n<p>The pure palatal segments [ɕ] and [ʑ] have a constant alveolo-palatal place of articulation. The palatalized alveolar segments [sʲ] and [zʲ] have alveolar articulation with a palatal release. The two core sounds (palatal versus alveolar) are very clearly distinguishable and several languages do have [ɕ]-[s] minimal pairs. </p>\n\n<p>As far as I know, there are no languages with ?[ɕ]-[sʲ] minimal pairs; i.e., there are no languages that make a semantic contrast based purely on palatalization onset time. That's not to say the difference is not noticeable. Mandarin Chinese has the alveolo-palatal fricative in its standard phonology, but it is common to see delayed palatalization onset these days, and it is seen as a dialectical (especially cosmopolitan urban) marker as well as a non-native dialectical marker (the delayed palatalization as well as voiced palatalization as in [sj] is extremely common for learners of Chinese whose L1 is a language that lacks palatal obstruents).</p>\n\n<p>It is always worth note in cases like these, however, that since there is no contrastive difference between the two in any language, there is no real canonical difference between the two. There'd be nothing stopping you from transcribing speech using a convention where the palatal release diacritic was just taken to mean constant palatal articulation.</p>\n", "Id":"176", "ParentId":"175", "CreationDate":"2011-09-15T17:14:38.007", "Score":"17", "PostTypeId":"2", "OwnerUserId":"9", "LastActivityDate":"2011-09-15T17:14:38.007", "CommentCount":"12"}