{"Body":"<p>All the same methods of analysis that are used with spoken languages apply successfully to signed languages. Most work with sign is at a subphonemic level, in  keeping with modern trends  toward nonlinear phonology. \nThe analysis of a HMH sign as one syllable utilizes a sonority scale based on perceptual salience, and  equates Movements with vowels and Holds with consonants.  Other models of visual  phonology utilize autosegments, with separate tiers for  configuration features { +/-  backed tongue root, raised apex, bent finger, palm upward ... } and for Location / Place features { alveolar ridge, teeth, lip, nose, forehead … } each tier operating independently. \nBrentari, D. (1998). A Prosodic Model of Sign Language Phonology. MIT Press,  outlines different models of sign phonology starting on page 83, and discusses syllables from page 71.  </p>\n\n<p>In the Movement-Hold Model, the phoneme /t/ would be a Hold-Movement-Hold structure, with beginning and ending positions of the tongue joined by a Movement. The auditory signature of a stop consonant is dead silence: what's perceived, via changes in formant frequency, is the movement of the articulator, either upward [eat] or downwards [tea].  As it moves, the articulator has to be in some configuration, and since this tongue-shape occurs simultaneously with the movement component, we get acoustically different /t/s if we change it.  This co-articulation is the difference between dark L and clear L, or between two signs with different hand-shapes.<br>\nNote: A big difference in the two media is that no morphemes show up in speech at this level of detail, but a HMH sign often includes several morphemes, maybe an entire sentence.  </p>\n", "Id":"1786", "ParentId":"1737", "LastEditorUserId":"803", "CreationDate":"2012-04-14T04:14:39.853", "OwnerUserId":"803", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-04-15T02:45:34.533", "LastEditedUser":{"UpVotes":"0", "DownVotes":"0", "Id":"803", "AccountId":"1285298", "Views":"7", "Reputation":"408", "CreationDate":"2012-02-28T18:05:10.473", "DisplayName":"Joe Martin", "LastAccessDate":"2012-04-17T06:20:47.550"}, "LastActivityDate":"2012-04-15T02:45:34.533", "Score":"3", "CommentCount":"1", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"803", "AccountId":"1285298", "Views":"7", "Reputation":"408", "CreationDate":"2012-02-28T18:05:10.473", "DisplayName":"Joe Martin", "LastAccessDate":"2012-04-17T06:20:47.550"}}