{"Body":"<p>ASL has grammatical morphemes, in the form of facial expressions, that function as modifiers and co-occur with the manual signs they modify<sup><strong>1</strong></sup>.  The modifier has scope over all the signing produced with that facial expression.  Example: \n<img src=\"http://i.stack.imgur.com/oMP4r.jpg\" alt=\"enter image description here\"></p>\n\n<p>Raised brows signal a sentence topic, analogously to the Japanese particle wa/ga.  Here the topic is the whole “old man and woman” part, so the brows are raised and held while signing those three signs.  A scrunched up lip signals a relative clause, and the sign “old” gets an up-lip, so a more accurate translation would be “a man who is old”.  Not exactly what you're looking for, but close.</p>\n\n<p>Location in space is another grammatical morpheme.  This stuff is better written in vertical columns, and then it would show how \"man who is old\" is signed over to the signer's left, and \"woman\" is signed over to the right side. If they were both old, they'd both be signed on the same side. </p>\n\n<p><sup><strong>1</strong>. Carol Neidle, Judy Kegl, Dawn MacLaughlin, Benjamin Bahan, and Robert G. Lee (2000) The Syntax of American Sign Language: Functional Categories and Hierarchical Structure. Cambridge, MA: The MIT Press.  Section 3.4.3 starting on Page 42</sup></p>\n", "Id":"1798", "ParentId":"1788", "LastEditorUserId":"803", "CreationDate":"2012-04-16T01:56:47.343", "OwnerUserId":"803", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-04-16T02:07:31.027", "LastEditedUser":{"UpVotes":"0", "DownVotes":"0", "Id":"803", "AccountId":"1285298", "Views":"7", "Reputation":"408", "CreationDate":"2012-02-28T18:05:10.473", "DisplayName":"Joe Martin", "LastAccessDate":"2012-04-17T06:20:47.550"}, "LastActivityDate":"2012-04-16T02:07:31.027", "Score":"3", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"803", "AccountId":"1285298", "Views":"7", "Reputation":"408", "CreationDate":"2012-02-28T18:05:10.473", "DisplayName":"Joe Martin", "LastAccessDate":"2012-04-17T06:20:47.550"}}