{"comments":[], "Body":"<p>Phonology, morphology and etc are not elements or components that can be developed, they are levels of linguistic analysis.  At the level of the morpheme, rules tell how the morphemes fit together into a structure. If they are just jumbled together with no structure, there is no language. That was thought to be the case with ASL, until Stokoe proved otherwise.   </p>\n\n<p>If someone invented a <em>language</em> it would by definition have such structures at each level of analysis. Later, if users of the language developed different rules and structures, one could ask if it was now sufficiently different to be a new language, and if so, if that language was 'natural'.<br>\nASL was proven to be a <em>natural</em> language by showing that it was not invented, it is not a modified version of OFLS or anything else; it was not planned, it arose spontaneously, with genetic roots in at least three existing signed languages, and none in any spoken language.  </p>\n\n<p><strong>Not all sign language is ASL. Not all “sign language” is a natural signed language.</strong>  Some is just gestures; some is <a href=\"http://en.wikipedia.org/wiki/Manually_Coded_English\" rel=\"nofollow\">Signed English</a> or a <a href=\"http://en.wikipedia.org/wiki/Manually_coded_language\" rel=\"nofollow\">manual code</a> for some other spoken language.  Signed English is an artificial language which <em>was</em> planned and so forth; ASL is a natural language. </p>\n\n<p><img src=\"http://i.stack.imgur.com/xIW9B.jpg\" alt=\"enter image description here\"></p>\n\n<p>Being a constructed language, Signed English has structure at all the above named levels. At the level of phonology its structure is partly that of ASL and partly invented.  At the levels of syntax and morphology it has the structure of English.  Syntactically, as shown here, the two languages have different word order.  Morphologically, Signed English uses one sign for each English word, ASL uses fewer words and more affixes.</p>\n\n<p>It's worth noting that there are children whose first and only language is Signed English, but that doesn't make SE a natural language. </p>\n", "Id":"1807", "ParentId":"285", "CreationDate":"2012-04-17T05:36:01.633", "Score":"1", "PostTypeId":"2", "OwnerUserId":"803", "LastActivityDate":"2012-04-17T05:36:01.633", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"803", "AccountId":"1285298", "Views":"7", "Reputation":"408", "CreationDate":"2012-02-28T18:05:10.473", "DisplayName":"Joe Martin", "LastAccessDate":"2012-04-17T06:20:47.550"}}