{"Body":"<blockquote>\n  <p>But I honestly can't hear the phonetic difference unless the speaker carefully puts a pause between the morphological boundaries.</p>\n</blockquote>\n\n<p>You have very good instincts, because this statement is halfway to the answer. An exploration of the topic is best started in a discussion of the differences between the words <em>shoe</em> and <em>chew</em>, which differ only in that the former has a fricative initially and the latter has an affricate.</p>\n\n<p>The period of silence (caused by voiceless stop closures like [t]) that characterizes stops and the \"stop\" portion of affricates is indistinguishable from regular silence. We only ever \"identify\" the presence of \"stoppiness\" as well as the nature of the stoppiness (e.g., bilabial vs. velar) by the influences that the silences have on neighboring segments.</p>\n\n<p>In the case of the postalveolar fricative versus the postalveolar affricate, in the postalveolar affricate, the stop asserts its status by altering the nature (non-technical term used here; I will elaborate) of the following fricative.</p>\n\n<p>Let's compare my totally amateur recordings of shoe versus chew.</p>\n\n<h2>Shoe</h2>\n\n<p><img src=\"http://i.stack.imgur.com/aDrij.png\" alt=\"shoe\"></p>\n\n<h2>Chew</h2>\n\n<p><img src=\"http://i.stack.imgur.com/t9o3U.png\" alt=\"chew\"></p>\n\n<p>What do you notice?</p>\n\n<p>There are two major differences that linguists have narrowed down as the cues our ears and minds use to differentiate <em>shoe</em> from <em>chew</em>:</p>\n\n<ul>\n<li>The fricative is longer in duration than the affricate in general.</li>\n<li>The loudest point in the fricative occurs much later as a proportion of total fricative length compared to the affricate.</li>\n</ul>\n\n<p>You can even test this out for yourself by doing some basic audio editing in Praat or Audacity.</p>\n\n<p>When our brains hear <em>catch it</em> or <em>cat shit</em>, it is applying these two metrics to figure out which one it heard. Slow ascension to maximum amplitude and relatively long frication noise? Must be <em>shit</em>.</p>\n\n<p>This only really tells part of the story, though. Let's explore the production side a little.</p>\n\n<p>When an oral stop happens, the tongue (or lips) completely constrict the oral pathway. No air (and consequently sound, to an extent) can get in or out. That being said, in the transition process when a non-obstruent like a fricative or an oral sonorant follows a stop in the same syllable (this does not apply all the time, but the story is really complicated), what happens is that in the last few dozen milliseconds air starts coming out from the bottom of the vocal tract. Air pressure behind the stops exceeds air pressure outside the stop. And when the stop is released, air molecules quickly crack from behind the stop to in front of it relatively quickly (on releases of all oral stops, aspirated or not, especially into vowels, you can feel a marked burst of air on your lips or if you put your hand in front of your mouth). This is what we call the stop burst.</p>\n\n<p>Now, many different sorts of things can happen following the stop burst. In the case of the fricatives after stops, the closure relaxes slightly, causing the air to burst, but it remains relatively tight, and air traveling turbulently as it goes through and comes out of that tight corridor is what causes frication noise.</p>\n\n<p>So the story of the affricate (stop into fricative) is that significantly higher than atmospheric pressure builds up behind the closure. When the stop bursts and the tongue goes into constriction position for the fricative, that high pressure of air is released over the early span of the fricative, causing a high amount of noise.</p>\n\n<p>Compare this to what happens when you pronounce a bare fricative. In those cases (e.g., <em>shoe</em>), your tongue goes into fricative position (small constriction), and then your lower vocal tract just starts pushing air through the constriction. The noise does not begin amidst extremely high pressure behind the constriction. That lack of an air pressure gradient causes it to be quieter.</p>\n\n<p>The quicker climb of the affricate case causes a \"critical noise/vibration\" level to be reached more quickly and the tongue to retreat from its constriction position, hence the shorter duration of fricatives in general (the critical level hypothesis is not that thoroughly explored to my knowledge, but it seems to explain a <em>lot</em>). </p>\n\n<p>So that's the story of fricative versus affricate.</p>\n\n<p>Bring it all the way back to your case, what happens when there's a \"syllable break\" is important. When there is a syllable break after the stop, the pressure buildup behind the stop closure releases (sometimes audibly, depending on the dialect). Then, the tongue assumes the fricative constriction position during a period of neutral pressure, and then the air starts flowing, and the sound occurs as a regular fricative.</p>\n\n<p>I'm sure this is poorly edited, so I welcome volunteers who would be kind enough to correct me on all the errors I may have made.</p>\n\n<p>@aedia asked in a comment a very interesting question that I'll address as an edit:</p>\n\n<blockquote>\n  <p>perhaps try something like at shoe vs. achoo </p>\n</blockquote>\n\n<p>That's actually a slightly different case in my mind. The prosodic characteristics of <em>at</em> (being a very weak unit) in <em>at shoe</em> may cause segmentation issues. While I still haven't read anything that's totally convinced me that phonemic affricates exist in English, I suspect that proponents of phonemic affricates might argue that the resegmented form is proof that /tʃ/ the cluster and /tʃ/ the affricate are distinct. Rambling aside, this doesn't appear to prevail in my dialect and the fricative in <em>at shoe</em> emerges like a vanilla fricative:</p>\n\n<h2>At shoe</h2>\n\n<p><img src=\"http://i.stack.imgur.com/Y9kRI.png\" alt=\"at shoe\"></p>\n\n<h2>Achoo</h2>\n\n<p><img src=\"http://i.stack.imgur.com/OKSkU.png\" alt=\"achoo\"></p>\n", "Id":"181", "ParentId":"179", "LastEditorUserId":"9", "CreationDate":"2011-09-15T22:46:19.090", "OwnerUserId":"9", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-15T23:21:23.947", "LastEditedUser":{"UpVotes":"13", "WebsiteUrl":"http://stevenxu.ca", "Id":"9", "AccountId":"69900", "CreationDate":"2011-09-13T20:51:36.750", "AboutMe":"<p>Hi friends! I'm <a href=\"http://stevenxu.ca\" rel=\"nofollow\">Steven Xu</a>. I'm an enthusiastic San Francisco software engineer focused on the Web. </p>\n\n<p>In my spare time, I like to play and coach volleyball and dabble in linguistics, especially phonetics.</p>\n", "Age":"24", "Location":"Canada", "DownVotes":"0", "Views":"74", "Reputation":"1326", "DisplayName":"Steven Xu", "LastAccessDate":"2013-09-27T23:39:20.960"}, "LastActivityDate":"2011-09-15T23:21:23.947", "Score":"26", "CommentCount":"4", "OwnerUser":{"UpVotes":"13", "WebsiteUrl":"http://stevenxu.ca", "Id":"9", "AccountId":"69900", "CreationDate":"2011-09-13T20:51:36.750", "AboutMe":"<p>Hi friends! I'm <a href=\"http://stevenxu.ca\" rel=\"nofollow\">Steven Xu</a>. I'm an enthusiastic San Francisco software engineer focused on the Web. </p>\n\n<p>In my spare time, I like to play and coach volleyball and dabble in linguistics, especially phonetics.</p>\n", "Age":"24", "Location":"Canada", "DownVotes":"0", "Views":"74", "Reputation":"1326", "DisplayName":"Steven Xu", "LastAccessDate":"2013-09-27T23:39:20.960"}}