{"Body":"<p>I'm not a linguist, but I will try to provide some relevant information here as a native speaker.</p>\n\n<p>Words that come from other languages and get translated into Chinese are so different that I don't really know how important semantics is here. For example,</p>\n\n<blockquote>\n  <p>Leonardo Da Vinci 达芬奇 (da fen qi)</p>\n</blockquote>\n\n<p>Though \"fen qi\" can be a word in Chinese (分歧, difference in opinion), \"da\" does not make any sense if put before \"fen qi\". And one would know from the context that \"da fen qi\" is a person. Additionally, \"da\" is also not a common Chinese family name, so we know intuitively that \"da fen qi\" is a foreigner.</p>\n\n<p>There are also a few characters only used in foreign names. For example, \"耶\" is for the sound \"ye\". Though \"耶\" has a lot of homophones in Chinese that are more often used, people who first introduced foreign proper nouns into China probably found \"耶\" more exotic. So yes, sometimes lexically.</p>\n\n<blockquote>\n  <p>Yale University 耶鲁大学（ye lu da xue, da xue = university）</p>\n  \n  <p>Jerusalem 耶路撒冷（ye lu sa leng）</p>\n</blockquote>\n\n<p>And how do we distinguish proper nouns originated in China from common nouns? For example,</p>\n\n<blockquote>\n  <p>Tian'anmen Square 天安门广场（tian an men guang chang, guang chang = square）</p>\n</blockquote>\n\n<p>Since you have \"Tian'anmen\" before \"Square\", it is understood that you are talking about a specific place. In English, you might (???) later refer to it as \"the Square\" (with a capitalized \"S\"). In Chinese, since there is no articles* or capitalization, you can simply use \"那个广场\" (that square) or \"广场\" (square). For example,</p>\n\n<blockquote>\n  <p>我昨天去了天安门广场。广场上有很多人。</p>\n  \n  <p>(literally) I yesterday went to the Tian'anmen Square. Square* (on\n  it) had a lot of people.</p>\n\n<pre><code>*Definite Article:\n\nUnlike English, which has only one definite article “the\", Mandarin  does not \nhave this word at all. You can say ‘this’ or ‘that’, ‘these’ or ‘those’, but \nnot ‘the’.  \n\nIndefinite Article:\n\nWhile we have (a / an / some) in English as indefinite articles,  these words \ndo not exist in Mandarin.  To say ‘a book’ in Mandarin Chinese, you say ‘one \nbook’.\n\nhttp://mylanguages.org/chinese_articles.php\n</code></pre>\n</blockquote>\n\n<p>EDIT</p>\n\n<p>I was reading an article in which there was a man named Greg Weeks. Is it easy to distinguish \"Weeks\" (his last name) from \"weeks\" (the time unit)? Yes, even if they are both capitalized (at the beginning of a sentence, for example)! I think context is everything - and same with Chinese.</p>\n", "Id":"1816", "ParentId":"1558", "LastEditorUserId":"847", "CreationDate":"2012-04-18T21:44:05.167", "OwnerUserId":"847", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-07-28T08:03:59.323", "LastEditedUser":{"UpVotes":"4", "DownVotes":"0", "Id":"847", "AccountId":"1331883", "Views":"4", "Reputation":"166", "CreationDate":"2012-03-17T13:56:02.307", "DisplayName":"gonnastop", "LastAccessDate":"2013-07-28T08:02:57.427"}, "LastActivityDate":"2013-07-28T08:03:59.323", "Score":"5", "OwnerUser":{"UpVotes":"4", "DownVotes":"0", "Id":"847", "AccountId":"1331883", "Views":"4", "Reputation":"166", "CreationDate":"2012-03-17T13:56:02.307", "DisplayName":"gonnastop", "LastAccessDate":"2013-07-28T08:02:57.427"}}