{"comments":[], "Body":"<p>Anecdotally, I'd say yes, even after the (hypothetical) critical period for language learning I've experienced passive hearing as very helpful in acquiring a new language.</p>\n\n<p>Empirically, there's <a href=\"http://www.victoria.ac.nz/home/about/newspubs/news/ViewNews.aspx?id=2458&amp;newslabel=hn\">a study</a> that says that simply hearing a language is helpful in learning to understand it.</p>\n\n<p>Theoretically, this makes sense. A basic problem involved in language acquisition is the Segmentation Problem: the sounds you hear are physically continuous, but you need to break them into discrete segments (separate sounds) in order for them to be intelligible. Also, as opposed to written language, spoken language doesn't necessarily give a clear signal as to where one word ends and another begins. This is one of the main stumbling blocks to acquiring a new language: you have to learn to segment what you're hearing on two levels. Now, the more you hear a stream of sounds composed of a given set of building blocks (morphemes, themselves composed of phonemes) the more information you have with which to figure out where one of them starts and another begins. Think of it like this: a sound is physically (phonetically) different depending on what sounds it is in between. By hearing it again and again in different environments, your brain can better figure out what exactly makes that sound different from other sounds, and what's just the effect of neighboring sounds.</p>\n\n<p>I'd guess that passive hearing with no instruction is more effective than reading a good language-teaching book but not hearing the language. You might be able to learn how to read and write Norwegian from a book, but unless you know exactly how letters like O and R sound in Norwegian (not always quite like English!) you won't get very far in understanding it when you hear someone speak.</p>\n", "Id":"1826", "ParentId":"1792", "CreationDate":"2012-04-19T17:53:08.100", "Score":"7", "PostTypeId":"2", "OwnerUserId":"941", "LastActivityDate":"2012-04-19T17:53:08.100", "OwnerUser":{"UpVotes":"9", "WebsiteUrl":"http://www.didyoulearnanything.net", "Location":"Germany", "Id":"941", "DownVotes":"1", "AccountId":"522746", "Views":"1", "Reputation":"317", "CreationDate":"2012-04-19T09:51:50.690", "DisplayName":"michaelsappir", "LastAccessDate":"2013-10-14T14:20:51.253", "Age":"26"}}