{"comments":[], "Body":"<p>I think the big difficulty with the phonetics-phonology divide is not only that linguists don't even really agree on the difference but also that there doesn't exist a good analogy with any other pair of subfields.</p>\n\n<p>This is the way I've seen it (cards on the table, although there are more extreme folks, I'm fairly far on the \"phonology doesn't exist\" camp, and that is probably influencing my answers)...</p>\n\n<p><strong>Phonology</strong> is the study of the cognitive processes that turn words into instructions to hand down to the physical body parts that produce the sounds. These instructions, personified into human commands, might sound like, \"close your lips, now move your tongue to touch your alveolar ridge; begin lowering the diaphragm at a normal rate and constrict the vocal chords to this degree\". On the acoustic side, phonology's role is much harder to specify (at least to me), but I would say that the \"phonology\" center takes in sequences/matricies of interpreted linguistic features, for example \"between 442-488ms, palatalization level 2\". Phonology would then turn that into the abstract \"underlying\" representations that can be mapped to morphological parsers and the lexicon.</p>\n\n<p><strong>Phonetics</strong> is the study of how the \"commands\" end up translating into specific articulator and vocal tract movements. For instance, how the command to retract the tongue at some particular time \"really\" maps to minute physical details like exactly when tongue section X touches mouth section Y and then in turn how that affects parts of the resultant acoustic signal. Phonetics also makes observations of how certain groups of instructions can cause very specific consequences. On the acoustic side, phonetics turns the mental spectrogram we receive from the nerve endings in our cochleas into feature sets and timings of the sort that it received from the phonological center during articulation.</p>\n\n<p><strong>Articulatory phonology</strong> is an attempt to consolidate the two, that, as far as I can tell, is basically phonetics taken one level deeper to receive underlying segments as inputs. And articulatory phonology moves a lot of what was in phonology proper as cognitive processes into physically motivated processes during articulation.</p>\n\n<p>In short, nobody really knows the difference, but the broad agreement is that phonetics is lower-level and more articulator-centric and phonology is higher-level and more cognition-centric.</p>\n", "Id":"184", "ParentId":"180", "CreationDate":"2011-09-15T23:05:46.533", "Score":"11", "PostTypeId":"2", "OwnerUserId":"9", "LastActivityDate":"2011-09-15T23:05:46.533", "OwnerUser":{"UpVotes":"13", "WebsiteUrl":"http://stevenxu.ca", "Id":"9", "AccountId":"69900", "CreationDate":"2011-09-13T20:51:36.750", "AboutMe":"<p>Hi friends! I'm <a href=\"http://stevenxu.ca\" rel=\"nofollow\">Steven Xu</a>. I'm an enthusiastic San Francisco software engineer focused on the Web. </p>\n\n<p>In my spare time, I like to play and coach volleyball and dabble in linguistics, especially phonetics.</p>\n", "Age":"24", "Location":"Canada", "DownVotes":"0", "Views":"74", "Reputation":"1326", "DisplayName":"Steven Xu", "LastAccessDate":"2013-09-27T23:39:20.960"}}