{"comments":[], "Body":"<p>The Sino-Tibetan languages are actually a wonderful counterexample.  Some are isolating; some, especially the modern <a href=\"http://en.wikipedia.org/wiki/Tibetan_languages\">Tibetan languages</a>, are agglutinative; and the <a href=\"http://books.google.com/books?id=EcD8uNFBFHAC&amp;pg=PA372\">Kiranti languages</a> are highly fusional.  Some are tonal; many aren't, including <a href=\"http://en.wikipedia.org/wiki/Nepal_Bhasa\"> Newari</a> and several of the Tibetan languages.  (Indeed, Newari phonology looks like the phonology of an Indian language: voiced and voiceless aspirated plosives, retroflex and dental consonants, phonemic vowel length, and so on.)  Some are SVO, but some, including the Tibetan languages again and also <a href=\"http://en.wikipedia.org/wiki/Burmese_language\">Burmese</a>, are SOV.  </p>\n\n<p>It's important to remember that languages don't \"know\" what family they're in.  A feature that's been part of the language for thousands of years is just as likely to stick around, and just as likely to be lost, as a feature that was just borrowed or innovated yesterday.  So for instance, yeah, Mandarin and Newari share a common ancestor several thousand years back &mdash; but now there's nothing that's constraining them to evolve in the same direction as one another.  And so in fact they've diverged tremendously, Mandarin coming to look like a \"typical\" East Asian language and Newari like a typical South Asian language.</p>\n\n<p>To the extent that genetically related languages <i>are</i> typologically similar, it's a result either of historical intertia or of continued contact.  Over the course of 4,000 years, historical intertia only buys you so much continued similarity.  So when a language family spreads out over a natural barrier (as the Sino-Tibetan family did) or across a wide area (as Indo-European did), the result is an awful lot of typological diversity among genetically-related languages.</p>\n", "Id":"1858", "ParentId":"1853", "CreationDate":"2012-04-30T01:59:22.463", "Score":"7", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2012-04-30T01:59:22.463", "OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}}