{"comments":[], "Body":"<p>Essentially all of the Na-Dene languages make such a distinction. To take Tlingit, the language I work on, the inventory of the three types of stops &amp; affricates is as follows:</p>\n\n<ul>\n<li><strong>Unaspirated</strong>: t, ts, tʃ, tɬ, k, kʷ, q, qʷ</li>\n<li><strong>Aspirated</strong>: tʰ, tsʰ, tʃʰ, tɬʰ, kʰ, kʰʷ, qʰ, qʰʷ</li>\n<li><strong>Ejective</strong>: tʼ, tsʼ, tʃʼ, tɬʼ, kʼ, kʼʷ, qʼ, qʼʷ</li>\n</ul>\n\n<p>The glottal stop (ʔ, also ʔʷ for some) could be either unaspirated or ejective depending on one’s analysis. The only voiced sounds in Tlingit are the sonorants /n, j, w, ɰ/, so none of the unaspirated stops &amp; affricates are ever voiced in careful speech, and usually aren’t in fast speech either. Tlingit was described with instrumental phonetic data by Maddieson, Smith, &amp; Bessell (2001, <em>Anthropological Linguistics</em>), if you care to check.</p>\n\n<p>For completeness, Tlingit also has a plain/ejective fricative distinction:</p>\n\n<ul>\n<li><strong>Plain fricative</strong>: s, ʃ, ɬ, x, xʷ, χ, χʷ, h</li>\n<li><strong>Ejective fricative</strong>: sʼ, ɬʼ, xʼ, xʼʷ, χʼ, χʼʷ</li>\n</ul>\n\n<p>The ejective fricatives are real ejectives, articulated in much the same way as ejective stops and affricates. They have a smaller aperture and greater tension with the primary articulator (the tongue) than the plain fricatives, compensating for the ‘leaky’ property of fricatives. Note the lack of *ʃʼ, which might be the result of a historical merger of *sʼ, *ʃʼ > sʼ.</p>\n\n<p>As far as I’m aware, nearly all the Athabaskan languages have the same three-way distinction between unaspirated, aspirated, and ejective stops and affricates. Navajo is particularly well documented phonetically, as is Witsuwitʼen. For the latter see Sharon Hargus’s immense grammar (Hargus 2007). I think Joyce McDonough has some solid instrumental phonetic data for Dëne Sųłiné and Slave as well, but I don’t have a reference offhand. Eyak also has the same patterns, but I don’t know of any phonetic investigation of it. The Proto-Na-Dene language is thus logically reconstructed with the same three-way distinction.</p>\n", "Id":"1874", "ParentId":"1831", "CreationDate":"2012-05-04T20:15:28.580", "Score":"4", "PostTypeId":"2", "OwnerUserId":"511", "LastActivityDate":"2012-05-04T20:15:28.580", "OwnerUser":{"UpVotes":"30", "WebsiteUrl":"http://www.drangle.com/~james", "Id":"511", "AccountId":"513739", "CreationDate":"2011-11-16T02:03:12.387", "AboutMe":"<p>I’m a PhD student in linguistics at the University of British Columbia. I work on Tlingit, a critically endangered language of northern British Columbia, the Yukon, and southeast Alaska. I also have extensive interests in the related Athabaskan languages, language documentation theory and practice, orthography design, morphological theory, phonological theory, and the syntax of noun phrases and relativization.</p>\n\n<p>I’ve been using TeX and friends for more than a decade. I use Xe(La)TeX, fontspec, memoir, and BibLaTeX extensively, and I am working on a BibLaTeX style for linguistics publications. Other packages I use frequently include pst-jtree, expex, and booktabs. I’m learning PGF/TikZ and considering developing a library to produce autosegmental representation diagrams. I do my writing in TeXShop, and my TeX programming in MacVim, having abandoned FSF Emacs and XEmacs due to their perpetually disappointing Unicode rendering.</p>\n", "Age":"35", "Location":"Vancouver, Canada", "DownVotes":"5", "Views":"13", "Reputation":"866", "DisplayName":"James C.", "LastAccessDate":"2013-11-03T19:13:48.097"}}