{"Body":"<p>The most common evaluation metrics examine the conceptual \"distance\" between the <strong>candidate parse</strong> generated by the parser, and the correctly annotated solution (the \"<strong>gold standard</strong>\").  Gold standards are sometimes annotated by hand, but more often they come from existing corpora (<a href=\"http://linguistics.stackexchange.com/questions/1632/is-there-a-standard-corpus-against-which-to-benchmark-mechanical-parsers\">Is there a standard corpus against which to benchmark mechanical parsers?</a> has related discussion).  A common choice is the <em>Wall Street Journal</em> sections of the <a href=\"http://www.cis.upenn.edu/~treebank/\" rel=\"nofollow\">Penn Treebank</a>.</p>\n\n<p>Generally speaking, the current standard comparison is the <strong>PARSEVAL</strong> metric (<a href=\"http://www.aclweb.org/anthology-new/H/H91/H91-1060.pdf\" rel=\"nofollow\">Black, et al 1991</a>). It defines a set of values that focus primarily on the constituency differences between the two trees. The main values are:</p>\n\n<ul>\n<li><p><strong>Precision</strong>: The number of correct constituents out of the number of constituents in the candidate parse.</p></li>\n<li><p><strong>Recall</strong>: The number of correct constituents out of the number of constituents in the gold standard.</p></li>\n<li><p><strong>F-Score</strong>: The harmonic mean of precision and recall (see below).</p>\n\n<p><img src=\"http://i.stack.imgur.com/9GHsz.png\" alt=\"F-score formula from Wikipedia: F=2*(P*R)/(P+R)\"></p></li>\n</ul>\n\n<p>To demonstrate the concept, consider the pair of trees given below.</p>\n\n<p><img src=\"http://i.stack.imgur.com/nUQ0k.png\" alt=\"Two parse trees\"></p>\n\n<p>The constituents for each are given below in form label:yield (<strong>yield</strong> is the span of the node/constituent).</p>\n\n<pre><code>Candidate  gold\n   X:a      X:a\n   Y:b      Z:b\n   Z:cd     V:cd\n   --       Y:bcd\n   W:abcd   W:abcd\n</code></pre>\n\n<p>As you can see, all of the constituents in the candidate have correct yield, so we have 4/4 = <strong>100%</strong> precision, but there is an extra node in the hierarchy of the gold, so we only have 4/5 = <strong>80%</strong> recall. These values then give us an F-score of 2*1*0.8/(1+0.8) = <strong>88.9%</strong>.</p>\n\n<p>We may also want to consider the accuracy of the labels. In this case we can use the <strong>labelled precision</strong> and <strong>labelled recall</strong> (potentially introduced by <a href=\"http://acl.ldc.upenn.edu/P/P97/P97-1003.pdf\" rel=\"nofollow\">Collins 1997</a>). These metrics only count a node as correct if its yield AND label match the gold standard.  Above, only 2 out of our 4 nodes with correct yield have the correct label (W &amp; X), so we get:</p>\n\n<pre><code>P = 50%  R = 40%  F = 44.4%\n</code></pre>\n\n<p>PARSEVAL also includes one last value—the number of <strong>crossing brackets</strong>.  This is simply a count of how many constituent boundaries in the candidate cross over constituent boundaries in the gold. These errors might be considered more serious, because they often indicate an element is in the completely wrong grouping. In the above example there are no crossing brackets.</p>\n\n<hr>\n\n<p>As you may have noticed, PARSEVAL is a rather <em>coarse</em> metric, and it certainly is not without <a href=\"https://files.ifi.uzh.ch/cl/gschneid/ParserVorl/ParserVorl10.pdf\" rel=\"nofollow\">conceptual flaws</a>. Among the complaints:</p>\n\n<ul>\n<li>Rewards shallow/safe analyses better than those that make more claims but a few mistakes.</li>\n<li>Especially with corpora, punishes parsers that provide more information than necessary.</li>\n<li>Some \"single\" errors can hurt the score repeatedly, for example a single misplaced node may trigger multiple crossing brackets and incorrect yields.</li>\n<li>Weights all nodes evenly, rather than making crucial semantical relations more important.</li>\n</ul>\n\n<p>There are several competing metrics to address some of these issues. One such is Sampson's <a href=\"http://www.grsampson.net/RLeafAnc.html\" rel=\"nofollow\"><strong>leaf-ancestor</strong> metric</a>.  This method examines the <strong>lineage</strong> of each terminal node—the list of nodes that connect it to the root—and determines the edit distance from the lineage of that node in the gold standard. The creators argue that this is a much more intuitive sense of accuracy, mostly because the Parseval metric \"lays excessive weight on locating the exact boundaries of constructions,\" (<a href=\"http://www.grsampson.net/ATot.html\" rel=\"nofollow\">Sampson &amp; Babarczy</a>) which might not be as semantically important as the \"ancestry\" for each word.</p>\n\n<p>Still, PARSEVAL remains in widespread use, most likely because it is simple and most of its flaws are \"equally flawed\" for different parsing approaches.  ACL's <a href=\"http://aclweb.org/aclwiki/index.php?title=Parsing_%28State_of_the_art%29\" rel=\"nofollow\">state-of-the-art listing</a> continues to use it (though this wiki link only has a few recent parsers included).</p>\n\n<hr>\n\n<p>One should note that the above vision doesn't apply to all models of grammar. <strong>Dependency grammars</strong> in particular have become popular for parsing in the last decade. These do not intrinsically define constituents, so they cannot utilise the formulas as given above.  <em>Note: I cannot attest well enough to other models at the moment, so perhaps someone else can come along.</em></p>\n\n<p>Lastly, consider that there are factors that one might evaluate that don't compare parses with a standard. Most statistical parsers assign a score to each parse for the purposes of ranking and choosing the best.  One may want to adjust the values of this score without even knowing if the parse is correct. (e.g. in a parser whose top candidates all get very uncertain scores or one that responds poorly to unknown entities).  There are plenty of other goal-dependent values too. For example, necessary training set size might be a big factor to a parser that aims to approach optimal output with minimal input.</p>\n\n<p>In any case, these tools are only used for rough comparisons. Any fine-grained evaluations will consider many metrics, and when controlled for different factors—languages, training sets, tuning values, time/memory limitations, etc.  Ultimately it comes down to the idea of success for the given problem, which is usually tough to quantify, and impossible to compare unilaterally.</p>\n", "Id":"1875", "ParentId":"1873", "LastEditorUserId":"746", "CreationDate":"2012-05-04T22:14:41.697", "OwnerUserId":"62", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-05-05T08:05:55.673", "LastEditedUser":{"UpVotes":"62", "WebsiteUrl":"http://www.overpunch.com", "Id":"746", "AccountId":"63513", "CreationDate":"2012-02-07T00:29:49.180", "AboutMe":"<p>I am a computational linguistics PhD candidate. But before that, long before that, I fell in love with languages.</p>\n\n<p>By the way, if you're addicted to Stack Exchange and use iOS, check out <a href=\"http://stackapps.com/questions/3673/stackwise-a-beautiful-way-to-browse-stack-exchange-sites\">Stackwise for iOS</a> and browse Stack Exchange beautifully.</p>\n", "Age":"28", "Location":"Sydney, Australia", "DownVotes":"12", "Views":"15", "Reputation":"1989", "DisplayName":"jogloran", "LastAccessDate":"2014-01-18T09:49:34.847"}, "LastActivityDate":"2012-05-05T08:05:55.673", "Score":"5", "CommentCount":"1", "OwnerUser":{"UpVotes":"33", "WebsiteUrl":"http://www.tdhsmith.com", "Id":"62", "AccountId":"558608", "CreationDate":"2011-09-13T21:40:09.490", "AboutMe":"<p>I'm a graduate in mathematics currently pursuing linguistics; I am primarily interested in syntax, semantics, and language documentation, especially in regard to special registers and/or signed languages, but I enjoy just about anything language-related.  In my spare time I enjoy travelling, computer programming, geocaching, bad puns, obscure board game variants, urban farming, and all kinds of food.</p>\n", "Age":"25", "Location":"United States", "DownVotes":"2", "Views":"6", "Reputation":"470", "DisplayName":"tdhsmith", "LastAccessDate":"2012-09-04T04:59:08.823"}}