{"OwnerUser":{"UpVotes":"33", "WebsiteUrl":"http://www.tdhsmith.com", "Id":"62", "AccountId":"558608", "CreationDate":"2011-09-13T21:40:09.490", "AboutMe":"<p>I'm a graduate in mathematics currently pursuing linguistics; I am primarily interested in syntax, semantics, and language documentation, especially in regard to special registers and/or signed languages, but I enjoy just about anything language-related.  In my spare time I enjoy travelling, computer programming, geocaching, bad puns, obscure board game variants, urban farming, and all kinds of food.</p>\n", "Age":"25", "Location":"United States", "DownVotes":"2", "Views":"6", "Reputation":"470", "DisplayName":"tdhsmith", "LastAccessDate":"2012-09-04T04:59:08.823"}, "comments":[], "Body":"<p>Portuguese does not have full* morphological case marking, though it still expresses case through other methods, e.g. pronoun choice, use of prepositions, and other syntactic phenomena.</p>\n\n<p>This seems to have been known for a long time: (<a href=\"http://books.google.com/books?id=U7oGAAAAQAAJ&amp;pg=PA11#v=onepage&amp;q&amp;f=false\" rel=\"nofollow\">Transtagano &amp; Nourse 1768</a>)</p>\n\n<blockquote>\n  <p>The Portuguese nouns have no variation of case, like the Latin, and it is only the article that distinguishes the case.</p>\n</blockquote>\n\n<p>As you noted, the <a href=\"http://wals.info/\" rel=\"nofollow\">World Atlas of Language Structures</a> doesn't list Portuguese anywhere under its \"number of cases\" feature, but in Chapter 49 it does generalize for the region: (<a href=\"http://wals.info/chapter/49\" rel=\"nofollow\">Iggeson 2011</a>)</p>\n\n<blockquote>\n  <p>Western Europe has no case marking, or only minimal inventories (with the striking exception of Basque).</p>\n</blockquote>\n\n<p>Another generalization, this time for the whole family: (<a href=\"http://books.google.com/books?id=oGh5C6DwZowC&amp;pg=PT186&amp;lpg=PT186#v=onepage&amp;q&amp;f=false\" rel=\"nofollow\">Kato 2010</a>)</p>\n\n<blockquote>\n  <p>...in Romance[,] case is morphological only in pronouns.</p>\n</blockquote>\n\n<p>Clements' work on the Korlai-Portuguese creole addresses Middle Portuguese directly: (<a href=\"http://books.google.com/books?id=n2qDqzm7-fcC&amp;pg=PA104&amp;lpg=PA104#v=onepage&amp;q&amp;f=false\" rel=\"nofollow\">1996</a>)</p>\n\n<blockquote>\n  <p>...case marking for nouns does not involve paradigms in any of the three languages [including Middle Portuguese], but rather elements that are more appropriately considered syntactic phenomena...</p>\n</blockquote>\n\n<p>Finally, Bick's <em>Portuguese Syntax</em> (<a href=\"http://visl.sdu.dk/~eckhard/pdf/Portuguese_Syntax4.ps.pdf\" rel=\"nofollow\">2000</a>) has a couple good quotes on the matter:</p>\n\n<blockquote>\n  <p>In order to force case on Portuguese nominal constituents, pronoun substitution is useful... [since only pronouns display case]</p>\n</blockquote>\n\n<p>And in his conclusion on how to classify Portuguese parts of speech:</p>\n\n<blockquote>\n  <p>Thus, nouns, proper nouns, adjectives and (cardinal) numerals feature\n  number and gender [...] only number is ”free” in nouns, whereas gender is a lexeme category to be derived directly from the lexicon. [...] Personal\n  pronouns are morphologically special in that they also inflect for person and case.</p>\n</blockquote>\n\n<hr>\n\n<p>*-Note that I used the term \"<em>full</em>\" in the beginning to highlight the fact that some authors consider pronoun selection to be \"morphological case marking.\" The more common view however seems to be that pseudo-lexical pronoun differentiation alone does not constitute a system of overt noun case marking.  From <em>Flexible Syntax: A Theory of Case and Arguments</em>: (<a href=\"http://books.google.com/books?id=91-D04Xphi0C&amp;pg=PA185#v=onepage&amp;q&amp;f=false\" rel=\"nofollow\">Neeleman &amp; Weerman 2001</a>)</p>\n\n<blockquote>\n  <p>As an aside, it should be remarked that the mere existence of a distinction between object and subject pronouns does not mean that object pronouns bear morphological case. [...] Whether or not a language has morphological case depends, it seems, on the existence of a productive paradigm. A word-specific paradigm like (13) is insufficient to introduce the relevant features into the language.</p>\n</blockquote>\n", "Id":"1881", "ParentId":"1879", "CreationDate":"2012-05-05T20:19:37.880", "Score":"4", "PostTypeId":"2", "OwnerUserId":"62", "LastActivityDate":"2012-05-05T20:19:37.880", "CommentCount":"2"}