{"Body":"<p>I disagree partly with <a href=\"http://linguistics.stackexchange.com/a/766/201\">this answer</a> claiming that 'aa' and 'ağ' are identical.</p>\n\n<p>The sequence <em>aa</em> does not appear in Turkish words unless they are of Arabic origin, and the proper pronunciation of the <em>aa</em> sequence is not a single lengthened <em>a</em> sound, but rather two separate vowel sounds. Take for example the word <em>cemaat</em> (more properly <em>cema'ât</em>), which in its Arabic form has an 'ayn consonantal sound between the two <em>a</em> sounds. The same goes for the word <em>müracaat</em>, although I concede that the standard pronunciation of the doubled <em>aa</em> in these and similar words is often more akin to <em>ağ</em> or <em>â</em>.</p>\n\n<p>The letter <em>â</em> comes mainly from Arabic loan words where it palatises the preceding consonant and/or lengthens the vowel (but Turkish orthography used to use it for French words as well: <em>plân</em>). Palatisation occurs with the letters <em>k</em>, <em>g</em> and <em>l</em>, but there is sometime ambiguity: <em>kâtil</em> has a long <em>a</em> but an unpalatised <em>k</em>; <em>lâkin</em> has a short <em>a</em> but palatised <em>l</em>.</p>\n\n<p>The sound of <em>ğ</em> after <em>a</em> varies depending on the dialect of Turkish, but in Istanbul Turkish, you'd have to say that <em>ağ</em> and <em>â</em> are identical. The same does not hold true in, say, Eastern Turkey, where you will hear the <em>ğ</em>.</p>\n", "Id":"1882", "ParentId":"373", "LastEditorUserId":"201", "CreationDate":"2012-05-06T00:39:30.723", "OwnerUserId":"557", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-05-07T11:53:40.057", "LastEditedUser":{"UpVotes":"23", "WebsiteUrl":"http://alerque.com", "Id":"201", "AccountId":"120635", "CreationDate":"2011-09-20T20:26:14.167", "AboutMe":"<p>I am a scripting language connoisseur, regular expression aficionado, network geek, general lover of Linux and a <a href=\"http://www.ohloh.net/accounts/alerque\" rel=\"nofollow\">frequent contributor</a> to open source software. I transitioned to programming from other work because I was too busy automating my own work environment to actually do the other work. I have a hobby interest in <a href=\"http://wiki.openstreetmap.org/wiki/User%3aAlerque\" rel=\"nofollow\">cartography</a>. For more <strong>see my <a href=\"http://alerque.com\" rel=\"nofollow\">personal site</a></strong>. Most importantly, my life is defined by the grace of God given to men through Jesus Christ. It is my ambition that everything I do would reflect His glory and point people towards Him.</p>\n", "Age":"32", "Location":"Izmir, Turkey", "DownVotes":"0", "Views":"2", "Reputation":"105", "DisplayName":"Caleb", "LastAccessDate":"2013-11-08T22:46:07.000"}, "LastActivityDate":"2012-05-07T11:53:40.057", "Score":"4", "CommentCount":"10", "OwnerUser":{"UpVotes":"3", "Location":"Canada", "DownVotes":"0", "Id":"557", "AccountId":"1079579", "Views":"5", "Reputation":"221", "CreationDate":"2011-12-03T19:52:47.917", "DisplayName":"SigueSigueBen", "LastAccessDate":"2013-01-07T05:22:51.570", "Age":"36"}}