{"Body":"<p>This is my question, but I've lost the login and can't respond to the questions anywhere other than here.</p>\n\n<p>@Ron Maimon- Thanks!  I think you stated my question better than I did.</p>\n\n<p>@Alennano- Thanks for the welcome.  What I meant was that most sentences an individual hears are novel in the sense that they have never encountered that exact sentence in their lives before.  I don't even know if this is true for starters, but it seems to be repeated a lot.</p>\n\n<p>@michaelsappir- It's been a while since I learned x-bar theory, but I think I understood everything you said.  If you say that everything is just a lexical item combined together with another lexical item then no tree is novel which does seem pretty trivial (I guess, unless you talk about the particular combinations of lexically-based constraints used to combine the items).  But in any event, what I meant by slots was nouns, verbs, prepositions, etc.  In terms of tree size, I agree that it seems likely that we have encountered most small trees by adulthood.  Regarding maximum tree size, since I'm interested in where \"most\" productivity comes from, I would be happy taking a frequency cutoff (like, the lower 99.9% of tree sizes an individual encounters) as capturing most day-to-day language use.</p>\n\n<p>In any event, the reason I was wondering is that poverty-of-the-stimulus arguments seem to focus a lot on (\"unexplainable\") syntactic productivity in development, but I know there are (psychological) theories arguing that children's generalization is actually very restricted (lexically but especially syntactically).  This just made me wonder if in principle, it's possible to \"get by\", as an adult, with no syntactic tree productivity.  I don't know if I explained that very well.  It's obviously a loaded question in full form which is why I asked the simplest version I could think of.</p>\n", "Id":"1911", "ParentId":"1734", "LastEditorUserId":"22", "CreationDate":"2012-05-11T22:34:50.890", "OwnerUserId":"886", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-05-12T00:28:26.337", "LastEditedUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "LastActivityDate":"2012-05-12T00:28:26.337", "Score":"0", "CommentCount":"2", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"886", "AccountId":"956009", "Views":"2", "Reputation":"43", "CreationDate":"2012-04-01T04:13:29.277", "DisplayName":"Tiffany", "LastAccessDate":"2013-01-13T17:18:27.763"}}