{"Body":"<p>Answering this question requires defining \"language\" and \"dialect\". It's easier to do this by using the non-technical word \"variety\".</p>\n\n<blockquote>\n  <p><strong>Language</strong>: speech varieties are different languages if they are not mutually intelligible.</p>\n  \n  <p><strong>Dialect</strong>: speech varieties are dialects of a language if they are mutually intelligible but differ in systematic ways.</p>\n</blockquote>\n\n<p>Some examples of dialects of English<br>\nBritain: Received Pronunciation (or RP), Yorkshire English, Estuary English, Scouse, Norfolk English, etc. Through various historical accidents RP came to be the most prestigious dialect.\nThe USA: General American, North-Central, Midland, Greater New York City, etc. General American is the variety with the fewest obvious regional features, and is used especially in the media. <a href=\"http://aschmann.net/AmEng/\" rel=\"nofollow\">Rick Aschmann</a> has an excellent and detailed introduction to North American English dialectology.</p>\n\n<p>The <a href=\"http://en.wikipedia.org/wiki/Comparison_of_American_and_British_English\" rel=\"nofollow\">Wikipedia article</a> that says: \"British English is the form of English used in the United Kingdom. It includes all English dialects used within the United Kingdom.\" is simply using the non-technical term \"form\" to refer to the grouping of all dialects of English found in the United Kingdom.</p>\n\n<p>As for the <a href=\"http://en.wikipedia.org/wiki/Singapore_English\" rel=\"nofollow\">Wikipedia article</a> on Singapore English, I can't see where it says that \"'Standard Singapore English' is not a dialect, but a form of English\". It does say that Singapore Standard English is very similar to standard British English (which I assume refers to RP). Singapore Colloquial English (aka <a href=\"http://en.wikipedia.org/wiki/Singlish\" rel=\"nofollow\">Singlish</a>) on the other hand, while based largely on English (as well as on the other languages of Singapore) is so different from English that it is not usually considered a dialect of English (ie it is not mutually intelligible with any other dialect of English) but a creole.</p>\n\n<p>So in short, referring to a \"form\" of a language is a non-technical usage that could cover any variety, or grouping of varieties, of a language (ie dialects, idiolects, registers, genres, jargons, etc).  But the term \"dialect\" is a technical term within linguistics.</p>\n", "Id":"1919", "ParentId":"1915", "LastEditorUserId":"363", "CreationDate":"2012-05-13T03:17:49.697", "OwnerUserId":"363", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-05-20T08:54:39.417", "LastEditedUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}, "LastActivityDate":"2012-05-20T08:54:39.417", "Score":"9", "CommentCount":"10", "OwnerUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}}