{"comments":[], "Body":"<p>I am reasonably certain that in all of Finnic, and I think in Hungarian, plural is marked in all cases. (Another interesting feature of Uralic languages in comparison with Indo-European languages is lack of adjective case, i.e., concord, and Finnic and I think Hungarian buck the trend here too.)</p>\n\n<p>It seems that in Mordva there is an indefinite and definite declension, corresponding to what in English we would mark with the articles \"a(n)/Ø\" vs. \"the\"; in the indefinite declension, number is only marked in the nominative.</p>\n\n<p>The idea of pluralization in Mari seems to be complex: possessive plurals are often used to pluralize a noun, there are various dedicated plural markers, and sometimes simply the plural verb form suffices; beyond this, context often seems to be enough.</p>\n\n<p>The following information is from <a href=\"http://books.google.com/books?id=0YMU5azMAV0C\" rel=\"nofollow\">The Uralic Languages</a>, edited by Daniel Abondolo, which I highly recommend, especially if you also want to find out what the situation is with the plural in Sámi, Permian, Khanty and Mansi, and Samoyedic.</p>\n\n<h2>Mordva, Gábor Zaicz</h2>\n\n<blockquote>\n  <p>We may treat as nominals all stems which take declensional suffixes: nouns, adjectives, numberals, and pronouns...Both Erzya and Moksha distinguish indefinite from definite forms of the nominal...In the I[ndefinite] D[eclension], the opposition singular : plural is neutralized in all cases except the nominative, e.g. sN <em>kudo</em> 'house', pN <em>kudo-t</em> 'houses', spEla <em>kudo-sto</em> 'out of a house ~ out of houses.' The ID pN suffix <em>-t</em> continues the pU plural suffix *-t.</p>\n</blockquote>\n\n<h2>Mari, Eeva Kangasmaa-Minn</h2>\n\n<blockquote>\n  <p>A kind of generic, non-personal plural may be expressed by the p3 suffix, e.g. <em>šüšpə̂k-ə̂št mura er dene</em> NIGHTINGALE-p3 SINGS-s3pres MORNING AT 'nightingales sing in the morning', none also <em>tosešə̂št ulo kazde jeŋə̂n</em> FRIEND-p3 EXISTS EVERY HUMAN-gen 'every person has his/her friends'.</p>\n  \n  <p>There are also several dedicated plural markers, occurring with different distributions in different dialects. Chief among these in eastern dialects is <em>-wlak</em>, e.g. pD <em>lud=šo-wlak-lan</em> 'to readers'. This suffix may be a loan from Tatar, where it is a noun meaning 'cattle'; or it may be related to Mordva <em>velʲe</em> 'village' and Saami <em>valvi</em> 'pack (of wolves, dogs)'. Its position in relation to person and case suffixes is rather labile. In the nominative, it can either precede or follow the person marker, e.g. <em>olma-m-wlak</em> or <em>olma-wlak-em</em> 'my apples', and in the grammatical cases both orders, person-number and number-person, are possible again, e.g. <em>joltaš-em-wlak-ə̂m</em> FRIEND-s1-plur-acc, <em>joltaš-wlak-em(-ə̂m)</em> FRIEND-plur-s1-acc 'my friends (acc)'. In local cases, besides these two orders, there also exists a third order, number-case-person, e.g. <em>olma-wlak-ə̂št-em</em> APPLE-plur-ine-s1 'in my apples'. The only restrictions operating in trisuffixal sequences with local cases seems to be that the plural marker cannot come last, and that the case marker cannot come first. Other, distributionally more restricted, plural suffixes in EM are <em>-la,</em> used mainly with nouns which designate places (e.g. <em>ola-la</em> 'cities';...), and <em>-mə̂t</em>, which is used with (chiefly human) animates and forms inclusives, e.g. <em>awa-mə̂t</em> 'mother and her associates'.</p>\n  \n  <p>A singular form often designates a plural conception; depending on the situation <em>kol</em> can refer to one fish or to many. There are also syntactic means of expressing plurality, viz. a noun in the singular followed by a verb in the plural: <em>kol ijat</em> FISH SWIMS-p3pres 'fish(es) swim', contrast <em>kol ija</em> FISH SWIMS.s3pres 'a fish swims' and the example with <em>šüšpə̂k-ə̂št</em> 'nightingales' cited above. In sum, the category of number is <em>in statu nascendi</em> in Mari, and is highly pragmatic.</p>\n  \n  <p>As in many Uralic languages, referents (usually body parts) normally occurring in pairs are encoded morphologically as singulars, e.g. the unmarked meaning of <em>kit</em> is '(the two) hands/arms'. Disambiguation therefore specifies the marked meaning 'one hand/arm', which is expressed by means of the word <em>pel</em> 'half', e.g. <em>pel+kid=an</em> HALF+ARM=adj 'one-armed'.</p>\n  \n  <p>The second- and third-person singular person markers also act as indicators of definiteness, thus functioning as article surrogates, e.g. <em>užeš kugužan+üdə̂r-ə̂m. kugužan+üdə̂r-et mə̂gə̂ra</em> 'he sees a princess (<em>kugužan+üdə̂r-ə̂m</em>, sA). The princess (<em>kugužan+üdə̂r-et</em>, s2; lit. your princess) is weeping.'</p>\n</blockquote>\n", "Id":"1930", "ParentId":"1893", "CreationDate":"2012-05-13T20:50:48.347", "Score":"3", "PostTypeId":"2", "OwnerUserId":"84", "LastActivityDate":"2012-05-13T20:50:48.347", "OwnerUser":{"UpVotes":"167", "WebsiteUrl":"http://web.mit.edu/~dbriggs/www", "Id":"84", "AccountId":"511555", "CreationDate":"2011-09-14T00:18:36.197", "AboutMe":"<p>At UMass Amherst in the Ph.D. program in math.<br>\n</p>\n\n<p>\nCurrently taking:<br>\nAnalysis (Measure theory & integration)<br>\nGeometry (Theory of manifolds)<br>\nModular Forms</p>\n", "Age":"29", "Location":"Cambridge, MA", "DownVotes":"0", "Views":"23", "Reputation":"1163", "DisplayName":"Daniel Briggs", "LastAccessDate":"2013-08-10T16:57:15.060"}}