{"Body":"<p>I'm afraid I don't quite understand what you mean by \"a given name of feminine grammatical gender used as a masculine given name.\"</p>\n\n<p>Gender assignment in given names is usually lexical, i.e. the Russian boy's name Petja is M and not F - although nouns ending in -a are usually F in IE languages - precisely because that particular name is given to boys, and not girls. </p>\n\n<p>UPDATE: A couple of words on gender in linguistics. <strong>Gender in linguistics doesn't mean biological gender</strong> - linguistics is not biology, after all. <strong>It is understood as a type, kind.</strong></p>\n\n<p><em>For animate nouns</em> (NB: animate doesn't mean alive), gender assignment is usually based on semantics.  In other words, if a word denotes a male (human being), the word is masculine.</p>\n\n<p><strong>For inanimate nouns, gender assignment is based on their morphosyntactic properties</strong>, e.g. all nouns taking a particular set of endings belong to gender X. That is why the first declension in Latin includes feminine (mostly) <em>and</em> masculine nouns, both common and proper (for a list of some masculine nouns belonging to the first declension see <a href=\"http://en.wikipedia.org/wiki/List_of_masculine_Latin_nouns_of_the_1st_declension\" rel=\"nofollow\">http://en.wikipedia.org/wiki/List_of_masculine_Latin_nouns_of_the_1st_declension</a>).</p>\n\n<p>Now, let me repeat it here. If a proper noun denotes a male, it is of the masculine gender. It doesn't matter whether it belongs to the first declension or not. It will be masculine. That is why \"Catilina\" in Latin is masculine, although it belongs to the first declension. Or in Russian, \"Petja\" (Pete) and \"Vera\" (a girl's name) belong to the same type of declension.</p>\n\n<p>To make things even more complicated, gender is only one type of noun categorization (see more on noun classes). There are languages where there is no masculine/feminine distinction in nouns.</p>\n\n<p>see a famous passage written by Mark Twain: \"<em>the reader will see that in Germany a man may think he is a man, but when he comes to look into the matter closely, he is bound to have his doubts; he finds that in sober truth he is a most ridiculous mixture; and if he ends by trying to comfort himself with the thought that he can at least depend on a third of this mess as being manly and masculine, the humiliating second thought will quickly remind him that in this respect he is no better off than any woman or cow in the land.</em></p>\n\n<p><em>In the German it is true that by some oversight of the inventor of the language, a Woman is a female; but a Wife (Weib) is not -- which is unfortunate. A Wife, here, has no sex; she is neuter; so, according to the grammar, a fish is he, his scales are she, but a fishwife is neither. To describe a wife as sexless may be called under-description; that is bad enough, but over-description is surely worse.</em>\"</p>\n", "Id":"1939", "ParentId":"1937", "LastEditorUserId":"445", "CreationDate":"2012-05-15T16:35:06.023", "OwnerUserId":"445", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-05-16T23:18:20.233", "LastEditedUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}, "LastActivityDate":"2012-05-16T23:18:20.233", "Score":"1", "CommentCount":"13", "OwnerUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}}