{"Body":"<p>Obviously, Colbert wanted to preserve the \"and so can you\" part, to achieve the desired effect.</p>\n\n<p>At first, I posted an answer but I decided to completely rewrite it. I don’t pretend to know all relevant literature on VPE (verb phrase ellipsis) in depth, so what I’m going to post below is mostly based on Chapter 17, written by Stirling and Huddleston, in the <em>Cambridge grammar of the English language</em>:</p>\n\n<p>There are two conflicting rules there. On the one hand, as Stirling and Huddleston argue, <em>“the VP following <strong>so</strong> is almost invariably reduced”</em> (p. 1539):</p>\n\n<blockquote>\n  <p>*Jill will certainly notice the mistake, and so will Max notice it.<br>\n  Jill will certainly notice the mistake, and so will Max.</p>\n</blockquote>\n\n<p>However, a full VP is sometimes possible, as in:</p>\n\n<blockquote>\n  <p>This forecast is admittedly way above the estimate of most analysts in several recent surveys. But so is reality generally far from off the consensus.</p>\n</blockquote>\n\n<p>However, the most important thing about the \"and so AUX Subj\" construction is that anaphoric so indicates likeness between the two clauses.</p>\n\n<p>On the other hand, we have a stranded auxiliary (can). Only auxiliary verbs can be stranded. In parallel constructions like in your example, you need to use a matching auxiliary verb in the second clause:</p>\n\n<blockquote>\n  <ol>\n  <li>I <strong>was</strong> tired, and so <strong>were</strong> the others. </li>\n  <li>I <strong>am</strong> American, and so <strong>are</strong> you.</li>\n  <li>Loiuse <strong>can</strong> dance beautifully, and so <strong>can</strong> her sister.</li>\n  <li>Jill <strong>will</strong> certainly notice the mistake, and so <strong>will</strong> Max.</li>\n  <li>\"I'<strong>ve</strong> lost their address.\" \"So <strong>have</strong> I.\"</li>\n  </ol>\n</blockquote>\n\n<p>(I borrowed some of the examples above from Swan 2005).</p>\n\n<p>This is called <a href=\"http://en.wikipedia.org/wiki/Do-support\">do-support</a>, and it works with lexical verbs. With the verb \"be\" and modal verbs you don't need \"do\"; there are some exceptions but they are irrelevant to this discussion, though. If there is another auxiliary already (like in \"have/has/had+pp\"), you don't need do, either.</p>\n\n<p>Now, Stirling and Huddleston argue that the verbs “be” and “have” tend to resist ellipsis when there are inflectional differences. In other words, in the following examples you can’t omit the verbs “be” or “have” – it would lead to unacceptable or very marginal results:</p>\n\n<blockquote>\n  <p>Kim was interrogated yesterday and is being again today.<br>\n  *Kim was interrogated yesterday and is again today.</p>\n  \n  <p>He has been sick several times, and doubtless will be again.<br>\n  *He has been sick several times, and doubtless will again.</p>\n</blockquote>\n\n<p>That's why <a href=\"http://itre.cis.upenn.edu/~myl/languagelog/archives/004522.html\">Arnold Zwicky</a> finds the following sentence marginally acceptable (sounds better than Colbert's title of the book):</p>\n\n<blockquote>\n  <p>[??] I am America, and so can you be.</p>\n</blockquote>\n\n<p>Why would it be?</p>\n\n<p>Huddleston 2002 argues that there are two types of the stranded auxiliary - discourse-old and discourse-new (p. 99).</p>\n\n<blockquote>\n  <p><em>Kim has seen the report and I think Pat has too.</em> [old-verb stranding]</p>\n  \n  <p><em>I'll help you if I can.</em> [new-verb stranding]</p>\n</blockquote>\n\n<p>It's called discourse-old because the missing material occurs in the preceding context (seen the report).</p>\n\n<p>Huddleston also argues that new-verb stranding has a slightly narrow rage of possibilities:</p>\n\n<blockquote>\n  <p>*I didn't bother to phone the results to her because I knew Kim was.</p>\n</blockquote>\n\n<p>This sentence is <strong>ungrammatical</strong> (or, rather, infelicitous) because it's virtually impossible to recover \"Kim was\" from the previous context. \"Kim was what?\"</p>\n\n<p>To conclude, a couple of words on the construction, \"and so AUX Subj\". Stirling and Huddleston argue that this construction is restricted to positive clauses:</p>\n\n<blockquote>\n  <p>Jill <strong>will</strong> certainly notice the mistake, and so <strong>will</strong> Max.<br>\n  *Jill won't notice the mistake, and so won't Max.</p>\n</blockquote>\n\n<p>On the other hand, the subject in the \"and so AUX Subj\" must be different from the subject in the preceding clause:</p>\n\n<blockquote>\n  <p>*Jill can play the piano, and so can she sing.<br>\n  Jill can play the piano, and so can Max.</p>\n</blockquote>\n", "Id":"1981", "ParentId":"1979", "LastEditorUserId":"445", "CreationDate":"2012-05-24T20:06:21.067", "OwnerUserId":"445", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-05-25T19:14:28.463", "LastEditedUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}, "LastActivityDate":"2012-05-25T19:14:28.463", "Score":"8", "CommentCount":"5", "OwnerUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}}