{"OwnerUser":{"UpVotes":"133", "WebsiteUrl":"http://lumenaris.com", "Id":"314", "AccountId":"906180", "CreationDate":"2011-09-27T02:55:28.507", "AboutMe":"<p>I play lots of games, develop a few.  Check out my publisher's page at <a href=\"http://lumenaris.com/games.html\" rel=\"nofollow\">lumenaris.com</a>.</p>\n\n<p>New games published in 2013:</p>\n\n<ul>\n<li><em><a href=\"http://lumenaris.com/goldenwilderness.html\" rel=\"nofollow\">The Golden Wilderness</a>:</em> A game of early California, from the Spanish explorers to the Gold Rush.</li>\n<li><em><a href=\"http://lumenaris.com/actionworks.html\" rel=\"nofollow\">Actionworks</a>:</em> A fast-paced, industrial-themed card game.</li>\n</ul>\n\n<p>Games published in 2012:</p>\n\n<ul>\n<li><em><a href=\"http://lumenaris.com/games_caravans.html\" rel=\"nofollow\">Caravans of Asia</a>:</em> Trading on the Silk Road in the days of Marco Polo.</li>\n<li><em><a href=\"http://boardgamegeek.com/boardgameexpansion/130895/caravans-of-asia-arabian-sails\" rel=\"nofollow\">Arabian Sails</a>:</em> An expansion for <em>Caravans</em>; sailing ships on the monsoon winds of the Indian Ocean.</li>\n</ul>\n", "Age":"33", "Location":"California", "DownVotes":"4", "Views":"17", "Reputation":"1012", "DisplayName":"Joe", "LastAccessDate":"2014-01-07T14:27:49.863"}, "comments":[], "Body":"<p>This question is rather vague, but I think this is what you're getting at:</p>\n\n<ol>\n<li>What non-Germanic languages were spoken ca. 500 BC to 500 AD in areas that speak Germanic languages today?  How do we know?</li>\n<li>What traces do languages leave if they leave no descendants?</li>\n</ol>\n\n<p>Question 1 leads to a long list of languages.  Proto-Germanic is conjectured to have existed somewhere between 500 BC and 500 AD, roughly the period of Roman ascendancy over Europe.  We look at where Germanic languages are spoken today, then look back to the Roman period, and we can see that:</p>\n\n<ul>\n<li>Germanic languages were spoken where Germany and southern Scandinavia are today.</li>\n<li>Celtic languages (alongside Latin and whatever Pictish was) were spoken in the British Isles.</li>\n<li>Nothing was spoken in Iceland yet.</li>\n<li>Probably some Finno-Ugric language was spoken in northern Scandinavia.</li>\n<li>(I'm assuming you're looking at Europe, so I'll stop here.)</li>\n</ul>\n\n<p>Question 2 is more general.  A language that dies out can leave traces on the languages around it -- the same traces that a living language can leave.  Words can be borrowed; phrases can be borrowed or directly translated.  Look at the concept of a <em>Sprachbund</em> for some interesting types of borrowing between languages.</p>\n", "Id":"1987", "ParentId":"1983", "CreationDate":"2012-05-25T14:37:10.977", "Score":"4", "PostTypeId":"2", "OwnerUserId":"314", "LastActivityDate":"2012-05-25T14:37:10.977", "CommentCount":"1"}