{"comments":[], "Body":"<p>A partial answer to this is that it will probably depend on how native-like the speaker's pronunciation of <em>other</em> parts of the utterance are. So taking a very simplistic example with your two French vowels as an example, the words \"clé\" and \"craie\", in addition to having \"l\" vs \"r\", generally differ in that the final vowel is /e/ and /ɛ/ respectively. So if a speaker does not differentiate /e/ and /ɛ/, this puts more 'pressure' on the /l/ vs /r/ distinction to differentiate these two words.</p>\n\n<p>(N.B. it turns out that /e/~/ɛ/ are actually in free variation much of the time in French and pronunciation of either is highly subject to effects of assimilation or \"vowel harmony\", so this pair isn't necessarily the most compelling example.)</p>\n\n<p>Extending this isolated example out to many different phonemes in a more complex utterance, and you'll see that the situation quickly becomes very complex. Listeners are expecting all sorts of phonetic cues to decipher what they hear, and if you eliminate one particular cue in a specific place it's difficult to predict exactly what pressure this will put on which cues elsewhere.</p>\n\n<p>You would also need to think about what exactly you mean by two phonemes being \"similar\". If you mean specifically vowel quality, what other features of the phoneme (e.g. duration patterns, propensity to assimilation, phonotactics) are you then disregarding and does the cost-benefit ratio actually work in favour of your assumption? For example, maybe speakers have difficulty in distinguishing the <em>quality</em> of English /I/ vs /i/. But maybe they can easily pronounce these vowels with different durations and that it is primarily the duration that is perceptually important. (cf Tajima et al, 1997, \"Effects of temporal correction on intelligibility of foreign-accented English: they found that by re-synthesising foreign accented speech to correct specifically the timings of segments, this apparently improved intelligibility even though vowel <em>quality</em> may been quite 'far off the mark' in some cases). In that case, you have thrown out <em>a priori</em> a distinction that speakers could potentially have made quite easily because your system decided that it was \"too difficult to be worth making\".</p>\n\n<p>Or, to put it more succinctly: what you're proposing doesn't sound as though it will achieve its objectives.</p>\n", "Id":"1990", "ParentId":"882", "CreationDate":"2012-05-25T18:48:16.420", "Score":"2", "PostTypeId":"2", "OwnerUserId":"1047", "LastActivityDate":"2012-05-25T18:48:16.420", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://www.javamex.com/", "DownVotes":"0", "Id":"1047", "AccountId":"20470", "Views":"0", "Reputation":"326", "CreationDate":"2012-05-25T18:11:25.580", "DisplayName":"Neil Coffey", "LastAccessDate":"2013-11-29T21:16:26.503", "AboutMe":"<p>I am a language and IT specialist. My current activities include:</p>\n\n<ul>\n<li>development of various web sites, including the compilation and back-end development of language dictionaries and learning materials (incorporate Java Servlets and MySQL);</li>\n<li>software development, including various titles published for iOS;</li>\n<li>language translation, with a focus on specialist IT translation between French, Spanish and English;</li>\n<li>web articles devoted to Java programming with a focus on performance.</li>\n</ul>\n\n<p>Please message me privately for information about potential collaboration.</p>\n"}}