{"comments":[], "Body":"<p>The Cardinal Vowel chart is a rough, impressionistic tool. Nobody is claiming that it is a <em>precise</em> measurement of the quality of a vowel but rather that it is \"good enough\" for the purposes of recording and conveying an impression of the approximate quality of a vowel.</p>\n\n<p>Although it is true that as far as <em>normal, spontaneous speech processing</em> is concerned, listeners may be desensitised to subtle variations in vowel quality around the targets of phonemes in their native language(s), this doesn't necessarily preclude that with training, phoneticians can still judge the quality of vowels precisely enough for the purposes of the Cardinal Vowel chart.</p>\n\n<p>The CV chart <em>isn't</em> very well suited to studies relying on precise measurements of vowel quality. For such studies, it is more common nowadays to take an approach similar to that outlined by JoFrhwld, in which vowels (or indeed, continuants in general) are analysed for their formant frequencies. With some judicious mathematical jiggery-pokery, you can just about contort formant frequency measurements into something resembling a CV chart. But there's not always much motivation for doing so: once you're analysing in terms of measured formant frequencies rather than impressionistically, you may as well just plot those measurements on some graph or other, even if it doesn't quite look like a CV chart.</p>\n\n<p>So the bottom line is: if you are asking \"how do I find the precise position of a vowel on the CV chart?\", that's probably an indication that the CV chart isn't suitable for your purposes.</p>\n", "Id":"1992", "ParentId":"137", "CreationDate":"2012-05-26T14:35:35.470", "Score":"6", "PostTypeId":"2", "OwnerUserId":"1047", "LastActivityDate":"2012-05-26T14:35:35.470", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://www.javamex.com/", "DownVotes":"0", "Id":"1047", "AccountId":"20470", "Views":"0", "Reputation":"326", "CreationDate":"2012-05-25T18:11:25.580", "DisplayName":"Neil Coffey", "LastAccessDate":"2013-11-29T21:16:26.503", "AboutMe":"<p>I am a language and IT specialist. My current activities include:</p>\n\n<ul>\n<li>development of various web sites, including the compilation and back-end development of language dictionaries and learning materials (incorporate Java Servlets and MySQL);</li>\n<li>software development, including various titles published for iOS;</li>\n<li>language translation, with a focus on specialist IT translation between French, Spanish and English;</li>\n<li>web articles devoted to Java programming with a focus on performance.</li>\n</ul>\n\n<p>Please message me privately for information about potential collaboration.</p>\n"}}