{"Body":"<p>Defining \"native language\" can be a complex issue.</p>\n\n<p>But for linguistic purposes, I think it's most useful to see it as this: in which language(s) can you make the types of linguistic judgements that a \"canonical\" native speaker can readily make in their native language but which a typical non-native speaker cannot readily make?</p>\n\n<p>(By \"canonical\", we'd mean something like: \"a typical adult speaker having instinctively acquired just that language from birth through a typical degree of exposure\". That's actually slightly problematic: e.g. there are languages where most speakers are actually bilingual. But let's go with it for now.)</p>\n\n<p>So, for example, native speakers can typically make grammaticality judgements about sentences that are 'on the fringe' of the language's syntax whereas non-native speakers have much more difficulty making an instance judgement. So for example, a native English speaker would probably instantly recognise that one of the following 'sounds a little odd'. To even a fairly advanced non-native speaker, neither sentence probably 'breaks any grammar rules' that they've learnt:</p>\n\n<blockquote>\n  <p>\"Here's the parent involved in the homework club.\"</p>\n  \n  <p>\"Here's the parent baked a cake by the children.\"</p>\n</blockquote>\n\n<p>Or for example:</p>\n\n<blockquote>\n  <p>\"He's the friend that I told you came yesterday.\"</p>\n  \n  <p>\"He's the friend that I told you that came yesterday.\"</p>\n</blockquote>\n\n<p>Or:</p>\n\n<blockquote>\n  <p>\"Which task was he asking whether I'd finished?\"</p>\n  \n  <p>\"Which task was he asking whether was most important?\"</p>\n</blockquote>\n\n<p>So, as a starting point, in which language(s) can you instantly make judgements about sentences that constitute 'fringe' cases like this?</p>\n\n<p>I should say there are some problems with this view: it's not clear just how much consensus you will necessarily get among speakers regarding these 'fringe' cases, or whether they make those judgements in exactly the same way as with more common sentences. And it's not clear that in principle a \"non-native\" speaker can't gradually acquire the ability to make this kind of judgement over time. But for practical purposes, I think this criterion of being able to \"instantly judge difficult/fringe cases and arrive at a similar judgement to other 'canonical' native speakers\" is useful.</p>\n", "Id":"1996", "ParentId":"1994", "LastEditorUserId":"1047", "CreationDate":"2012-05-27T18:52:36.520", "OwnerUserId":"1047", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-05-29T20:14:50.823", "LastEditedUser":{"UpVotes":"0", "WebsiteUrl":"http://www.javamex.com/", "DownVotes":"0", "Id":"1047", "AccountId":"20470", "Views":"0", "Reputation":"326", "CreationDate":"2012-05-25T18:11:25.580", "DisplayName":"Neil Coffey", "LastAccessDate":"2013-11-29T21:16:26.503", "AboutMe":"<p>I am a language and IT specialist. My current activities include:</p>\n\n<ul>\n<li>development of various web sites, including the compilation and back-end development of language dictionaries and learning materials (incorporate Java Servlets and MySQL);</li>\n<li>software development, including various titles published for iOS;</li>\n<li>language translation, with a focus on specialist IT translation between French, Spanish and English;</li>\n<li>web articles devoted to Java programming with a focus on performance.</li>\n</ul>\n\n<p>Please message me privately for information about potential collaboration.</p>\n"}, "LastActivityDate":"2012-05-29T20:14:50.823", "Score":"1", "CommentCount":"5", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://www.javamex.com/", "DownVotes":"0", "Id":"1047", "AccountId":"20470", "Views":"0", "Reputation":"326", "CreationDate":"2012-05-25T18:11:25.580", "DisplayName":"Neil Coffey", "LastAccessDate":"2013-11-29T21:16:26.503", "AboutMe":"<p>I am a language and IT specialist. My current activities include:</p>\n\n<ul>\n<li>development of various web sites, including the compilation and back-end development of language dictionaries and learning materials (incorporate Java Servlets and MySQL);</li>\n<li>software development, including various titles published for iOS;</li>\n<li>language translation, with a focus on specialist IT translation between French, Spanish and English;</li>\n<li>web articles devoted to Java programming with a focus on performance.</li>\n</ul>\n\n<p>Please message me privately for information about potential collaboration.</p>\n"}}