{"Body":"<p>There are a few different things computational linguists do, broadly speaking:</p>\n\n<p><strong>computational work for linguistic knowledge</strong>: this includes, eg, statistical analysis of corpora to confirm or explore linguistic phenomena, the explorations of the computational complexity of human language</p>\n\n<p><strong>language work for computing applications</strong>: a lot of actual or potential computing applications need human language capabilities. Some examples dealt with by computational linguists include:</p>\n\n<ul>\n<li>machine translation</li>\n<li>conversational agents (computer programs that can talk to you, eg, there's a \"virtual nurse\" application in testing) (this field overlaps with <a href=\"http://en.wikipedia.org/wiki/Human%E2%80%93computer_interaction\" rel=\"nofollow\">HCI</a>)</li>\n<li>automatic question answering</li>\n</ul>\n\n<p><strong>language work required for the workflow of computing applications</strong> like parsing and so on: generally speaking a tagged sentence or parse tree isn't the end result of an application but may be required as an intermediate step in order to achieve the best results.</p>\n\n<p>There are also quite a few problems in computational linguistics that are to some extent in search of an application, or considered interesting in and of themselves. Examples typically given include word sense disambiguation (eg does \"bank\" in a given context mean a river bank or a money bank?) and textual entailment recognition. Likewise, it may not always be clear that there is an application that requires a .05% improvement in parsing reliability, but parsing researchers will pursue it (as researchers should!)</p>\n\n<p>Like any research field it has developed its own conversations. It's important not to think of computational linguists as either linguists who can program, or software developers who know some linguistics. Computational linguists spend a lot of time on problems and tasks they have developed within their community. Familiarity with those problems may help you get an idea of what you are in for. Have a look at <a href=\"http://www.aclweb.org/index.php?option=com_content&amp;task=view&amp;id=17&amp;Itemid=28\" rel=\"nofollow\">the Association for Computational Linguistics's Special Interest Groups</a> for an idea of active subfields, likewise if you look at the front matter of the <a href=\"http://www.aclweb.org/anthology/P/P11/\" rel=\"nofollow\">2011 ACL conference proceedings</a> (look for the actual schedule of presentations, it will tell you which track each paper was assigned to).</p>\n", "Id":"2002", "ParentId":"1840", "LastEditorUserId":"51", "CreationDate":"2012-05-28T01:34:20.560", "OwnerUserId":"953", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-05-28T08:47:47.597", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2012-05-28T08:47:47.597", "Score":"6", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"953", "AccountId":"493828", "Views":"0", "Reputation":"76", "CreationDate":"2012-04-24T06:00:58.740", "DisplayName":"puzzlement", "LastAccessDate":"2012-05-28T08:06:12.293"}}