{"comments":[], "Body":"<p>Well I'm still learning, but I have made some important advances on this front:</p>\n\n<ul>\n<li><p>The so-called Georgian <strong><em>Verb(s) of motion</em></strong> is/are an important and exceptional (set of) verbs.</p></li>\n<li><p>Georgian grammar is usually analysed as having four classes of verbs. Some classes form the future/perfect forms by addition of preverbs, others form them in other ways. The <em>verb(s) of motion</em> fall into the latter category.</p></li>\n<li><p>Textbooks and websites tend to be unclear on whether there is one <em>verb of motion</em>, which changes nuance by changing a <em>preverb</em>, or a set of several related <em>verbs of motion</em>, which differ by initial morpheme.</p></li>\n<li><p>Textbooks and websites on Georgian grammar are inconsistent on whether to call the same morphemes <em>preverbs</em> as they are used with the <em>verb(s) of motion</em>. Also the <em>verb(s) of motion</em> tend not to fit into the standard formats of vocabularies and dictionaries used for normal verbs with their preverbs.</p></li>\n<li><p>Textbooks and websites tend to be unclear on the relationship between the various functions of preverbs: forming the future/perfect; adding a directional component; distinguishing different senses of the same basic verb.</p></li>\n<li><p>Vocabularies and dictionaries may list their verbs alphabetically by a present form, only some of which add the preverb as a data point in a way similar to how other languages might deal with gender. But the <em>verb(s) of motion</em> will typically be listed with the initial morphemes that may or may not be considered preverbs.</p></li>\n<li><p>The <em>verb(s) of motion</em> do(es) not exist in a form lacking this preverb-like morpheme. There exists <em>modis</em> and <em>midis</em> but not plain *<em>dis</em>.</p></li>\n</ul>\n", "Id":"2005", "ParentId":"1553", "CreationDate":"2012-05-28T08:43:31.037", "Score":"1", "PostTypeId":"2", "OwnerUserId":"51", "LastActivityDate":"2012-05-28T08:43:31.037", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}