{"Body":"<p>I was reading a paper called <a href=\"http://www.fon.hum.uva.nl/paul/papers/BoersmaHamannLoans35.pdf\" rel=\"nofollow\">Loanword adaptation as first-language phonological perception</a> for a term paper I'm currently writing. I don't know enough about the literature to know if this is a particularly novel idea, but I think that their OT-based perception analysis (as seen in section 3 of that paper) is relevant here. I'll describe the theory first and then I'll talk about how I think it applies to your problem.</p>\n\n<p>For people who don't know, <a href=\"http://en.wikipedia.org/wiki/Optimality_theory\" rel=\"nofollow\">Optimality Theory</a> is basically an alternative to rule-based systems where instead of having specific inputs undergo specific transformations to become specific outputs, there is simply a bunch of preferences where some have a higher priority than others (and thus are less likely to be violated).</p>\n\n<p>Usually when people talk about OT they're talking about the production process (from UR to SR). However, that paper mentions an OT-based approach to perception. So, for example, consider a language that does not contain /ɛ/.There must be some highly ranked constraint <code>*[ɛ]/ɛ/</code> (meaning the phonetic sound [ɛ] must not be interpretted as the phonological unit /ɛ/). This prevents speakers of that langauge from <strong>perceiving</strong> /ɛ/ when they hear [ɛ]. This would be desirable because, due to the lack of /ɛ/ in that language, any SR containing /ɛ/ would be unexpected.</p>\n\n<p>Let's compare this to a language that does contain /ɛ/ as well as /e/ (like French). It is important to note that in OT <strong>all constraints exist across all languages</strong> only the rankings change. Therefore, that same <code>*[ɛ]/ɛ/</code> must exist in this language too except that now it is much much much lower priority. In this langauge, since /e/ and /ɛ/ are different, we know there needs to be another constraint <code>*[ɛ]/e/</code> (do not interpret [ɛ] as /e/) that has higher priority than <code>*[ɛ]/ɛ/</code>. This means that when speakers hear [ɛ] they are more likely to perceive it as /ɛ/ because perceiving it as /e/ is a greater violation (<code>*[ɛ]/e/ &gt;&gt; *[ɛ]/ɛ/</code>).</p>\n\n<p>The same paper proposes that the ranking of these constraints is somewhat dynamic and based on a \"probability-matching listener\". This means that, theoretically speaking, if a French speaker is systematically forced to accept [ɛ] as /e/ (for example, by speaking for an extended period of time with an L2 French speaker from a language without /e/, only /ɛ/) then the <code>*[ɛ]/e/</code> constraint slowly loses priority and the French speaker slowly becomes more ready to identify [ɛ] as /e/ (and of course, the process will slowly undo itself when the French speaker returns to speakering to other native speakers). Taken to its logical extreme, this could explain why certian languages merge certian sounds while others do not (i.e. if a language does not distinguish between two sounds, violations of the relevant constraints become so lowly ranked that faithfully perceiving phonetic input becomes more costly than approximating it).</p>\n\n<p>So here is how I think this applies to your problem: <strong>in English</strong> the constraints <code>*[ɛ]/e/</code> and <code>*[e]/ɛ/</code> are both very lowly ranked, allowing English speakers to freely interpret one as the other. Conversely, <strong>in French</strong>, where misinterpreting one as the other causes a loss of meaning, the constraints are much higher ranked and thus it is much less likely that they will confuse to two. By this approach, it isn't that speakers \"lose comprehension\" when faced with similar phonetic sounds, it's that the natural \"error correcting\" in their brain interprets the sounds as whatever sound makes the most sense in a given context.</p>\n\n<p>As mentioned earlier, I'm not too familar with the literature, but I've found <a href=\"http://www.lscp.net/persons/peperkamp/publications.html\" rel=\"nofollow\">another author</a> who's written a few papers around a similar idea of a productive perception as well as both sets of authors cite various other authors who came before them.</p>\n", "Id":"2010", "ParentId":"882", "LastEditorUserId":"1055", "CreationDate":"2012-05-30T01:36:47.663", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-05-30T07:56:14.780", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2012-05-30T07:56:14.780", "Score":"3", "CommentCount":"3", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}