{"Body":"<p>The premise that there are only two modes of communication — verbal communication and \"body language\" — and that these two categories are complements of each other is fundamentally flawed.</p>\n\n<p>The term <em>verbal communication</em> refers to communication involving words, and the term <em>body language</em> refers to communication involving visual cues involving parts of the body. But there are ways to communicate using <em>sounds</em> that are non-verbal, and as a linguist I would argue that signed languages, which are completely non-vocal and involve movement of the body, fall under the category of verbal communication.</p>\n\n<p>There is a whole dimension of language called <em>prosody</em> that is outside of the domain of the pronunciation of consonants and vowels. This term covers variations in pitch, loudness, and rhythm in speech, all aspects of speech that can be controlled by a person without opening her mouth or moving any articulators. It has been shown that babies become sensitive to the prosody of their mother's native language while in-utero and can distinguish it from the prosody of other languages as soon as they are born.</p>\n\n<p>We also control the pitch, loudness, pace, and timbre of our speech to indicate pragmatic things like our intentions, attitude, and expectations, and also to convey emotions and mood.</p>\n\n<p>Consider for a moment a patient in a hospital who has been in a horrible accident and is confined to a full-body cast with her jaw wired shut. How would she communicate with the hospital staff and with visitors? Not with body language, that's for sure! And not verbally. I would call it <em>vocal communication</em>. She could use <em>mm-HM</em> and <em>MM-mm</em> (with the appropriate pitch contours) for \"yes\" and \"no\", respectively. She could indicate pain or discomfort with higher, shriller sounds and pleasure or delight with longer falling sounds (think of the sounds we make when we are getting a great massage or eating something yummy). </p>\n\n<p>She could let people know she was questioning something or being emphatically sure about something by raising the pitch or making it fall, respectively, at the end of a given \"utterance\". If people had the right context in mind, she could even convey exact words and phrases by \"saying\" them with the appropriate stress and rhythm without opening her mouth. For example, if it were clear to her mother that she wanted her to get someone, it might be enough to utter \"mmm-m-m-MMM-mm\" for \"Doctor Mendoza\". If she were feeling extra creative, she could even hum songs with certain key lyrics or titles to get certain messages across. </p>\n\n<p>I would be hard-pressed to put any of the above examples into the category of body language, especially since they could be used over the phone! I think your study needs to take into account modes of communication that are both non-verbal and non-\"body\" and you need to decide whether or not such means of communication are permissible in your experiment. </p>\n\n<p>As a side note, whether or not the mouth is open should not be used as a criterion for anything. Many linguistic speech sounds are made with the mouth closed--in fact it's the alternating open-closed state of the vocal tract that gives us consonants and vowels. And there are languages that allow whole words to be uttered with the lips together. For example, in Cantonese the word for \"not\" is pronounced [m]. </p>\n", "Id":"2030", "ParentId":"2026", "LastEditorUserId":"111", "CreationDate":"2012-05-31T13:21:31.710", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-06-01T22:53:22.173", "LastEditedUser":{"UpVotes":"308", "DownVotes":"10", "Id":"111", "AccountId":"514008", "Views":"172", "Reputation":"5430", "CreationDate":"2011-09-14T09:33:29.710", "DisplayName":"Alenanno", "LastAccessDate":"2014-01-19T00:38:35.883", "AboutMe":"<p>I'm a student majoring in Languages (branch: Linguistics), currently working as a freelance translator. I've recently discovered <a href=\"http://db.tt/WpiKeReH\" rel=\"nofollow\">Dropbox</a> and I'm going to use it for my needs! :)</p>\n\n<p><em><strong>I love</em></strong><br>\nLanguages, Movies (Fantasy, Sci-Fi, Tarantino, etc.), Music, 3D Graphics, books and so on. </p>\n\n<p>Appointed ♦ Moderator Pro Tempore on <a href=\"http://area51.stackexchange.com/proposals/6673/linguistics?referrer=GlDGLdkDYNxMg1X13CJ1vg2\">Linguistics SE</a>, <a href=\"http://area51.stackexchange.com/proposals/6388/chinese-language-usage?referrer=XzTG1Nz01tc01sJEhak_6g2\">Chinese SE</a> and the <a href=\"http://area51.stackexchange.com/proposals/10848/russian-language-usage?referrer=J7IYS3ZUomUDvVVb-6SmDQ2\">Russian SE</a> site. If you're interested in other Stack Exchanges, try the <a href=\"http://area51.stackexchange.com/proposals/42949/italian-language-usage?referrer=ALVtGpK0tjLp1Lw15QCaUA2\">Italian SE</a> site.</p>\n\n<p>I like to lurk on other sites' Metas. <em>Meta is fun!</em> </p>\n\n<p><strong>My feature requests</strong>:</p>\n\n<ol>\n<li><a href=\"http://meta.stackoverflow.com/q/135786/176533\">Alert a moderator when an answer is improved after a post notice</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/138273/176533\">Automatically add chat event to the community bulletin (or make it easier)</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/121363/176533\">Give 10k users the ability to see the total count of flags they've handled</a></li>\n</ol>\n\n<p><strong>Moderator issues</strong>: If you have concerns or want to contact me about my moderation, you can find/ping me either in the <a href=\"http://chat.stackexchange.com/rooms/1336/linguistics\">Linguistics SE chat room</a> or <a href=\"http://chat.stackexchange.com/rooms/1984/chinese-language-and-usage\">CL&amp;U chat room</a>; if I'm not there or I'm \"idle\", just ping me! Please <em>avoid</em> using my personal email for such things. Use the chat rooms.</p>\n\n<hr>\n\n<p><strong>Languages List</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <sup>Languages with  * = learning on my own</sup></p>\n\n<p><strong>Mother Tongue:</strong> Italian, Sardinian;<br>\n<strong>Fluent:</strong> English, Spanish;<br>\n<strong>Less Fluent:</strong> French, German, Russian;<br>\n<strong>Learning:</strong> Japanese*, Chinese*, Swedish*, Greek*, Finnish*;<br>\n<strong>Willing to learn:</strong> Welsh, Korean, Dutch, Arabic, Hebrew, Hindi [to be continued]</p>\n\n<p>Me gusta el Español.<br>\nJ'aime le Français.<br>\nDeutsch gefällt mir.<br>\nМне нравится Русский язык.<br>\n私は日本語が好きです。<br>\n我爱中文。<br>\nJag älskar Svenska.</p>\n"}, "LastActivityDate":"2012-06-01T22:53:22.173", "Score":"7", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}