{"Body":"<p>First, I feel you're artificially limiting yourself to greetings when you could ask a similar question of all words.</p>\n\n<p>Second, there's a fundemental flaw in your question in that you assume the origin of a word has a large effect on its meaning. As counter-intuitive as it may seem, etymology isn't particularly useful in most linguistic studies. Does knowing that \"Thursday\" has its root in the Norse god <a href=\"http://en.wikipedia.org/wiki/Thursday\" rel=\"nofollow\">\"Thor\"</a> truly effect your understanding of what \"Thursday\" means?</p>\n\n<p>Furthermore, small, incremental changes gathered over long periods of time can yield words with meanings completely dettached from their original source. The word \"hysterical\" meaning \"very funny\" can trace its origin back through \"excessively emotional\" all the way back to the Greek word for <a href=\"http://www.etymonline.com/index.php?term=hysterical&amp;allowed_in_frame=0\" rel=\"nofollow\">\"womb\"</a>. Obviously the modern meaning of \"hysterical\" has little to do with wombs!</p>\n\n<p>Another mistake you're making is that you assume these greetings are context-free. In fact, their usage is strictly bound by a rich context! No native English speaker would ever randomly say \"bye bye\" except in the context of a parting phrase (specifically, a parting phrase offered to someone who the speaker is highly familiar with or by/to someone who is very young). Humans don't learn language the same way they learn math. Humans learn language passively through observation, mimicry, deduction, intuition, and trial and error with very little directed input or overt effort (at least as children). Basically, to children the <strong>what</strong> doesn't matter nearly as much as the <strong>when and how</strong>.</p>\n\n<p>As for why some languages use a phrase and some languages use a word, if you spend any time trying to learn a second language you will quickly discover words in that language that take an entire sentence to explain in English and vice versa. In fact, this is why loanwords exist; words and phrases adopted from other languages because they express an idea more efficiently than pure native vocabulary alone ever could. The reasons for this can be historical or cultural or it could just be down to plain chance.</p>\n\n<p>Even in languages where their greetings are explicitly phrases, my experience is that they become almost a reflex and few speakers stop to consider the literal meaning. For example, I am currently learning Korean and the standard Korean greeting, some variation of \"안녕하세요!\" (<em>annyeonghasaeyo</em>, literally <a href=\"http://en.wiktionary.org/wiki/%EC%95%88%EB%85%95\" rel=\"nofollow\">\"be peaceful\"</a> or \"peace be with you\"), is so dettached from it's literal meaning that if one tried to use the word \"안녕\" (<em>annyeong</em>) to remark that something is peaceful or tranquil they would be met with slight confusion.</p>\n", "Id":"2031", "ParentId":"2029", "LastEditorUserId":"1055", "CreationDate":"2012-05-31T16:15:58.923", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-06-01T01:13:04.507", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2012-06-01T01:13:04.507", "Score":"7", "CommentCount":"5", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}