{"comments":[], "Body":"<p>If you want limited and descriptive then look fora  narrative corpus. Your best bet would be to look for something like \"Frog Story\" - which is the wordless picture book \"Frog Where Are You\" by Mercer Mayer a fairly standard text in linguistic elicitation. This way you also have controlled elicitation because you know exactly the scope of the visual information available for each event description. </p>\n\n<p>I'm assuming you want English, but this task has been done in many many languages over the years.</p>\n\n<p>Here's a text file of a child and adult corpus from Tania Renner and Virginia Marchman at U Cal:\n<a href=\"http://www.docstoc.com/docs/53044454/ENGLISH-FROG-STORY-DATA\" rel=\"nofollow\">http://www.docstoc.com/docs/53044454/ENGLISH-FROG-STORY-DATA</a></p>\n\n<p>OLAC shows one from Lowry Hemphill:\n<a href=\"http://www.language-archives.org/item/oai:childes.psy.cmu.edu:Frogs-English-WolfHemp\" rel=\"nofollow\">http://www.language-archives.org/item/oai:childes.psy.cmu.edu:Frogs-English-WolfHemp</a></p>\n\n<p>The CHILDES project - a major child language corpus - also has a collection of frog stories (this opens as a PDF) <a href=\"http://childes.psy.cmu.edu/manuals/frog.pdf\" rel=\"nofollow\">http://childes.psy.cmu.edu/manuals/frog.pdf</a></p>\n\n<p>Yuji Kawaguchi et al.'s \"Corpus-based perspectives in linguistics\" has an article and corpus on Frog Stories.</p>\n\n<p>Of course, a bit more googling and investigating might turn up more - you'll find plenty of researchers have used Frog Story and even if their corpus isn't publicly available you could contact them to see if they'll share it!</p>\n", "Id":"204", "ParentId":"178", "CreationDate":"2011-09-16T01:21:46.583", "Score":"3", "PostTypeId":"2", "OwnerUserId":"64", "LastActivityDate":"2011-09-16T01:21:46.583", "OwnerUser":{"UpVotes":"126", "WebsiteUrl":"http://www.superlinguo.com", "Id":"64", "AccountId":"900445", "CreationDate":"2011-09-13T21:45:12.903", "AboutMe":"<p>I have a PhD in linguistics. My areas of interest include language documentation, Tibeto-Burman linguistics, gesture, language play, LOLspeak, evidentiality and making bad puns. I blog about language and linguistics at www.superlinguo.com</p>\n", "Age":"29", "Location":"Australia", "DownVotes":"6", "Views":"40", "Reputation":"2016", "DisplayName":"LaurenG", "LastAccessDate":"2013-10-26T00:28:12.653"}}