{"Body":"<p>I think it's interesting enough to try to lay out a method that one might use to try to answer this question, and I think the question is more interesting as one about words written in a basic / lossy IPA (such as how we tended to use <a href=\"http://www.kirshenbaum.net/IPA/\" rel=\"nofollow\">Kirshenbaum</a> on Usenet) rather than the languages' respective orthographies.</p>\n\n<p>If I had the relevant tools available, I'd try this:</p>\n\n<ul>\n<li><p>Two-sound CV combinations should probably win out.</p></li>\n<li><p>Look for two-sound Austronesian words. There are over 800 Austronesian languages, and many Malayo-Polynesian of them can be quite close.</p></li>\n<li><p>There are 250-500 Bantu languages, and they can be quite close as well, so if bare prefixes are allowed (and also even if they aren't), jlovegren's suggestion of /ki/ should be taken quite seriously, especially since both the consonant and the vowel are extremely prevalent worldwide.</p></li>\n<li><p>It's important to note that along with importation of the Roman alphabet we get at least 20-30 loanwords for names of letters into each language. This applies to the hundreds, possibly thousands of languages that \"use\" the Roman alphabet to some capacity.</p></li>\n<li><p>Languages using scripts in the Brahmic tradition tend to name consonants with a trailing schwa. /kə/, for example. Whether this vowel is involved in many words in other languages seems to rely heavily on how we're transcribing.</p></li>\n</ul>\n\n<p>My guess (heavily influenced by how Malayo-Polynesian languages tend to pronounce the alphabet) is we would end up getting /ka/, /ke/, /ki/, /nu/, /pe/, /pi/, /te/, or /ti/.</p>\n\n<p>Another question: For each length n, what is the most popular n-letter (in IPA) word? For n at least 4, I have no idea what one could do short of crawling a massive database.</p>\n\n<p>Edit: Just noticed that we're supposed to exclude universal loanwords, so I'll rework my answer soon or take it down.</p>\n", "Id":"2040", "ParentId":"1931", "LastEditorUserId":"84", "CreationDate":"2012-06-04T03:10:06.740", "OwnerUserId":"84", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-06-04T08:04:56.497", "LastEditedUser":{"UpVotes":"167", "WebsiteUrl":"http://web.mit.edu/~dbriggs/www", "Id":"84", "AccountId":"511555", "CreationDate":"2011-09-14T00:18:36.197", "AboutMe":"<p>At UMass Amherst in the Ph.D. program in math.<br>\n</p>\n\n<p>\nCurrently taking:<br>\nAnalysis (Measure theory & integration)<br>\nGeometry (Theory of manifolds)<br>\nModular Forms</p>\n", "Age":"29", "Location":"Cambridge, MA", "DownVotes":"0", "Views":"23", "Reputation":"1163", "DisplayName":"Daniel Briggs", "LastAccessDate":"2013-08-10T16:57:15.060"}, "LastActivityDate":"2012-06-04T08:04:56.497", "Score":"1", "OwnerUser":{"UpVotes":"167", "WebsiteUrl":"http://web.mit.edu/~dbriggs/www", "Id":"84", "AccountId":"511555", "CreationDate":"2011-09-14T00:18:36.197", "AboutMe":"<p>At UMass Amherst in the Ph.D. program in math.<br>\n</p>\n\n<p>\nCurrently taking:<br>\nAnalysis (Measure theory & integration)<br>\nGeometry (Theory of manifolds)<br>\nModular Forms</p>\n", "Age":"29", "Location":"Cambridge, MA", "DownVotes":"0", "Views":"23", "Reputation":"1163", "DisplayName":"Daniel Briggs", "LastAccessDate":"2013-08-10T16:57:15.060"}}