{"Body":"<p>Let's get one thing out of the way first - no language is hard to learn for a child.  What you're addressing is second language (L2) acquisition.  Adults tend to have greater problems reaching full proficiency in a second language in general.  </p>\n\n<p>Because L2 acquisition is such a complicated task, no matter what language you're learning, the political dominance of certain languages is more likely to be simply a result of political factors.  You can blame colonialism, not grammatical complexity, for the decline in use of North American indigenous languages.</p>\n\n<p>The question of \"which language is hardest to learn\" is more complicated than simply determining which world language is the most grammatically complex because you have to look at each language pair individually (i.e. how Russian speakers learn English, how they learn French, how English speakers learn Russian, etc...).  It turns out that no language is easy to learn for any adult speaker but that adults have certain tendencies in acquisition that can help predict what learning pathway a speaker of one language might take to acquire another language.</p>\n\n<p>Here are 4 tendencies that have been observed in L2 acquisition (there are probably more):</p>\n\n<ol>\n<li>Transfer - using structures from the first language (L1) in the second,</li>\n<li>Universal tendencies - problems with structures that can be considered complex in the face of cross-linguistic variability,</li>\n<li>Morphology is more difficult to acquire than syntax,</li>\n<li>Grammatical structures that involve interfaces between different components of the grammar are more difficult to acquire.</li>\n</ol>\n\n<p>So, you can make generalizations based on these 4 observations.  For example, English has a relatively simple morphological system, which makes this part of the grammar easier to learn in general for adults.  It's interesting, though, because it's been seen that adult learners of English usually have long-lasting problems realizing even that tiny bit of inflection found in English (plural and third-person -s), even if their L1 is Turkish, that involves a great deal of morphological inflection.</p>\n", "Id":"2042", "ParentId":"2041", "LastEditorUserId":"935", "CreationDate":"2012-06-04T14:54:41.740", "OwnerUserId":"1070", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-05-09T06:57:15.363", "LastEditedUser":{"UpVotes":"8", "WebsiteUrl":"http://verbally.flimzy.com", "Id":"935", "AccountId":"7879", "CreationDate":"2012-04-16T17:30:22.570", "AboutMe":"<p>I'm a full-time software developer, working from home for a company in Atlanta, GA.  I from Wichita, KS but have been living in Guadalajara, Mexico for the last year, and will stay here until sometime early 2012.</p>\n", "Age":"35", "Location":"Guadalajara, Mexico", "DownVotes":"2", "Views":"1", "Reputation":"165", "DisplayName":"Flimzy", "LastAccessDate":"2013-08-29T05:24:34.433"}, "LastActivityDate":"2013-05-09T06:57:15.363", "Score":"5", "CommentCount":"2", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1070", "AccountId":"1540668", "Views":"0", "Reputation":"66", "CreationDate":"2012-06-04T14:54:41.740", "DisplayName":"Jeff K", "LastAccessDate":"2012-06-04T14:54:41.740"}}