{"comments":[], "Body":"<p>Learning any new language helps open your mind to the very different ways in which languages can work. This is always a good thing and will stay with you.</p>\n\n<p>If you are not motivated to learn a foreign language but are motivated to learn a \"constructed\" language like Esperanto, or a \"fictional\" language like Klingon, your mind will still be opened to some of the possible variation in language.</p>\n\n<p>Later on when you are motivated to learn a foreign language, the fact that you have already opened your mind by studying a made-up language will reduce some of the barriers. Because while you still lack experience in say French, you do have experience in producing sounds and forming and parsing morphosyntactical structures quite different from your native language.</p>\n\n<p>Think of it as \"what is the point of pure science?\" You never know when a practical application pure knowledge will be beneficial <em>at some point in the future</em>.</p>\n\n<p>I bet if I had learned Klingon as a kid that the strange and wonderful language features Georgian is throwing at me today would be at least a little bit easier to grok. After all Klingon was specifically devised, by a real linguist, to be very different at most levels to English and other common Western European languages.</p>\n", "Id":"2059", "ParentId":"2049", "CreationDate":"2012-06-06T13:30:13.547", "Score":"3", "PostTypeId":"2", "OwnerUserId":"51", "LastActivityDate":"2012-06-06T13:30:13.547", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}