{"Body":"<p>Apparently, many subjective and objective (<em>cas régime</em>) forms of words were still used in Middle French, at least into the late Middles Ages, if you go through the etymologies of French words. Here are some examples of words in modern French that are reflexes of the Latin nominative, from the <em><a href=\"http://www.cnrtl.fr/etymologie/fils\" rel=\"nofollow\">Centre National de Ressources Textuelles et Lexicales</a></em>:</p>\n\n<p>French <em>on</em>:</p>\n\n<blockquote>\n  <p>... Du lat. <strong>homo</strong>, cas <strong>suj</strong>. du subst. signifiant «homme», développé en position proclitique, et qui, à basse époque, est relevé dans qq. ex. comme suj. indéterm., emploi aboutissant à sa fonction de pron. indéf.: Peregr. Aether. 13, 1: <em>\"ubi homo desiderium suum compleri videt\"</em></p>\n</blockquote>\n\n<p>French <em>fils</em>, \"son\":</p>\n\n<blockquote>\n  <p>... Du lat. class. <strong>filius</strong> « fils, enfant »; « descendants » en b. lat. La forme actuelle représente l'anc. cas <strong>sujet</strong> conservé en raison de son emploi fréq. comme vocatif et prob. aussi pour éviter la confusion avec <em>fil.</em> </p>\n</blockquote>\n\n<p>A similar cross-pollination from the vocative occurred with French <em>soeur</em>, \"sister\" (the Old-French oblique case <em>seror</em> falling out of use):</p>\n\n<blockquote>\n  <p>Du lat. <strong>soror</strong> « sœur ». L'a. fr. avait les formes <em>suer,</em> cas suj., et <em>seror,</em> avec différentes var., cas régime issu de l'acc. <em>sororem</em>, très tôt <strong>le cas suj. devint le plus usuel</strong> à cause de son utilisation fréq. au vocatif.</p>\n</blockquote>\n\n<p>Another good candidate is <em>corps</em> (OFr. <em>cors</em>), but the nominative is not mentioned as such:</p>\n\n<blockquote>\n  <p>... Du lat. class. <strong>corpus</strong>, attesté aux sens de base A 1, 2, 3, B 1; sens C en lat. class., repris en fr. surtout au xvie s.; le sens D est également latin; ... </p>\n</blockquote>\n\n<p>There's also <em>croix</em> and <em>champs</em>, but those probably come from plurals, in which nominative and accusative are formally identical.</p>\n\n<p>Italian <em>uomo</em> (pl. <em>uomini</em>) appears to come from the nominative <em>homo</em> too. The <em><a href=\"http://www.etimo.it/?term=uomo\" rel=\"nofollow\">Vocabolario Etimologico della Lingua Italiana</a></em> by Pianigiani is not entirely clear; lacking further knowledge about the phonology of that time and a reliable source, we cannot be absolutely certain that the word wasn't shortened from <em>huomino</em>, or something like that. The same applies to Provençal <em>hom</em>.</p>\n\n<p><a href=\"http://etimologias.dechile.net/?luz\" rel=\"nofollow\">This Spanish etymological-dictionary website</a> says <em>hombre</em> comes from <em>hominem</em> but <em>luz, paz, voz, cruz</em> from <em>lux, pax, vox, crux</em>; however, I would not trust this dictionary: it sounds rather amateurish all over. I couldn't find any good, relatively modern etymological dictionary for Spanish.</p>\n\n<hr>\n\n<p><strong>Update:</strong> This quotation from <a href=\"http://fr.wikipedia.org/wiki/R%C3%A9gime_%28cas%29\" rel=\"nofollow\">Wikipedia</a> lists more examples for French:</p>\n\n<blockquote>\n  <p>La forme unique du français moderne dérive le plus souvent du cas régime. Il y a cependant un certain nombre d'exceptions où <strong>c'est le cas sujet qui a survécu</strong>, concernant <strong>les noms de personnes</strong> : ex. <em>prestre / provoire</em> (« prêtre »), <em>ancestre / ancessor</em> (« ancêtre »), <em>traïtre / traïtor</em> (« traître »), <em>suer / seror</em> (« sœur ») et de nombreux prénoms. Dans quelques cas, le cas sujet et le cas régime se sont tous deux maintenus dans la langue moderne, parfois avec des sens différents : c'est le cas pour <em>gars / garçon, copain / compagnon, sire / seigneur, pâtre / pasteur, nonne / nonnain</em> et <em>pute / putain.</em> <strong>[The first word of each pair is the Old-French nominatif.]</strong></p>\n</blockquote>\n\n<p>A few more French examples:</p>\n\n<p><em>Moindre</em>, and many other nominals on <em>-dre</em>:</p>\n\n<blockquote>\n  <p>Anc. <strong>cas suj.</strong>, issu du nomin. lat. <em>minor</em>, compar. de <em>parvus</em> «petit en taille, nombre, quantité, valeur, âge, rang, condition, importance», le cas régime étant <em>meneur</em> issu de l'acc. <em>minorem</em>, v. <em>mineur</em>. Dès la fin du xiies. <em>mendre</em> fut employé au cas régime sing., puis aux cas suj. et régime plur., évinçant <em>meneur</em>.</p>\n</blockquote>\n\n<p><em>Gindre</em>:</p>\n\n<blockquote>\n  <p>Anc. <strong>cas suj.</strong>, issu du lat. <em>junior</em> nomin., compar. de l'adj. <em>juvenis</em> « jeune ».</p>\n</blockquote>\n\n<p>Probably <em>queux</em>:</p>\n\n<blockquote>\n  <p><em>Étymol. et Hist.</em> Ca 1100 <em>cous</em> cas régime plur. (Roland, éd. J. Bédier, 1817); ca 1165 <em>keu</em> cas suj. plur. (Guillaume d'Angleterre, éd. M. Wilmotte, 1818); 1174-76 <em>coeu</em> cas régime sing.; <em>keus</em> <strong>cas suj. sing.</strong> (Guernes de Pont-Ste-Maxence, St Thomas, éd. E. Walberg, 1291; 1292); fin xiies. <em>princes queurs de la coisine</em> (Prophéties de David, 69 ds T.-L.); ca 1280 <em>Li maistre ques</em> (Merveilles de Rigomer, 7684, ibid.). Du lat. <em>coquus</em> « cuisinier », devenu <em>cocus</em>.</p>\n</blockquote>\n\n<p><em>Maire</em>, from a substantivised nominative adjective (and probably many pure nouns on <em>-air(e)</em> that come from Latin <em>-ator</em>):</p>\n\n<blockquote>\n  <p>A substantivation de l'anc. adj. <em>maire</em> «plus grand» ca 1165 (Benoît de Sainte-Maure, Troie, éd. L. Constans, 6031), issu du nominatif lat. <em>major</em>, comparatif de <em>magnus</em> «grand», v. <em>majeur</em>.</p>\n</blockquote>\n\n<hr>\n\n<p>If you Google for <code>site:cnrtl.fr/etymologie/ \"cas suj.\"|nominatif|nomin</code>, you will probably find a whole lot more (though most of those Google hits are not it).</p>\n", "Id":"207", "ParentId":"167", "LastEditorUserId":"82", "CreationDate":"2011-09-16T05:05:29.103", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-05-16T19:24:43.117", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-05-16T19:24:43.117", "Score":"15", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}