{"Body":"<p>At first, a general remark on terminology. There are many theories of how to analyze such constructions. Some linguists even refuse to treat them as \"phrasal verbs\", e.g. the authors of the Cambridge Grammar of the English Language.</p>\n\n<blockquote>\n  <p>Secondly, I do not endorse any particular analysis here, nor do I wish to criticize or contrast competing proposals. I simply tried to reconstruct someone else's proposal. I also tried to explain it using very simple words, without theory-specific terminology.</p>\n</blockquote>\n\n<p>I'm not entirely sure whose theory you're trying to describe (references would be extremely helpful). Here's what the authors of the Longman Grammar of Spoken and Written English say on this - since what you are trying to describe seems similar to their proposal.</p>\n\n<p>They mention three tests that help you distinguish between a phrasal verb, a prepositional verb, and a phrasal prepositional verb:</p>\n\n<ul>\n<li>idiomatic meaning</li>\n<li>particle movement</li>\n<li>wh-questions</li>\n</ul>\n\n<p>A phrasal verb under this analysis is a combination of a verb and a particle (not participle!) that has some idiomatic interpretation (get along). You can't really figure out the meaning of \"get along\" by adding \"get\" and \"along\".</p>\n\n<p>Now about prepositional vs. adverbial particles. Under this proposal, if you can insert some material between a verb and a particle, that particle is adverbial (look up a word - look it up; pick up the phone - pick the phone up). On the other hand, a verb and a preposition are inseparable (look at the book - look at it - *look the book at).</p>\n", "Id":"2072", "ParentId":"2071", "LastEditorUserId":"385", "CreationDate":"2012-06-07T17:19:16.220", "OwnerUserId":"445", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-06-07T20:10:57.737", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2012-06-07T20:10:57.737", "Score":"5", "CommentCount":"1", "OwnerUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}}