{"comments":[], "Body":"<p>This is largely a matter of standardisation. For example, English had highly varied spellings up until the 18th century as people spelled words however they wished and this was not seen as a bad thing. Printers commonly added letters to words (or removed them) to make full justification easier. Letters were added to make words more like their (presumed) French/Latin/Greek/whatever source. Also, in the early British Empire there was no standard spelling for many of the tremendous number of words borrowed into English. Much of this was made possible by the fact that spoken English had changed quite substantially, meaning that the writing system did not match it at all well, so there many choices in spelling. Even with languages with a highly phonemic orthography there will be variation in how people spell. With small language communities it is likely that standards will emerge naturally from the small number of writers. But with a large and widespread body of speakers, likely with differing dialects, it is much more likely for there to be great variation in writing, reflecting the dialectal differences.</p>\n\n<p>Once language planning is undertaken and standardised spellings are imposed, and with the development of a concern for 'correct' ways of spelling, variation in writing becomes much less, while variation in the language may still be large. Of coure, as the language drifts away from the orthography there will be a new source of variation in spelling, due to the difficulty of always spelling correctly. But as writing/spelling is a constructed system (as opposed to speaking, which is a natural system) it can be taught and imposed, which will reduce variation.</p>\n", "Id":"2080", "ParentId":"2077", "CreationDate":"2012-06-10T07:59:31.547", "Score":"2", "PostTypeId":"2", "OwnerUserId":"363", "LastActivityDate":"2012-06-10T07:59:31.547", "OwnerUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}}