{"OwnerUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}, "comments":[], "Body":"<p>The Greek graphemes Ψ ('psi', [ps]) and Ξ ('xi', [ks]) represent consonant clusters in some varieties of the Greek alphabet. These clusters are represented by the same graphemes even when they are spilt by a morpheme boundary. Some sources describe these clusters as phonemes but this is not correct, they are combinations of two phonemes in all varieties of Greek.</p>\n\n<p>It is not certain why the Greeks used single graphemes for these two clusters but it may be related to the fact that they are <a href=\"http://www.haskins.yale.edu/sr/SR101/SR101_03.pdf\" rel=\"nofollow\">the only clusters that occur in coda</a>) (ie. final) position in syllables. Earlier forms of the Attic alphabet lacked these graphemes and used ΦΣ and ΧΣ, respectively. While the majority of the Greek alphabet is believed to have been derived from either the Canaanite and/or Phoenician writing system, the graphemes Ψ and Ξ are have no obvious prototype in these traditions and may possibly have been derived from the South Arabian script.</p>\n\n<p>While the alphabetic tradition normally has the target of representing individual phonemes, this may not be possible when borrowing an alphabet for use with a different language. Other considerations such as prosodic phenomena, syllable structure, morphophonemics, may make single graphemes for multiple phonemes a better solution than a straight mapping of segmental phonemes. And of course there are many languages which have single graphmes for phonemes, such as affricates and double articulations, that combine phones found in other languages as distinct phonemes.</p>\n", "Id":"2083", "ParentId":"2076", "CreationDate":"2012-06-11T02:43:19.837", "Score":"4", "PostTypeId":"2", "OwnerUserId":"363", "LastActivityDate":"2012-06-11T02:43:19.837", "CommentCount":"2"}