{"Body":"<p>I don't think the nature of the written notation for the language really had much effect. Computation is basically just math and the Chinese had a <a href=\"http://en.wikipedia.org/wiki/The_Nine_Chapters_on_the_Mathematical_Art\">firm grasp on mathematics from the earliest times</a>.  Computational devices were developed based on mechanics - gears, punch cards, etc. - long before they were based on silicon. <a href=\"http://en.wikipedia.org/wiki/Difference_engine\">Babbage's device didn't use any human language</a> - it ran on punch cards, gears, and steam; Lovelace's algorithm was, well, algorithmic in nature and not based on characters, <a href=\"http://www.fourmilab.ch/babbage/sketch.html#NoteG\">as is plain on reviewing it</a>.</p>\n\n<p>I'd note the Chinese invention of the <a href=\"http://en.wikipedia.org/wiki/Suanpan\"><em>suànpán</em>, more commonly known as the abacus</a>, and the earlier <a href=\"http://en.wikipedia.org/wiki/Counting_rods\"><em>chóu</em> counting rods</a>. The Ancient Chinese also independently invented the <a href=\"http://en.wikipedia.org/wiki/South_Pointing_Chariot\">differential gear</a>, an early analog computing device. In none of these case did the Chinese language prove a hindrance to developing mechanical calculation devices. </p>\n\n<p>Electronic digital computers, the kind we usually think of nowadays, have been part of Chinese technology <a href=\"http://itri2.org/ttec/aemu/report/c3.pdf\">since the late 1950s [PDF]</a>. The authors note \"By June 1985, the task force had successfully developed a personal computer, Great Wall 0520CH, which was the first PC using Chinese character generation and display technology, capable of processing information in Chinese.\"</p>\n\n<p>I don't think there's much evidence for the proposition your interlocuter made. It's mistaking the modern keyboard and ASCII input and text monitors - the <em>accoutrements</em> of computers - for what a computer really <em>is</em>. </p>\n\n<p>The Chinese have always been perfectly aware of alphabets and do make use of the Roman alphabet in their computing. The popular use of keyboards during the past couple decades is not fundamental to computing. Consider touch screens. Touch screens are noted for their difficulty in entering Roman letters, but they are almost perfect for entering Chinese characters.</p>\n\n<hr>\n\n<p>Here is another look at <a href=\"http://www.fourmilab.ch/babbage/figures/menat6_1-5k.png\">Lovelace's algorithm</a>. Note its remarkable similarity to <a href=\"http://upload.wikimedia.org/wikipedia/commons/e/ea/Yanghui_triangle.gif\">this Chinese version of Pascal's triangle</a>. </p>\n", "Id":"2092", "ParentId":"2090", "LastEditorUserId":"537", "CreationDate":"2012-06-12T15:35:25.517", "OwnerUserId":"537", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-06-12T16:07:41.000", "LastEditedUser":{"UpVotes":"556", "WebsiteUrl":"http://www.markbeadles.com/", "Id":"537", "AccountId":"297827", "CreationDate":"2011-11-27T02:50:39.717", "AboutMe":"<p>Polymathic renaissance redneck</p>\n", "Age":"47", "Location":"Columbus, OH", "DownVotes":"22", "Views":"30", "Reputation":"3876", "DisplayName":"Mark Beadles", "LastAccessDate":"2013-02-02T04:23:30.703"}, "LastActivityDate":"2012-06-12T16:07:41.000", "Score":"12", "CommentCount":"10", "OwnerUser":{"UpVotes":"556", "WebsiteUrl":"http://www.markbeadles.com/", "Id":"537", "AccountId":"297827", "CreationDate":"2011-11-27T02:50:39.717", "AboutMe":"<p>Polymathic renaissance redneck</p>\n", "Age":"47", "Location":"Columbus, OH", "DownVotes":"22", "Views":"30", "Reputation":"3876", "DisplayName":"Mark Beadles", "LastAccessDate":"2013-02-02T04:23:30.703"}}