{"Body":"<p>I've had the experience of living with a family with two small children (ages 2 and 3).</p>\n\n<p>The father would only spoke German to them, and the mother would only spoke Portuguese.\nThe kids could clearly understand both of them, even though they didn't speak much.\nThe father told me that the important thing about this is that he would spoke only German to them, and not sometimes German and sometimes Portuguese, for this would get them confused (he wanted them to learn both languages).</p>\n\n<p>I guess the kids could sense that each person had a proper communication system (one for the father and one for the mother). I think this means they distinguished the languages, for understanding what was said to them required that they knew the values of the signs used in the system.</p>\n\n<p>It seems that if one person uses several languages to talk to a child, this would make it harder for the kid to distinguish them.</p>\n", "Id":"2120", "ParentId":"820", "LastEditorUserId":"22", "CreationDate":"2012-06-16T23:20:54.783", "OwnerUserId":"1107", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-06-17T00:30:33.017", "LastEditedUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "LastActivityDate":"2012-06-17T00:30:33.017", "Score":"2", "CommentCount":"1", "OwnerUser":{"UpVotes":"13", "Location":"Brazil", "DownVotes":"1", "Id":"1107", "AccountId":"1574222", "Views":"9", "Reputation":"217", "CreationDate":"2012-06-16T22:34:44.127", "DisplayName":"Tames", "LastAccessDate":"2012-08-10T17:08:25.337", "AboutMe":"<p>Visual arts graduate\nPsychology student\nMain interests: psychoanalysis (Freud and Lacan), linguistics, logic, literature...</p>\n\n<p>I guess we are all here to learn. Learning how to ask, learning how to answer, learning how to deal with people, learning how to make a decision... learning to have some patience, sometimes. Possibly the greatest of all is learning how to make the best out of a problem. Keep that in mind!</p>\n", "Age":"31"}}