{"Body":"<p>Every language is permeated by the cultural values in which it is immersed. Language may be determinant of what is and what is not acceptable in a situation. Just think about all the social constraints on politeness. These values define who is in and who is out of the group. How does one speak when giving a lecture? How does one speak when talking to his/her mom? The use of language will be determinant of professional and emotional acceptance. If you talk to your girlfriend like an academic lecturer she may be offended (or turned on by it, who knows).</p>\n\n<p>One thing that comes to my mind now is Benveniste's comment on \"shifters\", like \"me\", \"you\", words that depend on the context for the determination of meaning. If you say \"me\", it is one person. If I say \"me\" it is another. Benveniste says that these \"shifter\" words are important and exist not only because it is a kind of \"shortcut\" for a name, but because of the socializating factor: as you say \"me\" in a dialogue, and the other person uses this word as well, it is a way of one person seeing the other as a fellow (it is like 'walking on your shoes').</p>\n\n<p>An example of an specific language with some purpose, Esperanto, comes to my mind, as a language pretending to be universal and non-discriminating (almost a paradoxical statement). There's the experimental language E-Prime, which pretends to say things whitout using the verb \"to be\", as this would lack objectivity; E-Prime would be a statement on \"language should be information\", interestingly.</p>\n\n<p>If your focus on use of language to avoid communication, this happens whenever people don't share a language. Those who share it will be communicating, and who doesn't dominate the code will be left out of the group. (adolescents using slangs keep their parents out of it, for example)</p>\n", "Id":"2145", "ParentId":"2144", "LastEditorUserId":"22", "CreationDate":"2012-06-19T15:42:47.863", "OwnerUserId":"1107", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-06-19T16:31:00.160", "LastEditedUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "LastActivityDate":"2012-06-19T16:31:00.160", "Score":"3", "CommentCount":"7", "OwnerUser":{"UpVotes":"13", "Location":"Brazil", "DownVotes":"1", "Id":"1107", "AccountId":"1574222", "Views":"9", "Reputation":"217", "CreationDate":"2012-06-16T22:34:44.127", "DisplayName":"Tames", "LastAccessDate":"2012-08-10T17:08:25.337", "AboutMe":"<p>Visual arts graduate\nPsychology student\nMain interests: psychoanalysis (Freud and Lacan), linguistics, logic, literature...</p>\n\n<p>I guess we are all here to learn. Learning how to ask, learning how to answer, learning how to deal with people, learning how to make a decision... learning to have some patience, sometimes. Possibly the greatest of all is learning how to make the best out of a problem. Keep that in mind!</p>\n", "Age":"31"}}