{"OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "comments":[], "Body":"<p>I recently took a phonology course where Mora Theory was breifly mentioned but we didn't go too indepth so your question piqued my interest. I did some light googling and I found <a href=\"http://www.ling.fju.edu.tw/phono/farrah/Moraic%20Phonology.htm\" rel=\"nofollow\">this set of lecture notes</a> which I think does a pretty good job explaining it:</p>\n\n<blockquote>\n  <p>Ladefoged (1982: 226 in Vance 1987) states that \"A mora is a unit of timing. Each mora takes about the same length of time to say\" (p.62)</p>\n</blockquote>\n\n<p>So, if  I am understanding the issue correctly, onsets are not assigned a mora because they do not significantly add to the pronunciation time. That is, the time required to pronounce \"ah\" and \"bah\" are not significantly different. That amount of time is defined as one mora.</p>\n\n<p>I'm sitting at my computer trying various onset/vowel combinations to see if this is true and anecdotally it seems to check out. (Incidently, it would be a good idea to make sure no one else is home before trying this yourself)</p>\n\n<p>Now, some things take extra time to pronounce. Long vowels are longer than short vowels. Codas (post-vowel consonants) take more time to pronounce. Thus, such syllables are 2 moras because the syllable can be divided into two basic units, each taking time to pronounce:</p>\n\n<ol>\n<li>the onset/vowel</li>\n<li>the vowel continuation or the coda</li>\n</ol>\n\n<p>I hope this helps clear up your issue.</p>\n", "Id":"2151", "ParentId":"2148", "CreationDate":"2012-06-20T13:00:59.207", "Score":"3", "PostTypeId":"2", "OwnerUserId":"1055", "LastActivityDate":"2012-06-20T13:00:59.207", "CommentCount":"2"}