{"comments":[], "Body":"<p>Most languages have some kind of word-accentual system, where one position in each word is more prominent than other positions in the same word. The prominent position(s) may have some or all of these properties: higher pitch, longer duration, greater number of contrasts, louder or more forceful pronunciation. When the final property applies, the language is usually said to have stress accent. In these cases the most prominent position is said to have primary stress, and other positions may have secondary stress if they are more prominent than the least prominent syllable, but less prominent than the most prominent syllable.</p>\n\n<p>When studying the word-accent system of a language, you would like to be able to predict which syllable has primary stress, and which if any have secondary stress, and this often involves counting some number of syllables from the edge of a word.\nIn Polish, for example, you count from the end of the word and then stress (in most words) falls on the penultimate syllable. But there are some languages where the counting is complicated by the fact that some syllables (especially syllables with a long vowel or a coda) seem to \"count as two\" for the purpose of assigning primary and secondary accent. So that your analysis can still be simple and easy to follow, you just invent a new type of timing unit, the mora, and say that a double-counting syllable is made up of two morae, and a single-counting syllable is made up of one mora. </p>\n", "Id":"2153", "ParentId":"2148", "CreationDate":"2012-06-20T13:36:35.593", "Score":"4", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2012-06-20T13:36:35.593", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}