{"comments":[], "Body":"<p>This depends on the meaning of \"<em>can be said to rhyme</em>\". Judgments about the acceptability of rhyming really only make sense in a particular artistic context. I'm using classical Chinese poetry and modern Mandarin pop songs as examples.</p>\n\n<h2>Classical Chinese Poetry</h2>\n\n<p>The rules about rhyming in classical Chinese poetry are <strong>complicated</strong>. Syllables which rhymed in Middle-Chinese often don't in Mandarin (and vice versa); in order to even assess whether a poem rhymes properly, you need to look up all the characters' Middle-Chinese tones and so forth. Also, since this style of poetry was being written well after the vernacular pronunciation had changed substantially, the <strong>writers</strong> had to look this stuff up in order to write poems that rhymed.</p>\n\n<blockquote>\n  <p>[Of the 13-yuán rime] As a so-called 险韵 “treacherous rime,” it was often assigned as the required rhyme on official poetry examinations, so that nervous candidates would mistakenly include words in an<sub>3b</sub> in the rhyme scheme. Or they might include words in an<sub>3a</sub> in a poem whose rhyme scheme was limited to an<sub>3b</sub> and an<sub>4</sub>. In either case, they would be considered to have 出韵 “left the rhyme-scheme”.\n  <strong>...</strong> In late Manchu times, 王闓運 (1833-1916) wrote a poem teasing his colleague 高心夔 (1835-1883), who twice received low scores on the official exams when the appearance of 13-yuán caused him to “leave the rhyme-scheme.” Wáng wrote:</p>\n  \n  <p>平生兩四等，該死十三元！</p>\n  \n  <p>[Two fourth-place finishes in one lifetime — to hell with 13-yuán!]</p>\n</blockquote>\n\n<p>For a more complete exposition of this, read page 29 to 53 of <a href=\"https://brannerchinese.com/dpb/publications/Branner_MedievalSpelling.pdf\">this</a>.</p>\n\n<h2>Mandarin Pop Songs</h2>\n\n<p>Pop songs rhyme. Mostly. Except when they don't. It's pretty much the same as in English pop songs. I did manage to <a href=\"http://www.chinasmack.com/2012/more/chinese-pop-songs/old-boy-by-chopsticks-brothers.html\">find</a> a couple of approximate rhymes:</p>\n\n<blockquote>\n  <p>转眼过去多年世间多少离合悲欢</p>\n  \n  <p>zhuan3 yan3 guo4 qu4 duo1 nian2 shi4 jian1 duo1 shao3 li2 he2 bei1 huan1</p>\n  \n  <p>曾经志在四方少年 羡慕南飞的雁</p>\n  \n  <p>ceng2 jing1 zhi4 zai4 si4 fang1 shao4 nian2  xian4 mu4 nan2 fei1 de yan4</p>\n  \n  <p>各自奔前程的身影 匆匆渐行渐远</p>\n  \n  <p>ge4 zi4 ben1 qian2 cheng2 de shen1 ying3  cong1 cong1 jian4 xing2 jian4 yuan3</p>\n  \n  <p>未来在哪里平凡 啊谁给我答案</p>\n  \n  <p>wei4 lai2 zai4 na3 li3 ping2 fan2  a shui2 gei3 wo3 da2 an4</p>\n</blockquote>\n\n<p>Note, that despite the pinyin, huan and yuan do not have the same vowel. Also, yan and an don't either.</p>\n", "Id":"2156", "ParentId":"2149", "CreationDate":"2012-06-21T03:37:12.907", "Score":"6", "PostTypeId":"2", "OwnerUserId":"1115", "LastActivityDate":"2012-06-21T03:37:12.907", "OwnerUser":{"UpVotes":"47", "WebsiteUrl":"http://peterthenelson.com", "Id":"1115", "AccountId":"1331637", "CreationDate":"2012-06-18T12:58:59.783", "AboutMe":"<p>I'm interested in:</p>\n\n<ul>\n<li>All things Chinese</li>\n<li>Historical linguistics and etymology</li>\n<li>Computationally sane models of grammar</li>\n<li>People who are not Noam Chomsky</li>\n</ul>\n", "Age":"26", "Location":"United States", "DownVotes":"1", "Views":"1", "Reputation":"251", "DisplayName":"Stumpy Joe Pete", "LastAccessDate":"2013-08-10T22:34:12.867"}}