{"Body":"<p>Rotokas has a small phonetic inventory, but otherwise, like most languages of small isolated communities, the language is mind bendingly complex with respect to morphology and syntax. Piraha may have a smaller phonetic inventory, but it is tonal, so for a non-tonal language speaker, it would still be considered fairly hard to learn.</p>\n\n<p>The simplest languages are the creoles. They typically do not use tone, are unlikely to have difficult phonemes (like clicks), are likely to be isolating (simple morphology) and have simple syntax. Derek Bickertons \"Bastard Tongues\" and McWhorter books on creoles are a good place to find more about how creoles in many senses are full languages, yet simpler than languages that were not born of a recent contact situation.</p>\n\n<p>Lingua francas are also simpler than average because large numbers of people using lingua francas must speak with people who use the language as second language and this tends to put an upper limit on how many unnecessary complexities the speech community tolerates. I got this factoid from \"Through the Language Glass\"</p>\n\n<p>Romanian and Chinese are both lingua francas (Romanian used to be latin, at which time it was a very typical lingua franca spoken over a huge area by people where it wasn't their first language-- now Romanian is slowly becoming less like a lingua franca), so if they appear simple, I would posit that it is because of the dymanics of lingua francas.</p>\n", "Id":"2171", "ParentId":"2169", "LastEditorUserId":"51", "CreationDate":"2012-06-23T19:58:11.697", "OwnerUserId":"20", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-06-24T20:42:08.093", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2012-06-24T20:42:08.093", "Score":"7", "CommentCount":"2", "OwnerUser":{"UpVotes":"72", "WebsiteUrl":"http://suburbandestiny.com/conlang", "Id":"20", "AccountId":"15651", "CreationDate":"2011-09-13T20:53:42.550", "AboutMe":"<p>I'm a programmer by day and an amateur linguist by night.</p>\n\n<p>I organize the Arlington Linguistics Book Club, where we read a wide variety of books that make the science of linguistic accessible to a popular audience.</p>\n", "Age":"41", "Location":"United States", "DownVotes":"6", "Views":"39", "Reputation":"1657", "DisplayName":"MatthewMartin", "LastAccessDate":"2014-01-08T19:46:09.130"}}