{"Body":"<p>Jakobson in a 1969 article theorized that the words for 'mum' and 'dad' across languages were indeed based on the first sounds an infant produced. Thus they would constitute an important exception to the rule that language is arbitrary.</p>\n\n<p>He also noted just like you that it applied clearly to <strong>[m]</strong> and 'mum', and less precisely to <strong>[d]</strong> , <strong>[p]</strong> or <strong>[t]</strong> (as in the english <em>dad</em>, the french <em>papa</em> or the polish <em>tata</em>).</p>\n\n<p>In a nutshell our 'mum' is so natural she's not arbitrary but our 'dad' is already culture-dependent ;-)</p>\n\n<p>Also in 1969 Benveniste tackled precisely the question of 'dad' in the chapter 'kinship' of his fantastic \"Vocabulary of Indo-European Institutions\". Benveniste focused primarily on the drift of the semantics of these words in relationship with each other, but his etymological knowledge was very famous. </p>\n\n<p>Step 1: He points out that although more formal forms like <em>father</em> are sound-related to forms like <em>dad</em> today, one isn't derived from the other in modern times, but rather that they evolved through the ages in parallel. He notes the Gothic <em>atta</em> was the norm to designate the father and that <em>fadar</em> was almost never used.</p>\n\n<p>Step 2: This form <em>atta</em> in turn comes almost certainly from an Indo-European root because almost identical forms are found in Latin and Greek. He also connects it with Slavic 'otic' via a hypothetic compound form *<em>otta</em> + *<em>ik</em> (i.e. 'father' + 'qualifier').</p>\n\n<p>This also tells you something about etymology methods: either you already have a trace of the change (as in step 1, where the Gothic form is attested in old corpora) or you try to reconstruct a hypothetical proto-form by comparing related languages and making certain assumptions as in step 2.</p>\n", "Id":"2172", "ParentId":"1870", "LastEditorUserId":"22", "CreationDate":"2012-06-23T23:03:07.327", "OwnerUserId":"1132", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-06-23T23:26:21.060", "LastEditedUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "LastActivityDate":"2012-06-23T23:26:21.060", "Score":"7", "CommentCount":"4", "OwnerUser":{"UpVotes":"2", "WebsiteUrl":"", "DownVotes":"0", "Id":"1132", "AccountId":"1593818", "Views":"0", "Reputation":"106", "CreationDate":"2012-06-23T13:31:34.460", "DisplayName":"rloth", "LastAccessDate":"2013-09-25T07:48:48.660", "AboutMe":"<p>I'm a french PhD candidate in linguistics and text mining. Also interested in math with pretty low level knowledge.</p>\n"}}