{"OwnerUser":{"UpVotes":"30", "WebsiteUrl":"http://www.seas.upenn.edu/~lignos", "DownVotes":"6", "Id":"106", "AccountId":"896149", "Views":"16", "Reputation":"381", "CreationDate":"2011-09-14T05:56:35.697", "DisplayName":"Constantine", "LastAccessDate":"2013-12-29T05:06:56.547", "AboutMe":"<p>I am a PhD student at the University of Pennsylvania. I work on language acquisition/processing and computational linguistics.</p>\n"}, "comments":[], "Body":"<p>The Deb Roy work prash brings up is certainly interesting, but it is just one child in one language. The standard for researchers that study language acquisition is to use the <a href=\"http://childes.psy.cmu.edu/\">CHILDES Database</a> (MacWhinney, 2000). CHILDES provides downloadable transcripts, video, and audio files mostly comprised of conversations between caretakers and children in many languages and at many ages.</p>\n\n<p>As for Motherese itself, the seminal paper on this is <a href=\"http://pages.pomona.edu/~rt004747/lgcs123read/NewportEA77.pdf\"><em>Mother, I'd Rather Do it Myself</em></a> (Newport, Gleitman, and Gleitman, 1977). While the topic has been revisted many times since, the general conclusions of that work still stand. It was the first paper to show that Motherese is \"tuned\" to the stage of acquisition of the child is in. That is, Motherese isn't a fixed style of speaking; we vary it with respect to how much the child we're talking to knows about language.</p>\n\n<p>Some characteristics of Motherese pointed out in that article:</p>\n\n<ol>\n<li>While utterances are short, they are not necessarily syntactically simple. There are arguments made that the amount of movement required in a derivation of those sentences on average exceeds that of adult-to-adult utterances, largely because of the high number of questions.</li>\n<li>Utterances are heavily focused on directing the actions of children when they are younger, and change to contain more declaratives as they get older.</li>\n<li>It would appear that Motherese is optimized for easy processing rather than syntactic complexity. That is, utterances are short and contain few morphemes, but often more complex short utterances are used as opposed to simpler, longer ones.</li>\n</ol>\n\n<p>Of course, the concept of \"simple\" is not straightforward; in the cited article it has to do in particular with the transformations common of syntactic theory of the time. Later papers questioned these ideas, but the consensus is that for whatever definition of \"simple\" you choose with respect to a grammar these general conclusions still hold.</p>\n\n<p>There are of course other phonological and phonetic characteristics of Motherese. The exaggerated prosody (the intonation of a sentence) and facial expressions are an important part of it as well. So if you want to find a broad set of discussions on Motherese and rules, etc., I would recommend following the trail of papers that cite the one I list above. You can use <a href=\"http://scholar.google.com/scholar?cites=5157312406828912975\">this Google Scholar link</a> to search among those articles.</p>\n", "Id":"218", "ParentId":"211", "CreationDate":"2011-09-16T12:52:58.733", "Score":"12", "PostTypeId":"2", "OwnerUserId":"106", "LastActivityDate":"2011-09-16T12:52:58.733", "CommentCount":"1"}