{"comments":[], "Body":"<p>Scholars used to believe that convergence and borrowing was more likely to happen between two languages that were typologically similar, but I believe this has now been disproved. (Clyne, M. (2003) Dynamics of Language Contact, Cambridge) </p>\n\n<p>For example, Michif is a mixed language which combines Cree (verbs) and French (nouns). The languages are typologically very different - what matters is that the social situation, i.e. the intensity of contact.</p>\n\n<p>Japanese has many loanwords from English - it has to alter the phonology of the words, sometimes quite drastically, to make them pronounceable. E.g. kappu (cup) and rimokon (remote control). But English is cool, so the typological difference doesn't matter. ;-)</p>\n\n<p>Borrowing of fairly basic things like morphology, pronouns, numbers, etc, can certainly happen. Again, it seems to be dependent on the social situation rather than any linguistic factors. For example, English pronouns 'they, them' are borrowed from Scandinavian languages. Speakers of Hindi and other Indian languages (in which the number system is quite complicated) often use English numbers, especially for strings such as phone numbers - it's probably relevant that English and Hindi have been in contact for a long time. Morphological borrowing is typical of languages in extremely close contact, especially where one is near extinction.</p>\n\n<p>I think perhaps the misconception that similar languages borrow more from each other is simply based on the fact that nearby languages are often (though by no means always) typologically similar. So the languages English is in most contact with are French, German, etc - all relatively easy to borrow from. But it's the closeness that makes the difference, not the typology.</p>\n", "Id":"2201", "ParentId":"2199", "CreationDate":"2012-07-03T07:18:49.637", "Score":"3", "PostTypeId":"2", "OwnerUserId":"1154", "LastActivityDate":"2012-07-03T07:18:49.637", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1154", "AccountId":"1621574", "Views":"0", "Reputation":"46", "CreationDate":"2012-07-03T07:18:49.650", "DisplayName":"Katherine", "LastAccessDate":"2012-07-04T07:30:40.533"}}