{"OwnerUser":{"UpVotes":"13", "WebsiteUrl":"http://stevenxu.ca", "Id":"9", "AccountId":"69900", "CreationDate":"2011-09-13T20:51:36.750", "AboutMe":"<p>Hi friends! I'm <a href=\"http://stevenxu.ca\" rel=\"nofollow\">Steven Xu</a>. I'm an enthusiastic San Francisco software engineer focused on the Web. </p>\n\n<p>In my spare time, I like to play and coach volleyball and dabble in linguistics, especially phonetics.</p>\n", "Age":"24", "Location":"Canada", "DownVotes":"0", "Views":"74", "Reputation":"1326", "DisplayName":"Steven Xu", "LastAccessDate":"2013-09-27T23:39:20.960"}, "comments":[], "Body":"<p>There is no \"primary\" difference. Some examples from across the spectrum:</p>\n\n<ul>\n<li>Stops: one of the main differences people consciously identify between British English registers is the nature of stop releases. Fully released stops, even in word final position is characteristic of more deliberate and higher register speech, whereas stop glottalization or lack of release is common in lower registers.</li>\n<li>Fricatives: one of the most salient markets of the Taiwanese dialect of Chinese is the merger of alveolar sibilants with their retroflex counterparts.</li>\n<li>Approximants: broadly speaking, a major and easily identifiable difference between the Scottish dialect of English and RP is that in Scottish English, there is much less /r/-dropping.</li>\n<li>Vowels: vowel examples are probably the most common, but I wouldn't go as far as to say that they are the \"primary\" difference due to all the above examples. Probably the easiest isolated example of vowels being a cue of dialect is Canadian diphthong raising.</li>\n</ul>\n\n<p>Moreover, each of the above can all contribute equally to non-native dialects:</p>\n\n<ul>\n<li>Stops: the inability of CV or CVN languages to adapt to CVC languages is a huge cue for non-nativeness; another prevalent example is when speakers of languages with obligatory word-final devoicing like German and Russian make homophonous word pairs like <em>bat</em> and <em>bad</em> (not exactly a stop contrast, since it's mostly vowel length, but it's complicated).</li>\n<li>Fricatives: since so many fricatives sound alike, fricatives are incredibly frequently pronounced differently for non-native speakers. Examples are substitution of /s/ for the cross-linguistically rare dental fricative found in English and the use of the velar /x/ in place of /h/ by speakers from languages without [h]. /h/ is also a common source of non-native accents. Since [h] is basically just loud breathing, it's non-distinctive in many languages. English speakers have a hard time adjusting to languages with contrastive word-final /h/, for instance, and French speakers have a hard time adjusting to languages with contrastive word-initial /h/.</li>\n<li>Approximants: conflation of /r/ and /l/ by Japanese and Korean speakers of English is all too well studied.</li>\n<li>Vowels: speakers will very often import vowel qualities from their native languages. For instance, English speakers learning any language with the pure high back rounded [u] will substitute the English centralized gliding equivalent.</li>\n</ul>\n\n<p>There are also prosodic differences that influence our judgment of dialects, but I'm not experienced enough with them to advise on it intelligently.</p>\n\n<p>In summary, differences between dialects are marked in so many ways including both vowels and consonants. There is no \"primary\" difference. That question is as unanswerable as the question \"What is the primary sound in languages? Vowels or consonants?\".</p>\n", "Id":"223", "ParentId":"221", "CreationDate":"2011-09-16T14:13:39.047", "Score":"6", "PostTypeId":"2", "OwnerUserId":"9", "LastActivityDate":"2011-09-16T14:13:39.047", "CommentCount":"7"}