{"comments":[], "Body":"<h2>From the comments:</h2>\n\n<blockquote>\n  <p>This because my wife (who is Chinese) tells me that the grammar changed in radical ways in the 19th century, as contact with the west led Chinese to modernize. Before that, she said, Chinese sentences were \"short\" and \"hard to understand\". She isn't a linguist, so I can't be sure. – Ron Maimon</p>\n</blockquote>\n\n<p>I believe two events have been conflated in this description.</p>\n\n<p>Chinese has historically had a very analytical typology, reinforced by its writing system that tended to obscure morphological and phonological effects. Those who studied Chinese were more interested in semantics and pragmatics at the lexical level. Therefore, there wasn't a strong native tradition of grammar in syntax as evolved in the west.</p>\n\n<p>In the 19th century, western missionaries introduced the syntactic approach, and new descriptions of Chinese grammar were written. The only radical change that came as a direct consequence was academic. To this day, the Chinese themselves still approach their language lexicographically, and western curricula in advanced Chinese studies generally follow that tradition.</p>\n\n<p>Although we've been talking about Chinese as if it were a single language, and in some ways it does behave like one, an important distinction needs to be made. Chinese languages are internally at least as diverse as the Romance languages. Unlike Romance speakers, who were rarely under one central authority for long, the Chinese lived in one unified state for most of their history.</p>\n\n<p>In practical terms, this meant the Chinese retained Classical Chinese as a written standard until the early 20th century, even as local vernaculars evolved and diverged. Classical Chinese is a frozen form of Old Chinese, is known for being extremely terse, and is not intelligible to untrained Chinese readers. This was most likely what your wife meant by short and hard to understand sentences.</p>\n\n<p>Imagine if Western Europeans continued to write exclusively in Latin while speaking French, Spanish, Italian, etc, and if asked to recite their written Latin, pronounced every word with its local equivalent.</p>\n\n<p>Western contact coincided with (and contributed to) increased prestige in local written vernaculars, e.g. written Shanghainese, Cantonese, and Hokkien. Only in the early 20th century did written Mandarin replace Classical Chinese as the national standard.</p>\n\n<h2>On multiple-level embedding:</h2>\n\n<p>Back to the topic of recursion, multiple centre-embedding can be found as early as Zhuangzi (300-200 BCE). I didn't look very hard, so there are probably other, earlier sources.</p>\n\n<pre><code>  Yángzǐ         yuē,\nMaster Yang      say\nJì       zhī,    xíng  xián    ér       qù       zì      xián       zhī     xīn,\nremember this     do  worthy  CONJ   set aside  self    worthy      this    heart\nān        wǎng     ér   bú    ài        zāi?\nwhere     go      CONJ  not  love  particle-question\n</code></pre>\n\n<p>Although <em>zhī</em> literally meant 'this', it had a parallel usage as an adnominal modifier. Also, any adjective in Classical Chinese can be used as a causative verb. With these two points in mind, we can render the sentence as literally as possible:</p>\n\n<p>'Master Yang said, Remember ⟨that {[worthy-doing]-[[self-making-worthy]-setting-aside]} heart go where and not be loved?⟩'</p>\n\n<p>In more idiomatic English,</p>\n\n<p>'Master Yang said, Remember that a heart that does what is worthy, setting aside self-praise, could go anywhere and not be unloved.'</p>\n", "Id":"2245", "ParentId":"1598", "CreationDate":"2012-07-13T10:58:34.427", "Score":"11", "PostTypeId":"2", "OwnerUserId":"1185", "LastActivityDate":"2012-07-13T10:58:34.427", "OwnerUser":{"UpVotes":"42", "Location":"KiTTYLand", "DownVotes":"0", "Id":"1185", "AccountId":"559628", "Views":"3", "Reputation":"456", "CreationDate":"2012-07-13T00:21:32.883", "DisplayName":"ROBOKiTTY", "LastAccessDate":"2014-01-05T16:26:27.617", "AboutMe":"<p>Primarily work in LOLCODE, Java, C#, and C++.</p>\n"}}