{"OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1191", "AccountId":"1657811", "Views":"1", "Reputation":"136", "CreationDate":"2012-07-15T12:07:55.957", "DisplayName":"Ty'reese Tranh", "LastAccessDate":"2012-09-20T12:02:25.597"}, "comments":[], "Body":"<p>This is briefly discussed in <em>The Romance Languages</em>, on pages 296-7 (in the chapter on Italian by Nigel Vincent). The author explains the origins of some irregular preterits and past participles occurring with second-conjugation verbs. According to him, a number of these verbs derive their irregular preterit base from the Latin perfect marker -U-, which produced gemination of a preceding consonant (e.g. VOLUI > <em>volli</em>, 'I wanted').He notes that these are also the verbs with participles in -<em>u</em>-: <em>avuto</em>, <em>conosciuto</em>, <em>voluto</em>, etc., and explains thus:</p>\n\n<p>Although this participial -<em>u</em>- is etymologically from a different source,   namely verbs in -UO such as BATTUO 'I beat', it extended its range considerably in late Latin...suggesting that it had been morphologically reanalysed as being the same element as perfective -U-.... Finally, in this connection, we may note the form [of the verb <em>vivere</em>] <em>vissuto</em> 'lived' &lt; *VIXUTUM, which represents the extension of the -UTUM suffix to the already sigmatic Latin perfect from VIXI. The original Latin participle VICTUM survives instead in the word <em>vitto</em> 'food'.</p>\n\n<p>Of course, there remains a large number (he estimates about 200) of irregular second-conjugation participles, and he notes that in other areas of Italy, i.e. the South, where the preterit is still used daily, corresponding preterit and participial forms in local languages have undergone analogical leveling and are more regular. I'm aware that in northern Italy where, conversely, the preterit is extinct in many local languages (and where even speakers of Standard Italian simply don't use it), those languages have likewise simplified second-conjugation participles by analogical extension of the -<em>u</em> (widely phonetically realized as [y]).</p>\n", "Id":"2255", "ParentId":"1905", "CreationDate":"2012-07-15T12:07:55.957", "Score":"2", "PostTypeId":"2", "OwnerUserId":"1191", "LastActivityDate":"2012-07-15T12:07:55.957", "CommentCount":"1"}