{"Body":"<p>Italian was adopted as an everyday written language long after French and English were. In medieval central Italy, literacy meant the ability to read and write Latin (and perhaps Greek if one was really learned)—that is, until influential writers like Dante and Petrarca wrote in a somewhat artificial version of <em>il dialetto fiorentino</em> and made it prestigious. Use of this vernacular was further bolstered by the regional political influence that Tuscany enjoyed from the early Renaissance on, but it wasn't (at least not in the modern sense) a national language until 1861. By then the written form of the language was fairly stable. I think there was a final orthographic reform in the early 20th century.</p>\n\n<p>In fact, modern Italian spelling isn't all that \"phonetic\" when it comes to avoiding ambiguity. In many words it fails to note tonic stress or to disambiguate certain letters, such as: open and closed <em>o</em> and <em>e</em>, voiced and voiceless <em>s</em> and <em>z</em> (including <em>zz</em>), the combination <em>gli</em>, which normally represents a palatal lateral but in a few cases is [gli], the digraph <em>gn</em>, which is usually a palatal nasal, but very occasionally is [gn], and semi-consonantal and vocalic <em>i</em> and <em>u</em>. While figuring out the written form of an unfamiliar spoken French word can be difficult, the spelling is normally consistent enough (much more so than in English) to enable correct pronunciation of an unfamiliar written word.</p>\n\n<p>Furthermore, French and Italian are at opposite ends of the Romance Family when it comes to diachronic change or innovation. Old French developed a relatively fixed orthography early on. At that point the writing closely reflected actual pronunciation, but with rapid expansion and the increasing urbanization of its speakers Old French  soon underwent radical pronunciation and syntactic changes (morphing into Middle French) while the writing remained fairly static. Florentine-based Tuscan, on the other hand, is remarkable for its phonological and morphological conservatism, only central Sardinian dialects being closer to Latin in these respects. Native vocabulary hasn't undergone any appreciable phonetic or morphological changes up to the present day, so the spelling, which became fixed relatively late, has remained much closer to spoken Italian than has written French to spoken French. In theory spoken Tuscan could have changed radically soon after the written language became common, as happened with French, but during that period Tuscan didn't become the popular language of a vast state or kingdom—the kind of situation that encourages rapid linguistic change. When it finally became an  official national language in the latter part of the 19th century it was imposed on the population as a language of bureaucracy and remained such until extremely recently. Modern Italian is no longer pure Tuscan but is increasingly mixed with Southern dialects and is in the process of absorbing a huge amount of foreign vocabulary for which it lacks native equivalents. These foreign words—more often than not from English—create an ever-increasing number of \"non-phonetic\" spellings.</p>\n", "Id":"2256", "ParentId":"637", "LastEditorUserId":"1191", "CreationDate":"2012-07-15T17:42:55.787", "OwnerUserId":"1191", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-07-16T07:48:20.793", "LastEditedUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1191", "AccountId":"1657811", "Views":"1", "Reputation":"136", "CreationDate":"2012-07-15T12:07:55.957", "DisplayName":"Ty'reese Tranh", "LastAccessDate":"2012-09-20T12:02:25.597"}, "LastActivityDate":"2012-07-16T07:48:20.793", "Score":"10", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1191", "AccountId":"1657811", "Views":"1", "Reputation":"136", "CreationDate":"2012-07-15T12:07:55.957", "DisplayName":"Ty'reese Tranh", "LastAccessDate":"2012-09-20T12:02:25.597"}}