{"comments":[], "Body":"<p>Rhyming is not a uniquely English phenomenon. It is present in Chinese, for example. As one article puts it, \"Chinese words are made up of so few possible syllables that it’s almost hard NOT to rhyme.\" (original article: <a href=\"http://laowaichinese.net/why-is-it-so-easy-to-rhyme-in-mandarin.htm\">Rhyming in Mandarin</a>)</p>\n\n<p>The main difference between rhyming in English and Chinese, however, is that Chinese rhymes must take into account both the pronunciation of the syllable and the tone (i.e. the tones must match).</p>\n\n<p>Rhyming was an integral part of classical Chinese poetry and there were even large dictionaries of Chinese characters indicating which characters rhymed with each other. (Since the pronunciation of Chinese has changed over time, many classical Chinese poems don't actually rhyme anymore when read using modern Chinese pronunciation, however.)</p>\n\n<p>Your question mentions the possible difficulty of constructing rhymes that form coherent sentences in some languages. This is a valid point, for example, for languages that have different syntax than English. Tibetan and Japanese generally have <code>SOV</code> (subject-object-verb) word order where the verb always comes last. Thus if you are constructing a poem in these languages and you want the last words/syllables of two sentences to rhyme, you would be forced to find two <em>verbs</em> that rhyme with each other.</p>\n\n<p>I imagine there are other languages which are also easier to rhyme in than English due to differences in syllable structure. Hawaiian language, for example, has a <code>(C)V</code> syllable structure, which means that all syllables always end in a vowel. Thus I imagine it would be fairly easy to rhyme in Hawaiian.</p>\n\n<p>But then again, perhaps other languages have different criteria for what constitutes a \"rhyme\".</p>\n", "Id":"2263", "ParentId":"2260", "CreationDate":"2012-07-17T13:53:38.713", "Score":"5", "PostTypeId":"2", "OwnerUserId":"1192", "LastActivityDate":"2012-07-17T13:53:38.713", "OwnerUser":{"UpVotes":"7", "WebsiteUrl":"", "DownVotes":"0", "Id":"1192", "AccountId":"316670", "Views":"0", "Reputation":"161", "CreationDate":"2012-07-15T22:06:58.437", "DisplayName":"Joshua", "LastAccessDate":"2012-11-29T15:44:07.713", "AboutMe":"<p>medical student interested in Sino-Tibetan and Scandinavian languages</p>\n"}}