{"Body":"<p>One thing to keep in mind is that IPA is language-dependent, i.e. there is not a one-to-one correspondence between IPA symbols and speech sounds.  This point is sometimes glossed over in introductory linguistics courses, where students sometimes are given the impression that the same symbol represents the same sound in all different languages. But this is far from true. Take the symbol [s] for example. What we call [s] in various languages is articulated in a variety of ways, and it is acoustically different in those languages, as well. When my Icelandic friends produce [s] I hear it as somewhere between [s] and [ʃ]; Icelanders, meanwhile, have trouble hearing the [s]/[ʃ] distinction in English because they have no such contrast phonemically (/s/ vs. /ʃ/) in their native language. Indeed, in a spectrogram, the [s] produced by my Icelandic friends shows fricative noise in a frequency range somewhere between that of my [s] and my [ʃ]. Another example comes from Hebrew, which allows many more complex onset clusters than English does. Rina Kreitman played some Hebrew clusters for non-Hebrew-speaking listeners, and those listeners sometimes reported hearing consonant-schwa-consonant sequences, presumably because their native languages didn't allow for such clusters; Japanese speakers also report \"hearing\" vowels between consonants in English clusters.</p>\n\n<p>All of this is to make the point that, yes, you are likely being influenced by your native language when you are hearing this so-called voiced velar fricative as a vowel. English doesn't have such a fricative; it doesn't even have the approximant version of it (transcribed as [ɰ]), nor are approximants allowed in that position in onset clusters (*[wga], e.g.), so it makes sense that you would map this sound to the closest thing that your native language's phonotactics would allow in that syllabic position--a mid-central-ish vowel. </p>\n\n<p>That being said, it is indeed quite possible that, <em>articulatorily</em>, the sound most often being transcribed as a velar fricative is being lenited to an approximant, in the sense that there is not enough of a constriction in the vocal tract to produce audible turbulent noise. This is quite common cross-linguistically; for example, the pronunciation of the Icelandic word <em>saga</em> is usually transcribed as [saɣa], but in reality it is often produced as [saɰa]; that is, the back of the tongue and velum approach each other for the velar consonant but they never get close enough to result in audible fricative noise.</p>\n\n<p>Acoustics aren't going to help you distinguish between a vowel and an approximant (unless you have minimal pairs in the language under investigation), because the distinction between the two is largely phonological. You might be able to see evidence for deciding between the fricative [ɣ] and the approximant [ɰ], though. The former should manifest itself with some aperiodic \"noise\" in the spectrum--some of the otherwise regular vertical lines corresponding to the regular glottal pulses in vowels and approximants will be \"smudged over\" with textured noise.</p>\n\n<p>Note, though, that even in the absence of visible aperiodic noise, researchers might still label this sound as a velar fricative in broader transcriptions (see the second paragraph in the <a href=\"http://en.wikipedia.org/wiki/Velar_approximant\">Wikipedia entry for the velar approximant</a>)!</p>\n", "Id":"2274", "ParentId":"2269", "LastEditorUserId":"385", "CreationDate":"2012-07-19T13:39:16.243", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-07-19T14:02:40.573", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2012-07-19T14:02:40.573", "Score":"9", "CommentCount":"1", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}