{"comments":[], "Body":"<p>I don't think you have any real evidence that this \"center-marking\" is diachronically unstable. It also seems that you are totally unfamiliar with things such as case prefixes and prenomial relative clauses. I suggest you read grammars of Basque or Japanese, for example. (I'm not all that familiar with any case prefix languages, so I can't help you there.)</p>\n\n<p>In a hypothetical SOV language with case suffixes and prenomial relative clauses, your example of</p>\n\n<pre><code>I walked store-from-ly the wide open sheep grazing field-ward where John slaughtered the goat.\n</code></pre>\n\n<p>might be glossed something like this:</p>\n\n<pre><code>1SG.NOM store-ABL John-NOM goat-ACC slaughtered where wide open sheep grazing field-ALL walked.\n</code></pre>\n\n<p>In the comments you stated that you didn't believe kaleissin that Basque works this way. I don't know it well enough to translate this sentence, but I assure you that it works this way (and in Japanese, too).</p>\n\n<p>Likewise, in a hypothetical VSO language with case prefixes and postnomial relative clauses, it might be glossed like this:</p>\n\n<pre><code>walked 1SG.NOM ABL-store ALL-field grazing sheep open wide where slaughtered John-NOM goat-ACC.\n</code></pre>\n\n<p>Your problem is avoided entirely when the locus of case marking is on the opposite side of the head noun as relative clauses. This is fairly common. (Few languages have case prefixes, but that is irrelevant. Case prefixes are equivalent to prepositions for this purpose, as are case suffixes to postpositions.)</p>\n\n<p>The other way to solve your problem is with case clitics. Rather than give you another hypothetical example, I will use English here. The possesive 's is a clitic that attaches to whole noun phrases. For example, you say \"The Queen of England's crown\" instead of \"The Queen's of England crown\", which you wouldn't like. There are languages that build their entire case systems like this. (In fact, I'm not entirely sure about this, but I think I remember reading that full case-concord systems like we are all used to from Latin, Greek, etc. are relatively uncommon, and case is applied only once to a whole noun phrase in many more languages.)</p>\n", "Id":"2276", "ParentId":"1548", "CreationDate":"2012-07-19T21:51:33.130", "Score":"3", "PostTypeId":"2", "OwnerUserId":"142", "LastActivityDate":"2012-07-19T21:51:33.130", "OwnerUser":{"UpVotes":"14", "DownVotes":"2", "Id":"142", "AccountId":"30716", "Views":"4", "Reputation":"212", "CreationDate":"2011-09-15T16:01:10.480", "DisplayName":"Zifre", "LastAccessDate":"2012-07-29T17:12:07.037", "Age":"20"}}