{"Body":"<p>Prepositions are one obvious answer. English doesn't need to mark its object because of its SVO order, but it does mark most other roles with prepositions, and you can easily imagine a language that marks its subject or object with a preposition. </p>\n\n<p>Of course I say \"preposition\" as that's what's typical in VO languages. In Japanese, a moderately synthetic language with some peculiar isolating tendencies, just about all roles are (sometimes optionally) marked with postpositions (Japanese is an SOV language). E.g. from \"neko\" (cat):<br>\n\"neko ga\": subject<br>\n\"neko wo\": object<br>\n\"neko ni\": indirect object<br>\n\"neko kara\": ablative<br>\n\"neko ye\": lative</p>\n\n<p>In something of a variation on a theme, non-particle words may be used as well. E.g. some of Japanese' relational postpositions (\"kara\" comes readily to mind) are thought to originally have been nouns, probably the heads of agglutinative genitive constructs. In Trique, an indian language that was probably originally isolating, possessed-case nouns are often used to mark roles. E.g. \"body of\" can be an object marker (not often used, primarily for disambiguation), \"face of\" means \"to\", \"hand of\" means \"from\", \"stomach of\" means \"inside\", etc.</p>\n\n<p>Alternately, you could use a serial verb structure to reduce a transitive construct to a pair of intransitive cosubordinated clauses. This is also common in Trique. E.g. to say \"He said to them\" you would literally say \"Said he heard they\". Though this isn't a very good example (off the top of my head) because both of those have an object of their own: the thing which was said, which comes at the very end.</p>\n\n<p>Yet another method I can think of (though the examples I know of are pretty highly synthetic) is an agency-based system. In such a system, both subject and object are unmarked, and the more agentive noun phrase is taken to be the subject and the less agentive the object; if this is not true in a particular clause, an additional \"exception\" morpheme is added. If you look at the declension of Proto-Indo-European, there appears to be hints of a system like this, perhaps preceding the well-known PIE case system: specifically, you see that animate nouns were zero-marked in the nominative in some declensions, and inanimate nouns were zero-marked in the accusative.</p>\n", "Id":"2289", "ParentId":"2287", "LastEditorUserId":"1097", "CreationDate":"2012-07-23T02:02:46.103", "OwnerUserId":"1097", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-07-29T17:39:27.260", "LastEditedUser":{"UpVotes":"1", "WebsiteUrl":"https://twitter.com/#!/JustinOlbrantz", "DownVotes":"0", "Id":"1097", "AccountId":"1561933", "Views":"12", "Reputation":"470", "CreationDate":"2012-06-12T15:27:45.637", "DisplayName":"Justin Olbrantz", "LastAccessDate":"2014-01-19T02:48:30.797"}, "LastActivityDate":"2012-07-29T17:39:27.260", "Score":"2", "OwnerUser":{"UpVotes":"1", "WebsiteUrl":"https://twitter.com/#!/JustinOlbrantz", "DownVotes":"0", "Id":"1097", "AccountId":"1561933", "Views":"12", "Reputation":"470", "CreationDate":"2012-06-12T15:27:45.637", "DisplayName":"Justin Olbrantz", "LastAccessDate":"2014-01-19T02:48:30.797"}}