{"Body":"<p>I'm not sure if you are asking about Modern or Biblical Hebrew: your transliterations suggest the latter, but I'm not certain.</p>\n\n<p>What you are calling the \"first person singular in the present\" is actually a participle, which varies for number and gender, but not person. In Modern Hebrew this is thought of as a present tense, but historically it is simply a participle, construed with the copula. </p>\n\n<blockquote>\n  <p>אני כותב ('ani kotev) = I (am) one-who-writes </p>\n</blockquote>\n\n<p>Your first example, שותה shoteh 'who drinks' is regular. </p>\n\n<p>ישן yaśen, 'who sleeps' I haven't an answer to: it just appears to be irregular.</p>\n\n<p>צריכ ẓarik, 'need' appears not to be a verbal form at all, but an adjective meaning 'needing', though Segal and Dagut's dictionary says \"should, must (as prs. tense of הצטרך)\" (hitztarekh - the hitpa'el from the same root). I think this means that it functions as though it were the present of that verb. They do not list לצרוכ liẓrok at all, but they don't necessarily list all infinitives.</p>\n\n<p>Your last, פגוע pagu'a, is a different form, the passive participle, seen in ברוך (barukh) = 'blessed' and כתוב (katuv) = 'written'. The active פוגע (poge'a) means 'who strikes/offends'.</p>\n\n<p>So in summary, one is regular, one appears to be irregular, one is a functionally different form which just happens to be used in a similar way, and the last is a different but parallel form. </p>\n\n<p>One more point: I strongly advise that you don't think of the infinitive as the 'basic' or 'dictionary' form. We are used to doing this in Indo-European languages, but it tends to be unhelpful in Hebrew, because it sometimes omits a consonant of the root, as לשבת lashevet, from ישב yashav = 'sat' . Treat the 3sg perfective (or 'past', if you're talking about Modern Hebrew) as the basic form, and the infinitive as one of the derived forms. </p>\n", "Id":"2291", "ParentId":"2282", "LastEditorUserId":"718", "CreationDate":"2012-07-23T15:21:08.087", "OwnerUserId":"718", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-07-23T15:28:26.877", "LastEditedUser":{"UpVotes":"90", "Location":"England, United Kingdom", "DownVotes":"10", "Id":"718", "AccountId":"34526", "Views":"13", "Reputation":"1364", "CreationDate":"2012-01-27T00:02:42.473", "DisplayName":"Colin Fine", "LastAccessDate":"2014-01-18T23:15:12.837"}, "LastActivityDate":"2012-07-23T15:28:26.877", "Score":"2", "CommentCount":"3", "OwnerUser":{"UpVotes":"90", "Location":"England, United Kingdom", "DownVotes":"10", "Id":"718", "AccountId":"34526", "Views":"13", "Reputation":"1364", "CreationDate":"2012-01-27T00:02:42.473", "DisplayName":"Colin Fine", "LastAccessDate":"2014-01-18T23:15:12.837"}}