{"OwnerDisplayName":"WAF", "OwnerUser":{"UpVotes":"10", "DownVotes":"0", "Id":"96", "AccountId":"260659", "Views":"1", "Reputation":"383", "CreationDate":"2011-09-14T03:18:30.907", "DisplayName":"WAF", "LastAccessDate":"2014-01-16T01:47:47.207"}, "Body":"<p>The two examples you give are good ones because they represent two stages in the development of this trend. Both stem from the translation and transliteration of the Bible into Greek. This juncture in the transmission of non-Hebrew versions of the Bible has had many an impact in enduring transliterations that are strange to the modern English speaking ear. </p>\n\n<p>In many cases, sounds that are impossible in the Greek alphabet were dropped or replaced by more Grecophilic ones. Take for example the dropping of the 'sh' (absent in Greek) from names like Simeon and Samuel, or the non-consonantal beginnings to names like Isaac and Israel (although that nuance is slightly more complex).*</p>\n\n<p>In the present test case, it appears to us that no sounds were dropped and therefore the replacement of the simple 'f' sound with the more cumbersome /ph/ bigram is counterintuitive. It can be brought back to the intuitive realm by recalling some phacts about the sounds actually available to speakers of older Greek. The minimal pair of sounds spelled out with the letters /π/ (pi) and /φ/ (phi) was actually originally not the difference between 'p' and 'f', but between an <a href=\"http://en.wikipedia.org/wiki/Aspiration%5F%28phonetics%29\" rel=\"nofollow\">aspirated</a> 'p' and an unaspirated 'p'. These two letters were the obvious choices for differentiating between the two versions of the Hebrew letter /פ/ (pei). Then, when English came along and transliterated from the Greek, the aspirated version was spelled out, quite logically with an /h/ denoting the breath of air that accompanies the 'p' sound.</p>\n\n<p>Thus, in a word that is almost exclusively Biblical, such as 'seraph', the proportion of /ph/ spellings to /f/ spellings is much more striking because most instances of it are [more] influenced directly by its appearance in the Bible. In contrast a word like 'aleph', whose transliteration is more likely to be direct (since most occurrences of it on the Internet today probably refer to the letter, a meaning not appearing in the Bible) would easily be spelled out the way they sound, with the letter /f/.</p>\n\n<p>*Names are often the best exemplars of changes like this because they force transliteration as opposed to translation most of the time.</p>\n", "Id":"2293", "ParentId":"2292", "comments":[], "CreationDate":"2009-12-24T04:33:41.493", "Score":"18", "PostTypeId":"2", "OwnerUserId":"96", "LastActivityDate":"2009-12-24T04:33:41.493", "CommentCount":"5"}