{"OwnerUser":{"UpVotes":"308", "DownVotes":"10", "Id":"111", "AccountId":"514008", "Views":"172", "Reputation":"5430", "CreationDate":"2011-09-14T09:33:29.710", "DisplayName":"Alenanno", "LastAccessDate":"2014-01-19T00:38:35.883", "AboutMe":"<p>I'm a student majoring in Languages (branch: Linguistics), currently working as a freelance translator. I've recently discovered <a href=\"http://db.tt/WpiKeReH\" rel=\"nofollow\">Dropbox</a> and I'm going to use it for my needs! :)</p>\n\n<p><em><strong>I love</em></strong><br>\nLanguages, Movies (Fantasy, Sci-Fi, Tarantino, etc.), Music, 3D Graphics, books and so on. </p>\n\n<p>Appointed ♦ Moderator Pro Tempore on <a href=\"http://area51.stackexchange.com/proposals/6673/linguistics?referrer=GlDGLdkDYNxMg1X13CJ1vg2\">Linguistics SE</a>, <a href=\"http://area51.stackexchange.com/proposals/6388/chinese-language-usage?referrer=XzTG1Nz01tc01sJEhak_6g2\">Chinese SE</a> and the <a href=\"http://area51.stackexchange.com/proposals/10848/russian-language-usage?referrer=J7IYS3ZUomUDvVVb-6SmDQ2\">Russian SE</a> site. If you're interested in other Stack Exchanges, try the <a href=\"http://area51.stackexchange.com/proposals/42949/italian-language-usage?referrer=ALVtGpK0tjLp1Lw15QCaUA2\">Italian SE</a> site.</p>\n\n<p>I like to lurk on other sites' Metas. <em>Meta is fun!</em> </p>\n\n<p><strong>My feature requests</strong>:</p>\n\n<ol>\n<li><a href=\"http://meta.stackoverflow.com/q/135786/176533\">Alert a moderator when an answer is improved after a post notice</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/138273/176533\">Automatically add chat event to the community bulletin (or make it easier)</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/121363/176533\">Give 10k users the ability to see the total count of flags they've handled</a></li>\n</ol>\n\n<p><strong>Moderator issues</strong>: If you have concerns or want to contact me about my moderation, you can find/ping me either in the <a href=\"http://chat.stackexchange.com/rooms/1336/linguistics\">Linguistics SE chat room</a> or <a href=\"http://chat.stackexchange.com/rooms/1984/chinese-language-and-usage\">CL&amp;U chat room</a>; if I'm not there or I'm \"idle\", just ping me! Please <em>avoid</em> using my personal email for such things. Use the chat rooms.</p>\n\n<hr>\n\n<p><strong>Languages List</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <sup>Languages with  * = learning on my own</sup></p>\n\n<p><strong>Mother Tongue:</strong> Italian, Sardinian;<br>\n<strong>Fluent:</strong> English, Spanish;<br>\n<strong>Less Fluent:</strong> French, German, Russian;<br>\n<strong>Learning:</strong> Japanese*, Chinese*, Swedish*, Greek*, Finnish*;<br>\n<strong>Willing to learn:</strong> Welsh, Korean, Dutch, Arabic, Hebrew, Hindi [to be continued]</p>\n\n<p>Me gusta el Español.<br>\nJ'aime le Français.<br>\nDeutsch gefällt mir.<br>\nМне нравится Русский язык.<br>\n私は日本語が好きです。<br>\n我爱中文。<br>\nJag älskar Svenska.</p>\n"}, "comments":[], "Body":"<p>I'd like to go a bit more in depth about this. </p>\n\n<h2>Deixis</h2>\n\n<p>Traditionally, by deixis is meant the location and identification of person, objects, events, processes and activities being talked about, or referred to, in relation to the spatiotemporal context created and sustained by the act of utterance and the participation in it, typically, of a single speaker and at least one addressee; we can analyze them this way:</p>\n\n<ol>\n<li><strong>Person deixis:</strong> those that are used to refer to speaker and addressee (<em>I, you, we</em>);</li>\n<li><strong>Place deixis:</strong> those that refer to spatial context (<em>here, there</em>);</li>\n<li><strong>Time deixis:</strong> these that refer to temporal context (<em>now, then, verb tense markers</em>);</li>\n<li><strong>Discourse deixis:</strong> those that refer to parts of unfolding discourse (<em>next, below, furthermore</em>);</li>\n<li><strong>Social deixis:</strong> those that encode aspects of the social relationship between speaker and addressee (<em>Her Majesty</em>);</li>\n<li><strong>Perceptual deixis:</strong> <em>There's Harry</em>.</li>\n</ol>\n\n<p>Deixis concerns the use of certain linguistic expressions to locate entities in spatiotemporal, social and discursive context. First and second person pronouns, demonstratives, tense, certain place and time adverbials, verbs such as <em>come, go, bring, take</em> and <em>fetch</em>. Such deictic expressions encode specific aspects of the speech event and <strong>cannot be interpreted unless contextual parameters are taken into account</strong>.</p>\n\n<p>Without physical context we cannot interpret utterances like:</p>\n\n<blockquote>\n  <p>I'll meet you over there.<br>\n  See you tomorrow.<br>\n  Will be back in 10 minutes.<br>\n  You, you and you, come over here.<br>\n  He does not like that.<br>\n  Put that here and then move this over there.</p>\n</blockquote>\n\n<p>Deictic expressions refer to a deictic field of language whose zero point is fixed by the person who is speaking, the place of utterance and the time of utterance (I, here, now, respectively, etc). <strong>Deictic constructions construct the speaker as the deictic center</strong>. </p>\n\n<h2>Anaphora and Cataphora</h2>\n\n<p><strong>Anaphora</strong>, along with <strong>cataphora</strong> and other devices, belong to the so-called <strong>Patterns of reduction</strong>. In other words they allow you to say less, but still keep sense in your utterances.</p>\n\n<ul>\n<li>Anaphora = reference backward</li>\n<li>Cataphora = reference forward </li>\n</ul>\n\n<p>Anaphora is a lower expenditure of cognitive effort for recovering the conceptual content of the co-referring expression (more efficient) - the identity of the content is made plain in advance. Cataphora's processing requires the creation of a temporarily empty slot until the required content is supplied (low efficiency): it is often used to generate uncertainty and to intensify receiver's interest (effectiveness).</p>\n\n<h2>The difference</h2>\n\n<p>The Anaphora, in the linguistics sense, makes use of deictic expressions:</p>\n\n<blockquote>\n  <p><strong>Sam</strong> went home because <strong>he</strong> was tired.</p>\n</blockquote>\n\n<p>\"He\" is the anaphora expression referring to \"Sam\", but it's also a deictic expression, i.e. it changes according to the context/subject.</p>\n\n<p>Deixis, on the other hand, is not necessarily related to anaphora. For example, there's no anaphora in this sentence:</p>\n\n<blockquote>\n  <p><strong>You</strong>, <strong>you</strong> and <strong>you</strong>, come over here.</p>\n</blockquote>\n\n<p>Those are just deictic expressions referring to 3 different subjects, but no anaphora.</p>\n", "Id":"2308", "ParentId":"2305", "CreationDate":"2012-07-25T10:28:05.960", "Score":"10", "PostTypeId":"2", "OwnerUserId":"111", "LastActivityDate":"2012-07-25T10:28:05.960", "CommentCount":"3"}