{"comments":[], "Body":"<p>Assuming you mean <em>phonologically</em> voiced (because if you're whispering there can't be any phonetic voicing), this indeed has to be a language-specific question, because how phonological voicing contrasts are realized phonetically differs from language to language.</p>\n\n<p>For English, there are often several other phonetic manifestations of phonological voicing other than phonetic voicing (in fact, quite often phonologically voiced consonants are not phonetically voiced at all). What these manifestations are depends on the consonants in question and on their position in an utterance.</p>\n\n<p>For example, word-initial voiceless stops (/p t k/) tend to have stronger bursts than their voiced counterparts (/b d g/), where \"stronger bursts\" means longer and more intense periods of noise. They are also characterized by a relatively long period of aspiration (especially if they are in a stressed syllable) whereas the voiced stops lack such aspiration or only show a bit of it. Aspiration may be distinguished from whispered phonation by being more intense (because the air coming out is not as impeded by the vocal folds). Also, the period of aspiration usually adds duration to the total duration of a syllable (this relative duration difference is usually not perceptually relevant in my experience, but it can be seen in spectrograms when comparing minimal pairs side by side).</p>\n\n<p>As for syllable-final stops and fricatives, the relative duration of the nucleus is dependent on the voicing of the coda. All else being equal, a nucleus before a voiced coda will be longer than a nucleus before a voiceless coda. Try recording yourself whispering minimal pairs like <em>seat</em> and <em>seed</em> to convince yourself of this (or have a native speaker do it if you are not one yourself).</p>\n\n<p>For phrase-final stops, released voiceless stops often display a stronger burst than released voiced stops.</p>\n\n<p>Finally, if the consonants in question are in positions where their closure durations can be measured (stops in utterance-initial position and final unreleased stops do not fall under this category), then all else being equal, the closure duration of a voiceless consonant tends to be longer than that of its voiced counterpart. This is true for fricatives, too, where the period of frication is longer for voiceless fricatives (like /s/) than for their voiced counterparts (/z/ in the case of /s/). Try recording yourself whispering <em>E.C.</em> and <em>E.Z.</em> to confirm this. </p>\n", "Id":"2344", "ParentId":"2340", "CreationDate":"2012-08-03T21:00:03.433", "Score":"6", "PostTypeId":"2", "OwnerUserId":"385", "LastActivityDate":"2012-08-03T21:00:03.433", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}