{"Body":"<p>I am Tamil from Tamil Nadu, India. Though, the name is written as \"Tamil\" the \"t\" is \"Tamil\" is pronounced as the \"th\" in \"thin\" or \"think\". Actually almost every Indian language has both the \"th\" sounds (as in \"thin\" and \"then\"). It is just witten as \"Tamil\" as if one got to pronounce it as \"TAM-IL\" but none of the Tamil speakers pronounce that way they pronounce it \"THAM-IL\".</p>\n\n<p>The so-called national language of India Hindi has this sound too. Though it is spelled hin-Di, the \"D\" in \"Hindi\" is always pronounced as the \"th\" in \"they\" and not like the \"d\" in \"dad\".</p>\n\n<p>Many Indian languages have varieties of d, t, th sounds and as English got only a few letters to accommodate, they use the same English letter \"d\" or \"t\" to represent the following sounds as in:</p>\n\n<p>\"d\" for the \"d\" in \"daddy\" \n\"d\" for the \"th\" in \"Netherlands\" (Example: Hindi)</p>\n\n<p>\"t\" for the \"t\" in \"Take\" (Example: Tamatar  meaning Tomato where the \"t\" is pronounced as the \"t\" in Take)</p>\n\n<p>\"t\" for the \"th\" in \"Thin\" (Example: Tum meaning you, but the \"t\" here is pronounced as the \"th\" in \"thin\" and it is \"thoom\" and not \"toom\")</p>\n\n<p>Though Wikipedia and a number of articles say the \"th\" sound doesn't exist in many languages, I would say it is not true. I don't know whether those researchers traveled all the way to all countries and regions studying sounds.</p>\n", "Id":"2348", "ParentId":"2320", "LastEditorUserId":"1224", "CreationDate":"2012-08-04T18:22:01.333", "OwnerUserId":"1224", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-08-04T23:29:56.457", "LastEditedUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1224", "AccountId":"1720416", "Views":"0", "Reputation":"9", "CreationDate":"2012-08-04T18:22:01.333", "DisplayName":"Kanthappan", "LastAccessDate":"2012-08-04T23:28:28.923"}, "LastActivityDate":"2012-08-04T23:29:56.457", "Score":"0", "CommentCount":"1", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1224", "AccountId":"1720416", "Views":"0", "Reputation":"9", "CreationDate":"2012-08-04T18:22:01.333", "DisplayName":"Kanthappan", "LastAccessDate":"2012-08-04T23:28:28.923"}}