{"OwnerUser":{"UpVotes":"26", "WebsiteUrl":"http://www.perl.com/", "Id":"707", "AccountId":"216196", "CreationDate":"2012-01-24T16:28:35.700", "AboutMe":"<p><a href=\"http://stackexchange.com/users/216196\">\n<img src=\"http://stackexchange.com/users/flair/216196.png\" width=\"208\" height=\"58\" alt=\"profile for tchrist on Stack Exchange, a network of free, community-driven Q&amp;A sites\" title=\"profile for tchrist on Stack Exchange, a network of free, community-driven Q&amp;A sites\">\n</a></p>\n\n<p>I’m Tom Christiansen, author of <em>Programming Perl</em> and <em>Perl Cookbook</em> from O’Reilly. I’m a freelance instructor giving courses in Perl programming, including Unicode and regular expressions. I’ve been using BSD Unix for 30 years now; like your maid, I don’t do Windows.</p>\n\n<p>I’ve undergraduate degrees in Spanish and in Computer Science, and a graduate degree in compsci focusing on operating systems design and in natural language processing. I’ve studied Spanish, French, Italian, Portuguese, Latin, and German, with a smattering of other languages thrown in. For the last few years I’ve been dabbling in computational linguistics.</p>\n", "Age":"51", "Location":"Boulder, CO", "DownVotes":"1", "Views":"5", "Reputation":"206", "DisplayName":"tchrist", "LastAccessDate":"2013-12-24T16:58:31.240"}, "comments":[], "Body":"<p>In Asturian, there is such a thing as a different noun class than masculine / feminine.  You can mark a noun with a different suffix to indicate that it is an abstract version of that noun.  This is the so-called <em>neutru de materia</em>, used for non-countable mass nouns.  This presents a five-fold paradigm morphologically:</p>\n\n<ol>\n<li><em>-u</em> for masculine singular</li>\n<li><em>-os</em> for masculine plural</li>\n<li><em>-a</em> for feminine singular </li>\n<li><em>-es</em> for feminine plural</li>\n<li><em>-o</em> for the “material neuter”</li>\n</ol>\n\n<p>Nouns are still either masculine or feminine, but you can make them abstract / material nouns.  So for example, if you had <strong>a</strong> red hair, it would be <em>un pelu roxu</em>, but if you were talking about red hair in general, it becomes <em>pelo roxo</em>.</p>\n\n<p>It’s a bit more complicated than this (for example, feminine nouns don’t change their endings), but that’s the basic idea.  You can find vestiges of this in the Castilian <em>ése / ésa / eso</em> distinction, and in <em>lo necesario</em>.  </p>\n\n<p>If you read Castilian, you should be able to piece your way through texts in Asturian that talk about this very interesting subject.  One such is  <a href=\"http://www.asturies.com/espaciuytiempu/deprendeasturianu/tema4\" rel=\"nofollow\">El llamáu neutru materia</a>.</p>\n", "Id":"2351", "ParentId":"384", "CreationDate":"2012-08-04T21:22:44.700", "Score":"1", "PostTypeId":"2", "OwnerUserId":"707", "LastActivityDate":"2012-08-04T21:22:44.700", "CommentCount":"1"}