{"Body":"<p>Short answer: \"no\".</p>\n\n<p>To start, your premise is slightly faulty as descriptive grammaticists are more common than prescriptive grammaticists since most people just follow their own local dialect anyway, regardless of what prescriptive grammaticists say. Further more, with very few exceptions, prescriptive grammar has not had a large effect on language change. The history of prescriptive grammar is a history of futility.</p>\n\n<p>Even today, prescriptive grammaticists are merely a vocal minority, as they have been throughout all of history. This should be obvious since they tend to oppose language usage which they deem incorrect but is in common usage and common usage is, by definition, common! I don't have my copy in front of me, so I can't give you any explicit citations, but the book <a href=\"http://rads.stackoverflow.com/amzn/click/0140260234\">Language Myths</a> by Bauer and Trudgill offers citations for how prescriptive grammaticists always seem to think they are living in the first generation to taint the English language and that only a few decades ago everyone spoke like Shakespeare.</p>\n\n<p>That said, if one stretches the definition of <a href=\"http://en.wikipedia.org/wiki/Diglossia\">\"diaglossia\"</a> a bit, prescriptive grammaticists tend to promote the standard dialect, typically regarded as the H dialect. Common usage, by virtue of being common, is usually seen as the L dialect. Thus there is social prestige to be gained by overtly aligning oneself with the high-class, more respected H dialect. Basically, supporting a prescriptive grammar yields greater rewards than descriptive grammar and thus will continue to attract people.</p>\n\n<p>Therefore, I see no signs of their numbers decreasing nor their public influence waning. Additionally, in my opinion they (prepare for blasphemy) serve a <strong>somewhat</strong> useful purpose. They help to codify and propagate the standard dialect. A standard dialect is important for ensuring mutual intelligibility across a wide audience.</p>\n\n<p>Although people should not be forced to use such a standard dialect at all times, if one wishes to be understood by a wide audience then they must at least have the ability to conform to that standard when the need arises, especially in written form. Can you imagine trying to a read a daily newspaper written in the style of James Joyce?!</p>\n\n<p>For further readings about the conflict between allowing people to speak naturally and teaching them standard dialect, look into the controversy surrounding BEV (Black English Venacular) or AAE (African-American English) in US schools.</p>\n", "Id":"2370", "ParentId":"2365", "LastEditorUserId":"1055", "CreationDate":"2012-08-06T02:16:19.197", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-08-06T05:38:24.867", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2012-08-06T05:38:24.867", "Score":"5", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}