{"comments":[], "Body":"<p>Both proposals have undergone changes since they were proposed, and now each exists in multiple versions. The Sapir-Whorf hypothesis was originally understood to be a proposal that mental categories which are involved in cognitive tasks other than language use could be arbitrarily shaped by the language practices of a given community. Nobody who is interested in the issue at a professional level believes this anymore. Neo-Whorfianism, on the other hand, is a modern research program whose proponents believe that while there are strong biological constraints on cognition, there are some areas of cognition where a person's native language influences the way they conceptualize things. What are called Nativists do not believe that language can have any such influence: they believe instead that differences in thought processes can be explained in terms of factors such as a person's exposure to literacy, or the type of geographic locale, amongst other factors. To see an example of this kind of debate in the area of spatial cognition, consider the Neo-Whorfian study by Pederson et al (1998), and a similar Nativist-oriented study by Li &amp; Gleitman (2002). </p>\n\n<p>Nativists tend to subscribe to some form of the Universal Grammar hypothesis, while Neo-Whorfians tend not to. While all or nearly all linguists agree that there is something special about human brains that allows them to use langauge (cf. comments on Chomsky's \"<a href=\"http://linguistlist.org/issues/22/22-4631.html\">Rocks and Kittens</a>\" argument for UG), actual UG proponents believe that there are special cognitive abilities which have evolved in humans which are only used for language processing. This may lead (though logically it doesn't have to) to the belief that language processing may be \"segregated\" from other cognitive functions, and so there is no possibly that knowledge about language can interfere with other cognitive abilities. This is probably why most Nativists tend to be UG proponents. If one believes instead that language ability is tied to other types of cognitive abilities outside of the domain of language, then it is not so hard to see how language and non-language thinking patterns might influence each other at least a little bit.</p>\n\n<p>Pederson, E., Danziger, E., Wilkins, D. P., Levinson, S. C., Kita, S., &amp; Senft, G. (1998).\nSemantic typology and spatial conceptualization.Language 74(3), 557-589.</p>\n\n<p>Li, P., &amp; Gleitman, L. 2002. Turning the tables: Language and spatial\nreasoning. Cognition 83: 265-294.</p>\n", "Id":"2374", "ParentId":"2366", "CreationDate":"2012-08-06T16:09:58.157", "Score":"7", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2012-08-06T16:09:58.157", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}