{"OwnerUser":{"UpVotes":"40", "WebsiteUrl":"http://labbook.net", "Id":"958", "AccountId":"266116", "CreationDate":"2012-04-26T04:27:19.147", "AboutMe":"<p>I am currently a junior at Penn State pursuing a B.Phil. in Linguistics and a B.S. in Psychology with minors in Arabic and Statistics. I plan to graduate in 2015 to pursue a Ph.D. in linguistics.</p>\n", "Age":"21", "Location":"Pittsburgh, PA", "DownVotes":"2", "Views":"15", "Reputation":"620", "DisplayName":"Nick Anderegg", "LastAccessDate":"2014-01-04T22:11:02.530"}, "comments":[], "Body":"<p>I would have to nominate English. It meets all of your criteria.</p>\n\n<p>The grammar is fairly regular in that odd constructions are possible, but simple sentences follow a fairly standard form. As for the irregularity of the grammar, there are a finite number of irregular verbs. Everything else follows set patterns.</p>\n\n<p>2, 3, and 4 are easily knocked out by English. English spelling might be a disaster, but in terms of actual grammar, English is simple. Tenses and conjugation are regular and simple, there are no complex conjugations, and word order feels right for programming. Since English is SVO, and since programs follow the syntax \"you have this, now make it do that\" English fits. You could assign something with the sentence \"String s is equal to 'example.'\" This fits in with the <em>current programming paradigm.</em> At any rates, people who want to program learn English; nobody would have to learn a new language if they are already a programmer.</p>\n\n<p>English definitely has popularity. It's the second most spoken language in the world, and as I already said, most programmers already speak it. It's a universal language in the computer world.</p>\n\n<p>As for the practicality of it, it seems like the more \"natural\" a programming language is, the less functional it actuall is. Compare C to C++ to Java. C can do anything; with Java, you have to do more to do small, system-level operations. Coding is an art form all its own. If you're aiming for elegance, try Python. Python is <em>pretty.</em></p>\n", "Id":"2378", "ParentId":"1697", "CreationDate":"2012-08-06T21:30:44.577", "Score":"-1", "PostTypeId":"2", "OwnerUserId":"958", "LastActivityDate":"2012-08-06T21:30:44.577", "CommentCount":"2"}