{"comments":[], "Body":"<p>The adverb \"normalmente\" isn't the right kind of diagnostic for these languages, as evidenced by its free placement in the sentence.  The fact that it it prosodically \"heavy\" also leads one to be suspicious of its status -- in general, the right kinds of adverbs for these tests are relatively light.  For Spanish, Suñer (1994) proposes the following sentences as adverbial diagnostics of V-movement (example 14 from the paper):</p>\n\n<pre>\n(1) Juan juega sucio a las cartas todos los días\n    J.   plays dirty P the cards  all   the days\n\n(2) *Juan juega a las cartas sucio todos los días\n</pre>\n\n<p>In non-finite contexts (which lack subject raising to Spec,IP) the verb moves past the VP-internal subject (ex. 17a):</p>\n\n<pre>\n(3) Jugar   Juan limpio a las cartas es una contradicción\n    to.play J.   clean  P the cards  is a   contradiction\n</pre>\n\n<p>Since subject movement to Spec,IP isn't obligatory in finite sentences either, the subject can also intervene it these sentences (ex. 17b)</p>\n\n<pre>\n(4) Aunque   jugaba Juan limpio a las cartas, ...\n    although played J.   clean  P the cards\n</pre>\n\n<p>The exact parallel to the English sentence \"John often kisses Mary\" can't be tested, since it is possible that \"sucio/limpio\" is base-generated to the right of the verb instead of to the left like \"often.\"  But these diagnostics demonstrate that verb movement of some sort is occurring.  (I don't know Portugese, so I don't know how well they translate to that language.)</p>\n\n<p>Costa &amp; Galves argue that the Portuguese verb movement is shorter than the English/French kind.  Though position is optional with respect to some adverbs, it isn't with others:</p>\n\n<pre>\n(5)  O   Pedro leu   bem  o   livro\n     The P.    reads well the book\n\n(6) *O   Pedro bem  leu   o   livro\n     The P.    well reads the book\n</pre>\n\n<p>Thus (and with other arguments) they conclude that the verb movement targets a lower position in Portugese.</p>\n\n<p><strong>References</strong></p>\n\n<p><a href=\"http://www.tycho.iel.unicamp.br/~tycho/pesquisa/artigos/COSTA_Jetal-Fase1a.pdf\">Costa &amp; Galves</a> (2000) \"Peripheral subjects in two varieties of Portuguese: evidence for a non-unified analysis.\" In <em>Romance Languages and Linguistic Theory 2000</em>. John Benjamins.</p>\n\n<p><a href=\"http://jstor.org/stable/i387450\">Suñer</a> (1994) \"V-Movement and the Licensing of Argumental Wh-Phrases in Spanish.\" NLLT 12:2.</p>\n", "Id":"238", "ParentId":"236", "CreationDate":"2011-09-17T02:00:35.110", "Score":"5", "PostTypeId":"2", "OwnerUserId":"46", "LastActivityDate":"2011-09-17T02:00:35.110", "OwnerUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}}