{"comments":[], "Body":"<p>Is there a specific question about whether a particular candidate can be considered a phoneme in sign language? Perhaps if you frame your question in terms of the research you've already done on the field (and it <a href=\"http://www.google.com/search?sourceid=chrome&amp;ie=UTF-8&amp;q=sign+language+phonology\" rel=\"nofollow\">doesn't take much to start</a>), people can build on that. That way, you can take advantage of the diverse array of backgrounds here to help you arrive at new knowledge. I feel the way the question is phrased now, it might be banking entirely on one of the 50-or-so private beta-ists on knowing sign language phonology, which might be unlikely.</p>\n\n<p>That being said, what a phoneme is is no different in sign language than in natural language. The fact that word <em>phoneme</em> is derived from a root meaning sound doesn't affect the more abstract meaning that it's taken in academic linguistics. It's the underlying representation of a minimally contrastive unit. If changing the location of a gesture and nothing else changes the semantic meaning produced (in ASL, and all other full sign languages as far as I know), then each location (or some more abstract construct that includes or influences location) is mutually contrastive. If changing the hand shape and unilaterally change the semantic meaning, then each of those shapes are mutually contrastive.</p>\n\n<p>Once we know all the mutually contrastive locations, movements, and hand shapes (and other things), we discover relationships between them and rely on native speaker intuition to wean this down into a candidate list of phonemes, whose compositions can deterministically produce every word in the lexicon. </p>\n", "Id":"239", "ParentId":"237", "CreationDate":"2011-09-17T02:54:04.290", "Score":"4", "PostTypeId":"2", "OwnerUserId":"9", "LastActivityDate":"2011-09-17T02:54:04.290", "OwnerUser":{"UpVotes":"13", "WebsiteUrl":"http://stevenxu.ca", "Id":"9", "AccountId":"69900", "CreationDate":"2011-09-13T20:51:36.750", "AboutMe":"<p>Hi friends! I'm <a href=\"http://stevenxu.ca\" rel=\"nofollow\">Steven Xu</a>. I'm an enthusiastic San Francisco software engineer focused on the Web. </p>\n\n<p>In my spare time, I like to play and coach volleyball and dabble in linguistics, especially phonetics.</p>\n", "Age":"24", "Location":"Canada", "DownVotes":"0", "Views":"74", "Reputation":"1326", "DisplayName":"Steven Xu", "LastAccessDate":"2013-09-27T23:39:20.960"}}