{"Body":"<p><em>(a slightly updated answer)</em></p>\n\n<p>Latin \"lupus\" is usually believed to be a borrowing from Sabellic - PIE *k<sup>w</sup> corresponds to Sabellic (Osco-Umbrian) *p. Other examples of this phenomenon is Latin popina vs. Latin coquina or Latin Pontius vs. Quintius. Another stop in Sabellic borrowings: Latin \"bos\". And then metathesis is usually proposed for Greek \"lykos\".</p>\n\n<p>As for Latin \"vesper\", you might not be seeing a bigger picture. Compare Greek \"hesperos\", Armenian \"gisher\", Hittite \"ispant-\", and Sanskrit \"ksap-\". It has been suggested that the PIE root was *ue(k)spero, a derivative of PIE *kwsep- \"night\", the zero grade *kwsp-, the consonant cluster was simplified in different daughter languages with various outcomes.</p>\n\n<p>Of course, you can dispute the link between Latin \"vesper\" (Greek \"hesperos\" and the rest), on the one hand, and Lithuanian \"vakaras\" and OCS večerъ, on the other hand. OCS večerъ has no clear etymology, and various hypotheses have been proposed. The hypothesis I mentioned above clearly has one weak point: it offers no explanation of what might have happened to \"sp\" in Balto-Slavic; although it was suggested that some sort of taboo was involved there (see Havers 1946, Specht 1944) or possibly another word (Muehlenbach 1923-1932). There is another proposal that OCS večerъ is a not a simplex, but a root *vek- with a suffix erъ (like OCS severъ). Or maybe it is related to Lithuanian ukanas \"cloudy\" and ukti \"overcast\" etc. So, the last two proposals do not posit any connection between OCS večerъ and Latin \"vesper\" (and other comparanda mentioned above). </p>\n\n<p>It's not clear how the hypothesized PIE form *wesk<sup>w</sup>er- would explain the Balto-Slavic data (what happened to *-s-?). Nor it is entirely clear why two roots with the same meaning would exist in PIE.</p>\n\n<p>As for Latin \"quinque\" and PIE *penk<sup>w</sup>e, it is usually suggested that in Italic as well as in Celtic (!) languages *p was assimilated to the following *kw (distance or non-adjacent assimilation). You can find it even in intro textbooks, e.g. Campbell 2004: 29. Another example of this assimilation: PIE *pek<sup>w</sup>- vs. Latin coquina.</p>\n\n<p>You need to understand that in historical linguistics, esp. in etymological research, there is no ultimate theory that explains everything, a theory that cannot be refuted. Quite often several hypotheses coexist, with different degrees of probability. And quite often these hypotheses are ad-hoc, that is they are created to explain one or, at best, a couple of words. This is undesirable but, I'm afraid, unavoidable, at least at the moment.</p>\n", "Id":"2398", "ParentId":"2395", "LastEditorUserId":"445", "CreationDate":"2012-08-08T15:29:39.653", "OwnerUserId":"445", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-08-09T03:41:25.043", "LastEditedUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}, "LastActivityDate":"2012-08-09T03:41:25.043", "Score":"4", "CommentCount":"20", "OwnerUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}}