{"Body":"<p>Most speakers of Brazilian Portuguese (the exception that comes to mind is the dialect spoken in Bahia), when referring to someone in an informal context, use definite articles before the personal name:</p>\n\n<blockquote>\n  <p><strong>A Maria vem amanhã.</strong>\n  <br>DEF Maria comes.3sg.PRES tomorrow\n  <br><em>Maria comes tomorrow.</em></p>\n</blockquote>\n\n<p>But in more formal contexts, such as newspaper articles, for example, the article is not used.</p>\n", "Id":"24", "ParentId":"5", "LastEditorUserId":"136", "CreationDate":"2011-09-13T22:13:18.777", "OwnerUserId":"22", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-16T20:15:35.037", "LastEditedUser":{"UpVotes":"44", "Location":"United States", "DownVotes":"2", "Id":"136", "AccountId":"9694", "Views":"5", "Reputation":"296", "CreationDate":"2011-09-15T00:29:20.830", "DisplayName":"pat", "LastAccessDate":"2013-12-16T02:10:37.907", "AboutMe":"<p>I'm a linguist, so all of the programming that I slog may way through has to do with language or linguistics in one way or another. </p>\n\n<p>I've been programming for a long time but I still feel like I've got a long way to go. But maybe that's how I <em>should</em> feel. :)</p>\n\n<p>I'm a big believer in the idea that just a little technical skill can be very useful for people in many fields. So I spend a fair amount of time trying to explain things like HTML and CSS and perhaps a little Python or something to other people. </p>\n\n<p>If anyone out there is interested in working on open source projects for linguistics, please get in touch.</p>\n\n<p>I have a Github account but it's a bewildering pile of crap right now, I'll try to get around to cleaning that up and then I'll post it here.</p>\n"}, "LastActivityDate":"2011-09-16T20:15:35.037", "Score":"5", "OwnerUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}}