{"comments":[], "Body":"<p>Given the absence of anything that looks like an alternative to the comparative method (and internal reconstruction) in the historical linguistics literature, I think we can safely say that there is no alternative.</p>\n\n<p>The method of mass (or multilateral) comparison is heavily critiqued, but whether one would subscribe to its use or not, it would not pose an alternative to the comparative method. If we take the comparative method as a way of i) establishing genetic relatedness between languages, ii) identifying systematic sound correspondences between them, in order to iii) ultimately arrive at a reconstructed proto-language, then multilateral comparison concerns itself only with the first step.</p>\n\n<p>For example, Greenberg (1996: 131–132):</p>\n\n<blockquote>\n  <p>It seems to be\n  widely  supposed that multilateral comparison and the\n  comparative-historical method are in some way contradictory. This is\n  perhaps most starkly stated by Nichols (1990:477, n. 1) as follows:\n  \"Greenberg (1987) makes it clear that he  believes  such  grouping\n  cannot be  reached by  the  standard comparative method; a wholly \n  different method, mass comparison, is  required.\" Where I supposedly\n  said this is not specified. In fact, just the opposite is stated: \"...\n  my remarks are not intended as an attack on the validity of \n  comparative linguistics  or  on  the  importance of  undertaking\n  reconstruction. Rather, the discussion is meant constructively as a\n  way of taking first steps where the comparative method has not been\n  applied for want of an  assured basis in genetic classification\" (LIA,\n  p.3).</p>\n  \n  <p>I said much the same thing in regard to the relationship between\n  the two much earlier (1957:44),  namely, that the  methods outlined\n  there did not conflict in  any fashion with the traditional\n  comparative method and that they might be viewed as the first step in\n  the method itself, for we cannot begin systematic reconstruction until\n  we know which languages to compare.  Whether classification by\n  multilateral comparison is to be viewed as a necessary preliminary\n  step in order to define valid genetic units without which comparative\n  linguistics cannot proceed or as the first step in the method itself -\n  an alternative which seems more natural - is a matter of  definition.</p>\n</blockquote>\n\n<p>The heart of the dispute then seems to be whether a classification of genetically related languages can be proven by way of multilateral comparison, or whether the relatedness can only be established by identifying systematic sound correspondences and/or a reconstructed proto-langauge. Either way, mass comparison cannot be counted as a full alternative to the comparative method, since it does not address the reconstruction of proto-languages.</p>\n\n<ul>\n<li>Greenberg, Joseph H. 1996. “In Defense of Amerind.” <em>International Journal of American Linguistics</em> 62 (2): 131–164. <a href=\"http://www.jstor.org/stable/1265773\" rel=\"nofollow\">http://www.jstor.org/stable/1265773</a></li>\n</ul>\n", "Id":"2413", "ParentId":"1631", "CreationDate":"2012-08-11T22:45:06.827", "Score":"3", "PostTypeId":"2", "OwnerUserId":"444", "LastActivityDate":"2012-08-11T22:45:06.827", "OwnerUser":{"UpVotes":"127", "WebsiteUrl":"", "Location":"Netherlands", "Id":"444", "DownVotes":"2", "AccountId":"902812", "Views":"19", "Reputation":"934", "CreationDate":"2011-10-23T14:14:27.380", "DisplayName":"arjan", "LastAccessDate":"2014-01-14T14:07:55.473", "AboutMe":""}}