{"Body":"<p>Check out the Punjabi language. Well spoken by the Sikh culture. Many, many, many names are genderless. Only in modern times (past 50–100 years) have there started to exist some names that are more associated with one gender than the other.</p>\n\n<p>This website, <a href=\"http://babynamesworld.parentsconnect.com/category-sikh-names.html\">Baby Names World</a>, would fool you into thinking that's not the case. But I know many people whose names are registered there as female who are male and vice versa.</p>\n\n<p>A Google search for \"Sikh names\" usually leads to results that mention how their names are genderless. The <a href=\"http://en.wikipedia.org/wiki/Sikh_names\">Wikipedia entry</a> says, \"Given names are not in general associated with a particular gender\". If gender is to be indicated people say both their first/given name as well as their middle/last name.</p>\n\n<p>Doing a Google search for the <em>exact phrase of your question</em> led to this <a href=\"http://webcache.googleusercontent.com/search?q=cache%3aK1wVqOwCkakJ%3aanswers.yahoo.com/question/index?qid=20080923085111AAstKzu%20&amp;cd=5&amp;hl=en&amp;ct=clnk&amp;gl=us\">Yahoo question</a> from 2008 that states:</p>\n\n<blockquote>\n  <p>In Chinese it is normal for names to be for both boys and girls, because there isn't a specific group of \"words\" that are only used as names, where you can only choose your name from this group like in the Western World, eg. \"Anna\" isn't a word, but is something that can only be used as a (girl's) name. In Chinese you can use any word or words (max. 2 characters) you like as your name, provided it sounds good and you find it meaningful, just like the names of Native Americans commented above. </p>\n  \n  <p>Of course, names that are flowers are generally girls' names and names with \"strength\" and such themes are generally boys' names, but other words are mostly neutral. In earlier times there was stronger distinction between genders, but today, where \"flower\" names and such are pretty much out of the fashion, you would not immediately know the gender of the person when you read their name. Korean names are also similar in this way.</p>\n</blockquote>\n\n<p>Continuing on my Google search, I found this extremely <a href=\"http://www.slate.com/articles/double_x/doublex/2012/04/hen_sweden_s_new_gender_neutral_pronoun_causes_controversy_.html\">lovely article</a> about how Sweden is trying to pass legislature on allowing parents to give their child <em>any</em> name (like <em>Jack</em> or <em>Lisa</em>), saying that names should not be tied to gender.</p>\n\n<p>So all in all there is at least three distinct groups of languages/cultures (and many more, I'm sure, are tied to these three groups) that either have genderless given names or are advocating for such a goal.</p>\n", "Id":"2419", "ParentId":"2415", "LastEditorUserId":"1255", "CreationDate":"2012-08-14T18:29:22.463", "OwnerUserId":"1255", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-08-14T19:52:41.797", "LastEditedUser":{"UpVotes":"4", "WebsiteUrl":"", "DownVotes":"0", "Id":"1255", "AccountId":"1034626", "Views":"0", "Reputation":"146", "CreationDate":"2012-08-14T18:05:07.390", "DisplayName":"victoroux", "LastAccessDate":"2012-08-24T12:56:49.783", "AboutMe":""}, "LastActivityDate":"2012-08-14T19:52:41.797", "Score":"11", "CommentCount":"3", "OwnerUser":{"UpVotes":"4", "WebsiteUrl":"", "DownVotes":"0", "Id":"1255", "AccountId":"1034626", "Views":"0", "Reputation":"146", "CreationDate":"2012-08-14T18:05:07.390", "DisplayName":"victoroux", "LastAccessDate":"2012-08-24T12:56:49.783", "AboutMe":""}}