{"OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "comments":[], "Body":"<p>[I thought I'd add this answer to cover in a more systematic way some of the points brought up in earlier answers]</p>\n\n<p>The first point to make is that trained phoneticians <em>are</em> able to hear the differences between similar-sounding vowels in different languages, although these are not noticed by casual observers.</p>\n\n<p>Concerning how to make vowel plots,\nthere are, in principle, several ways that a vowel trapezoid could be constructed:</p>\n\n<ol>\n<li>Based on objectively measured articulatory characteristics of the vowels</li>\n<li>Based on <em>proprioceptively</em> assessed articulatory characteristics of the vowels</li>\n<li>Based on auditory characteristics of the vowels</li>\n<li>Based on acoustic characteristics of the vowels</li>\n</ol>\n\n<p>Examples of all four types of vowel plots can be found in <a href=\"http://www.ai.mit.edu/projects/dm/featgeom/lindau78-vowelfeatures.pdf\">Lindau (1978)</a>. The first method has been used in the past with varying methods which would be considered too invasive by today's standards (x-ray motion pictures, placing gold or lead chains, buttons on the tongue, etc.). Modern techniques such as ultrasound or MRI are still used in well-equipped phonetics laboratories, but on whole method (1) is not practical for ordinary descriptions. </p>\n\n<p>Method (2), called the \"Cardinal Vowel\" method, is a bit curious in historical perspective: it requires a phonetician trained in the method to repeat a vowel sound uttered by a native consultant until the phonetician's imitation is nearly perfect, and then to proprioceptively assess his/her tongue position in articulating the vowel (Abercrombie, 1991: 40). What is interesting about this method is that in order to use it you would have to be personally trained by the late Daniel Jones or by one of his students, and this is why it has more or less died out. But to get an idea of how it went, consider a typical description of some vowels in Tswana written by Daniel Jones:</p>\n\n<blockquote>\n  <p>The Sechuana <strong>o</strong> is very nearly cardinal vowel No. 7 (The French sound\n  of <em>ô</em> in <em>tôt</em>); the tongue-position is if anything, a shade lower than\n  this. The sound does not exist in Southern English, but may be heard\n  in the Scottish pronunciation of words like <em>home, go</em>. It must be\n  carefully distinguished from the diphthongs heard in the various\n  English pronunciations of such words. (Jones and Plaatje,\n  1916: xxiv)</p>\n</blockquote>\n\n<p>The third method is rarely done in a strictly controlled way because of the difficulty in measuring auditory properties precisely. It is, however, used informally by phoneticians with a trained ear. Ladefoged has claimed that many phoneticians claiming to use the Cardinal Vowel method were actually using a sort of auditory based method (most likely because it is actually difficult for anyone to feel the position of their tongue body):</p>\n\n<blockquote>\n  <p>. . . after you’ve used a term like tongue height—raise the tongue,\n  lower the tongue, move it to the back or front—you begin to feel that\n  that is what your tongue is actually doing. But you are kidding\n  yourself. This is not really what one does in trying to produce a\n  vowel. (Fromkin, 1985: 5)</p>\n</blockquote>\n\n<p>This leaves, finally, the vowel plot based on acoustic characteristics of vowels. Most vowel plots you will see published today are constructed by measuring the first and second formant values of vowels, and either using these values directly or using some kind of transformation of them (e.g., a derived perceptual scale or a normalized value) in making the plots. The main difference between the vowel plot and the kinds of plots you make in high school algebra is that the axis originates at the upper-right corner. Acoustic \"backness\" is a function of F2 (or F2-F1), and moving to the left corresponds to increasing F2. Acoustic \"height\" is a function of F1, and moving down corresponds to increasing F1. </p>\n\n<p>Software exists for tracking formants, but it is not completely reliable and its results need to be double-checked by a trained phonetician. Fortunately, it is much easier to learn approximate formant values for different vowels than it is to learn how to use the Cardinal Vowel method.</p>\n\n<p>David Abercrombie (1991). \"Daniel Jones's teaching.\" Fifty Years in Phonetics: Selected Papers. Edinburgh University Press. pages 37–47.</p>\n\n<p>Victoria A Fromkin. Introduction. In Victoria A Fromkin, editor, Phonetic Linguistics: Essays in\nhonor of Peter Ladefoged, pages 1–14. Academic Press, Orlando, 1985.</p>\n\n<p>Daniel Jones and Solomon Tshekisho Plaatje. A Sechuana Reader, in international Phonetic\nOrthography (with English Translations). The University of London Press, London, 1916</p>\n", "Id":"2428", "ParentId":"137", "CreationDate":"2012-08-16T14:54:59.957", "Score":"5", "PostTypeId":"2", "OwnerUserId":"483", "LastActivityDate":"2012-08-16T14:54:59.957", "CommentCount":"1"}