{"Body":"<p>It's seldom accurate to say that any sound in one language is \"just like\" a sound in another language.  Among other reasons, most languages are made up of multiple dialects, with significant pronunciation differences between them.  The examples given comparing the Esperanto letter \"ĥ\" to the  Spanish \"J\", as in 'juego, rojo, jota', is only true for a few of the Spanish dialects.  </p>\n\n<p>For Esperanto, almost all speakers learn in their spare time, and use the language as much as they want to, so it is natural that few people have really model pronunciation.  Most speakers strive to pronounce as well as they can, while some don't really care.  Without a lot of practice, it is likely that a person's primary language will influence the pronunciation when speaking another language.  The model pronunciation for Esperanto has been codified, and careful speakers do strive to speak with an \"International Accent\".  One goal is to speak sufficiently like the norm, that other Esperanto speakers can't guess your native language or home country.  </p>\n\n<p>Having said all that, the examples that you have listed for ĝ and ĵ are fine for getting started, as are the distinctions others have listed for \"s\" and \"c\" in Esperanto.  </p>\n\n<p><a href=\"http://en.lernu.net/\" rel=\"nofollow\">lernu!</a> is one of the best learning resources for Esperanto, and it has many sound files available, ranging from the pronunciation of single letters to works of literature.  You will find sound files in multiple locations, including within the lessons in the courses and in the library of texts, sound files, and movies.  </p>\n", "Id":"2431", "ParentId":"2418", "LastEditorUserId":"22", "CreationDate":"2012-08-17T05:05:02.220", "OwnerUserId":"1262", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-08-17T11:33:28.110", "LastEditedUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "LastActivityDate":"2012-08-17T11:33:28.110", "Score":"3", "CommentCount":"3", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1262", "AccountId":"1758235", "Views":"0", "Reputation":"31", "CreationDate":"2012-08-17T05:05:02.220", "DisplayName":"Vere Nekoninda", "LastAccessDate":"2012-08-17T05:05:02.220"}}