{"Body":"<p>We usually refer to the process of producing artificial human speech as <strong>speech synthesis</strong>. A text-to-speech system includes a component called a <strong>speech synthesizer</strong> that takes input in the form of a linguistic representation (that is either provided to it directly by the user or derived from regular text by a front-end component) and produces speech as its output. The verb we can use to describe what it does is <strong>synthesize</strong>, as in, \"That TTS system can <strong>synthesize</strong> speech in seven different languages.\"</p>\n\n<p>Here's <a href=\"http://en.wikipedia.org/wiki/Speech_synthesis\" rel=\"nofollow\">the relevant Wikipedia article</a> if you want to read more about this topic.</p>\n\n<p>***EDIT IN RESPONSE TO @TOOLUKA'S COMMENT BELOW:</p>\n\n<p>Note, though, that there is a deeper issue with how you've framed your inquiry. One example context you gave was \"TTS software reads text, then processes it, then...\", and the other (in your comment below) was \"1) User does this and this; 2) Program <em>_</em> text to the user\". The concepts that fill in these blanks are fundamentally different concepts, because the former is a single sub-process of the TTS's functionality, while the latter encompasses the whole text-to-speech process and includes multiple stages. </p>\n\n<p>For the first context I would say \"The TTS system reads text, processes the text, then <strong>produces synthesized speech</strong>.\" By the time the text has been processed, it is no longer text, so at that last stage the synthesizer is not operating on the text. It's operating on the output of the component(s) of the system that processed the text. Imagine a machine that takes water, flour, and other ingredients and makes it into bread, then slices the bread into slices and stacks them onto a serving plate. It would be strange to say \"the machine mixes the water and flour, bakes the water and flour, then slices the water and flour and stacks them onto a serving plate.\"</p>\n\n<p>For the second context, it seems like you are looking for a single phrase that covers the entire text-to-speech process. To describe this process I would say \"The program <strong>converts text into speech</strong> for the user.\" Unfortunately, I don't think there's a single verb for this process that takes \"text\" as a direct object, but a colleague of mine suggested the playfully derived word <strong>speechify</strong>, as in \"The program <strong>speechifies</strong> text for the user.\" This would be comprehensible to most people, but it isn't appropriate for formal writing. Neither of these phrases, though, can be used with \"to the user\"; the only solution I can think of for that is to personify the TTS system and say that it \"<strong>reads the text aloud</strong> to the user\".</p>\n", "Id":"2433", "ParentId":"2432", "LastEditorUserId":"385", "CreationDate":"2012-08-17T14:33:17.223", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-08-21T12:14:40.913", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2012-08-21T12:14:40.913", "Score":"5", "CommentCount":"7", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}