{"OwnerUser":{"UpVotes":"126", "WebsiteUrl":"http://www.superlinguo.com", "Id":"64", "AccountId":"900445", "CreationDate":"2011-09-13T21:45:12.903", "AboutMe":"<p>I have a PhD in linguistics. My areas of interest include language documentation, Tibeto-Burman linguistics, gesture, language play, LOLspeak, evidentiality and making bad puns. I blog about language and linguistics at www.superlinguo.com</p>\n", "Age":"29", "Location":"Australia", "DownVotes":"6", "Views":"40", "Reputation":"2016", "DisplayName":"LaurenG", "LastAccessDate":"2013-10-26T00:28:12.653"}, "comments":[], "Body":"<p>Using epidemiology as way towards understanding language use and spread is a good start! See \"<a href=\"http://rads.stackoverflow.com/amzn/click/0415297435\" rel=\"nofollow\">Linguistic Epidemiology</a>\" (Amazon link) by Nick Enfield - he's an excellent field linguist using features of epidemiology to look at contact situations.</p>\n\n<p>There are many other ways sociology can help you in field linguistic, at all levels.</p>\n\n<p>Any grammatical description worthy of attention these days will include a fairly detailed description of the social context in which the language is spoken. That includes social dynamics, power structures and other features. </p>\n\n<p>From there, it really depends what you're looking at. These days field linguists can do a whole lot more than just study the grammar of a language. We're also interested in how migration affects language use, or the power relation between the local language and the national language (or even in some cases, the local dialect and the more common one). You may want to look at the rise of the use of small minority languages on the internet, in which case social networking theory might be useful.</p>\n\n<p>You might find there are less direct benefits, for example some areas of sociology put better emphasis on quantitative methods than most linguistics majors do, which might give you a better grounding in statistics, which might help with corpus analysis or phonetic analysis.  </p>\n\n<p>Even if the study of sociology doesn't directly relate to any future linguistic study you do, the grounding in critical thinking, research methodology and the ability to think from the perspective of cultures other than your own are all going to help make you a better linguist!     </p>\n", "Id":"2441", "ParentId":"2440", "CreationDate":"2012-08-19T21:59:05.723", "Score":"3", "PostTypeId":"2", "OwnerUserId":"64", "LastActivityDate":"2012-08-19T21:59:05.723", "CommentCount":"2"}