{"Body":"<p>I will agree with Denis Bouchard that \"pragmatic likeliness is not a measure of grammaticality\". </p>\n\n<p>Yet we can not just speculate on the possibilities of a language based on grammatical ambiguities. For instance, French allows loan words from English, but looking at the following sentence:</p>\n\n<blockquote>\n  <p>Le race car allait à toute speed sur l'highway et s'est crashé avec un big truck.</p>\n</blockquote>\n\n<p>I doubt that with so many nouns, adjectives and verbs borrowed from English,this sentence would be accepted as a correct French sentence, if considered to be French at all.</p>\n\n<p>To figure out what rules adjectival positions, one needs to rely on usage. Although I don't have full-fledged statistical evidence with me (but mere examples from <a href=\"http://books.google.com/ngrams\" rel=\"nofollow\">NGrams</a>), it is clear that in spite of some adjectives allowing pre- as well as post-nominal position, many others are used in either positions only (where the other position remains marginal in usage). For instance:</p>\n\n<ul>\n<li><p>Some adjectives will take either pre- and post-nominal position (<a href=\"http://books.google.com/ngrams/graph?content=un%20ami%20fid%C3%A8le,un%20fid%C3%A8le%20ami&amp;year_start=1800&amp;year_end=2000&amp;corpus=7&amp;smoothing=3\" rel=\"nofollow\">ngrams</a>):</p>\n\n<blockquote>\n  <p><em>un ami fidèle</em> <strong>or</strong> <em>un fidèle ami</em>   </p>\n</blockquote></li>\n<li><p>Some adjectives will take strictly the pre-nomimal position:</p>\n\n<blockquote>\n  <p><em>autre chose</em> <strong>not</strong> <em>chose autre</em></p>\n</blockquote></li>\n<li><p>Some adjectives will take strictly the post-nominal position (<a href=\"http://books.google.com/ngrams/graph?content=un%20vert%20arbre,un%20arbre%20vert&amp;year_start=1800&amp;year_end=2000&amp;corpus=7&amp;smoothing=3\" rel=\"nofollow\">ngrams</a>):</p>\n\n<blockquote>\n  <p><em>un arbre vert</em> <strong>not</strong> <em>un vert arbre</em></p>\n</blockquote></li>\n</ul>\n\n<p>Here we have to make several distinctions:</p>\n\n<ol>\n<li><p>Same adjective usage from homonymic adjective usage:<br>\nThe examples provided in the question (here in French):</p>\n\n<blockquote>\n  <p><em>un homme grand</em> <strong>and</strong> <em>un grand homme</em></p>\n</blockquote>\n\n<p>offer a case of homonymic usage: while the first translates as \"a tall man\", the second translates as \"a great man\". Nevertheless, it is possible for the latter to mean \"tall\" as well as \"great\" depending on the context, e.g. <em>c'est un grand homme mince, dont la tête touche le plafond</em>, \"it's a tall, thin man, whose head touches the sealing\". The same is true in the example provided by Denis, where <em>ancienne église</em> can mean both \"former\" as well as \"ancient\":</p>\n\n<blockquote>\n  <p><em>cette école est une ancienne église</em>, \"this school is a former church\"<br>\n  <em>cette ancienne église date de 1200 AD</em>, \"this ancient church dates 1200 AD\"</p>\n</blockquote>\n\n<p>NB: whilst <em>grand homme</em> relates to <em>homme grand</em> by denoting a figurative sense of the same adjective, it is not true of <em>ancienne église</em>, nor is it true in the case of <em>grande maison</em>, which translates as a \"large house\" and not as a \"great house\".</p></li>\n<li><p>Colloquial usage from literary usage:<br>\nSome adjectives will be found in both pre- and post-nominal positions, whilst keeping the same meaning. Yet the difference would be hinging on style as the examples below reveal: </p>\n\n<blockquote>\n  <p><em>une fleur blanche</em> <strong>and</strong> <em>une blanche fleur</em> (<a href=\"http://books.google.com/ngrams/graph?content=une%20blanche%20fleur,%20une%20fleur%20blanche&amp;year_start=1800&amp;year_end=2000&amp;corpus=7&amp;smoothing=3\" rel=\"nofollow\">ngrams</a>)</p>\n</blockquote>\n\n<p>The first is colloquial and the second literary, it may possibly be found in poems, tales and fancy names only.</p></li>\n</ol>\n\n<p><strong>So what rules adjective order in French?</strong>   </p>\n\n<p>The question hasn't really been answered yet, and I don't see a single rule that can explain all possibilities. I don't claim to hold the entire solution to this problem, but in an effort to explain this feature to students of French languages, I have found several factors that can explain adjectival position:</p>\n\n<ol>\n<li>most adjectives are post-nominal;</li>\n<li>some semantic categories of adjectives determine the position (eg. numbers are pre-nominal);</li>\n<li>some morphological categories of adjectives determine the position (eg. past participles or adjectives in <em>-able</em> are post-nominal);</li>\n<li>some phonetic constraints force an alternative position to facilitate pronunciation (eg. <em>une femme aimable</em>, <em>un homme aimable</em>, <em>une aimable femme</em> but not <em>un aimable homme</em>);</li>\n<li>some adjectives can take a figurative meaning if pre-nominal (eg. <em>un grand homme</em>);</li>\n<li>pre-nominal adjectives usage can be prescriptive and post-nominal descriptive (eg. <em>\"glycosylphosphatidylethanolamine\" est un mot long</em>, <em>\"glycosylphosphatidylethanolamine\" fait partie des longs mots français</em> or cf. <em>c'est un sympa moment</em> i.e. a pre-defined class of \"nice moments\" vs. <em>c'est un moment sympa</em> i.e. a moment that has the quality of being nice);</li>\n<li>pre-nominal adjective usage can emphasise a literary style (see above) or be enunciative (eg. <em>aujourd'hui est un sombre jour dans l'histoire humaine</em> or <em>il s'agit d'un incroyable individu</em>).</li>\n</ol>\n\n<p>If more can be added to complement or challenge this explanation, I'd be glad to read it, as I am not fully satisfied with it myself. Meanwhile I hope it helps.</p>\n", "Id":"2456", "ParentId":"1163", "LastEditorUserId":"682", "CreationDate":"2012-08-23T14:31:16.483", "OwnerUserId":"682", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-09-23T09:35:05.523", "LastEditedUser":{"UpVotes":"11", "WebsiteUrl":"http://stackoverflow.com/users/717441/benjamin", "Id":"682", "AccountId":"369843", "CreationDate":"2012-01-17T21:01:13.080", "AboutMe":"<p>As a student in South Asian languages, culture and history, specialising in comparative cultures and cognitive science, I take special interest in the influence of cultural paradigms in the perception and interaction with the world in terms of development.\nI am also a polyglot with a strong passion for learning languages, including programming languages such as Python. Also I am firm supporter of unix and free software.</p>\n", "Age":"33", "Location":"Earth", "DownVotes":"1", "Views":"3", "Reputation":"273", "DisplayName":"Benjamin", "LastAccessDate":"2012-10-11T07:58:22.963"}, "LastActivityDate":"2012-09-23T09:35:05.523", "Score":"4", "CommentCount":"5", "OwnerUser":{"UpVotes":"11", "WebsiteUrl":"http://stackoverflow.com/users/717441/benjamin", "Id":"682", "AccountId":"369843", "CreationDate":"2012-01-17T21:01:13.080", "AboutMe":"<p>As a student in South Asian languages, culture and history, specialising in comparative cultures and cognitive science, I take special interest in the influence of cultural paradigms in the perception and interaction with the world in terms of development.\nI am also a polyglot with a strong passion for learning languages, including programming languages such as Python. Also I am firm supporter of unix and free software.</p>\n", "Age":"33", "Location":"Earth", "DownVotes":"1", "Views":"3", "Reputation":"273", "DisplayName":"Benjamin", "LastAccessDate":"2012-10-11T07:58:22.963"}}