{"Body":"<p>I've heard of something, which is not the answer your looking for but nonetheless related and which I thought might be interesting, called the cohort model from my first year linguistics text (O'Grady's <a href=\"http://www.amazon.ca/Contemporary-Linguistic-Analysis-William-OGrady/dp/0321476662/ref=sr_1_3?s=books&amp;ie=UTF8&amp;qid=1345823827&amp;sr=1-3\" rel=\"nofollow\">Contemporary Linguistic Analysis</a> 6th ed):</p>\n\n<blockquote>This model states that, in comprehension, words are analyzed by hearers from beginning to end. So for example, when we hear the word glass we initially consider all the words that begin with with the sound [ɡ]. When the next sound [l] is recognized, the number of possible words (the cohort) is reduced to those words that begin with [ɡl]. This process continues until the cohort of possible words is reduced to one - the word being recognized.</blockquote>\n\n<p>I thought I saw somewhere else in the book the same \"cohort\" notion being used for something like the set of possible syntactic structures given a partially complete phrase, but I guess I was mistaken in that.</p>\n\n<p>I only mean to say that \"a smallest set of words that need to be placed after a given word to complete the meaning of a phrase\" can be thought of as an element of something like a  cohort. If you think of a cohort as the set of all words and their syntactic configurations (in a conceptually similar way to the use above) that <i>could</i> be placed after a given word to complete the meaning of a phrase, then \"the minimal number of words that need to be placed after a given word\" would be found by making equivalence classes on the cohort by equating n-tuples of words having similar syntactic structure and then noting the smallest n. So, for example, some equivalence class has the elements {(he, car, drive), (she, book, buy), (they, baby, raise), ...} with element length 3 and which is smaller than the equivalence class {(he, car, drive, they), (she, book, buy, they), (they, baby, raise, they), ...} with element length 4.</p>\n", "Id":"2461", "ParentId":"1121", "LastEditorUserId":"1162", "CreationDate":"2012-08-24T16:06:14.547", "OwnerUserId":"1162", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-08-27T01:17:59.890", "LastEditedUser":{"UpVotes":"23", "DownVotes":"0", "Id":"1162", "AccountId":"1586391", "Views":"2", "Reputation":"286", "CreationDate":"2012-07-04T22:46:56.807", "DisplayName":"taylor", "LastAccessDate":"2013-05-10T17:08:44.560"}, "LastActivityDate":"2012-08-27T01:17:59.890", "Score":"1", "CommentCount":"2", "OwnerUser":{"UpVotes":"23", "DownVotes":"0", "Id":"1162", "AccountId":"1586391", "Views":"2", "Reputation":"286", "CreationDate":"2012-07-04T22:46:56.807", "DisplayName":"taylor", "LastAccessDate":"2013-05-10T17:08:44.560"}}