{"Body":"<p>In spoken language \"ah\" is an interjection. It is simply an arbitrary, nonsense, semi-involuntary sound that people make to express surprise, excitement, understanding, etc. I say arbitrary since, in my experience, the choice of interjection varies slightly along with other linguistic and sociolinguistic factors. For example, the stereotypical Japanese equivalent of the English \"ah\" seems to be closer to \"eh/ey\" while the Korean seems to be closer to \"uh\". Also note that the other sounds such as \"oh\", \"aw\", or \"heh\" would have resulted in no change to meaning what-so-ever. I say nonsense because, although it is not vacuous in meaning, it is extragrammatical and context dependent. I say involuntary because \"ah\" is not a word in the same sense that \"apple\" is a word, it is a sound that the body makes almost reflexively in response to certain stimuli (such as saying \"ow\" when hurt, or the act of laughing).</p>\n\n<p>\"Ah\" as a written word is a different matter all together.  \"Ah\" the written word is simply a phonetic approximation of \"ah\" the sound/interjection, remembering that \"ah\" the interjection has special status as a word and is semi-involuntary. It is in that respect that \"ah\" the written word is onomatopoeic.</p>\n\n<p>While the top rated response to <a href=\"http://answers.yahoo.com/question/index?qid=20100730100800AAOdW0D\" rel=\"nofollow\">this Yahoo! Answers question</a> shows confusion as to the definition of onomatopoeia (confusing it with interjection), the second response was useful to me in understanding the problem. </p>\n", "Id":"2465", "ParentId":"2464", "LastEditorUserId":"1055", "CreationDate":"2012-08-26T03:58:24.387", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-08-26T04:13:01.533", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2012-08-26T04:13:01.533", "Score":"1", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}