{"Body":"<p>Greenberg's four major African language families are Niger-Kordofanian, Afro-Asiatic, Nilo-Saharan and Khoisan. </p>\n\n<p>When he says that \"...the few proposals cutting across my four basic groups have received no general support,\" this would be an accurate statement today, as it was in 1989: There haven't been any well-received proposals for language families which <strong>crosscut</strong> members of Greenberg's four families. e.g., there is nothing like a proposal for a family which groups together the Chadic languages (Greenberg's Afroasiatic) and the Benue-Congo languages (Greenberg's Niger-Kordofanian).</p>\n\n<p>However, when he claims that \"[a]ll disputes have been at the level of subgroupings,\" this would not be correct today, though it may have been in 1989. Concerning the first three families (Niger-Kordofanian, Afroasiatic and Nilo-Saharan), disputes about these <strong>have</strong> usually been about subgroupings: e.g., Atantic may not be a branch of Niger-Congo, etc. However, concerning Khoisan,\ndisputes have not been about subgroupings, but about the coherence of the whole family itself. As for Khoisan, there <strong>is</strong> a dispute about the basic coherence of the family as a whole, and most Africanists no longer believe that Khoisan is a proper genetic unit, although the term \"Khoisan\" is still used to refer to something like \"the click languages in southern Africa\". For discussion on the problems of Greenberg's Khoisan, and new proposed groupings for the languages formerly classified as Khoisan, see <a href=\"http://email.eva.mpg.de/~gueldema/pdf/GreenbergKhoisan.pdf\" rel=\"nofollow\">Gueldemann (2008)</a>.</p>\n\n<p>It might be added that of Greenberg's works on language classification, that of the African languages is the only one which has been successful as far as being adopted in a very similar form by the majority of practicing linguists today. His proposals for languages of the Americas and his Indo-Pacific hypothesis have never been truly taken seriously.</p>\n", "Id":"2470", "ParentId":"2469", "LastEditorUserId":"483", "CreationDate":"2012-08-28T12:45:39.107", "OwnerUserId":"483", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-08-28T19:25:33.240", "LastEditedUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "LastActivityDate":"2012-08-28T19:25:33.240", "Score":"6", "CommentCount":"5", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}