{"Body":"<p>The initial question is asking two very different questions. One is what languages have a grammar/syntax easy to parse. Another is could computer programs extract meaning from the content that they parse.</p>\n\n<p>With regards to question 1, @Nick Anderegg is correct. English is as good as any other language as its grammar is fixed / parsable. Sure, you have ambiguities that prevent complete determinism. With natural languages,an input can sometimes lead to different interpretations. For instance because some token can be words or verbs. Two approaches. One you stick to a simplified version of the language. </p>\n\n<p>Hypertalk was a computer language using simplified english:</p>\n\n<pre><code>put \"100,100\" into pos\nrepeat with x = 1 to the number of card buttons\n  set the location of card button x to pos\n  add 15 to item 1 of pos\nend repeat\n</code></pre>\n\n<p>More recently, [isla][1], a computer language for young children</p>\n\n<pre><code>my name is 'Mary'\nmy summary is 'You are a boy. You have no shoes.'\nhallway is a room\nhallway summary is 'A candle burns on a table.'\n</code></pre>\n\n<p>If you take the approach to simplify, then the natural language that your computer language is inspired from is somewhat irrelevant. You can \"translate\" the rules to adapt to the patterns used in other natural languages. In javascript, the <a href=\"http://fhtr.org/js-i18n/\" rel=\"nofollow\">JS-i18n</a> project proposed to translate the javascript syntax to a developer's native language.</p>\n\n<p>Another way around the parsing ambiguity problem is to add a few rules that removes these ambiguities. For instance, you force the user to clarify the role for each token (talk as Verb vs talk as Noun). The initial question then becomes  could you find some natural languages that could be parsed with 100% accuracy with no rule added?</p>\n\n<p>The second question is what human language would the the easiest for a computer easily extract meaning from (cf. \"meaningful relationships\"). Computer languages are not designed to extract meaning. Computer languages execute one instruction (program statement) at a time. They don't need to know the meaning/intent of the block that they are part of. Dependencies, preconditions, logical inference, etc., yes. Understanding of the meaning (which often depends on an understanding of the greater context), no. </p>\n\n<p>You can write computer programs that extract very complex patterns from natural languages. But that doesn't meant that they \"understand\" what you say. Google translate or Siri are great pieces of software, however they don't really actually understand you. Many computer programs that appear to process language the way we do rely on extraction of patterns instead of extraction of meaning. They can produce frustrating or hilarious results with [people with accents][3]. Good coverage of issues and current solutions in this presentation on \"[Can computers understand our language?][4]\"</p>\n\n<p>Back to the Turing's Chinese Room. Is displaying a performance close to the human one evidence that the program does it the way human do it? If you look at the latest Loebner's prize (2012), the level of conversation that chatbot achieve are far from being in par with humans:</p>\n\n<pre><code>Judge: Where did you go to school? \nChip: I wasn't aware that I told you I went somewhere. I found out though, that majority of the students in Japan don't pursue tertiary education anymore. They can already work right after graduating from high school. \nJudge: Are you Japanese? \nChip: I haven't achieved self-awareness yet, so I'm not sure. \nJudge: Why not ask somebody? \nChip: No idea. \nJudge: Why not ask me? \nChip: Okay. \nJudge: Well, I think you may be Japanese - you are very respectful and polite \nChip: That's an interesting opinion\n</code></pre>\n\n<p>Base line. The word language means \"a system of communication\". Human/Natural Languages and Computer Languages both contain the word \"Language\" but they have very different purposes. </p>\n\n<blockquote>\n  <p>\"A programming language is an artificial language designed to express computations that can be performed by a machine, particularly a computer.\" (source: [codeproject][5])</p>\n</blockquote>\n\n<p>If you want to design a good computer language, then don't look at natural languages for inspiration! If you want to create a computer languages that is easy to learn, straightforward to use, then go visual, the way [scratch][6] did. A javascript equivalent, <a href=\"http://www.readwriteweb.com/hack/2011/05/waterbear-is-like-scratch-but.php\" rel=\"nofollow\">watebear</a> will let you create your custom micro-language that follows the syntactic patterns of [any natural language][8]. You are then considering a 4th or 5th generation programming language (4GL/5GL)</p>\n\n<blockquote>\n  <p>5GL or fifth-generation language is programming that uses a visual or graphical development interface to create source language that is usually compiled with a 3GL or 4GL language compiler.  (source: [programming languages generation][9])</p>\n</blockquote>\n\n<p>4GL/5GL are typically used to implement domain specific languages. If you want a more general purpose language, then you will have to be get further away from natural languages. You go from 4GL to [3GL or less][10]. The closer to 1GL, the closer the language syntax is from the machine code and the faster it is to execute. However, it also is more difficult for humans to modify. These different generations are described in some details in this article on [programming languages][11] </p>\n\n<p>(Some links missing... spam prevention, no more than 2 hyperlinks)</p>\n", "Id":"2506", "ParentId":"1697", "LastEditorUserId":"1300", "CreationDate":"2012-09-01T12:15:02.827", "OwnerUserId":"1300", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-09-01T13:58:59.840", "LastEditedUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1300", "AccountId":"1802369", "Views":"0", "Reputation":"11", "CreationDate":"2012-09-01T10:23:58.813", "DisplayName":"widged", "LastAccessDate":"2012-09-01T13:56:48.237"}, "LastActivityDate":"2012-09-01T13:58:59.840", "Score":"0", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1300", "AccountId":"1802369", "Views":"0", "Reputation":"11", "CreationDate":"2012-09-01T10:23:58.813", "DisplayName":"widged", "LastAccessDate":"2012-09-01T13:56:48.237"}}