{"comments":[], "Body":"<p>[This should be a comment, but I need room].</p>\n\n<p>As remarked earlier, this feature is shared by French. I'll use French examples, because I'm sure to produce correct and idiomatic sentences in this language.</p>\n\n<p>The rule we are talking about has two aspects:</p>\n\n<ul>\n<li><p>When the compound tense is built with “to be“ [essere / être], there is agreement between the past participle and the subject. When the tense is built with “to have” [avere / avoir], the agreement, <strong>if any</strong> is between the direct object and the participle.</p></li>\n<li><p>In the “have“-case, there is agreement if and only if the direct object precedes the verb.</p></li>\n</ul>\n\n<p>Some examples :</p>\n\n<blockquote>\n  <p><em>Marie est venue.</em>  (Marie has come.)</p>\n  \n  <p><em>J'ai mangé une pomme</em> (I've eaten an apple.)</p>\n  \n  <p><em>La pomme que j'ai mangée était verte.</em> (The apple I've eaten was green.)</p>\n</blockquote>\n\n<p>My point is that the first part of the rule is perfectly logical. The choice of the auxiliary verb (to be vs. to have) depends on the verb you're conjugating. (Very) roughly speaking, transitive verbs use “to have“ and intransitive verbs use “to be“. Let's also remember that, taken in isolation, the participles of transitive verbs are adjectives. When I eat an apple, what's eaten is the apple, not me, so the agreement with the subject would really be weird. In the other case, agreement with the subject makes sense (in some cases, it is even hard to tell if we're dealing with a verb at a compound tense or with “to be + adjective“; for example « <em>Jean est mort</em> » can mean both “Jean is dead” and “Jean has died.”)</p>\n\n<p>The second part of the rule (and all the subtleties I've hidden [pronominal verbs, special constructions with « <em>voir</em> », « <em>faire</em> », « <em>laisser</em> »...], which are very complicated and largely ignored even by native speakers) is indeed much more artificial. It's also noteworthy that before grammar was taught in schools, there was a lot of variation concerning this part of the rule. Voltaire, for example, systematically left the past participle without agreement (he would have written “La pomme que j'ai mangé était verte.”) [Chervel's <em>Et il fallut apprendre à écrire à tous les petits Français</em>, a marvelous book about the history of school grammar, even makes the case that the development of school grammar was in no small part motivated by this question of the « <em>accord avec l'auxilliaire avoir</em> »]</p>\n\n<p>There are other cases where French grammar asks for an agreement if and only if the part that triggers the agreement comes first, but they are mostly unimportant peculiarities. For example, “barefoot“ is « nu-pieds » or « pieds nus », you write « <em>une heure et demie</em> » (an hour and a half) but « <em>une demi-heure</em> » (a half-hour)... (To be perfectly honest, I wonder how many native francophones know about these rules...) So we could say that, while peculiar, even this artificial part of the rule belongs to some logical framework (but as the other examples are even weirder than the rule we're discussing, this argument doesn't sound very convincing).</p>\n\n<p>A final comment: this rule is very often infringed in speech, even among educated speakers (with a very large tendency to left the participle uninflected). Interstingly, women (who have to apply it in sentences like « <em>Il m'a remise à ma place</em> » = “he put me in my place” ; a man would say « <em>remis</em> ») tend to respect the rule more carefully than men.</p>\n", "Id":"2530", "ParentId":"2136", "CreationDate":"2012-09-06T13:29:29.473", "Score":"3", "PostTypeId":"2", "OwnerUserId":"189", "LastActivityDate":"2012-09-06T13:29:29.473", "OwnerUser":{"UpVotes":"30", "WebsiteUrl":"", "DownVotes":"1", "Id":"189", "AccountId":"924492", "Views":"4", "Reputation":"295", "CreationDate":"2011-09-20T19:36:05.183", "DisplayName":"JPP", "LastAccessDate":"2012-11-14T01:20:48.150", "AboutMe":"<p>My first language is <a href=\"http://en.wikipedia.org/wiki/French_language\" rel=\"nofollow\">some dialect of Latin</a>.</p>\n\n<p>My last language is <a href=\"https://en.wikipedia.org/wiki/T%C3%BCbatulabal_language\" rel=\"nofollow\">Tübatulabal</a> (<em>ex æquo</em>).</p>\n", "Age":"37"}}