{"OwnerUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}, "comments":[], "Body":"<p>There are a number of examples known of tonal systems being lost in daughter languages, a couple are described below. Given that it is thought that the majority of the world's languages make use of some kind of tonal contrast in their phonology, that tone seems to be a feature likely to be conserved diachronically, and that tonogenesis seems to happen fairly readily, we shouldn't expect there to be many examples of the loss of tone.</p>\n\n<p>According to <a href=\"http://www.ddl.ish-lyon.cnrs.fr/aalled/Univ_ete/3LCourseMaterial/African%20%28Cushitic%29%20topics%20-%20M.%20Mous/Downing.pdf\" rel=\"nofollow\">Downing (2004)</a> proto-Bantu is reconstructed as having had two tones. While most present-day Bantu languages have tonal contrasts a few have lost them, retaining only a stress system, eg Chimwi:ni, Kituba, Nyakyusa and Swahili.</p>\n\n<p>It has been argued by Indo-Europeanist scholars (including <a href=\"http://www.utexas.edu/cola/centers/lrc/books/piep15.html\" rel=\"nofollow\">Christian Lehmann</a>) that an early stage of proto-Indo-European had a pitch-accent system which was lost in most daughter branches. It was preserved into Ancient Greek (although lost in Modern Greek) and continues in present-day Lithuanian and some Slavic <a href=\"http://en.wikipedia.org/wiki/Proto-Indo-European_accent\" rel=\"nofollow\">languages</a>. The tone systems found in some North Germanic languages are thought to be relatively recent innovations.</p>\n", "Id":"2543", "ParentId":"2532", "CreationDate":"2012-09-08T12:49:13.283", "Score":"4", "PostTypeId":"2", "OwnerUserId":"363", "LastActivityDate":"2012-09-08T12:49:13.283", "CommentCount":"2"}