{"Body":"<p>The examples given in GastonUmlaut's answer are sufficient, so I want to only add a note addressing the main methodological issue here. It concerns the relative strengths of historical factors and biological factors in typology. We can say, simplifying things, that a language is the way it is because:</p>\n\n<ol>\n<li>It is a reproduction of an earlier stage of the language (Historical factors)</li>\n<li>It must be learnable and usable by humans (Biological factors)</li>\n</ol>\n\n<p>A large number of biological factors have been identified by comparative studies in phonology, morphology and syntax. To give a few examples: voiced fricatives are dispreferred because they are more difficult to produce than voiceless fricatives; suffixes are preferred over prefixes, probably because this facilitates processing, and a consistent head--modifier ordering between verbs and objects, and between adpositions and their objects, is also preferred for processing reasons. </p>\n\n<p>However, these biological factors are necessarily weak when compared to historical factors. If the factor disfavoring voiced fricatives were strong, then it would be simply too difficult for humans to learn to incorporate this kind of sound into running speech, and no language would have them. </p>\n\n<p>Now if biological factors is discovered which is different across human populations, we would expect for it to be weak compared to historical factors, because so far there is no evidence that any human population is <strong>constitutionally unable</strong> to learn some other's language.</p>\n\n<p>I think if this point is kept in mind then Dedieu &amp; Ladd's finding should not be especially controversial, since it is not at all surprising that there are minor genetic differences across human populations.</p>\n", "Id":"2544", "ParentId":"2532", "LastEditorUserId":"363", "CreationDate":"2012-09-08T16:02:57.857", "OwnerUserId":"483", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-09-08T23:40:30.180", "LastEditedUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}, "LastActivityDate":"2012-09-08T23:40:30.180", "Score":"3", "CommentCount":"1", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}