{"Body":"<p>Korean arguably fits the bill as a language with both a high amount of homophones and a highly phonetic writing system.</p>\n\n<p>I will start with the writing system since it is the most cut and dry. <a href=\"http://en.wikipedia.org/wiki/Hangul\" rel=\"nofollow\">Hangul</a> is by far the most common writing system in Korean. Spelling adheres closely to pronunciation with a few exceptions. It should be noted, however, that those exceptions are all regular. That is, knowing a small handful of pronunciation rules you can reliably produce a faithful pronunciation of a word from written form alone. Some of these rules include nasal assimilation of approximates when preceded by a nasal (as in 종로, literally <em>jong-ro</em>, a district in Seoul, but actually pronounced as <em>jong-no</em>), and neutralization of codas (받, 밭, 밧, and 밪, literally <em>bat</em>, <em>bath</em>, <em>bas</em>, and <em>bac</em> respectively, are all pronounced as <em>bat</em> due to neutralization).</p>\n\n<p>Hangul is kept highly phonetic by occasional revisions to Korean spelling to match modern pronunciation (<em>note</em>: I was unable to find an appropriate citation for this. This is what my sociolinguistics professor told me.). I believe the last such update was in the 1950s.</p>\n\n<p>North Korea uses Hangul exclusively however South Korea does have a second writing system, <a href=\"http://en.wikipedia.org/wiki/Hanja\" rel=\"nofollow\">Hanja</a>, which is basically Traditional Chinese characters (with some variation, but less than Kanji or Simplified Chinese). This system predates Hangul as before Hangul's invention Koreans wrote using Chinese characters. It should be noted that these days Hanja is almost exclusively used in TV news and newspapers (mostly for disambiguation), as well as for artistic purposes (store signs, calligraphy, etc.).</p>\n\n<p>The relatively recent invention of Hangul combined with the existence and use of the Hanja writing system is what makes the statement \"Korean uses a highly phonetic writing system\" debatable. However from my experience living in Korea and learning the language I would argue that since Hanja is used only in limited context (you will never see a sentence written entirely in Hanja, if only because all Hanja-based verbs and adjectives must end in 하다, <em>ha-ta</em>, dictionary form of \"to do\", which is pure Korean), it does have a highly phonetic writing system.</p>\n\n<p>Second, the statement that Korean has a <a href=\"http://www.lexiophiles.com/english/korean-homophones\" rel=\"nofollow\">high level of homophone</a> (<em>note</em>: forgive the non-academic source). It should be noted that this statement too is <a href=\"http://seedyroad.com/academics/JournalOfLinguistics-46-453-482.pdf\" rel=\"nofollow\">up for debate</a> as, amongst other reasons, homophone usually does not create ambiguity when viewed in context. Much of Korean vocabulary, especially written and formal vocabulary, is adopted from Chinese (much like English uses French/Latin vocabulary). Given the relatively small sets of phonemes in Chinese and the fact that Korean is not tonal and thus can't differentiate through tones, this leaves many sets of words with identical spellings and thus pronunciations.</p>\n\n<p>Common examples include lexical items like:</p>\n\n<blockquote>\n  <p><strong>매매</strong> - <em>mae-mae</em> - 賣買 - literally \"buying and selling\"<br>\n  <strong>수상</strong> - <em>swu-sang</em> - 1) 受賞 - winning a prize, 2) 授賞 - awarding a prize (somewhat archaic)<br>\n  <strong>기타</strong> - <em>ki-tha</em> - 1) guitar (English loanword), 2) 其他 - other, the rest  </p>\n</blockquote>\n\n<p>\nAnd my personal favourite,</p>\n\n<blockquote>\n  <p><strong>시간</strong> - <em>si-kan</em> - 1) 時間 - an hour, time, 2) 屍姦 - necrophilia (definitely <strong>not</strong> in common usage)</p>\n</blockquote>\n\n<p>As well as full sentences such as:</p>\n\n<blockquote>\n  <p>아이가 방에 있어<br>\n  ai-ka bang-ey iss-a<br>\n  child-SUB room-LOC exist-INFORMAL<br>\n  The child is in [his] room.  </p>\n</blockquote>\n\n<p></p>\n\n<blockquote>\n  <p>아이 가방에 있어<br>\n  ai kabang-ey iss-a<br>\n  child bag-LOC exist-INFORMAL<br>\n  The child is in the bag.  </p>\n</blockquote>\n\n<p>Technically these two differ by the voicing on \"ka\" (voiced in the first, unvoiced in the second) but Korean does not differentiate consonants based on voicing and spoken at a conversational speed they sound identical.</p>\n", "Id":"2548", "ParentId":"2547", "LastEditorUserId":"1055", "CreationDate":"2012-09-09T15:21:25.883", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-09-09T17:29:34.960", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2012-09-09T17:29:34.960", "Score":"5", "CommentCount":"5", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}