{"Body":"<p>A possible answer may be Mongolian. Alphabets used are: Mongolian script (traditional, Galik, Vagindra, Todo), Phags-pha, Soyombo, Chinese Hanzi, Arabic, Latin, Cyrillic.</p>\n\n<p><a href=\"http://en.wikipedia.org/wiki/Mongolian_alphabet\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Mongolian_alphabet</a></p>\n\n<p>Mongolian in literature involved a lot of vocabulary originated from foreign languages like Sanskrit, Tibetan and Chinese which is why Galik alphabets where used at the time. However, everyday Mongolian uses most of these alphabets, because some dialects like Khalkha (official dialect of Mongolia) uses sounds not originally inclusive in the traditional script. Vagindra is the name for the Mongolian script with Buryat dialect-specific alphabets while Todo or Clear script is the one for Oirat dialects. Vagindra had been used and Todo is still officially used in Mongol autonomies in Xinjiang.</p>\n\n<p>Phags-pha was created by a Tibetan scholar in service of Kublai Khan. It was created on a decree by the Khan. This script was intended to be used officially by the Mongols. However, it had only been used extensively in the court thus there are a lot of documents written in Phags-pha. The alphabets are still used in Mongolia and Tibet for decorative, artistic and religious purposes.</p>\n\n<p>Soyombo was created by Zanabazar, a noble khutagt. Late Bogd Khan of Mongolia was the last reincarnated avatar of him. The script is still used extensively in the temples. Also, the first letter in the alphabet made national symbol for Mongolia.</p>\n\n<p>It is evident that Chinese Hanzi was used for writing Mongolian by transliterating the language. A famous book from the Middle Ages (The Secret History of the Mongols) was first found in a Mongolian edition written using Chinese Hanzi characters.</p>\n\n<p>Arabic and Persian alphabets where used by the Mongol Empire's presence in the Middle East and the later Ilkhanate dynasty. There are many written documents including stamps and paizs (modern-day passport) issued by Mongol khans and nobles and letters to Pope and other European entities.</p>\n", "Id":"2570", "ParentId":"1883", "LastEditorUserId":"425", "CreationDate":"2012-09-18T08:29:23.170", "OwnerUserId":"425", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-09-19T15:02:03.777", "LastEditedUser":{"UpVotes":"2", "WebsiteUrl":"http://dagvadorj.blogspot.com", "DownVotes":"0", "Id":"425", "AccountId":"72399", "Views":"0", "Reputation":"128", "CreationDate":"2011-10-15T17:35:46.773", "DisplayName":"Dagvadorj", "LastAccessDate":"2013-12-17T10:03:22.937"}, "LastActivityDate":"2012-09-19T15:02:03.777", "Score":"3", "CommentCount":"5", "OwnerUser":{"UpVotes":"2", "WebsiteUrl":"http://dagvadorj.blogspot.com", "DownVotes":"0", "Id":"425", "AccountId":"72399", "Views":"0", "Reputation":"128", "CreationDate":"2011-10-15T17:35:46.773", "DisplayName":"Dagvadorj", "LastAccessDate":"2013-12-17T10:03:22.937"}}