{"Body":"<p>General and fairly short answer: Indo-European languages generally have two tenses: past and non-past. The non-past (what you call the present) can be used for the future, though depending on the language other means might be preferable when speaking about the future, e.g. English prefers to use an irrealis mood marked by the modal verb \"will\" (which, I might add, can also be used for the present and past, e.g. \"He'll be there by now\" and \"He would [past tense form of will] go later\"). But you can also use the plain non-past tense in some situations, such as where a future seems tangibly close, e.g. \"The sale begins tomorrow\".</p>\n\n<p>It's also worth noting that while in English tense and aspect are relatively orthogonal (two tenses x three aspects) other Indo-European languages might be more complicated. E.g. Proto-Indo-European had only four tense-aspect combinations: stative (would become the perfect), perfective (aorist), and past and non-past imperfective (imperfect and \"present\", respectively). In such a case the future would probably use either the perfective or the subjunctive mood, rather than the \"present\". It's very possible this system (or mutations) exists in some modern Indo-European languages.</p>\n", "Id":"2598", "ParentId":"2593", "LastEditorUserId":"1097", "CreationDate":"2012-09-22T18:35:23.000", "OwnerUserId":"1097", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-09-22T18:49:43.590", "LastEditedUser":{"UpVotes":"1", "WebsiteUrl":"https://twitter.com/#!/JustinOlbrantz", "DownVotes":"0", "Id":"1097", "AccountId":"1561933", "Views":"12", "Reputation":"470", "CreationDate":"2012-06-12T15:27:45.637", "DisplayName":"Justin Olbrantz", "LastAccessDate":"2014-01-19T02:48:30.797"}, "LastActivityDate":"2012-09-22T18:49:43.590", "Score":"5", "CommentCount":"4", "OwnerUser":{"UpVotes":"1", "WebsiteUrl":"https://twitter.com/#!/JustinOlbrantz", "DownVotes":"0", "Id":"1097", "AccountId":"1561933", "Views":"12", "Reputation":"470", "CreationDate":"2012-06-12T15:27:45.637", "DisplayName":"Justin Olbrantz", "LastAccessDate":"2014-01-19T02:48:30.797"}}