{"comments":[], "Body":"<p>I was thinking about your \"The Dark Knight Rises\" example and I was thinking \"well, if it was properly capitalized then it's obvious that it's a title of something.\" Then I thought \"but it wasn't capitalized and I still knew. How can I tell it's a title, even if I didn't have real world knowledge that it's a movie?\"</p>\n\n<p>One of the ways I can tell it's a title is because of the way it's embedded in sentence. On the surface it's an embedded CP but it is taking the place of a DP. That got me thinking about how syntax might help you.</p>\n\n<p>I think you should read about the double object construction. The current view of double objects was first put forth in <a href=\"http://www.jstor.org/discover/10.2307/25164901?uid=2&amp;uid=4&amp;sid=21101218033001\" rel=\"nofollow\">\"On Double Object Construction\" by Larson (1988)</a>. I can't find a full version online for free but <a href=\"http://www.bcs.rochester.edu/cls/s2001v2n1/runner_urwpls_v2n1.pdf\" rel=\"nofollow\">these lecture notes</a> that I found should give you the main ideas.</p>\n\n<p>If you generate a syntax tree it should be easy to pick out the arguments you want. Although I have never used it before today, I've been playing around with <a href=\"http://nlp.stanford.edu/software/lex-parser.shtml\" rel=\"nofollow\">the Standford Parser</a> and it looks like you might be able to adapt it to your needs.</p>\n\n<p>Incidentally, the Stanford Parser was able to identify \"the dark knight rises\" as an NP:</p>\n\n<pre><code>(ROOT\n  (SBARQ\n    (WHADVP (WRB when))\n    (SQ (VBZ does)\n      (NP (DT the) (JJ dark) (NN knight) (NNS rises))\n      (VP (VB come)\n        (PRT (RP out))))\n    (. ?)))\n</code></pre>\n", "Id":"2633", "ParentId":"2626", "CreationDate":"2012-09-29T08:28:08.273", "Score":"1", "PostTypeId":"2", "OwnerUserId":"1055", "LastActivityDate":"2012-09-29T08:28:08.273", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}