{"OwnerUser":{"UpVotes":"14", "WebsiteUrl":"", "DownVotes":"5", "Id":"1380", "AccountId":"1907225", "Views":"8", "Reputation":"529", "CreationDate":"2012-10-05T03:06:16.113", "DisplayName":"Fryie", "LastAccessDate":"2014-01-09T09:48:02.760", "AboutMe":"", "Age":"26"}, "comments":[], "Body":"<p>While I agree with the comment to your post that this cannot be done perfectly (or even near perfectly) unless computers get a lot better at \"understanding\" meaning, I'd still say there are a number of heuristics you'd be able to use. Of course, putting them together in a way that it yields useful results would mean a lot of trial and error; actually it might be simpler to use machine learning techniques than to try to hand-craft specific rules. Also consider that you have to be explicit about what you mean by <em>Topic</em>. It is one of those terms that has been used so often, by so many different scholars, that you cannot be sure what it actually means unless you try to provide a precise definition.</p>\n\n<p>That said, here are some patterns I would try to look for:</p>\n\n<ul>\n<li>Pronouns tend to be topics more often than full noun phrases, determinate noun phrases more often than indeterminate ones.</li>\n<li>Topics are often high on the animacy hierarchy.</li>\n<li>Sometimes, special constructions are used to highlight the topic of a sentence. In English, you can use <em>topicalization</em> where you just put the topical element at the front of the clause (which becomes apparent, when it is not the subject - e.g. \"<em>Him</em> I saw yesterday\"), but there are also other strategies, like using the \"as for\" construction.</li>\n<li>Topics are often continued across sentences, and when the topic is switched we also resort to a number of strategies to make that clear.</li>\n<li>and so on ... a lot of it will also depend on the language. For example, in some languages (like Japanese or Korean) you have special topic markers</li>\n</ul>\n", "Id":"2647", "ParentId":"2643", "CreationDate":"2012-10-05T04:50:11.850", "Score":"3", "PostTypeId":"2", "OwnerUserId":"1380", "LastActivityDate":"2012-10-05T04:50:11.850", "CommentCount":"1"}