{"OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "comments":[], "Body":"<p>Actually I had believed we had fully debunked this theory here some time ago. I thought we had found that the theory was posited by a certain individual linguist but was never accepted. I just had a look around the site looking the name of this linguist, but it seems my memory has deceived me and I can find no such thing.</p>\n\n<p>But I did find what I had not been able to find when I first asked some questions on this topic here. I found a Wikipedia article which covers the topic and includes a list of linguists who contributed to the development of the theory!</p>\n\n<p>The Wikipedia article, <strong><em>Drift (linguistics)</em></strong>, contains a section titled <strong><em><a href=\"http://en.wikipedia.org/wiki/Drift_%28linguistics%29#Long-term_cyclic_drift\" rel=\"nofollow\">Long-term cyclic drift</a>.</em></strong></p>\n\n<blockquote>\n  <p>Cyclic <strong>drift</strong> is the mechanism of long-term evolution that changes the functional characteristics of a language over time, such as the reversible drifts from SOV word order to SVO and from synthetic inflection to analytic observable as typological parameters in the syntax of language families and of areal groupings of languages open to investigation over long periods of time. Drift in this sense is not language-specific but universal, a consensus achieved over two decades by universalists of the typological school as well as the generativist, notably by Greenberg (1960, 1963), Cowgill (1963), Wittmann (1969), Hodge (1970), Givón (1971), Lakoff (1972), Vennemann (1975) and Reighard (1978).</p>\n</blockquote>\n", "Id":"2665", "ParentId":"320", "CreationDate":"2012-10-07T03:13:15.560", "Score":"0", "PostTypeId":"2", "OwnerUserId":"51", "LastActivityDate":"2012-10-07T03:13:15.560", "CommentCount":"3"}