{"OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "comments":[], "Body":"<p>Where I come from, inflection is seen as a kind of derivation, but one that is usefully distinguished from other kinds. It cannot be denied that an inflected form is derived from a stem, like any ordinary derivation; but inflection in general exhibits some properties that other kinds of derivation do not, like some of the ones Lawler mentions in his hand-out.</p>\n\n<p>However, verbal inflection is in many ways very different from nominal inflection: a fairly sharp line can be drawn between the two—sharper than the line between inflection on one hand and other kinds of derivation on the other. It could be argued that the division <em>verbal derivation</em> v. <em>nominal derivation</em> is more significant in certain contexts than that between inflectional and other derivation.</p>\n\n<p>Consider for example Latin <em>mulier</em>, \"woman\". I can add the non-inflectional suffix <em>-bris</em> to turn it into an adjective, so that <em>amicitia muliebris</em> could mean \"the friendship of a woman\". Instead, I could simply use the (inflectional) genitive, <em>mulier-is</em>, which is also normally translated as \"of a woman\" and which is in many contexts interchangeable with the adjective. I cannot do anything with verbal derivation that would result in the same meaning \"of a woman\", be it inflectional or non-inflectional derivation.</p>\n\n<p>Simple inflection can also be used to create a new verb. The first person singular present ending <em>-o</em> can be stuck on a stem to create a verb out of nothing. The stem <em>reg-</em>, which means something like \"straight, right, lead\" becomes a verb if you simply add <em>-o</em>, so <em>rego</em> \"I lead, direct\", second person <em>reg-i-s</em> \"you lead\". The nominal suffix <em>-s</em> turns it into a noun in the nominative: <em>rex</em> (&lt;*<em>regs</em>), \"leader, king\" (genitive <em>reg-is</em> \"of a king\", etc.). Is this added <em>-o</em> derivation or inflection? Or both?</p>\n\n<p>An important reason why we maintain this distinction between inflection and non-inflectional derivation is tradition. Not only is this a tradition in the terminology of descriptive linguistics that dates back thousands of years, but it was also a self-fulfilling prophesy among prescriptivists. Because a full paradigm was (and is) the norm, people felt more inclined to fill up any existing holes and create new forms. The farther you go back in history, the more suppletion you will see. It is speculated that the oldest cases were suffixes that were not at all distinctive compared other suffixes, and possibly even enclitics, and possibly even wholly separate words before that.</p>\n\n<p>For these reasons, it is best to treat inflection as distinct type of derivation.</p>\n", "Id":"2667", "ParentId":"2655", "CreationDate":"2012-10-07T07:09:14.417", "Score":"1", "PostTypeId":"2", "OwnerUserId":"82", "LastActivityDate":"2012-10-07T07:09:14.417", "CommentCount":"4"}