{"comments":[], "Body":"<p>It is possible that certain pronouns were borrowed into Uralic languages from Indo-European tongues. Other borrowings that would seem rare have found their way into the family, such as the Hungarian \"száz\", Finnish \"sata\", and Khanty \"sot\" for 100, which night have been either from an Indo-Iranian root like \"satem\" or Slavic \"sto/sotnya\". Scythian, an Iranian language, existed in central asia thousands of years ago and surely interacted with the early Uralic tribes; thus it might not be inconceivable to say that there were some borrowings from a more advanced society, and that there might have been some bilingualism. Scythian could have been a supplier of valuable items from the rest of Asia, like gold and spices, and therefore, it would have benefitted tribal chiefs and noblemen to know Scythian or a related language. However, there is still the possibility of false cognates here, like Hungarian \"ház\" for \"house\" (Finnish: koti; Proto-Germanic: husan). Such might be the case in the relative pronouns. As for \"sinä/se\", there would not be enough data to prove that the voiceless dental in Indo-European becomes a voiceless sibilant in Uralic, that is to say that \"*tuH > se\" is inconclusive at best.\nNevertheless, cognates false or not never definitively prove a genetic relationship. The grammar and morphology must be considered. Finnish has thirteen cases, like the essive, partitive, and illative, which do not correspond morphologically with the eight cases of Indo-European well. Furthermore, cases are not normally innovative, and are usually barrowed from other languages that have them, like the adessive and illative cases in Lithuanian. Moreover, Finnish observes vowel length, with is not common in Indo-European languages, which might employ pitch-accent.</p>\n", "Id":"2674", "ParentId":"1005", "CreationDate":"2012-10-11T04:28:03.787", "Score":"2", "PostTypeId":"2", "OwnerUserId":"1394", "LastActivityDate":"2012-10-11T04:28:03.787", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1394", "AccountId":"1926489", "Views":"1", "Reputation":"82", "CreationDate":"2012-10-11T03:30:07.557", "DisplayName":"Maxwell Garrison", "LastAccessDate":"2012-10-23T00:43:35.460"}}