{"OwnerUser":{"UpVotes":"302", "DownVotes":"1", "Id":"119", "AccountId":"14652", "Views":"52", "Reputation":"3065", "CreationDate":"2011-09-14T14:24:24.227", "DisplayName":"kaleissin", "LastAccessDate":"2014-01-18T22:21:33.313", "AboutMe":"<p>Sysadmin/programmer by day, linguist by night.</p>\n"}, "comments":[], "Body":"<p>The \"goodness\" depends on the purpose. There are several purposes. Some are meant to be used by people in a similar way to how natural languages are used, and meant to be used by several people, like Esperanto. Others are to give flavor to an artwork; a book (Lapine), a movie (Na'vi), a tv-series (Dothraki), a franchise (Klingon). Being used to communicate is then not one of the primary goals. Then again some are experiments: \"Can a language with X be mastered by humans? How will this feature Y change when used? How will this feature Z affect its users?\". Some are meant to be artworks in and of themselves. Some just happened and later give birth to conventional works of art (Quenya). Some are meant to be secret, used only be the creator or a small group. Some are made to communicate with the divine (not so uncommon in Wicca IIRC). Some are political statements, IMO (Láadan). Some are an attempt to fight depression (Toki Pona). Some are made for role-playing purposes (Tsolyani), as part of the world-building. Some are made to learn/discover the principles of linguistics. Some are made as a source of examples to teach linguistics. Some are made to serve as a contrast to languages already known, in order to better understand the mechanisms of those. There are probably fewer purposes than there are conlangs but I don't think there are that many fewer.</p>\n\n<p>Some have a goal of passing as a natural language. Then it becomes possible to use the normal linguistic arsenal of tools to analyze them and discuss them. Those who do not have this as one of their goals is probably a bad fit for this site.</p>\n\n<p>Some are meant to be a complete system usable for communication, others are not. As with naturalism, the former can lead to fruitful discussions, the latter are a lot less interesting, at least to me.</p>\n", "Id":"2678", "ParentId":"2377", "CreationDate":"2012-10-11T11:45:30.177", "Score":"5", "PostTypeId":"2", "OwnerUserId":"119", "LastActivityDate":"2012-10-11T11:45:30.177", "CommentCount":"2"}