{"comments":[], "Body":"<p>Before answering this question one must agree upon a definition of parts of speech.</p>\n\n<p>I will assume that we define POS not semantically (which would give rise to an almost infinite number of categories), but structurally, i.e. by the way they behave morphosyntactically.</p>\n\n<p>It is nowadays evident that POS (as any construction) cannot be established cross-linguistically. Some languages do not even distinguish between nouns and verbs, at leat not in the way English does. But even if two languages seem to share the same POS category, despite the similarities it is almost never going to be the exact same. Verbs in Russian inflect for aspect, while German ones don’t, for example. When we talk about \"verbs\" or \"nouns\" we always have in mind some prototype category that we compare language-specific categories with. When we ask \"does language X have category Y\", we are actually looking for something <em>similar</em> to Y, so the answer doesn’t have to be \"yes\" or \"no\", it will often be \"somewhat\".</p>\n\n<p>To answer the question about \"like\" one must consider how it behaves. Of course, it doesn’t behave like an adverb (it takes a complement), so that is ruled out by any traditional notion of \"adverb\". It seems to behave more like a proposition in that regard; interestingly its complement is also in the oblique case (\"like <em>him</em>\", not \"like <em>he</em>\") very unlike German for example (note however that the oblique case has long spread to constructions like coordination as well).</p>\n\n<p>On the top of my head I cannot think of structural features that contradict the preposition theory, but it is possible there are some (I’ve never studied English grammar in detail). There is no a priori reason why the word couldn’t be in a category all of its own.</p>\n\n<p>Note also that I didn’t consider the uses of <em>like</em> as subordinator or discourse particle. These would be other lexemes.</p>\n", "Id":"2706", "ParentId":"2358", "CreationDate":"2012-10-18T16:01:51.013", "Score":"3", "PostTypeId":"2", "OwnerUserId":"1380", "LastActivityDate":"2012-10-18T16:01:51.013", "OwnerUser":{"UpVotes":"14", "WebsiteUrl":"", "DownVotes":"5", "Id":"1380", "AccountId":"1907225", "Views":"8", "Reputation":"529", "CreationDate":"2012-10-05T03:06:16.113", "DisplayName":"Fryie", "LastAccessDate":"2014-01-09T09:48:02.760", "AboutMe":"", "Age":"26"}}