{"Body":"<p>This phenomenon is a specific case of how each language uniquely divides up the semantic space. </p>\n\n<p>The real world of referents is not divided up neatly into semantic categories that we can directly turn into lexical categories. A classic example is the color space. In the real world, there are an infinite number of colors in the spectrum, and <a href=\"http://hypertextbook.com/facts/2006/JenniferLeong.shtml\" rel=\"nofollow\">the human visual system can distinguish between 100,000 to 10,000,000</a> of them. Of course, no language has 10,000,000 color words - instead, each language divides the spectrum up into ranges and has color names corresponding to those ranges. We know that different languages divide up the color space differently, e.g. <a href=\"http://en.wikipedia.org/wiki/Distinguishing_blue_from_green_in_language\" rel=\"nofollow\">the range yellow vs. green vs. blue is notoriously different from language to language</a>. See for example the <a href=\"http://www1.icsi.berkeley.edu/~kay/piraha.pdf\" rel=\"nofollow\">color divisions of Piraha [PDF]</a>. </p>\n\n<p>This is not limited to colors. <a href=\"http://en.wikipedia.org/wiki/Digit_%28anatomy%29#Names\" rel=\"nofollow\">Fingers and toes</a>, <a href=\"http://en.wikipedia.org/wiki/Romance_copula#Spanish_copulae\" rel=\"nofollow\">states and locations of existence</a>, <a href=\"http://en.wikipedia.org/wiki/Kinship_terminology\" rel=\"nofollow\">kinship terms</a>, literally every concept is slightly differently divided and named. This division extends down to the idiolect, in  fact. </p>\n\n<p>What is happening is simply that each language has a unique mapping of abstract semantic fields to concrete lexical fields. </p>\n\n<p>In this particular instance, you are seeing that some languages (like Polish) happen to use two separate lexical fields for \"vision while sleeping\" (<strong>sen</strong>) and \"aspiration for the future\" (<strong>marzenie</strong>), and some (like English) happen to use one lexical field for both (<strong>dream</strong>). I say \"happen to\" because largely this is the end result of a complex combination of linguistic and cultural evolutionary happenstance. </p>\n\n<p>Russian uses two different words <strong>голубой</strong> <em>goluboj</em> and <strong>синий</strong> <em>sinij</em> for colors around 475 nm, while English uses one word <strong>blue</strong>. Similarly, Russian uses two different words <strong>сон</strong> <em>son</em> 'vision while sleeping' and <strong>мечта</strong> <em>m'ech'ta</em> 'aspiration or reverie' for related concepts corresponding to the English lexical field of <strong>dream</strong>.  The semantic field of \"visions, aspirations, and reveries\" is divided up uniquely. </p>\n", "Id":"2707", "ParentId":"2700", "LastEditorUserId":"624", "CreationDate":"2012-10-18T16:06:04.663", "OwnerUserId":"537", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-12-14T10:41:43.590", "LastEditedUser":{"UpVotes":"81", "DownVotes":"60", "Id":"624", "AccountId":"407237", "Views":"34", "Reputation":"1743", "CreationDate":"2011-12-28T07:24:31.420", "DisplayName":"Anixx", "LastAccessDate":"2014-01-18T10:33:34.597"}, "LastActivityDate":"2013-12-14T10:41:43.590", "Score":"5", "CommentCount":"3", "OwnerUser":{"UpVotes":"556", "WebsiteUrl":"http://www.markbeadles.com/", "Id":"537", "AccountId":"297827", "CreationDate":"2011-11-27T02:50:39.717", "AboutMe":"<p>Polymathic renaissance redneck</p>\n", "Age":"47", "Location":"Columbus, OH", "DownVotes":"22", "Views":"30", "Reputation":"3876", "DisplayName":"Mark Beadles", "LastAccessDate":"2013-02-02T04:23:30.703"}}