{"Body":"<p>Is your question about how the clitic ends up close enough to the verb to become reinterpreted as an affix? Or is it how personal pronouns end up as clitics?</p>\n\n<p>I'll assume the former and just point out that clitics don't act like personal pronouns. For instance, they're often not where you'd expect to find the personal pronoun. In most cases in Romance languages (SVO), object clitics are to the left of the verb, whereas a corresponding full pronoun would be to the right (in unmarked declarative clauses). It's conceivable that clitics in SOV languages can end up being verb-adjacent, but hopefully a typologist will confirm this.</p>\n\n<hr>\n\n<p>Edit: Justin rightly points out that Romance clitics originate in SOV Latin, which goes back to the question of how pronouns (or demonstratives) turn into clitics in the first place. I'm not a historical linguist, but see e.g. Kempson &amp; Cann 2008 for a functionalist-inspired analysis (spoiler: syntax and pragmatics conspire). Let me also turn to the typologists for a statement that perhaps applies more to the original question on SOV languages: </p>\n\n<blockquote>\n  <p>in many other [i.e. other than English] languages, pronouns exhibit word order properties that\n  differ considerably from lexical noun phrases, either because the\n  syntactic rules of the language treat them differently, or because the\n  pragmatic rules are such that their distribution is rather different. (Dryer 2007)</p>\n</blockquote>\n\n<p>So yeah, syntax and pragmatics.</p>\n\n<hr>\n\n<p>If you want to deal with clitic placement in syntax, you can either base-generate them in their normal argument position and then raise them to be adjacent to their host (the verb), or you could base-generate them in a special functional projection that's already next to the verb. In phonology, particularly in Optimality Theory, people usually use Alignment constraints to specify where the clitic likes to be wrt its host (left edge of the host or right, left edge of the phrasal projection of the host or right of it).</p>\n\n<p><strong>References</strong>: </p>\n\n<p>Anderson, Stephen R. (2005). <em>Aspects of the Theory of Clitics</em>. Oxford: Oxford University Press</p>\n\n<p>Kempson, R., Cann, R. (2008). <a href=\"http://www.kcl.ac.uk/innovation/groups/ds/publications/assets/ds-course/Clitics-leverhulme-revised-july08.pdf\" rel=\"nofollow\">Production pressures, syntactic change and the emergence of clitic pronouns</a>. In Cooper, R and Kempson, R (eds.) <em>Language in Flux</em>, 178-220. College Publications.</p>\n\n<p>Dryer, Matthew S. (2007). <a href=\"http://linguistics.buffalo.edu/people/faculty/dryer/dryer/DryerShopenWordOrder.pdf\" rel=\"nofollow\">Word order</a>. In Timothy Shopen (ed.) <em>Clause Structure, Language Typology and Syntactic Description</em>, Vol. 1, 61-131. Second Edition.</p>\n\n<p>Franks, Holloway King (2000). <em>A Handbook of Slavic Clitics</em>. Oxford: Oxford University Press</p>\n", "Id":"2731", "ParentId":"2635", "LastEditorUserId":"166", "CreationDate":"2012-10-21T15:56:31.027", "OwnerUserId":"166", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-10-22T15:11:10.173", "LastEditedUser":{"UpVotes":"33", "WebsiteUrl":"", "DownVotes":"2", "Id":"166", "AccountId":"895830", "Views":"2", "Reputation":"380", "CreationDate":"2011-09-18T16:47:03.823", "DisplayName":"lapropriu", "LastAccessDate":"2013-10-23T21:21:01.247", "AboutMe":"<p>I'm a grad student in Linguistics. I'm currently working on clitics and the prosodic hierarchy, but my interests are much broader than my expertise, unfortunately :).</p>\n"}, "LastActivityDate":"2012-10-22T15:11:10.173", "Score":"2", "CommentCount":"2", "OwnerUser":{"UpVotes":"33", "WebsiteUrl":"", "DownVotes":"2", "Id":"166", "AccountId":"895830", "Views":"2", "Reputation":"380", "CreationDate":"2011-09-18T16:47:03.823", "DisplayName":"lapropriu", "LastAccessDate":"2013-10-23T21:21:01.247", "AboutMe":"<p>I'm a grad student in Linguistics. I'm currently working on clitics and the prosodic hierarchy, but my interests are much broader than my expertise, unfortunately :).</p>\n"}}