{"OwnerUser":{"UpVotes":"33", "WebsiteUrl":"", "DownVotes":"2", "Id":"166", "AccountId":"895830", "Views":"2", "Reputation":"380", "CreationDate":"2011-09-18T16:47:03.823", "DisplayName":"lapropriu", "LastAccessDate":"2013-10-23T21:21:01.247", "AboutMe":"<p>I'm a grad student in Linguistics. I'm currently working on clitics and the prosodic hierarchy, but my interests are much broader than my expertise, unfortunately :).</p>\n"}, "comments":[], "Body":"<p>What we tell undergraduates in LING 101 is that the conventions of written language are not the object of linguistic investigation. But this might be a bit of an oversimplification (and I wonder if others here would agree). After all, <strong>corpus linguistics</strong> is a very fruitful approach to language research, on the assumption that the texts collected in corpora represent the writers' language experience, even though they may not fully represent their \"competence\". Now, what gets collected into corpora is usually not text messages or chat histories, presumably because they don't reflect spoken language use very well.</p>\n\n<p>But I think it can be useful to think of the language of these mediums as a sort of register, in which case it could be in the range of <strong>sociolinguistics</strong>. A few months ago I saw a talk by sociolinguist <a href=\"http://individual.utoronto.ca/tagliamonte/index.html\">Sali Tagliamonte</a> on IM language. Some googling reveals <a href=\"http://web.uvic.ca/ling/coursework/ling395/395_LOL.pdf\">this article</a> (pdf). I haven't read it, but if it is similar to the talk I head, it might be of interest. There might also be a newer incarnation that you could look for.</p>\n\n<p>References</p>\n\n<p>Tagliamonte, Sali &amp; Derek Denis (2008). Linguistic ruin? LOL! Instant messaging and teen language. In: <em>American Speech</em>, Vol. 83, No. 1, Spring 2008. doi 10.1215/00031283-2008-001</p>\n", "Id":"2744", "ParentId":"2742", "CreationDate":"2012-10-23T16:10:49.743", "Score":"5", "PostTypeId":"2", "OwnerUserId":"166", "LastActivityDate":"2012-10-23T16:10:49.743", "CommentCount":"6"}