{"OwnerUser":{"UpVotes":"512", "WebsiteUrl":"http://weew-waaw.com", "Id":"1009", "AccountId":"947951", "CreationDate":"2012-05-15T02:50:16.013", "AboutMe":"<p><img src=\"http://i.stack.imgur.com/VxMqM.jpg\" alt=\"Weew-Waaw, Thai to English, Thai to Russian transcription\"><br>\nI'm working on a project of rule-based Thai transcription: (the link is temporarily unavailable)<br>\nTechnically, it is written in F# with a C# front-end.<br>\nI would be happy to get acquainted with those who are experienced with NLP (Natural Language Processing), just ping me in the SE chat. :-)</p>\n", "Age":"42", "Location":"Bangkok, Thailand", "DownVotes":"50", "Views":"36", "Reputation":"1656", "DisplayName":"bytebuster", "LastAccessDate":"2014-01-19T00:53:20.473"}, "comments":[], "Body":"<blockquote>\n  <p>does the new-ish phenomenon of txt-speak and emoticons really pose any threat to language?</p>\n</blockquote>\n\n<p>I think, it's natural evolution of the language, and it exposes no threats.</p>\n\n<h3>Languages evolve.</h3>\n\n<p>In fact, languages never stop developing (except Latin). New words appear, new semantic constructs arise, others fade out or disappear. You can't stop this process.</p>\n\n<p>We all use <em>\"i.e.\"</em>, <em>\"e.g.\"</em>, <em>\"etc.\"</em>, <em>\"$\"</em>, <em>\"&amp;\"</em>, and it made no harm to the language.</p>\n\n<blockquote>\n  <p>is there anything other than the medium they grew from that would separate these from normal language evolution?</p>\n</blockquote>\n\n<h3>It happened before. On paper.</h3>\n\n<p>Languages, likewise all <em>instruments</em>, adopt to answer changing requirements. There was an objective need to reduce the number of symbols entered, and the language responded this very need.</p>\n\n<p><img src=\"http://i.stack.imgur.com/tfrfv.jpg\" alt=\"Abbreviations\"></p>\n\n<p>Look at the ancient texts. They are full of <a href=\"http://en.wikipedia.org/wiki/Scribal_abbreviation\">scribal abbreviations</a> which took place for very same reason: cost of the media.</p>\n\n<p>Also, if it has not ruined the languages before, why should we consider it a threat today?</p>\n\n<h3>Emoticons (smileys) are part of this process</h3>\n\n<p>You are correct, emoticons seem to be an interesting phenomenon as they are actually ideographic symbols appearing in alphabetic scripts. They evolve exactly the same way as the ideographic symbols have evolved. Their goal is to convey a certain meaning while using minimum of the space.</p>\n\n<p><img src=\"http://i.stack.imgur.com/sVLMW.jpg\" alt=\"Save button\"></p>\n\n<p>What do you see on this image? Of course, a <code>Save</code> button. But what exactly is depicted here? Someone young enough may have never seen a diskette, but still, they know the context this image conveys.</p>\n", "Id":"2745", "ParentId":"2742", "CreationDate":"2012-10-23T18:24:21.860", "Score":"6", "PostTypeId":"2", "OwnerUserId":"1009", "LastActivityDate":"2012-10-23T18:24:21.860", "CommentCount":"4"}