{"comments":[], "Body":"<p>A standard dictionary or encyclopaedia of mathematics should have these types of historical usages your talking about. You might find <a href=\"http://www.amazon.ca/Words-Mathematics-Etymological-Dictionary-Mathematical/dp/0883855119/ref=sr_1_2?ie=UTF8&amp;qid=1351344885&amp;sr=8-2\" rel=\"nofollow\">The Words of Mathematics: An Etymological Dictionary of Mathematical Terms Used in English</a> if you can find a copy. You might also search works on history of mathematical notation, you should find historical key terms and usages alongside notation compendiums. Otherwise start browsing indices of books like <a href=\"http://www.amazon.ca/Dictionary-Mathematics-McGraw-Hill/dp/0070524335/ref=sr_1_1?ie=UTF8&amp;qid=1351345111&amp;sr=8-1\" rel=\"nofollow\">Dictionary of Mathematics</a>. The book <a href=\"http://www.amazon.ca/Mathematical-Methods-Linguistics-Barbara-Partee/dp/9027722455/ref=sr_1_1?ie=UTF8&amp;qid=1351345207&amp;sr=8-1\" rel=\"nofollow\">Mathematical Methods in Linguistics</a> Chapter 7.7 \"Informal Style in Mathematical Proofs\" but it's not something like a discourse analysis. It's more like an explanation of notation and common omissions in proofs.</p>\n\n<p>Another thing you might find useful are books on the history of mathematics. Such as Boyer's <a href=\"http://www.amazon.ca/History-Mathematics-Carl-B-Boyer/dp/0471543977/ref=sr_1_2?s=books&amp;ie=UTF8&amp;qid=1351345843&amp;sr=1-2\" rel=\"nofollow\">A History of Mathematics</a>. These types of books should explain the contemporaneous concepts, key terms, and notation of mathematical science.</p>\n\n<p>I think the only way to find serious academic material on linguistic analysis of mathematical discourse is to approach it as mathematics being a domain of discourse. So, study discourse, then take as your domain \"mathematical works\" just as you would any other domain like \"cooking\" or \"legal statutes\". Then do as you would, eg extract collocations, classify documents, whatever.</p>\n\n<p>All this should really should be more than you asked for, but a less related subject is MathML and LaTex typesettings for mathematical documents. Reading about these would not be directly related to what you want, but it is the current and future course of mathematical publication, and if your seriously studying mathematical discourse you would be remiss to neglect this pertinent aspect.</p>\n", "Id":"2762", "ParentId":"2722", "CreationDate":"2012-10-27T13:59:54.420", "Score":"1", "PostTypeId":"2", "OwnerUserId":"1162", "LastActivityDate":"2012-10-27T13:59:54.420", "OwnerUser":{"UpVotes":"23", "DownVotes":"0", "Id":"1162", "AccountId":"1586391", "Views":"2", "Reputation":"286", "CreationDate":"2012-07-04T22:46:56.807", "DisplayName":"taylor", "LastAccessDate":"2013-05-10T17:08:44.560"}}