{"OwnerUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}, "comments":[], "Body":"<p>My understanding of the issues is as follows.  Principles and Parameters is an almost-tautologous restatement of Chomskian UG: there are certain things that are not subject to cross-linguistic variation (principles) and other things that can vary but only in constrained ways (parameters).  (The part about parameters is where the \"almost\" in \"almost-tautological\" comes in.)  There are other things that can vary freely, of course – e.g. vocabulary.</p>\n\n<p>All of Chomsky's syntactic theories fall under the P&amp;P approach.  In Government &amp; Binding (the immediately previous generation), things like Conditions A, B, and C were principles; parameters were things like the EPP (\"Extended Projection Principle;\" originally this was the \"subject movement to Spec,IP\" parameter).</p>\n\n<p>Minimalism's principles are things like Merge (the operation) and the conditions on it (Last Resort, no lookahead, ...).  One of the themes of Minimalist thought has been moving the locus of cross-linguistic variation to the lexicon.  So the old EPP parameter, which in GB was true or false of a language, now can be specified independently for each functional head.  In response to the observation/criticism that a small set of global parameters is not empirically adequate to describe the syntax of all natural languages, there has been research into lexical \"micro-parameters\" to fully describe languages (dialects) with small syntactic differences.</p>\n", "Id":"278", "ParentId":"275", "CreationDate":"2011-09-18T22:59:21.467", "Score":"6", "PostTypeId":"2", "OwnerUserId":"46", "LastActivityDate":"2011-09-18T22:59:21.467", "CommentCount":"1"}