{"Body":"<p>Since no one else has submitted an answer I guess I will. Be warned though that my answer will be based more on anecdotal evidence from living and working in Seoul for 2 years.</p>\n\n<p><strong>Word Boundaries in Written Korean</strong><br>\nKoreans have a joke about word boundaries:</p>\n\n<blockquote>\n  <p>아버지가 방에 있어.<br>\n  dad-SUB room-LOC exist<br>\n  Dad is in [his] room.  </p>\n  \n  <p>아버지 가방에 있어.<br>\n  dad handbag-LOC exist<br>\n  i) [It is] in Dad's handbag.<br>\n  ii) Dad is in [his] handbag.</p>\n</blockquote>\n\n<p>(The subject particle <code>이/가</code> is often dropped in casual speech, making the <em>ii</em> variant grammatical. My original understanding was that <em>ii</em> was the preferred interpretation but talking with friends seems to suggest that <em>i</em> might be the preferred interpretation. I would need more data before I can say for certain.)</p>\n\n<p>However, the question remains \"are word boundaries observed in usage?\". The answer to that, again taken from my personal experience, is \"it depends on the context\".</p>\n\n<p>Short form writings (SMSes, Twitter, chatting, notes-to-self, etc.) allow for the omission of white spaces. I have actually received SMSes from my faculty which had all spaces removed (which caused me great confusion as a non-native speaker).</p>\n\n<p>Longer and more formal forms do enforce word boundaries (thus the joke above). From what I've seen, the spaces are heavily enforced after case markers (<code>은/는</code> topic markers, <code>이/가</code> subject markers, <code>을/를</code> object marker, <code>에(게)</code> dative marker, etc.) and after any structural markers (<code>은/는/을</code> adjective marker, <code>게</code> adverb marker, <code>와/과</code> lexical <em>and</em>, <code>고</code> sentence <em>and</em>, various other conjunctions).</p>\n\n<p>The example you cited, <code>한 달</code> versus <code>한달</code> (both \"one month\"), varies because they are both nouns and both \"pure\" Korean (i.e. not taken from another language). <code>한</code> meaning \"one/first\" and <code>달</code> meaning month. They retain their meaning in isolation and the sense of their meaning does not change when viewed as a compound word. Therefore, without any grammatical markers, spacing is not strictly enforced.</p>\n\n<p>Interestingly, I've found that Chinese-based vocabulary (i.e. 한자, or\"hanja\", words) tend to avoid intra-word boundaries. For example: <code>일월</code> (<code>一月</code>, also literally <em>one/first month</em>, but with a different usage context than 한달) means \"January\" while <code>일 월</code> (<code>一 月</code>) is ungrammatical.</p>\n\n<p>I hypothesize that although these characters have a meaning in isolation the white space is enforced because, unlike \"pure\" Korean words, the way Chinese-based vocabulary combines changes the meaning of the characters based on context. For example, <code>친구</code> (<code>親舊</code>, \"friend\") broken into it's base characters is literally \"old closeness\" (<code>親</code> meaning <a href=\"http://en.wiktionary.org/wiki/%E8%A6%AA\" rel=\"nofollow\">\"close\"</a>, in the sense of relationships, <a href=\"http://en.wiktionary.org/wiki/%E8%A6%AA\" rel=\"nofollow\">or \"related\"</a> and <code>舊</code> meaning <a href=\"http://en.wiktionary.org/wiki/%E8%88%8A\" rel=\"nofollow\">\"old\" or \"ancient\"</a>). In this particular case one can guess how the modern meaning \"friend\" is derived (probably \"someone that you have been close to for a long time\"), but the literal meaning is essentially non-sense. Therefore, they cannot be analyzed separately.</p>\n\n<p><strong>Word Boundaries in Spoken Korean</strong><br>\nThis is a much more interesting problem. As I am sure you know, spoken language isn't a series of discrete words like written language but a continuous stream of input.</p>\n\n<p>Consider the following:</p>\n\n<blockquote>\n  <p>잘 못했다.<br>\n  well not-do-PAST<br>\n  [I] did not do [it] well.  </p>\n  \n  <p>잘못 했다.<br>\n  incorrect do-PAST<br>\n  [I] did [it] incorrectly.</p>\n</blockquote>\n\n<p>These two examples have different pronunciations. I am not a phoneticist so I cannot comment on exactly how they are different, but the effect is noticeable. It may have something to do with how humans comprehend word boundaries or it may be due to <a href=\"http://journals.cambridge.org/action/displayAbstract?fromPage=online&amp;aid=552176\" rel=\"nofollow\">Korean's semi-tonal nature</a>.</p>\n\n<p>Again, due to my lack of expertise in phonetics I do not feel comfortable attempting to answer your second question.</p>\n", "Id":"2785", "ParentId":"2777", "LastEditorUserId":"1055", "CreationDate":"2012-11-02T03:35:18.283", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-11-06T12:33:23.750", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2012-11-06T12:33:23.750", "Score":"4", "CommentCount":"3", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}