{"Body":"<p>What you are referring to are <strong>prosodic word boundaries</strong>. <a href=\"http://en.wikipedia.org/wiki/Prosody_%28linguistics%29\" rel=\"nofollow\">Prosody</a> deals with the relative prominence of linguistic units, but it also deals with the delineation of those units at different levels. Prosody can be encoded in the \"ups and downs\" of speech melody, but it also manifests itself in terms of duration (of speech units and of pauses) and intensity, among other things. All of these acoustic properties can be used by a speaker to cue prosodic boundaries, including word boundaries. </p>\n\n<p>Other prosodic boundaries include syllable boundaries and phrase boundaries. I added the <em>phonetics</em> tag to your question because phonetics is the field of linguistics that deals with how phonological units like words and phrases are delineated acoustically (acoustics is not a field of linguistics per se; one can study the acoustics of jet engines or the acoustics of a concert hall, but phonetics deals with the acoustics of speech) and how those acoustic cues are produced and perceived.</p>\n\n<p>As you noted, the <em>prosodic word</em> is not always equivalent to the <em>morphological word</em> or the <em>orthographic word</em>. For example, a prosodic word can often consist of a content word and a function word that cliticizes to it.</p>\n\n<p>One final note: the term <em><a href=\"http://en.wikipedia.org/wiki/Phonotactics\" rel=\"nofollow\">phonotactics</a></em> is not directly relevant for the discussion of the phonetic realization of prosodic boundaries. Phonotactics is the branch of phonology that deals with what combinations of phonemes are permitted in a language. Sometimes the phonotactics of a language can interact with its prosody such that, say, certain consonant clusters are only able to appear across syllable boundaries.</p>\n", "Id":"2800", "ParentId":"2793", "LastEditorUserId":"385", "CreationDate":"2012-11-05T13:44:25.257", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-11-05T15:24:35.990", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2012-11-05T15:24:35.990", "Score":"5", "CommentCount":"6", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}