{"Body":"<p><strong>Background</strong><br>\nBefore we start, I should explain for non-Korean speakers how coda-position ㅅ (\"S\") is pronounced in Korean. First, as jogloran has already hinted at, Korean has a tendency to avoid codas, converting them into onsets wherever possible (i.e. if the next syllable has no onset). Slight simplification but good enough for now. Second, ㅅ (\"s\") when pronounced <em>as a coda</em> (i.e. the syllable is pronounced in isolation or the following syllable has a non-null onset) it loses its [+stri] feature and is pronounced more like a soft (unaspirated) \"t\".</p>\n\n<p>The point being that 인터넷 (\"internet\". Literally \"intheneys\", pronounced \"intheneyt\") is pronounced <em>in isolation</em> in more-or-less the same manner as the English \"internet\". However, again as jogloran noted, when followed by a null-onset syllable, as in 인터넷이 (intheneys-i, internet-SUB) or 인터넷에 (intheneys-ey, internet-DAT, \"to/at the internet\") the coda ㅅ adjoins to the following syllable as an onset and <em>does not</em> lose it's [+stri] feature. This results in the surface forms \"in-the-ney-si\" and \"in-the-ney-sey\" respectively.</p>\n\n<p><strong>Answer</strong><br>\nIt is important to note that several codas undergo the same reduction as ㅅ. Namely, 밧, 받, 밭, and 밪 (pas, pat, path, and pac respectively) all have the same surface structure: 받 (pat). Of these \"t\" codas, ㅅ is by far the most common.</p>\n\n<p>Therefore, Koreans most readily associate \"t\" codas with ㅅ. From here it is not difficult to imagine why ㅅ used as a \"t\" coda, even in English loanwords.</p>\n\n<p><a href=\"http://www.fon.hum.uva.nl/paul/papers/BoersmaHamannLoans35.pdf\" rel=\"nofollow\">Loanword adaptation as first-language phonological perception.</a> by Boersma and Hamann is a paper I have <strong>heavily</strong> cited on this website. Essentially they propose that a learning algorithm dynamically ranks OT perception constraints over time such that rules preventing specific phonetic units from being perceived as specific phonological units become ranked in such a way that valid perceptions (for example <code>*[a]/a/</code>, \"don't interpret the phonetic <code>[a]</code> as the phonologic <code>/a/</code>\" becomes lowly ranked because it can be violated freely with no loss of meaning).</p>\n\n<p>Essentially, this paper provides a mechanism by which Koreans can perceive phonetic [t]s in the coda position as the phonologic /s/ (since the constraint forbidding this perception becomes lowly ranked). The result is a UR containing the /s/ coda which then explains its production as [s] in cases like \"인터넷이\". This UR /s/ is then reflected in their orthography.</p>\n", "Id":"2807", "ParentId":"2805", "LastEditorUserId":"1055", "CreationDate":"2012-11-08T16:05:04.730", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-11-13T14:14:53.560", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2012-11-13T14:14:53.560", "Score":"3", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}