{"comments":[], "Body":"<p>Tyler,\nI'm going to:\n1. Tell you my background\n2. Give you an answer to the best of my ability, \n3. Wait for feedback.</p>\n\n<p>I wanted to be an engineer and had through basic calculus in US High School. Ended up changing my mind and got a BA in Psychology that was 2 courses shy of a minor in linguistics and enjoyed cognitive science and psycholinguistics as it applied to language learning and propaganda.I had courses in statistics through multivariate analysis (11 Semester units)</p>\n\n<p>I think, your question would be easier to answer if you were to tell us what you plan to measure. What are the metrics of the \"state-change\"? As you're going to do this over time, I can only see using a graphical function which indicates calculating the \"area under the curve\"--whether it be language or concept recognition.\nSo, I think you will need at least some advanced algebra, and likely calculus analyze the differences you're wishing to measure. But, it has been 25 years since I've had calculus.\nTo do any meaningful measurements you'll have to understand the mathematical concepts to know the \"why\" of what you're measuring what you're measuring.</p>\n\n<p>Though, on another note: The human brain is a electro-chemical bath with billions of connections and the statement\"the current trend is to view the mind as a dynamical system\" should make you aware of the physical reality and the psychological/philosophical state of cognitive science. That statement is nearly as useful as \"water is wet\" in that it tells you something that is apparently true, but should be pretty obvious, and is still not a useful way to provide you with a way of measuring values that are important.\nI would recommend a good course or two in neurobiology and chemistry also.</p>\n", "Id":"2813", "ParentId":"2784", "CreationDate":"2012-11-09T15:13:02.497", "Score":"1", "PostTypeId":"2", "OwnerUserId":"1475", "LastActivityDate":"2012-11-09T15:13:02.497", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1475", "AccountId":"2028127", "Views":"0", "Reputation":"11", "CreationDate":"2012-11-09T15:13:02.497", "DisplayName":"James", "LastAccessDate":"2012-11-09T15:30:07.580"}}