{"Body":"<p>Your problem is very curious. Before going to elaborate, I'd like to jump to my conclusion first: I have a hunch that perhaps it is because <strong>you've already known English</strong>, which is exactly the reason why you cannot understand most things in English songs.</p>\n\n<p>This might seem to be mind-boggling, but after reviewing lots of things, and trying to think many possibilities, I really do think that it is exactly the reason.</p>\n\n<p>Since I can't speak Russian, and have watched some movies in Russian maybe only three or four time up until now (and I had to read the subtitles every time), after reading your post, I thought that it might be because English is a stress-timed language, or may be because of the liaison in English (\"do it\" is usually pronounced \"do-wit\", for example), or may be the number of pure vowels. But a quick research on the web tells me that Russian is also a stress-timed language, also has liaison, and six raw vowels is not so few. (Though English has unusually many vowels, around 14-16.)</p>\n\n<p>I read your original post again and again and finally it hit me. Your saying <em>\"I can write and read English well\"</em> gave me some clue. Also, the fact that you can \"easily write it [the Romanian/Italian song] down\" is another big clue.</p>\n\n<p>I dare say that if you try listening to an English song again, but this time pretend to know nothing about English (you can treat it as some extraterrestrial sounds if you like), and then transcribe it, your transcription might be even closer to the original lyric than you might think!</p>\n\n<p><strong>EDIT:</strong></p>\n\n<p>To really answer the question <em>Does English language stand special in terms of phonology?</em>, I would say that every language is special in its own way. English might have unusually many vowels, and the liaison seems to be very strong, so strong that all syllables would appear as if they were merged together, even across word boundaries. This could trouble many non-native speakers. But other languages would have their own quirks as well.</p>\n", "Id":"2834", "ParentId":"2829", "LastEditorUserId":"1482", "CreationDate":"2012-11-12T21:05:25.880", "OwnerUserId":"1482", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-11-12T22:08:27.773", "LastEditedUser":{"UpVotes":"2", "DownVotes":"0", "Id":"1482", "AccountId":"850963", "Views":"2", "Reputation":"191", "CreationDate":"2012-11-10T13:37:06.807", "DisplayName":"Damkerng T.", "LastAccessDate":"2014-01-15T17:53:11.193"}, "LastActivityDate":"2012-11-12T22:08:27.773", "Score":"2", "CommentCount":"6", "OwnerUser":{"UpVotes":"2", "DownVotes":"0", "Id":"1482", "AccountId":"850963", "Views":"2", "Reputation":"191", "CreationDate":"2012-11-10T13:37:06.807", "DisplayName":"Damkerng T.", "LastAccessDate":"2014-01-15T17:53:11.193"}}