{"comments":[], "Body":"<p>I'm not aware of any publication which has exact percentages for the origins of Monguor vocabulary. There are, however, a number of linguistic papers and grammars of Monguor, some of which are available on the Internet. The following grammar, for example, contains a glossary which lists source languages for many Monguor words:</p>\n\n<p><a href=\"http://sino-platonic.org/complete/spp069_monguor_language.pdf\" rel=\"nofollow\">Language Materials of China’s Monguor Minority</a></p>\n\n<p>As an example, here is the entry for \"accustom\":</p>\n\n<blockquote>\n  <p><strong>accustom</strong>--darisuu (T:dar srol), suri, {SUER, XIGUANRA} (C:xiguan 习惯)</p>\n</blockquote>\n\n<p>This indicates that the word <strong>darisuu</strong> is of Tibetan origin (from \"dar srol\") and that this word is used in Huzhu Mongghul. There is also a word <strong>xiguanra</strong> which is of Chinese origin (\"xiguan\") and used in Minhe Mangghuer. </p>\n\n<p>The above-mentioned grammar also contains an extensive bibliography of Monguor language resources, some of which may contain glossaries or discussions of Monguor vocabulary.</p>\n\n<p>Another publication that might be of use to you:</p>\n\n<p><em>Tibeto-Mongolica : the Tibetan loanwords of Monguor and the development of the archaic Tibetan dialects</em> by András Róna-Tas (The Hague : Mouton, 1966).</p>\n\n<p>Also, if you can read Chinese, there is quite a lot of material written about the languages of the Monguor minority (Chinese: tuzuyu, 土族语) in Chinese publications, which might contain discussions of vocabulary/etymology.</p>\n", "Id":"2853", "ParentId":"2573", "CreationDate":"2012-11-15T21:38:00.283", "Score":"3", "PostTypeId":"2", "OwnerUserId":"1192", "LastActivityDate":"2012-11-15T21:38:00.283", "OwnerUser":{"UpVotes":"7", "WebsiteUrl":"", "DownVotes":"0", "Id":"1192", "AccountId":"316670", "Views":"0", "Reputation":"161", "CreationDate":"2012-07-15T22:06:58.437", "DisplayName":"Joshua", "LastAccessDate":"2012-11-29T15:44:07.713", "AboutMe":"<p>medical student interested in Sino-Tibetan and Scandinavian languages</p>\n"}}