{"Body":"<p>Problems to listen English seems to be common among Russian native speakers (and me definitely isn't exception), and yes, it's harder to listen English than some another languages as in your examples. I'd post my answer mainly to confirm that it's not solely your issue, and to place some accents; the issue implementation may differ but it's very common to Russian natives, as far as I see and I'm told by friends and various mates. My personal implementation of it seems also influenced by Soviet school specifics which gave too few skills of listening of real native speech (not the one produced by teachers or specially trained dictors), and this one-sided teaching lead to prevailing of the written speech over the oral one (this seems noted by @Damkerng T.)</p>\n\n<p>Detailedly, the English features that I detected at my personal experience and which affects understanding of oral speech are:</p>\n\n<p>I. General \"inexactness\" of sounds which is of another kind than in Russian. For example, Russian never mutates /t/ to kind of /r/ or even to nothing. English vowels can easily shift to their neighbours, e.g. [æ] to [a] or [e], even under stress, which is impossible in Russian. (They shift even in phonetic courses, immediately when a dictor loses control on his/her pronounciation details.)</p>\n\n<p>This also includes shifts of implementation base (sorry for possible mis-terming). E.g. /d/ in English is less voiced than in Russian, and /t/ is more loud; this difference in exhalation power is sometimes more important than voicedness (e.g. some German dialects lose voicedness but continue to differ t-weak and t-hard). It's normal to hear a sound which we treat as /t/ but which is really /d/.</p>\n\n<p>II. Loss of difference. Some sounds are differentiated (for us!) only with length which is generally lost in songs, so the difference disappears (e.g. /ʌ/ vs. /a:/). Also, some differences which are supported to average Russian speaker only with r-coloring, can disappear.</p>\n\n<p>III. General inability to detect words quickly (simply because not trained for this). There are numerous omonyms which are detected as some accustomed word but really shall be others (e.g. sum vs. some, hare vs. hair, etc.)</p>\n\n<p>IV. Dialect differences which aren't often described. For example, some time ago I was unable to detect phrase which was \"must have had\" but pronounced like /məstəvəd/ at the same time that this speaker had kept /h/ in words like \"happy\".</p>\n\n<p>The factor which deepens this is that English, unlike Russian, doesn't have a single \"canonic\" form, so you could hear different accents and dialects when you have no time to spend thinking what does it mean. It's quite rare to hear a Russian song which isn't of ethnic genre but performed using dialect pronounciation; exceptions could be counted using a single hand fingers (В.Высоцкий, Сектор Газа...) English has no such centralization so each singer or speaker gives their own deposit to a \"bank\" of varieties. At the same time, we were generally taught some \"generic\" English which is based mainly on Oxford (\"RP\") dialect but with huge r-coloring, without some pecularities (as exact manner of [æ] or [ɜ:]), and with very limited vocabulary.</p>\n\n<p>OTOH I guess that your description of the issue is too emotional. Very unlikely you could differ e.g. /t/ vs. /m/ in Spanish or Finnish and, at the same time, unable to do this in English. If you can't detect the exact word, you can start with phonematic recording of a speech, and then make a deduction of the source using your recording. This could be very helpful to start with understanding songs.</p>\n", "Id":"2862", "ParentId":"2829", "LastEditorUserId":"865", "CreationDate":"2012-11-17T07:11:51.330", "OwnerUserId":"865", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-04-04T19:56:35.053", "LastEditedUser":{"UpVotes":"20", "Location":"Kiev, Ukraine", "DownVotes":"0", "Id":"865", "AccountId":"1343107", "Views":"3", "Reputation":"284", "CreationDate":"2012-03-24T16:20:02.170", "DisplayName":"Netch", "LastAccessDate":"2014-01-06T20:38:36.213", "Age":"41"}, "LastActivityDate":"2013-04-04T19:56:35.053", "Score":"4", "CommentCount":"2", "OwnerUser":{"UpVotes":"20", "Location":"Kiev, Ukraine", "DownVotes":"0", "Id":"865", "AccountId":"1343107", "Views":"3", "Reputation":"284", "CreationDate":"2012-03-24T16:20:02.170", "DisplayName":"Netch", "LastAccessDate":"2014-01-06T20:38:36.213", "Age":"41"}}