{"OwnerUser":{"UpVotes":"1", "WebsiteUrl":"", "DownVotes":"1", "Id":"1492", "AccountId":"2039682", "Views":"2", "Reputation":"325", "CreationDate":"2012-11-14T14:40:19.727", "DisplayName":"Berthilde", "LastAccessDate":"2012-12-10T16:24:27.427", "AboutMe":"<p>Native English and Welsh speaker, enthusiastic learner of Flemish/Dutch, French, German, and occasionally Italian.</p>\n\n<p>My doctorate is in medieval English. I taught as a college lecturer in Oxford for about five years, before taking a position as a researcher in the field of English linguistic history with a major publisher. I now spend my days hunting down words, and my evenings with music, books, art, cooking, and all that lovely stuff.</p>\n"}, "comments":[], "Body":"<p>I suppose the short answer is that both German and Sardinian are Indo-European languages, so it's to be expected that they'll have some common word-forms. German is classed as Germanic and Sardinian is classed as a Romance language, but that doesn't mean that their development is completely separate: they shared a common ancestor. You can see the same if you compare French and German, for example. Words like \"window\" (<em>fenêtre</em> / <em>Fenster</em>) are obviously from the same root in French and German (i.e. Latin <em>fenestra</em>). Welsh has the same root for its word, <em>ffenestr</em>, although Welsh is categorised as a Celtic language. The English word is unusual here, as English didn't take <em>window</em> from Latin, but rather uses a native Germanic-derived form, from the words for <em>wind</em> and <em>eye</em>. (Although note that the word <em>fenester</em> was also in use in English until the 1500s).</p>\n\n<p>The question of the relationship between German, Sardinian, and English falls into the trap of looking at the wrong data, I'm afraid. The English word that's comparable here is <em>curt</em>, not <em>short</em>. German <em>kurz</em>, Sardinian <em>curzu/a</em> and English <em>curt</em> all come from Latin <em>curtus</em>, as Alex B. pointed out in the comments. (The etymology of <em>short</em> is disputed, though it may also ultimately derive from <em>curtus</em>.) French <em>court</em>, Italian <em>corto</em>, Dutch <em>kort</em>, also all derive from the same root. </p>\n\n<p>In summary, the fact that any two Indo-European languages have vocabulary in common should not come as a surprise. Much of this vocabulary comes, directly or indirectly, from Latin, and is not usually a sign of particular relatedness between the two languages unless it can be proven that Language A took a lot of its word forms from Language B as an intermediary, and not directly from Latin (or indeed from Language C, or Language D, etc.)</p>\n", "Id":"2865", "ParentId":"2850", "CreationDate":"2012-11-19T09:32:54.890", "Score":"4", "PostTypeId":"2", "OwnerUserId":"1492", "LastActivityDate":"2012-11-19T09:32:54.890", "CommentCount":"1"}