{"Body":"<p>Your criticisms of the IPA seem to be mainly based on patent misapprehensions about how its notation is correctly used. </p>\n\n<ul>\n<li><p>In your first impungment of the IPA, you apparently are assuming two different notations of the same sound (in this case, a voiceless labio-velar approximant notated with [ʍ] and  [w̥]) are both unanimously agreed upon transcriptions of one phoneme and are used interchangeably. In reality, they're no more than the result of differences in how the phoneme could be more accurately or most obviously denoted. Whichever notation is employed is more an indication of the preference of whomever it was who employed it rather than the IPA's notations' ambiguity. It's a trivial objection to raise, nonetheless. </p></li>\n<li><p>To your presumably Anglophone ears, [tʃ] and [t͡ɕ] most likely sound the same. In reality, they correspond to two disparate phonemes. When used by knowledgeable people, [tʃ] invariably denotes the voiceless palato-alveolar affricate, whereas the voiceless alveolo-palatal affricate is signified with [t͡ɕ]. It isn't just a case of one phoneme having different names and transcriptions.</p></li>\n<li><p>There's a subtle articulatory distinction to be considered between a palatalized consonant and a palatal consonant which gives the two their different notations. Palatal consonants have a primary articulation with the tongue either toward or in contact with the mouth's hard palate. Some palatal consonants of import are: [ɲ], [c], and [ɟ]. A palatalized consonant (conventionally denoted with a superscript palatal approximant, as in [pJ] to denote the palatalized voiceless bilabial plosive) are such that they possess a non-palatal primary articulation coupled with a palatal secondary articulation. </p>\n\n<p>Therefore, the palatalized phoneme [nJ] is distinguishable from [ɲ]\nbecause of the latter's palatal primary place of articulation and the\nformer's non-palatal primary place of articulation. There's only a\nsoupçon of difference between the two, but it's still a difference\nthat deserves to be accounted for.</p></li>\n<li><p>Different symbols for different phonation isn't a legitimate criticism. Also, there are some phonemes which are given special diacritical marks to individuate their voiced and voiceless counterparts, like with voiceless implosives, for example. This is a complex and nuanced issue and I shan't waste any of my time explaining it here. If you're interested, a Google search will help.</p></li>\n</ul>\n", "Id":"2874", "ParentId":"2841", "LastEditorUserId":"1513", "CreationDate":"2012-11-21T04:24:20.240", "OwnerUserId":"1513", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-11-21T04:30:11.917", "LastEditedUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1513", "AccountId":"2064751", "Views":"3", "Reputation":"95", "CreationDate":"2012-11-21T01:19:02.507", "DisplayName":"Rajan S.", "LastAccessDate":"2012-11-30T10:25:28.210"}, "LastActivityDate":"2012-11-21T04:30:11.917", "Score":"5", "CommentCount":"22", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1513", "AccountId":"2064751", "Views":"3", "Reputation":"95", "CreationDate":"2012-11-21T01:19:02.507", "DisplayName":"Rajan S.", "LastAccessDate":"2012-11-30T10:25:28.210"}}