{"OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1531", "AccountId":"2089946", "Views":"1", "Reputation":"31", "CreationDate":"2012-11-28T13:34:03.370", "DisplayName":"Thomas", "LastAccessDate":"2012-11-28T13:34:03.370"}, "comments":[], "Body":"<p>I think the best answer to this question is that onomatopoeiae can undergo sound change, but do have a relatively strong tendency to resist it.  Perhaps a decent example of this could be \"woe\" in Indo-European languages.  Whether it was an ancient borrowing or a human universal onomatopoeia, there is some ancient, probably Proto-Indo-European uttering whose precise reconstruction may escape us, but is approximately something like *wai or *wei.  Note Semitic languages point to a Proto-Semitic *wai and the Old Georgian Bible contains 'wai' in the same function (possibly borrowed for translation purposes?).  </p>\n\n<p>In any case, even if you do not accept a PIE reconstruction, the internal history of 'woe' within branches of IE show sound change.  'vae' in Latin went from being pronounced [wai] to [vai].  Similarly many Germanic languages went through the same labial sound change, while there is considerable variation in the quality of the vowel(s): OEng. 'wa:', OSax./OHG 'we:', Old Norse 'vei'.  </p>\n\n<p>Otherwise, the forms of many branches show regular, or at least acceptable, sound changes from an initial syllable *w-, while others show clear renewal in order to preserve a w- or v-.  In terms of apparent inheritance we have Old Irish fé (f &lt; *w, like 'fer' man &lt; *wiH-ro-s, cf. Lat. vir) and Welsh 'gwae', while on the other hand there is Koiné Greek 'ouai' ([wai] where initial w- was not a Greek phoneme in that time period) and Armenian 'vay'(where initial PIE *w would normally render Armenian g-).  </p>\n\n<p>Therefore, we see an obvious tendency towards renewal but the clear ability of this onomatopoeia to undergo regular sound changes.  </p>\n\n<p>I am afraid I cannot answer the main question as to the relative frequencies of these different possible evolutionary paths for onomatopoeia.  I only took up the answer at all because of an error in a previous answer which states that onomatopoeias undergo sound change (which is true, or at least they can), but bases this on examples of orthographic change, which actually argues against the respondent's point and did not appear to be the intention of the authors of the cited work.  The fact a Greek sheep's sound is not transcribed with mu-pi only shows resilience against sound change.  The orthographic change from pip- to peep likewise preserves [pi:p].  </p>\n\n<p>Therefore, I think the examples involving the evolution of the pronunciation of 'woe' in Germanic and Romance languages, and maybe even in the gap of time from PIE to Celtic better demonstrate the point that onomatopoeia are vulnerable to sound change.</p>\n", "Id":"2907", "ParentId":"2052", "CreationDate":"2012-11-28T13:34:03.370", "Score":"3", "PostTypeId":"2", "OwnerUserId":"1531", "LastActivityDate":"2012-11-28T13:34:03.370", "CommentCount":"1"}