{"comments":[], "Body":"<p><strong>Grammatical categories</strong> - tense and remoteness in this case - <strong>are expressed morphosyntactically</strong>, whereas in your English example the idea of a recent event is expressed by the adverb \"yesterday\" (i.e. lexically).</p>\n\n<p>On the other hand, one could <em>theoretically</em> argue for a certain tense gram (form) purely based on semantics. In this case, one could talk of the following tense forms:</p>\n\n<p>I went to town yesterday. (hesternal)</p>\n\n<p>I went to town a week ago. (pre-hesternal)</p>\n\n<p>I went to town last year. (remote)</p>\n\n<p>I went to town a hundred years ago. (ancient past)</p>\n\n<p>etc. <strong>ad absurdum</strong>.</p>\n\n<p>cf. Kibort 2008</p>\n\n<blockquote>\n  <p>In order to be regarded as a (grammaticalised) tense, <strong>the expression of location in time has to be integrated into the grammatical system of the language</strong> [emphasis mine - Alex B.]. In contrast, a lexicalised expression of the location in time indicates its integration into the lexicon of the language, but does not entail any necessary consequences for the language's grammatical structure. Grammaticalisation, as opposed to lexicalisation, of the location in time, correlates with two parameters: obligatory expression and morphological boundness. The very rough rule is that a tense is grammaticalised if its morphological expression is obligatory even if the information carried by the exponent is redundant.</p>\n</blockquote>\n\n<p>Kibort, Anna. \"Tense.\" Grammatical Features. 7 January 2008. <a href=\"http://www.grammaticalfeatures.net/features/tense.html\">http://www.grammaticalfeatures.net/features/tense.html</a>.</p>\n", "Id":"2909", "ParentId":"2908", "CreationDate":"2012-11-28T23:46:47.833", "Score":"5", "PostTypeId":"2", "OwnerUserId":"445", "LastActivityDate":"2012-11-28T23:46:47.833", "OwnerUser":{"UpVotes":"197", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/z3GF5.jpg", "Id":"445", "AccountId":"992814", "CreationDate":"2011-10-23T14:24:40.117", "AboutMe":"<p><strong>Research interests:</strong> syntax, linguistic morphology, typology, historical linguistics, lexicography, lexicology, psycholinguistics, language acquisition, British accents</p>\n", "Location":"Seattle, WA", "DownVotes":"41", "Views":"56", "Reputation":"4171", "DisplayName":"Alex B.", "LastAccessDate":"2014-01-19T00:35:04.640"}}