{"Body":"<h2>What are performative verbs and declarations?</h2>\n\n<p>There is much confusion about what performatives and declarations are and how they should be classified. The following definition by Searle seems the most useful and exact one:</p>\n\n<blockquote>\n  <p>\"... an utterance is a <em>declaration</em> if the successful performance of the speech act is sufficient to bring about the fit between words and world, to <strong>make the propositional content true</strong>.\"</p>\n  \n  <p><sup>— John R. Searle, 'How Performatives Work' in: <em>Linguistics and Philosophy</em> 12 (5) pp. 535–558 (1989), 547.</sup></p>\n</blockquote>\n\n<p>This means that a <em>declaration</em> must <strong>describe a situation</strong>, or it couldn't have a truth value; and its being uttered must <strong>affect its truth value</strong>. (Note also that this is not necessarily black and white: different utterances may be more or less declarative in degrees; however, we normally only call an utterance a 'declaration' if it is a sufficient condition for itself to become true.)</p>\n\n<blockquote>\n  <p>You are dismissed.</p>\n</blockquote>\n\n<p>This sentence can be read in two ways; one is similar to the same sentence but in the third person or in the past: the utterance <em>you were dismissed</em> simply describes a situation where you were dismissed, but it is not a declaration. In that line of thought, <em>you are dismissed</em> could be read as a non-declarative description. The other reading is performative: by saying this, I affect the external world in such a way that the description becomes true and you are indeed dismissed. When both readings coincide, it is a declaration.</p>\n\n<p>You cannot remain undismissed after my utterance: there is a direct causal link. This is essential. From that it follows that a declaration must describe an utterance (among other things), or there cannot be an inescapable causal link. And so it must normally contain some verbal phrase that expresses an <em>utterance</em>.</p>\n\n<p>Note that the question who is to assign this truth value (you? I? someone else?) is open.</p>\n\n<p>An explicit declaration is one that is self descriptive, in that the descriptive aspect of the utterance <em>as a whole</em> accurately describes the performative utterance. In <em>you are dismissed</em>, this is not the case, because <em>you are x</em> does not describe an utterance at all; it is therefore considered <strong>implicit</strong>. The word <em>dismissed</em> does describe an utterance, in that dismissing someone is uttering certain words, but <em>dismissed</em> is not the <em>whole</em> utterance.</p>\n\n<blockquote>\n  <p>I hereby dismiss you.</p>\n</blockquote>\n\n<p>This is also a declaration, since the utterance affects its own truth value as above. It is an <strong>explicit</strong> declaration, because the descriptive aspect describes the act brought about by uttering it. It can be tested thus. If someone else produced the same utterance, describing the same state of affairs but with appropriate deixis (= pronouns and tenses, words referring to the external world), as in <em>he thereby dismisses you</em>, she would accurately describe my performative utterance. The sentence <em>I hereby dismiss you</em> must therefore be an explicit declaration.</p>\n\n<p>A <strong>performative verb</strong> is short for a verb resulting in an utterance that is usually a declaration if you say <em>I hereby [verb]</em>. I say <em>usually</em>, because (almost) any sentence can be given a different illocutionary meaning given the right context.</p>\n\n<hr>\n\n<h2>Should <em>I agree</em> count as a declaration?</h2>\n\n<blockquote>\n  <p>Brutus: — Caesar is a tyrant; he must be stopped.</p>\n  \n  <p>Cassius: — I agree.</p>\n</blockquote>\n\n<p>Is this a declaration? Does saying <em>I agree</em> affect its own truth value? I would say no, because agreeing means having an opinion, at least in this context: saying <em>I agree</em> merely informs the other party of Cassius' opinion here. Even if he said he agreed while he privately disagreed, this would not affect his private opinion: he would continue to disagree. One could write, <em>indeed, I said \"I agree\" to you, but I did not in fact agree</em>. If this <em>I agree</em> affected its own truth value, then Cassius could not secretly disagree while saying he agreed. But in fact nothing stopped Cassius from disagreeing and betraying Brutus. Therefore it must be something other than a declaration.</p>\n\n<p>As mentioned above, for something to count as a declaration, there must be a direct causal link, in that uttering agreement is a sufficient condition for the agreement to come about. This is not the case. The fact that agreeing is not exactly an utterance itself already points to this.</p>\n\n<blockquote>\n  <p>Scipio: — Hannibal, your army has been destroyed, and you are our prisoner. You now have a choice: either you agree to cede Spain in the presence of the Carthaginian and Roman noblemen assembled in this room, and you will be set free; or you will die. Once you have agreed, there is no way back: Spain will be ours and your title forfeited. What say you?</p>\n  \n  <p>Hannibal: — I agree.</p>\n</blockquote>\n\n<p>In this context, it seems reasonable to read Hannibal's <em>I agree</em> as <em>I formally agree, and I hereby cede Spain to the Roman Republic</em>. To formally agree comes close enough to a verbal phrase expressing an utterance (as mentioned above), rather than having an opinion. Could his father Hasdrubal in Carthage say later, <em>Hannibal said \"I [formally] agree\", but he did not [formally] agree</em>? This does not seem reasonable. No, the utterance seems to be a sufficient cause for formally agreeing in this situation. But all this does depend on your interpretation of <em>agree</em> as formally agreeing, so it is not clear cut.</p>\n\n<p>Is it an explicit declaration? Yes, if you read it as <em>I formally agree</em>. In this context, the utterance <em>I agree</em> as a whole accurately describes the speech act of formally agreeing. If you think that <em>I agree</em> does not actually 'mean' formally agreeing but requires interpretation as such, you will probably not consider this explicit. That is a subtle matter of definition which is perhaps not very important.</p>\n\n<p>The same issue applies to all speech acts: what is the 'basic' or locutionary meaning of an utterance, and what is its illocutionary meaning? If you say <em>could you pass the salt</em>, is the basic meaning \"so tell me about your ability to pass the salt; are you capable of doing so, you think?\"? Or do you consider <em>could you</em> an idiomatic phrase meaning \"I request that you...\" at a basic enough level? A matter of definition, a choice.</p>\n\n<hr>\n\n<h2>Are not all assertive/constative statements declarations?</h2>\n\n<blockquote>\n  <p>Father, I was forced to cede Spain to the Romans. I say we have lost the war.</p>\n</blockquote>\n\n<p>Here Hannibal says Carthage has lost the war, and he says that he says it, by <em>I say</em>. This makes it technically a declaration: uttering it is sufficient to make <em>I say</em> true, and the truth value of <em>I say</em> determines that of the whole utterance. One cannot say, <em>Hannibal uttered \"I say we have lost the war\", but in fact he did not say that</em>. That is, this can only work as a paradox, in which <em>say</em> and <em>said</em> are taken to mean two different things in context—which are for the Oracle to decipher, because I wouldn't understand it. The declaration is explicit, because the whole content of the utterance accurately describes itself.</p>\n\n<blockquote>\n  <p>We have lost the war.</p>\n</blockquote>\n\n<p>Here we have no <em>I say</em>. However, should we not implicitly read <em>I say</em> here? After all, this sentence means exactly the same as the one in the previous example. Perhaps this is absurd, or perhaps it is the most rigorous application of Searle's definition. The consequence would be that <em>all</em> descriptive utterances are taken as declarations with implicit <em>I say</em>. I have no answer. This shows the limits of speech-act theories.</p>\n\n<hr>\n\n<h2>Other examples.</h2>\n\n<blockquote>\n  <p>You're out!</p>\n</blockquote>\n\n<p>This is could be read as a declaration, if by being out you mean the registered statistic in the game. That is also how the umpire means it, so from his perspective it is a declaration. However, if you read it as <em>being at the designated position at that exact time</em>, it is possible that the umpire was wrong: you can then say <em>the umpire said \"you're out!\", but he was in fact not out</em>. Here the question 'who is to judge the truth value?' becomes very relevant, and this goes beyond my answer. It is not explicit, however, because <em>being out</em> does not describe an utterance, and therefore it cannot describe itself. There is no verbal expression of utterance, as in <em>I declare you out</em>.</p>\n\n<blockquote>\n  <p>\"I apologise\", I said, but I didn't feel sorry at all: it was his own fault, and I would do it again. He did not respond.</p>\n</blockquote>\n\n<p>Is this a declaration? Does saying <em>I apologise</em> make the statement true? Can you say, <em>he said \"I apologise\", but he did not in fact apologise</em>? I think not, at least not in this context. You can apologise and not mean it, but that is different. It is also explicit because the whole utterance describes itself.</p>\n\n<blockquote>\n  <p>He said, \"I apologise\", but he looked me in the eyes, grinned, and hit me again.</p>\n</blockquote>\n\n<p>Here it seems clear that neither the speaker nor the listener believe that it is really an apology. Can you say, <em>he said \"I apologise\", but he did not in fact apologise</em>? Suddenly this seems more reasonable. If you repeat the offence, even while saying <em>I apologise</em>, you are not truly apologising—or are you? It depends on which linguistic level you read <em>I apologise</em> on. If you read it as \"I am making an apologetic statement\", you are apologising even in this example; if you read it as \"I am sincerely sorry\", then you are not apologising.</p>\n\n<p>Irony makes it so that an utterance is interpreted (by both parties) at a deeper illocutionary or perlocutionary level that is very different from the superficial, basic, locutionary meaning. With irony, you can make any statement mean anything. So it may be a declaration at some level, but not at another. It depends on how you read it, and, again, I think this shows how Searle's classification has its limits in terms of usefulness.</p>\n", "Id":"2921", "ParentId":"2917", "LastEditorUserId":"82", "CreationDate":"2012-12-01T23:09:08.837", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-12-04T01:28:55.747", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2012-12-04T01:28:55.747", "Score":"4", "CommentCount":"2", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}