{"Body":"<p>As people have already pointed out in the comments there are some confusions in the question. The problem is that ergative and accusative, which are normally used to talk about case/agreement patterns across transitive and intransitive verbs, have been extended to talk about contrasts across different types of intransitive verbs, namely unergatives and unaccusatives.</p>\n\n<p>A language manifests ergativity if the subject of intransitive verbs behaves like the object of transitive verbs to the exclusion of the subject of transitive verbs. Languages can manifest ergativity in their case, their agreement, their syntax, etc. Mayan languages, for instance, have ergative agreement.</p>\n\n<p>Kaqchikel:</p>\n\n<pre><code>X    *e*     ki    tz'ët\nASP  *O3p*   S3p   see\n*They* saw them.\n\nX    *e'*    el\nASP  *S3p*   left\n*They* left.\n</code></pre>\n\n<p>Note above that the object agreement in the transitive verb is the same as the same as the subject agreement in the intransitive verb, namely <strong>e</strong>. This makes it ergative. In contrast, look at the English pronouns. The two third person subject pronouns are the same, but the object pronoun is different. This means that case in English is patterning accusatively.</p>\n\n<p>Where does unaccusative and unergative come from then? Well it was noticed that some subjects of intransitive verbs seem more agent-y while other subjects of intransitive verbs seem more patient-y. Moreover, in some languages, there are clear syntactic and morphosyntactic differences between these two classes of intransitive predicates. The logic behind the names goes something like this: Well, the agent-y subjects of certain intransitive verbs are getting treated special. That reminds me of how agents of transitive verbs in ergative languages are treated special. Let's call those special intransitive subject unergative. In contrast, the patient-y subjects of those other intransitive verbs are being treated special. That reminds me of how patients of transitive verbs in accusative languages are treated special. Let's call those guys unaccusative. </p>\n\n<p>In English its hard to talk about unaccusativity and unegativity because we don't have the best diagnostics. Other languages, do though. A classic case is perfect forms of intransitives in Italian. Different intransitive verbs take different forms of the copula.</p>\n\n<blockquote>\n  <ul>\n  <li><p><strong>È</strong> arrivato.<br>\n  He has arrived </p></li>\n  <li><p><strong>Ha</strong> telefonato.<br>\n  He has called.</p></li>\n  </ul>\n</blockquote>\n\n<p>When you look at more and more of these intransitives it looks like the agent-y, or unergative ones, use <strong>ha</strong>, while the patient-y, or unaccusative ones, use <strong>È</strong>.</p>\n\n<p>As for drawing trees. People usually assume that it's the unaccusative subjects that are treated differently. In a derivational theory, they are assumed to start out as objects to the intransitive verb, which then move to subject position. One piece of evidence for this, looking back at Italian, is that the passive form of the transitive verbs use the <strong>È</strong> you see with unaccusatives. In derivational theories of the passive, the subject starts out in object position and only moves to subject position later.</p>\n\n<blockquote>\n  <p><strong>È</strong> stato ucciso.<br>\n   He was killed.</p>\n</blockquote>\n\n<p>So long story short, your example (4) is a normal transitive clause. It has no bearing on unaccusativity or unergativity. You examples (1) and (3) are unaccusative, but to convince me you would need to give me some diagnostics. Once you have those, you could try to argue that the subjects of (1) and (3) are underlying objects. (2) might in fact be unergative. Once again, marshall some arguments. If it turns out to behave differently than other patient-y intransitive subejects, you might be able to argue that these subjects originate in subject position or something.</p>\n", "Id":"2928", "ParentId":"2922", "LastEditorUserId":"111", "CreationDate":"2012-12-03T16:49:13.710", "OwnerUserId":"390", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-12-03T17:06:28.417", "LastEditedUser":{"UpVotes":"308", "DownVotes":"10", "Id":"111", "AccountId":"514008", "Views":"172", "Reputation":"5430", "CreationDate":"2011-09-14T09:33:29.710", "DisplayName":"Alenanno", "LastAccessDate":"2014-01-19T00:38:35.883", "AboutMe":"<p>I'm a student majoring in Languages (branch: Linguistics), currently working as a freelance translator. I've recently discovered <a href=\"http://db.tt/WpiKeReH\" rel=\"nofollow\">Dropbox</a> and I'm going to use it for my needs! :)</p>\n\n<p><em><strong>I love</em></strong><br>\nLanguages, Movies (Fantasy, Sci-Fi, Tarantino, etc.), Music, 3D Graphics, books and so on. </p>\n\n<p>Appointed ♦ Moderator Pro Tempore on <a href=\"http://area51.stackexchange.com/proposals/6673/linguistics?referrer=GlDGLdkDYNxMg1X13CJ1vg2\">Linguistics SE</a>, <a href=\"http://area51.stackexchange.com/proposals/6388/chinese-language-usage?referrer=XzTG1Nz01tc01sJEhak_6g2\">Chinese SE</a> and the <a href=\"http://area51.stackexchange.com/proposals/10848/russian-language-usage?referrer=J7IYS3ZUomUDvVVb-6SmDQ2\">Russian SE</a> site. If you're interested in other Stack Exchanges, try the <a href=\"http://area51.stackexchange.com/proposals/42949/italian-language-usage?referrer=ALVtGpK0tjLp1Lw15QCaUA2\">Italian SE</a> site.</p>\n\n<p>I like to lurk on other sites' Metas. <em>Meta is fun!</em> </p>\n\n<p><strong>My feature requests</strong>:</p>\n\n<ol>\n<li><a href=\"http://meta.stackoverflow.com/q/135786/176533\">Alert a moderator when an answer is improved after a post notice</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/138273/176533\">Automatically add chat event to the community bulletin (or make it easier)</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/121363/176533\">Give 10k users the ability to see the total count of flags they've handled</a></li>\n</ol>\n\n<p><strong>Moderator issues</strong>: If you have concerns or want to contact me about my moderation, you can find/ping me either in the <a href=\"http://chat.stackexchange.com/rooms/1336/linguistics\">Linguistics SE chat room</a> or <a href=\"http://chat.stackexchange.com/rooms/1984/chinese-language-and-usage\">CL&amp;U chat room</a>; if I'm not there or I'm \"idle\", just ping me! Please <em>avoid</em> using my personal email for such things. Use the chat rooms.</p>\n\n<hr>\n\n<p><strong>Languages List</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <sup>Languages with  * = learning on my own</sup></p>\n\n<p><strong>Mother Tongue:</strong> Italian, Sardinian;<br>\n<strong>Fluent:</strong> English, Spanish;<br>\n<strong>Less Fluent:</strong> French, German, Russian;<br>\n<strong>Learning:</strong> Japanese*, Chinese*, Swedish*, Greek*, Finnish*;<br>\n<strong>Willing to learn:</strong> Welsh, Korean, Dutch, Arabic, Hebrew, Hindi [to be continued]</p>\n\n<p>Me gusta el Español.<br>\nJ'aime le Français.<br>\nDeutsch gefällt mir.<br>\nМне нравится Русский язык.<br>\n私は日本語が好きです。<br>\n我爱中文。<br>\nJag älskar Svenska.</p>\n"}, "LastActivityDate":"2012-12-03T17:06:28.417", "Score":"3", "CommentCount":"5", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://rhenderson.org", "DownVotes":"0", "Id":"390", "AccountId":"174943", "Views":"6", "Reputation":"361", "CreationDate":"2011-10-06T12:43:57.560", "DisplayName":"rmh", "LastAccessDate":"2013-01-08T16:29:04.403", "AboutMe":""}}