{"comments":[], "Body":"<p>The answers you seek are in \"Talking Hands\" by Margalit Fox (avail only in paper last I checked). For primarily cultural reasons, sign was ignored by academia until very recently, and this book happens to compile a lot of the recent work. By the quip the book is about the author's trip to the middle east to observe linguists studying a newly formed sign language. To fill in the gaps of the book and to explain what she was seeing, the book talks a lot about the similarities among the sign languages of the world. Some of the similarities are due to genetic relationships (ASL is descendant, roughly from French SL). Nicaraguan ASL and the middle eastern one the book studies are nearly a priori or at least as close to that as you can get in the real world.</p>\n\n<p>Some things that appear in many sign languages (even unrelated) are verbs that show spatial agreement, like when in ASL you sign , I-give-you, it is a single sign moved from me towards you. The same pattern pops up in unrelated sign languages, hinting at the possibility of SL universals. But like I said earlier, the research on global sign language is pretty new and suffers the same sort of problems that endangered languages suffer, few speakers (compared to English and French) and few researchers.</p>\n\n<p><a href=\"http://linguistics.stackexchange.com/questions/139/is-nicaraguan-sign-language-the-only-language-born-from-nothing\">Here is a tangentially related question</a></p>\n", "Id":"2950", "ParentId":"2941", "CreationDate":"2012-12-09T01:06:03.593", "Score":"2", "PostTypeId":"2", "OwnerUserId":"20", "LastActivityDate":"2012-12-09T01:06:03.593", "OwnerUser":{"UpVotes":"72", "WebsiteUrl":"http://suburbandestiny.com/conlang", "Id":"20", "AccountId":"15651", "CreationDate":"2011-09-13T20:53:42.550", "AboutMe":"<p>I'm a programmer by day and an amateur linguist by night.</p>\n\n<p>I organize the Arlington Linguistics Book Club, where we read a wide variety of books that make the science of linguistic accessible to a popular audience.</p>\n", "Age":"41", "Location":"United States", "DownVotes":"6", "Views":"39", "Reputation":"1657", "DisplayName":"MatthewMartin", "LastAccessDate":"2014-01-08T19:46:09.130"}}