{"Body":"<p>This may take less time, but it does not mean that the same information is conveyed. Being a native Russian speaker I find that with English I can convey only the basic meaning of a sentence and the overtones and other circumstances are lost. </p>\n\n<p>Sometimes you can improve the resemblance of the original meaning by adding some additional qualifier words, but in many cases you cannot do anything without explanation that would span a page (and even then it is unlikely would be understood precisely).</p>\n\n<p>In short one can claim that Black&amp;White video is more efficient than the color one (it takes less volume), but actually it conveys less information.</p>\n\n<p>I would describe English as a language with less \"resolution\" than Russian, that is less suitable to convey the details. With English you land not exactly at the point but somewhere near it (which may be enough for understanding a film though).</p>\n\n<p>In English, for example, it is difficult for a speaker to covey his own attitude to the subject without stating it explicitly. </p>\n\n<p>I think that there could be found examples of hate speech or political propaganda in Russian or German which after being translated to English would look quite neutral and unmarked. The English speaker would not even understand why the sequence is considered offensive or emotional.</p>\n\n<p>A similar thing is described in Orwell's \"1984\" where a new, simplified language \"newspeak\" (based on English) is invented. It has further reduced \"resolution\" of the meaning so you would have no means to convey emotions and shades (for example, one word \"ungood\" for bad, terrible, poor, inefficient etc).</p>\n", "Id":"2971", "ParentId":"2550", "LastEditorUserId":"624", "CreationDate":"2012-12-14T00:29:34.177", "OwnerUserId":"624", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-12-14T00:52:54.217", "LastEditedUser":{"UpVotes":"81", "DownVotes":"60", "Id":"624", "AccountId":"407237", "Views":"34", "Reputation":"1743", "CreationDate":"2011-12-28T07:24:31.420", "DisplayName":"Anixx", "LastAccessDate":"2014-01-18T10:33:34.597"}, "LastActivityDate":"2012-12-14T00:52:54.217", "Score":"4", "OwnerUser":{"UpVotes":"81", "DownVotes":"60", "Id":"624", "AccountId":"407237", "Views":"34", "Reputation":"1743", "CreationDate":"2011-12-28T07:24:31.420", "DisplayName":"Anixx", "LastAccessDate":"2014-01-18T10:33:34.597"}}