{"OwnerUser":{"UpVotes":"3", "DownVotes":"0", "Id":"1601", "AccountId":"262132", "Views":"1", "Reputation":"106", "CreationDate":"2012-12-20T03:21:37.733", "DisplayName":"Axen Zhyrkhinsky", "LastAccessDate":"2014-01-05T12:38:01.483"}, "comments":[], "Body":"<p>There seems to be no natural language with just one word class for both nouns and verbs. Although some Philippine-type Austronesian languages like Tagalog are said to have no noun/verb distinction, it seems what they have is weak distinction instead.</p>\n\n<p>According to <a href=\"http://www.uni-muenster.de/imperia/md/content/allgemeine_sprachwissenschaft/dozenten-unterlagen/himmelmann/lexcat.pdf\" rel=\"nofollow\">Himmelmann</a>, </p>\n\n<blockquote>\n  <p>With regard to syntactic categories it may be argued that all Tagalog\n  content words (both roots and derived words) are categorially\n  indistinct, i.e. they may all occur in essentially the same basic\n  syntactic positions (section 3.1)</p>\n</blockquote>\n\n<p>but <a href=\"http://www.gial.edu/images/pdf/Kroeger-reply-Foley-LFG98.pdf\" rel=\"nofollow\">Kroeger</a> disputes this saying </p>\n\n<blockquote>\n  <p>The distributional similarities mentioned above between nouns and\n  verbs in Tagalog apply equally to adjectives and even PPs.  Each of\n  the four categories may appear as (i) a clausal predicate, (ii) a\n  modifier within the NP, or (iii) a noun phrase..[but]..this difference\n  between verbal and non-verbal clauses provides a clear distributional\n  test for distinguishing between verbs and all other lexical\n  categories: <strong><em>only a verb can function as the predicate of a verbal\n  clause</em></strong>.</p>\n</blockquote>\n\n<p>According to Himmelmann, </p>\n\n<blockquote>\n  <p>With regard to lexical categories, however, there are clear-cut\n  categorial distinctions (section 3.2).</p>\n</blockquote>\n\n<p>His conclusion:</p>\n\n<blockquote>\n  <p>An important aspect of the voice system in Tagalog is the fact that voice-marked words (V-words) as well as the roots from which they are derived <strong><em>belong to lexical categories which are very different from the lexical categories found in more familiar languages such as English</em></strong>. It has been repeatedly suggested that the difference \n  pertains to the fact that Tagalog roots are precategorial and/or that there is no distinction between nouns and verbs in Tagalog. The preceding sections present a somewhat different explication of the difference between the two systems of lexical categories and its repercussions for the voice systems. Specifically, it is claimed that \n  Tagalog roots are generally not bound and/or precategorial roots. Instead, Tagalog roots belong to different morpho-lexical classes. That is, it cannot be predicted solely on the basis of their meaning with which affixes a given root may occur. Furthermore, all kinds of roots, including roots denoting ACTIONS, allow for unaffixed uses. In their unaffixed uses, roots may denote THINGS, ANIMATE BEINGS, PROPERTIES, STATES, RESULTS OF\n  ACTIONS, NAMES OF ACTIONS, etc., i.e. concepts which in English are generally rendered by nouns or adjectives.\n  What roots cannot denote is the actual and specific performance of an action. Only V-words may denote the actual performance of an action. In this regard, Tagalog V-words are similar to English verbs. They differ, however, from English verbs in the following important respects:</p>\n  \n  <ul>\n  <li>While Tagalog V-words clearly belong to their own morpho-lexical category, they do not belong to a special  terminal syntactic\n  category. That is, V-words have morphological and semantic properties\n  which set them  apart from all other Tagalog content words. But with\n  regard to the positions they may occupy in a phrase  structure tree\n  they do not differ from other content words. In English, on the other\n  hand, there is an  unambiguous correlation between (morpho-)lexical \n  and terminal syntactic categories: Membership in a given  lexical\n  (sub-)category implies membership in a specific terminal syntactic\n  category (‘die’ is an intransitive  verb, and hence a verb and not a\n  noun).    </li>\n  <li>All Tagalog V-words are necessarily derived, while in English there are both basic and derived verbs. The  derivation of Tagalog V-words\n  is manifest both formally and semantically: Formally, the\n  morpho-lexical  category of the root is changed to the<br>\n  morpho-lexical category of V-words. Semantically, an oriented action\n  expression is derived from an expression which denotes a THING, STATE,\n  NAME OF AN ACTION, RESULT OF AN  ACTION, etc. The notion oriented\n  action expression conveys two things: First, oriented action\n  expressions  denote the actual performance of an action (and not the\n  name or the result of an action). Second, they denote  the actual\n  performance of an action in such a way that at the same time they also\n  denote one of the  participants involved in the action.</li>\n  <li>For English verbs active voice is the basic, non-derived voice. For Tagalog V-words all voices are derived in  the same way. Hence, it\n  does not make sense to consider one of the four Tagalog voices the\n  basic voice.</li>\n  </ul>\n</blockquote>\n", "Id":"2990", "ParentId":"2099", "CreationDate":"2012-12-20T05:14:27.463", "Score":"2", "PostTypeId":"2", "OwnerUserId":"1601", "LastActivityDate":"2012-12-20T05:14:27.463", "CommentCount":"1"}