{"comments":[], "Body":"<p>It's not clear what you mean when you ask if it is okay. If that is how the language works, then that's how it works. I assume that what you're really asking is whether it okay to analyze some null case as ERG. </p>\n\n<p>It is well known that it is difficult to decide whether Austronesian languages have ergative alignment or accusative alignment because their incredibly rich voice systems make it difficult to tell what is the \"basic\" transitive clause. We need to know what the basic transitive clause looks like because that is what we compare to the intransitive clause to determine whether the pattern at hand looks ergative or not.</p>\n\n<p>You give two options for the basic transitive clause.</p>\n\n<p>(1) V+patient trigger _ ERG-Noun _ ABS-Noun (V_S_O);</p>\n\n<p>(2) V+actor trigger _ OBL-Noun _ ABS-Noun (V_O_S);</p>\n\n<p>Say we take (1) as basic. Then the alignment looks ergative because S in actor voice intransitive get marked with the same case as O in (1). If (1) is the basic transitive clause, then what is going on in (2)? We have to analyze it as some sort of antipassive, where O has been demoted and appears in an oblique, while S gets the same case as actor voice intransitive because (2) is actually intransitive itself in virtue of being an antipassive.</p>\n\n<p>What if we take (2) as the basic transitive clause? Then the alignment looks accusative because the A argument gets marked with the same case actor voice intransitive subjects. This would mean that what you call OBL here is actually an accusative case. If we take this path, then what must we say about (1). Well, we have to say that it is a passive clause. The thematic object has been promoted to subject of an intransitive verb, which is what it bears the same case as a normal intransitive subject. What you're call ERG would then have to to be the oblique agent.</p>\n\n<p>So what can the morphology tell us (In particular, what can the fact that your ERG above is unmarked tell us)? I think we have to pick our poison. It is typologically rare for ergative to be the unmarked case. At the same time, it is also typologically rare for oblique arguments, like the demoted agent of a passive, to be morphologically unmarked. Whether we decide (1) or (2) is the basic transitive clause, we're in a pickle. I really can't say anything more without looking at more data.</p>\n\n<p>NOTE: You could always just reject this dichotomy and say that this language is neither ergative nor accusative, but has a tripartite case systems where the A case is morphologically unmarked. I think this is typologically rare, but I don't know as much about these kinds of systems. </p>\n", "Id":"2993", "ParentId":"2981", "CreationDate":"2012-12-20T21:16:06.000", "Score":"3", "PostTypeId":"2", "OwnerUserId":"390", "LastActivityDate":"2012-12-20T21:16:06.000", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://rhenderson.org", "DownVotes":"0", "Id":"390", "AccountId":"174943", "Views":"6", "Reputation":"361", "CreationDate":"2011-10-06T12:43:57.560", "DisplayName":"rmh", "LastAccessDate":"2013-01-08T16:29:04.403", "AboutMe":""}}