{"Body":"<p>The \"piratespeak\" that we have come to recognize in the west is due to the opera <a href=\"http://en.wikipedia.org/wiki/The_Pirates_of_Penzance\">Pirates of Penzance</a>. What you think of as \"the pirate accent\" is the accent of Cornwall (where <a href=\"http://en.wikipedia.org/wiki/Penzance\">Penzance</a> is located). The coastline of this part of England is rocky and there were a large number of shipwrecks (selling the loot from wrecked ships provided extra income for many locals). According to legends, the number of wrecks was insufficient, so some of the <a href=\"http://en.wikipedia.org/wiki/Wrecking_%28shipwreck%29#Wrecking_in_Britain\">locals would hang a lantern from the neck of a horse or cow</a>, so the up and down motion of the lantern would fool victims into thinking that it was another ship and thus safe to continue sailing in that direction. A number of ships smashing into the rocky coastline during storms was one major motivation for the English to develop more accurate methods for determining <a href=\"http://en.wikipedia.org/wiki/Longitude_prize\">longitude</a> (in contrast, latitude is simple to determine with a sextant). The book, or TV series, called <a href=\"http://en.wikipedia.org/wiki/Longitude_%28TV_series%29\">Longitude</a> is a good place to start. </p>\n\n<blockquote>\n  <p><em>\"Serious pursuit of a means of fixing longitude began in 1707, after four British frigates ran aground in fog near their home port owing to total east-west disorientation, with the loss of nearly 2,000 men. Sobel recounts, in a horrifying passage, how after the vessels became lost in a week-long mist, a sailor approached Admiral Sir Clowdisley Shovell to declare that a private navigational logbook he had been keeping indicated the squadron was about to founder on the dangerous rocks of Scilly Isles southwest of England. British fleet rules then forbade any study of navigation by non-officers, because navigators had a wizard's status no enlisted personnel were allowed to challenge. Sir Clowdisley immediately had the sailor hanged for questioning the judgment of an Officer. Shortly afterward, his flagship ploughed into the Scilly rocks, the three following ships faithfully smashing in as well.</em>   </p>\n</blockquote>\n\n<p><a href=\"http://ticktocktony.com/Newsletter/time-zones.html\">Source</a>. The <a href=\"http://en.wikipedia.org/wiki/Scilly_Isles\">Scilly Isles</a> are off the tip of Cornwall. </p>\n", "Id":"300", "ParentId":"296", "LastEditorUserId":"117", "CreationDate":"2011-09-19T18:17:21.223", "OwnerUserId":"117", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-19T19:53:34.530", "LastEditedUser":{"UpVotes":"80", "Location":"Denver, CO", "DownVotes":"1", "Id":"117", "AccountId":"46214", "Views":"11", "Reputation":"609", "CreationDate":"2011-09-14T13:41:53.967", "DisplayName":"Tangurena", "LastAccessDate":"2013-10-09T17:10:34.627", "AboutMe":"<p>I am a .NET developer.</p>\n"}, "LastActivityDate":"2011-09-19T19:53:34.530", "Score":"6", "CommentCount":"1", "OwnerUser":{"UpVotes":"80", "Location":"Denver, CO", "DownVotes":"1", "Id":"117", "AccountId":"46214", "Views":"11", "Reputation":"609", "CreationDate":"2011-09-14T13:41:53.967", "DisplayName":"Tangurena", "LastAccessDate":"2013-10-09T17:10:34.627", "AboutMe":"<p>I am a .NET developer.</p>\n"}}