{"comments":[], "Body":"<p>I think, there are several reasons why some languages have developed a broad variety of particles (e.g. <a href=\"http://www.thai-language.com/id/589972\" rel=\"nofollow\">Thai</a>) while other have not (nor there are any historical evidences they have ever been).</p>\n\n<p>Of course, Confucian culture made a great impact on this, with its idea of saving one's face and harmonious relations are often at premium. Use of the appropriate polite particle in a sentence can add just the right amount of politeness for human communication.</p>\n\n<p>However, you are right asking the question here. There are researches <a href=\"http://www.linguistics.ucla.edu/people/jun/workshop2007icphs/pittayaporn_thai.pdf\" rel=\"nofollow\">(1; PDF)</a> that suggest pure linguistic reasons for particles have been more developed <strong>in tonal languages</strong>.<br>\nIndeed, a non-tonal language uses stress and tone to change the feeling and mood of a sentence. Asking someone, <em>\"What are you doing?\"</em>, depending on the tone of the voice, can completely change the meaning from a greeting to a rude command.</p>\n\n<p>A tonal language, where the meaning of a word is determined by the pitch of the voice, uses particles, usually tacked onto the end of a sentence, to convey emotion and feeling. If you tried to express feeling and mood through intonation of voice, it may interfere with the tone (and therefore meaning) of a word.</p>\n\n<p>A side note, Japanese used to be a tonal language. There are relics of tones, like 高低アクセント.</p>\n\n<p>However, in Thai language, even nouns or verbs may change depending on your relation to the listener (e.g. younger versus elder person, monks or royal family members). E.g. <code>to know</code> has polite <code>ทราบ [sâːp]</code> and informal <code>รู้ [rúː]</code> forms.<br>\nThey don't seem to be derived from tonal nature of the language, but most of the formal words I'm aware of are derived from ancient Pali/Sanskrit background.</p>\n\n<p>So, to summarize the answer to your question:<br>\n<strong>Many Asian languages had reasons to develop a set of polite particles, primarily because of their tonal nature, but also because of cultural reasons like harmony and saving one's face</strong>.</p>\n", "Id":"3005", "ParentId":"3004", "CreationDate":"2012-12-26T00:13:08.070", "Score":"4", "PostTypeId":"2", "OwnerUserId":"1009", "LastActivityDate":"2012-12-26T00:13:08.070", "OwnerUser":{"UpVotes":"512", "WebsiteUrl":"http://weew-waaw.com", "Id":"1009", "AccountId":"947951", "CreationDate":"2012-05-15T02:50:16.013", "AboutMe":"<p><img src=\"http://i.stack.imgur.com/VxMqM.jpg\" alt=\"Weew-Waaw, Thai to English, Thai to Russian transcription\"><br>\nI'm working on a project of rule-based Thai transcription: (the link is temporarily unavailable)<br>\nTechnically, it is written in F# with a C# front-end.<br>\nI would be happy to get acquainted with those who are experienced with NLP (Natural Language Processing), just ping me in the SE chat. :-)</p>\n", "Age":"42", "Location":"Bangkok, Thailand", "DownVotes":"50", "Views":"36", "Reputation":"1656", "DisplayName":"bytebuster", "LastAccessDate":"2014-01-19T00:53:20.473"}}