{"Body":"<p>First, I'll point to a previous question on this SE, <a href=\"http://linguistics.stackexchange.com/questions/836/what-meaningful-distinction-is-there-between-morphology-and-syntax\">What meaningful distinction is there between morphology and syntax?</a>. I'll just present one line of approach.</p>\n\n<p>A seminal article is Mark Baker's 1985 <a href=\"http://www.jstor.org/stable/4178442\">The Mirror Principle and morphosyntactic explanation</a>, wherein he defines the Mirror Principle as follows:</p>\n\n<blockquote>\n  <p>Morphological derivations must directly reflect syntactic derivations (and vice \n  versa). </p>\n</blockquote>\n\n<p>Subsequently, Distributed Morphology (DM) was developed by Morris Halle &amp; Alec Marantz and colleagues. I quote from their 1993 paper, <a href=\"http://www.uni-leipzig.de/~muellerg/dm8.pdf\">Distributed Morphology and the pieces of inflection</a> (pdf):</p>\n\n<blockquote>\n  <p>[...] we take the phonological realization of the terminal elements in the syntax to be governed by lexical (Vocabulary) entries that relate bundles of morphosyntactic features to bundles of phonological features.</p>\n  \n  <p>We have called our approach Distributed Morphology to highlight the fact that the machinery of what traditionally has been called morphology is not concentrated in a single component of the grammar, but rather is distributed among several different components.</p>\n</blockquote>\n\n<p>Two points: first, it is in a sense the opposite of what you mention in your question, in that a morphologically derived word is claimed to have internal syntactic structure. Second, DM is not pure syntax (hence the \"Distributed\" label): it does have a number of post-syntactic operations that derives morphological generalizations such as syncretism (where different morphosyntactic feature bundles like first person singular and second person singular are realized by the same morpheme).</p>\n\n<p>There are a number of resources for DM:</p>\n\n<ul>\n<li><p><a href=\"http://en.wikipedia.org/wiki/Distributed_morphology\">The Wikipedia article</a></p></li>\n<li><p>Rolf Noyer's <a href=\"http://www.ling.upenn.edu/~rnoyer/dm/\">DM Frequently Asked Questions page</a> and <a href=\"http://www.ling.upenn.edu/~rnoyer/dm/bib.html\">bibliography</a>, both written in the late 90s</p></li>\n<li><p>Heidi Harley and Rolf Noyer 1999, <a href=\"http://babel.ucsc.edu/~hank/mrg.readings/Harley+Noyer1999.pdf\">State-of-the-Article: Distributed Morphology</a> (pdf), another overview which also has an attached bibliography</p></li>\n<li><p>David Embick and Rolf Noyer 2006, <a href=\"http://www.ling.upenn.edu/~embick/interface.pdf\">Distributed Morphology and the syntax-morphology interface</a> (pdf), a handbook article</p></li>\n<li><p>Andrew Nevins and Karlos Arregi 2012, <a href=\"http://www.springer.com/education+%26+language/linguistics/book/978-94-007-3888-1\">Morphotactics: Basque Auxiliaries and The Structure of Spellout</a>, a recent book that shows Distributed Morphology \"in action\" by using the framework to account for the morphosyntax of the Basque auxiliary system.</p></li>\n</ul>\n", "Id":"3016", "ParentId":"3015", "LastEditorUserId":"397", "CreationDate":"2012-12-30T09:06:02.373", "OwnerUserId":"397", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-12-30T09:19:01.950", "LastEditedUser":{"UpVotes":"50", "DownVotes":"86", "Id":"397", "AccountId":"959564", "Views":"7", "Reputation":"680", "CreationDate":"2011-10-07T14:54:31.260", "DisplayName":"Aerlinthe", "LastAccessDate":"2013-12-10T17:42:44.790"}, "LastActivityDate":"2012-12-30T09:19:01.950", "Score":"5", "OwnerUser":{"UpVotes":"50", "DownVotes":"86", "Id":"397", "AccountId":"959564", "Views":"7", "Reputation":"680", "CreationDate":"2011-10-07T14:54:31.260", "DisplayName":"Aerlinthe", "LastAccessDate":"2013-12-10T17:42:44.790"}}