{"Body":"<p>I believe language is <em>by definition</em> symbolic; if your \"gradient of sounds\" <em>represents</em> anything, then I would call that a symbol. So I would say no.</p>\n\n<p>I'd say language is communicating information without relying exclusively or mainly on actions. If I hit a man and kill him, my intention that I wanted him dead is thereby communicated to others; but it isn't language.</p>\n\n<p>If I kick you in a medium-soft manner, I may thereby communicate to you mild displeasure. It is not merely a direct action, because hurting you, the obvious result of kicking someone, is not really my intention. You might call that language, although others insist that language should involve more complexity.</p>\n\n<p>If I emit a certain specific gnashing sound through my teeth to indicate that there is a rock that calls for your attention, and the volume expresses its hardness, then that is symbolic, because there is no intrinsic connection whatsoever between volume and the hardness of a rock.</p>\n\n<p>Even if there were <em>some</em> connection, but only a partial one, as in when sounds imitate the sound of something real, you might still call that language, although some will object, as with the kicking example above. But it cannot be denied that an imitation of the sound of a fox is not a fox, and yet I want to communicate to you \"there is a fox\", so that some form of symbolism is involved even in so basic an example.</p>\n", "Id":"3026", "ParentId":"3023", "LastEditorUserId":"82", "CreationDate":"2013-01-02T15:22:37.727", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-01-03T01:10:34.800", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-01-03T01:10:34.800", "Score":"5", "CommentCount":"1", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}