{"Body":"<p><strong>Historical Reasons</strong></p>\n\n<p>The most of these differences in English seem to be due to historical reasons.</p>\n\n<p>\"China\" seems to refer to either <a href=\"http://en.wikipedia.org/wiki/China#Etymology\">the Qin province or the Qin Dynasty</a> which comes to English via Persian.</p>\n\n<p>Similarly, \"Japan\" seems to have come to English via <a href=\"http://en.wikipedia.org/wiki/Names_of_Japan#Jippon\">the Portuguese name for Japan</a> (itself a transliteration of <em>nippon</em>).</p>\n\n<p>Finally, \"Germany\" refers to the geographic area called <a href=\"http://en.wikipedia.org/wiki/Germania\">Germania</a> in which Germany resides.</p>\n\n<p>You can see a similar process at work on a much smaller scale with people who still refer to \"Burma\" (which changed its name to Myanmar), \"Ivory Coast\" (which has stated that its name is always \"Cote d'Ivoire\", regardless of the language), and \"Czechoslavakia\" (a country that no longer exists and has been replaced by both Czech Republic and Slovakia, officially Slovak Republic).</p>\n\n<p><strong>Pronunciation</strong></p>\n\n<p>Other times these differences can, as you noted, occur for simple pronunciation reasons. This is why we refer to \"Spain\" instead of <em>España</em>. Also, as noted, the Japan example from above may fit this category as well.</p>\n\n<p><strong>Adaptations in other languages</strong></p>\n\n<p>During my short stint studying Chinese I was rather jealous that America became 美國 (<em>meiguo</em>, literally \"beautiful country\") and England became 英國 (<em>yingguo</em>, literally \"hero country\") while my native Canada was simply 加拿大 (<em>jianada</em>), a mere transliteration.</p>\n\n<p>However, the truth is a bit more complicated. <em>Meiguo</em> seems to be derived from <a href=\"http://en.wiktionary.org/wiki/%E7%BE%8E%E5%9C%8B#Etymology\">a transliteration of \"America\"</a> that got shortened and affixed with <em>guo</em> (country). Similarly, <em>yingguo</em> seems to also be derived from <a href=\"http://chinese.stackexchange.com/questions/1713/origin-of-%E8%8B%B1%E5%9B%BD-england\">a shortened and affixed transliteration</a>. So these country names are both a transliteration and an adaptation at the same time.</p>\n\n<p>Interestingly, American and England seem to have come to Korean via Chinese (미국, <em>miguk</em>, and 영국, <em>yeongguk</em>, respectively) while France (in Mandarin 法國, <em>faguo</em>, \"law country\". Presumably via the same mechanism as America and England), which would be koreanized as 법국 (<em>peopguk</em>), is actually 프랑스 (<em>phurangsu</em>, a more faithful transliteration).</p>\n\n<p>Some other interesting adaptations of country names in Korean are China and Japan. Korean, like many East-Asian languages, borrowed a lot from Classical Chinese (despite being linguistically unrelated). As such, many Chinese characters have a Korean pronunciation. This is how we can tell that 미국 and 영국 are derived from the Chinese. As you have stated, the Mandarin name for China is 中國 (<em>zhongguo</em>). Using the Korean pronunciations of those Chinese characters we get the Korean name for China: 중국 (<em>jungguk</em>). Similarly, <em>Nippon</em> is written in Chinese (technically, in Kanji) as 日本 which gives us the Korean name for Japan: 일본 (<em>ilbon</em>). Oddly, adaptations of this sort do not extend to city names but do sometimes apply to people's names.</p>\n", "Id":"3028", "ParentId":"3027", "LastEditorUserId":"746", "CreationDate":"2013-01-03T05:07:25.540", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-01-10T07:58:16.797", "LastEditedUser":{"UpVotes":"62", "WebsiteUrl":"http://www.overpunch.com", "Id":"746", "AccountId":"63513", "CreationDate":"2012-02-07T00:29:49.180", "AboutMe":"<p>I am a computational linguistics PhD candidate. But before that, long before that, I fell in love with languages.</p>\n\n<p>By the way, if you're addicted to Stack Exchange and use iOS, check out <a href=\"http://stackapps.com/questions/3673/stackwise-a-beautiful-way-to-browse-stack-exchange-sites\">Stackwise for iOS</a> and browse Stack Exchange beautifully.</p>\n", "Age":"28", "Location":"Sydney, Australia", "DownVotes":"12", "Views":"15", "Reputation":"1989", "DisplayName":"jogloran", "LastAccessDate":"2014-01-18T09:49:34.847"}, "LastActivityDate":"2013-01-10T07:58:16.797", "Score":"14", "CommentCount":"3", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}