{"Body":"<p>Linguistics belongs to <a href=\"http://en.wikipedia.org/wiki/Humanities\">humanities</a>. Unlike exact sciences, linguistic phenomenons often have social nature and therefore can't be measured or applied blindly.</p>\n\n<p>There are laws and tendencies, but they may apply differently in different times, locations, and conditions.</p>\n\n<p>Take an example of <a href=\"http://linguistics.stackexchange.com/questions/2565/jespersens-cycle-why-is-it-defined-cycle\">Jespersen's cycle</a>: the same language may have different tendencies as per how to build a negation, in different times. Other languages may totally skip this phenomenon (e.g., Slavic). Of course, if you read about Jespersen's cycle, you have to keep in mind that <em>\"this is just one analysis\"</em> which has a nice fit for certain languages and N/A for others.</p>\n\n<p>There's another thought. <strong>Linguistics is a young science.</strong> Although the earliest linguistic document, <a href=\"http://en.wikipedia.org/wiki/P%C4%81%E1%B9%87ini\">Panini</a> is dated about 500 BCE, linguistics as a science became taught in European universities only in 17th century. Compare to Newton's mechanics that was almost fully discovered (and stays unchanged) since the same time.<br>\nSo it seems to be normal that some discussions yet haven't been settled till today, and a good scientist should be ready to admit their mistakes and accept another theory, if it is proven better.</p>\n\n<p>Historical linguistics has problems similar to common history: there are many artifacts of written language, but they may be contradictory, e.g. the same document may have several spellings of the same word, and it's hard to figure out what is just a typo, and what is a proper spelling.</p>\n\n<p>The bottom line, maybe the most important.<br>\nAs per linguistics, <strong>courses do not teach you what theory is correct.</strong> They teach you to read, to argue, and to think by yourself. To make your own mistakes and to fix them.<br>\n<strong>Don't stick to a certain theory.</strong> Learn as many different views as you can and pick which one sounds better for you. Don't be afraid to change your opinion if you find evidences powerful enough.<br>\nBe a scientist.</p>\n", "Id":"3030", "ParentId":"3029", "LastEditorUserId":"1009", "CreationDate":"2013-01-03T08:02:33.913", "OwnerUserId":"1009", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-01-03T08:08:42.973", "LastEditedUser":{"UpVotes":"512", "WebsiteUrl":"http://weew-waaw.com", "Id":"1009", "AccountId":"947951", "CreationDate":"2012-05-15T02:50:16.013", "AboutMe":"<p><img src=\"http://i.stack.imgur.com/VxMqM.jpg\" alt=\"Weew-Waaw, Thai to English, Thai to Russian transcription\"><br>\nI'm working on a project of rule-based Thai transcription: (the link is temporarily unavailable)<br>\nTechnically, it is written in F# with a C# front-end.<br>\nI would be happy to get acquainted with those who are experienced with NLP (Natural Language Processing), just ping me in the SE chat. :-)</p>\n", "Age":"42", "Location":"Bangkok, Thailand", "DownVotes":"50", "Views":"36", "Reputation":"1656", "DisplayName":"bytebuster", "LastAccessDate":"2014-01-19T00:53:20.473"}, "LastActivityDate":"2013-01-03T08:08:42.973", "Score":"6", "CommentCount":"1", "OwnerUser":{"UpVotes":"512", "WebsiteUrl":"http://weew-waaw.com", "Id":"1009", "AccountId":"947951", "CreationDate":"2012-05-15T02:50:16.013", "AboutMe":"<p><img src=\"http://i.stack.imgur.com/VxMqM.jpg\" alt=\"Weew-Waaw, Thai to English, Thai to Russian transcription\"><br>\nI'm working on a project of rule-based Thai transcription: (the link is temporarily unavailable)<br>\nTechnically, it is written in F# with a C# front-end.<br>\nI would be happy to get acquainted with those who are experienced with NLP (Natural Language Processing), just ping me in the SE chat. :-)</p>\n", "Age":"42", "Location":"Bangkok, Thailand", "DownVotes":"50", "Views":"36", "Reputation":"1656", "DisplayName":"bytebuster", "LastAccessDate":"2014-01-19T00:53:20.473"}}