{"Body":"<p>The following remarks might be interesting when reflecting on why such text-to-speech software is not presently available:</p>\n\n<blockquote>\n  <p>The phonetic component of a computer system\n  may use an orthographic text, but it does not really require one. Chinese characters would do just\n  as well, as long as there was a character for each possible English syllable. The way most speech\n  synthesis systems work is to search through a vast store of several hours of recorded speech and\n  find the longest possible sequences that match the desired output. In practice this is done with \n  reference to something like a segmental transcription of words, but there is nothing in the theory\n  of concatenative speech synthesis, as this process is called, that requires traditional phonetic\n  segments. In fact it virtually never uses them. The smallest lengths of sounds that are ever pulled\n  out of the store are diphones — the last half of one segment and the first half of another — and\n  even these are used only very occasionally, when there is no matching word or syllable in store.\n  Concatenative synthesis nearly  always manages to  join  whole syllables or even whole long\n  words together. Listeners to high quality synthetic speech agree that the phonetic component of a\n  language generator works quite well by simply finding appropriate bits of stored sounds and then \n  joining  them together. (<a href=\"http://www.linguistics.ucla.edu/people/ladefoge/PLfeaturesParameters.pdf\" rel=\"nofollow\">Ladefoged 2005</a>)</p>\n</blockquote>\n\n<p>Also tangentially relevant, and a good and quick read regardless of one's familiarity with phonetics is a <a href=\"http://www.speech.kth.se/prod/publications/files/qpsr/2005/2005_47_1_009-019.pdf\" rel=\"nofollow\">2005 interview with Gunnar Fant</a>, who was very influential in the early development of digital speech transmission and speech synthesis. </p>\n", "Id":"3039", "ParentId":"3035", "LastEditorUserId":"483", "CreationDate":"2013-01-06T03:29:34.030", "OwnerUserId":"483", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-01-06T03:48:02.530", "LastEditedUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "LastActivityDate":"2013-01-06T03:48:02.530", "Score":"1", "CommentCount":"3", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}