{"Body":"<p>Square brackets ([fubar]) are generally used for what is known as <em>narrow</em> transcription - this includes as much detail as the transcriber feels is necessary. Slashes (/fubar/) represent the <em>broad</em> transcription, which does not include \"predictable\" information.</p>\n\n<p>For example, in English, voiceless plosives are aspirated word-initially and in stressed onsets. Thus, a narrow transcription of \"cool\" might be [kʰul], while a broad transcription would be /kul/. Similarly, \"lack\" could be represented as [læk] and /læk/ - note that broad /k/ can become narrow [k] or [kʰ], depending on its position in the word and surrounding sounds. Because this information is predictable by the above rule, the aspiration is left out of the broad transcription.</p>\n\n<p>In linguistic description, the \"broad\" and \"narrow\" designations are defined somewhat loosely, generally according to whatever convention the linguist reporting the language feels is most useful. Under the Generative Phonology framework, however, these are assumed to represent two distinct stages of phonological processing, each with a psychological reality. Square brackets denote the final stage of processing (which is sent to the articulators), called \"phonetic transcription\", while slashes denote the form stored in the mental lexicon (stripped of all predictable information), called \"phonemic transcription\".</p>\n\n<p>To perform this kind of analysis, first you must determine which sounds are constrastive in the output. For example, in English, [pʰ] and [p] are not contrastive, because [pʰæt] and [pæt] \"pat\" are judged to be \"the same\" word by (most) native speakers (even though [pæt] would be ill-formed). However, in Hindi, [kapʰi] \"coffee\" and [kapi] \"copy\" are two separate words. The generative hypothesis is that each set of non-contrastive sounds is stored as a single unit in the brain, called a <em>phoneme</em> (in slashes), which is transformed into a final form (in brackets) passed to the articulators by a series of serially-ordered rules or simultaneous constraints on the possible output forms.</p>\n", "Id":"304", "ParentId":"301", "LastEditorUserId":"76", "CreationDate":"2011-09-20T04:00:07.737", "OwnerUserId":"76", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-20T17:10:11.163", "LastEditedUser":{"UpVotes":"35", "WebsiteUrl":"http://github.com/alekstorm", "Id":"76", "AccountId":"411223", "CreationDate":"2011-09-13T23:34:32.303", "AboutMe":"", "Age":"24", "Location":"Urbana, IL", "DownVotes":"17", "Views":"36", "Reputation":"1043", "DisplayName":"Alek Storm", "LastAccessDate":"2013-12-09T07:20:27.393"}, "LastActivityDate":"2011-09-20T17:10:11.163", "Score":"20", "OwnerUser":{"UpVotes":"35", "WebsiteUrl":"http://github.com/alekstorm", "Id":"76", "AccountId":"411223", "CreationDate":"2011-09-13T23:34:32.303", "AboutMe":"", "Age":"24", "Location":"Urbana, IL", "DownVotes":"17", "Views":"36", "Reputation":"1043", "DisplayName":"Alek Storm", "LastAccessDate":"2013-12-09T07:20:27.393"}}