{"OwnerUser":{"UpVotes":"90", "Location":"England, United Kingdom", "DownVotes":"10", "Id":"718", "AccountId":"34526", "Views":"13", "Reputation":"1364", "CreationDate":"2012-01-27T00:02:42.473", "DisplayName":"Colin Fine", "LastAccessDate":"2014-01-18T23:15:12.837"}, "comments":[], "Body":"<p>You are on the track of something important, but you are confusing a number of things. </p>\n\n<p>The first thing to say is that language is not written language: written language is a highly divergent subset of language, with a lot of special properties not shared by language in general. Language does not have letters: it has sounds (or in the case of sign language, signs). </p>\n\n<p>The levels you are talking about do exist in languages in general (except that we talk about sounds rather than letters). But there are more fundamental distinctions that can usefully be made. </p>\n\n<p>Most linguists will recognise at least the following:</p>\n\n<ul>\n<li><strong>phonetics</strong> is about the actual sounds that are spoken and heard</li>\n<li><strong>phonology</strong> is about the patterns of sounds in a particular language</li>\n<li><strong>morphology</strong> is about the shapes of words in a language, and how in many languages the shape changes for different grammatical functions</li>\n<li><strong>syntax</strong> is about how a particular language puts words together to make sentences or larger structures</li>\n<li><strong>semantics</strong> is about the meanings of words</li>\n<li><strong>discourse analysis</strong> and <strong>pragmatics</strong> are about how we know what we 'mean' when we talk (eg \"If you like.\" can mean \"I don't really want to\").</li>\n</ul>\n\n<p>There are other areas of study, and different theoretical frameworks; but if you look some of these up you will get some idea. </p>\n", "Id":"3055", "ParentId":"3052", "CreationDate":"2013-01-09T16:30:47.607", "Score":"11", "PostTypeId":"2", "OwnerUserId":"718", "LastActivityDate":"2013-01-09T16:30:47.607", "CommentCount":"2"}