{"Body":"<p>See Colin Fine's response for a general answer on levels of analysis in linguistics and the object of linguistic study (i.e. not writing). I'll try to address some of your more specific questions.</p>\n\n<blockquote>\n  <p>In other words, how'd you classify each of these errors?</p>\n  \n  <p>1.) Awirit a wonderful mother. I am so proud of you. (Letters are joined non-sensically)</p>\n</blockquote>\n\n<p>Phonology studies which sound combinations you may find in an individual language. <em>Awirit</em> looks like a valid English sound sequence to me, but it just happens not be associated with a meaning. So let's say that if someone made such a mistake, they might have problems retrieving words from their mental lexicons. This would be a case of language pathology that might especially interest neurolinguists or psycholinguists.</p>\n\n<blockquote>\n  <p>2.) Youre a wonderful mother. I am so proud of you. (Letters are joined incorrectly)</p>\n</blockquote>\n\n<p>Typo or spelling mistake. This is not within the domain of linguistics. </p>\n\n<blockquote>\n  <p>3.) Your wonderful mother. I am so proud of you. (Word exists but is used incorrectly)</p>\n</blockquote>\n\n<p>Again, typo or spelling mistake, nothing to do with linguistics. You also omitted the article <em>a</em> here, which might be a question for semantics. Semantics defines the meaning of individual words and how they combine to give you the meaning of sentences. With your missing article in 3, semantics may tell you that it cannot form the meaning of the entire sentence.</p>\n\n<blockquote>\n  <p>4.) You are the wonderful mother. I am so proud of you. (Words exist but are used incorrectly)</p>\n</blockquote>\n\n<p>If you're at the level of \"words being joined\" (as opposed to sounds being joined, as in 1), you're probably going to be talking about syntax or semantics. I'm assuming again that you're using <em>the</em> instead of <em>a</em>, which makes this similar to 3. </p>\n\n<blockquote>\n  <p>5.) Colorless green ideas sleep furiously. (Sentence is correct but are joined nonsensically)</p>\n</blockquote>\n\n<p>Again semantics. <em>Colorless green</em> forms a contradiction in the semantic representation of the sentence. <em>Sleep</em> may impose an animacy restriction on its argument which is not met by <em>ideas</em>. </p>\n\n<blockquote>\n  <p>6.) You are a mother wonderful. I am so proud of you. (Words exist but are ordered incorrectly)</p>\n</blockquote>\n\n<p>Generally speaking, syntax deals with word order. Where the adjective is found relative to the noun it modifies may depend on the default ordering between heads and modifiers in any individual language.</p>\n\n<blockquote>\n  <p>7.) You are a wonderful mother. And I am so proud of you. (Sentences are correct but joined incorrectly, at least according to Italian rules.*)</p>\n</blockquote>\n\n<p>I don't know Italian, but this sounds like a prescriptive rule to me. This is to say that people may very well say this, but it is considered \"incorrect\" or \"uneducated\". Linguistics doesn't describe how people \"should\" speak, but how they can/do speak.</p>\n\n<blockquote>\n  <p>8.) You're a wonderful mother. I play tennis. (Sentences are correct but joined non-sensically)</p>\n</blockquote>\n\n<p>Discourse structure. Depending on your view, this could be dealt with in semantics, pragmatics, or separately.</p>\n\n<blockquote>\n  <p>...and what about languages like the Japanese that don't have letters as we know them to begin with?</p>\n</blockquote>\n\n<p>Linguists don't care much about writing systems (except historical linguists, since that's all they have to work with). Japanese is very much like any other language in that it has sounds, words and utterances. To illustrate the point further, speakers of languages with no writing systems and illiterate speakers are just as interesting to linguistics as literate English or Japanese speakers.</p>\n", "Id":"3056", "ParentId":"3052", "LastEditorUserId":"82", "CreationDate":"2013-01-09T17:29:53.867", "OwnerUserId":"166", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-01-09T18:56:05.137", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-01-09T18:56:05.137", "Score":"5", "OwnerUser":{"UpVotes":"33", "WebsiteUrl":"", "DownVotes":"2", "Id":"166", "AccountId":"895830", "Views":"2", "Reputation":"380", "CreationDate":"2011-09-18T16:47:03.823", "DisplayName":"lapropriu", "LastAccessDate":"2013-10-23T21:21:01.247", "AboutMe":"<p>I'm a grad student in Linguistics. I'm currently working on clitics and the prosodic hierarchy, but my interests are much broader than my expertise, unfortunately :).</p>\n"}}