{"Body":"<p>The academic field concerned with reading illegible manuscripts is <a href=\"http://en.wikipedia.org/wiki/Palaeography\"><strong>palaeography</strong></a>. As the name implies, only deciphering old manuscripts is apparently included: as palaeographers, we are not trained in deciphering modern handwriting, for better or worse. This is probably because modern manuscripts are less likely to contain information required for academic research, although one wonders about, say, the letters and notebooks of famous writers, which are often difficult to read.</p>\n\n<p>The way one deals with an illegible manuscript is by first <strong>collecting what information one has about the context</strong>. Do we know who wrote it? Where was it written? When? What do we know about the situation pertaining to the manuscript? If, for example, we know that a certain document deals with the transfer of land near Oxford into the hands of the bishop, this will help us tremendously, because we have a better idea of what to expect. Words like \"land\" will be primed in our minds.</p>\n\n<p>The second thing to do is to <strong>\"read\" through the entire document</strong>, or at least the first page, to see what we <em>can</em> read. Usually at least a few words or letters are legible enough, even if the beginning is not.</p>\n\n<p>Another thing that helps is background knowledge about the <strong>formulae commonly used in the genre</strong>. Many legal documents in Latin, for example, start with \"In nomine dei amen\". If we see something at the beginning of the first page that might possibly resemble these words in some way, this may be used as a starting point. We will then know what one version of the <em>e</em> used in the document looks like, and of an <em>o</em>, an <em>a</em>, etc. Then we can try and find more instances of these letters elsewhere.</p>\n\n<p><img src=\"http://i.stack.imgur.com/0n2mN.jpg\" alt=\"enter image description here\"></p>\n\n<p>Here it says IN NOMINE S[AN]C[T]E ET IND[IVID]UE TRINITATIS; once we know that the first words are likely to be something like this, it becomes much easier.</p>\n\n<p>Lastly, <strong>knowledge of common (or, better, rare) letter and character shapes</strong> of the time helps a great deal. That comes with experience, and from reading illustrated guides.</p>\n\n<p>There are some great <strong>dictionaries</strong> of scribal abbreviations, letter shapes, and other marks. For Latin and Italian, there is the phenomenal Cappelli, which can be browsed on line at the <a href=\"http://inkunabeln.ub.uni-koeln.de/vdibProduction/handapparat/nachs_w/cappelli/cappelli.html\">University of Cologne</a>. The main part of the book is the <em>Wörterbuch der Abkürzungen</em> (this is the German translation). Each letter starts with a list of the twenty or so most common shapes that the letter could take in the Middle Ages:</p>\n\n<p><img src=\"http://i.stack.imgur.com/K3tDY.jpg\" alt=\"enter image description here\"></p>\n\n<p>Since Western-European writing has always been based on Latin, many abbreviations were used in all countries using the Latin alphabet, like modern <em>&amp;</em>, which is a ligature of <em>Et</em>, Latin for \"and\". No doubt Cyrillic was partly influenced by Greek conventions; I have no idea about Chinese, but I am sure manuals and dictionaries exist. For whichever alphabet or character set one wants to study, there will be books teaching various techniques with many examples. And there are also countless websites providing lessons. If you have a practical problem regarding an older manuscript or print in Latin script, ping me in the English or Linguistics room, and could try to help you.</p>\n\n<hr>\n\n<p>As to modern handwriting, the same techniques mostly apply. The only problem is that there is even less uniformity now than in the Middle Ages, when a scribe would at least follow some local scribal tradition. The same applies to your question why some people can read a certain manuscript while others cannot: they may be more used to a certain style, they might have more information about the background of the person who wrote it, or they might just be more talented.</p>\n\n<p>An important approach to a cursive hand that is difficult to read is to <strong>follow the ink</strong> (or other pigment) in chronological order. That is, when looking at a letter or character, one tries to determine where the scribe first touched the paper (or parchment, papyrus, wax, clay, wood...), which line or curve was drawn first, which next, which last. Doing so consciously can sometimes be just enough to realise what the scribe was doing.</p>\n\n<p><img src=\"http://i.imgur.com/woW59.jpg\" alt=\"enter image description here\"></p>\n\n<p>This is from a <a href=\"http://www.peregrinatrix.com/wp-content/uploads/2009/02/ms_good31.jpg\">Latin document</a> presumably written in the 14th century. Consider the third, long letter. It looks a bit like a long, vertical, pointy semi-oval, with a short horizontal line across, and a diagonal thingy at the top right. When using a quill, a line drawn down is usually thicker than up. Looking at the thin left half of the oval (2), you will assume that the thick, right half of the oval (1) must have gone down, the left half up. Similarly, a line from left to right is thicker than one drawn toward the left. The short, thick, diagonal line at the top (3) must have been drawn downward and to the right. This means that the main vertical line and the short diagonal line must have been drawn in separate strokes. As to the horizontal line (4), where a short horizontal line crosses a long vertical line, we usually draw the vertical line first, as in our modern letters t and f. So he must have begun at the top, drawn the vertical line downwards, and up again to the left, touching the starting point and closing the oval. Then he either lifted his quill, or he continued to draw the \"flag\", the thick diagonal line that goes from the top downwards to the right. Then he raised his quill to draw the horizontal line from left to right, continuing on into the next letter.</p>\n\n<p>One usually begins a stroke with an important part of a letter, whereas a decorative or connecting flourish is more likely to occur at the end of a stroke. All this taken together leads to the conclusion that this letter must be an <em>f</em>, and the word <em>Infinita</em>.</p>\n", "Id":"3069", "ParentId":"3068", "LastEditorUserId":"82", "CreationDate":"2013-01-13T08:35:09.760", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-06-25T00:29:19.020", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-06-25T00:29:19.020", "Score":"14", "CommentCount":"4", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}