{"Body":"<p>After the French language became powerful during the Norman era, English lost its position in writing though people still spoke it. However, by the end of the 14th century, the French language had began to lose its power affected by the events like losing the war against France(=other French nobles) and Black Death. At the same time, English had started to be written by people again(e.g. Chaucer). After that, people including the rulers wanted English to be more powerful as a language, which led to borrowing many words from Latin that was the lingua franca (in writing) at the time. This coincided with The Renaissance which brought about new ways of thinking (<strong>philosophy</strong>), <strong>science</strong> and the revival of the classics. Latin (and some Greek as well) was the language used in this cultral expansion. And this was the time English borrowed Latin words the most. </p>\n\n<p>So, in conclusion, the answer is that English was more motivated to borrow Latin words than other languages. English at the time tried to gain power by borrowing words from powerful languages.</p>\n\n<ol>\n<li>Wermser, Richard. Statistische Studien zur Entwicklung des englischen Wortschatzes. Bern: Francke Verlag, 1976</li>\n<li>Gelderen, Elly van. A History of the English Language. Amsterdam, John Benjamins, 2006. 178.</li>\n</ol>\n\n<p><em>edit:sources added</em></p>\n", "Id":"3094", "ParentId":"3087", "LastEditorUserId":"1618", "CreationDate":"2013-01-19T17:02:13.123", "OwnerUserId":"1618", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-01-20T17:13:02.367", "LastEditedUser":{"UpVotes":"2", "DownVotes":"0", "Id":"1618", "AccountId":"2129089", "Views":"0", "Reputation":"143", "CreationDate":"2012-12-29T05:18:39.320", "DisplayName":"Sindry", "LastAccessDate":"2013-12-25T12:20:29.587"}, "LastActivityDate":"2013-01-20T17:13:02.367", "Score":"2", "OwnerUser":{"UpVotes":"2", "DownVotes":"0", "Id":"1618", "AccountId":"2129089", "Views":"0", "Reputation":"143", "CreationDate":"2012-12-29T05:18:39.320", "DisplayName":"Sindry", "LastAccessDate":"2013-12-25T12:20:29.587"}}