{"comments":[], "Body":"<p>Russian is an example of language which uses borrowing of foreign words actively for a few reasons:</p>\n\n<p>I. Loanword expresses something that have not a representation yet (obvious case, and isn't a case in question).</p>\n\n<p>II. Loanword is shorter and/or more convenient. For example, the complex clause \"электронно-вычислительная машина\" or its indeclinable abbreviation \"ЭВМ\" is replaced with \"компьютер\" ('computer'), and this replacement had finished just immediately after USSR collapse, when old moral rules had got down.</p>\n\n<p>III. Loanword is used due to fashion, or speaker lasiness to find an existing word for the same. This is typical for wide crowd of business related people (mainly \"office plankton\"), for IT people and some other branches which are led mainly by English literature, which borrow words with the described phenomena, even if the native language has words for the same sense. Such borrowings aren't stable and are actively criticised even by speakers' colleagues.</p>\n\n<p>IV. Loanword is used to express some specific flavor of word sense, which isn't distinguished from a main sense in own word. For example, \"тенденция\" ('tendency') was neutral for centuries, but, in the current business slang, it is definitely negative; instead, \"тренд\" ('trend') is used for positive meaning. This difference isn't reflected yet in printed dictionaries but it is marked by (IIRC) most of audience; it has appeared due to reasons described in (III) but, unlike most of those words, has been surviving for years. Also, IT is full of such borrowings.</p>\n", "Id":"3099", "ParentId":"3070", "CreationDate":"2013-01-21T07:31:57.540", "Score":"1", "PostTypeId":"2", "OwnerUserId":"865", "LastActivityDate":"2013-01-21T07:31:57.540", "OwnerUser":{"UpVotes":"20", "Location":"Kiev, Ukraine", "DownVotes":"0", "Id":"865", "AccountId":"1343107", "Views":"3", "Reputation":"284", "CreationDate":"2012-03-24T16:20:02.170", "DisplayName":"Netch", "LastAccessDate":"2014-01-06T20:38:36.213", "Age":"41"}}