{"comments":[], "Body":"<p>As @Louis Rhys commented, your question seems to be about the actual language that pirates spoke as opposed to the \"piratespeak\" used today, or at least about how the former led to the latter.</p>\n\n<p>There's not necessarily a connection - there would never really have been 'one language' that pirates spoke, because piracy has been practised for hundreds and hundreds of years by seafaring peoples from all over the world, and they didn't exactly band together into one group. Throughout time, pirates would have spoken languages from the Mediterranean, Scandinavia, the Middle East, Eastern Europe, India, East Asia, the rest of Europe, North Africa, North America - pretty much anywhere, really.</p>\n\n<p>But mostly what we think of is the <a href=\"http://en.wikipedia.org/wiki/Golden_Age_of_Piracy\">'golden age of piracy'</a> from around the 1600's to the 1800's, and during this time pirates from different parts of the world would certainly have developed ways to communicate - just not as one consistent pidgin or creole. There is some discussion of it on <a href=\"http://itre.cis.upenn.edu/~myl/languagelog/archives/002482.html\">this old Language Log post</a>, in which it was suggested that modern \"piratespeak\" could be attributed to Robert Newton in the 1950 movie of <em>Treasure Island</em>. Incidentally, he was from the southwest of England, as are the pirates in <em>The Pirates of Penzance</em>, as mentioned above. So it's fairly plausible that modern \"piratespeak\" is based on the alleged \"Maritime Pidgin English\" spoken by pirates who hailed from that part of the UK. Meanwhile, pirates from everywhere else in the world would have been busy developing their own pidgins based on European and African languages, or whatever, depending on where they were from, who they traded with, who they raided, and who they took as slaves or hostages.</p>\n", "Id":"311", "ParentId":"296", "CreationDate":"2011-09-20T12:32:32.113", "Score":"7", "PostTypeId":"2", "OwnerUserId":"153", "LastActivityDate":"2011-09-20T12:32:32.113", "OwnerUser":{"UpVotes":"47", "WebsiteUrl":"", "DownVotes":"1", "Id":"153", "AccountId":"871764", "Views":"33", "Reputation":"1445", "CreationDate":"2011-09-18T03:14:58.320", "DisplayName":"Floating Tone", "LastAccessDate":"2012-05-27T05:07:04.410", "AboutMe":"<p>I'm a PhD candidate in linguistics, with diverse interests including phonetics, phonology, morphology, language documentation, historical linguistics and sociolinguistics. I am particularly interested in the languages of Africa, Papua New Guinea and Australia. I'm also very interested in methods of making linguistic knowledge and materials more accessible and available to linguists and non-linguists alike.</p>\n"}}