{"comments":[], "Body":"<p>Speculation? </p>\n\n<p>There are at least 2 well-understood cognitive systems that provide humans (and many other species) with numerical representations: the Parallel Individuation System (PIS), which can track potentially up to 4 objects in the world as numerically distinct, and the Approximate Number System (ANS), which provides (fuzzy) representations of larger sets of objects. (You can read an overview discussion with references by Feigenson, Dehaene, and Spelke, in the review article titled \"Core systems of number\", in the 2004 Vol. 8, No. 7 of TRENDS in Cognitive Sciences.) Quantities of objects in the 1-3 range are in the \"subitizing range\", or, are amenable to  immediate, effortless perception in terms of exact numerosity. These are PIS representations. Quantities of objects numbering 4+ are represented only approximately, in accord with Weber's Law (the larger the set size, the greater the variance around the actual value). So, 7 objects in the world is <em>most likely</em> to strike you as 7 objects (without counting), but a good proportion of the time you'll represent it as 6 or 8 objects. These are ANS representations.</p>\n\n<p>That languages may represent singular, dual, and trial in various of their paradigms has struck me as interesting in light of these psychophysical facts. Susan Carey (in her book the Origins of Concepts) speculates that it is PIS representations plus the representations that underlie set-based quantification in natural language that \"bootstrap\" young language learners into understanding exact number concepts (the foundations of mathematics). Singular, dual, and trial thus refer to exact, primitively perceivable quantities. </p>\n\n<p>If \"paucal\" in one language is said to describe numerosities such as 3-6, you can probably bet that psychophysical experiments with such speakers would probably find it can also on occasion count 7, but probably not 2, as the beginning of the applicable numerical range is in the PIS domain, and the end is in the ANS range. \"paucal\" may here (synchronically) be understood as \"small number at the edge of the subitizing range\". You could imagine a similar language in which paucal meant \"small number but not 1\", which might (a) only apply to 2 and 3, or (b) would extend \"just out of\" the subitizing range to apply to those numbers at the lower edge of ANS representation. </p>\n\n<p>Why should languages encode such things? Languages often provides the expressive devices to encode distinctions that are/were important/useful to humans. The primitive distinction between the numbers 1-3 and strictly-greater-than-3 marks an important dividing line in humans' representational repertoire, and is occasionally is encoded in their language. Whether the type of story given here is speculative, the cross-linguistic patterns detectable in linguistic encoding of number, and what we have begun to understand about number cognition more generally, quite invite such speculation.</p>\n", "Id":"312", "ParentId":"105", "CreationDate":"2011-09-20T13:58:08.523", "Score":"5", "PostTypeId":"2", "OwnerUserId":"178", "LastActivityDate":"2011-09-20T13:58:08.523", "OwnerUser":{"UpVotes":"56", "WebsiteUrl":"http://ling.umd.edu/~wellwood", "Location":"College Park, MD", "Id":"178", "DownVotes":"11", "AccountId":"922214", "Views":"88", "Reputation":"1112", "CreationDate":"2011-09-19T23:20:44.103", "DisplayName":"Alexis Wellwood", "LastAccessDate":"2013-08-12T15:15:17.400", "AboutMe":"<p>Other relevant links for me are the University of Maryland <a href=\"http://phling.umd.edu/\" rel=\"nofollow\">PHLING</a> and the <a href=\"http://languagescience.umd.edu/\" rel=\"nofollow\">Language Science community</a>.</p>\n"}}