{"Body":"<p>To answer the question: IMO, Esperanto and Klingon (and other constructed/synthetic languages) are not and therefore never will be natural languages. Among native speakers, the languages will begin to <em>act</em> like natural languages because there will always be language change with time, but I think we'll need to coin a new phrase for these types of languages. (The language formerly known as constructed? Bam! Prince joke.)</p>\n\n<p>I'm still not sure about calling ASL a natural language. It is definitely a language of its own right, but it did not happen entirely spontaneously. I guess I wonder about calling any sign language a natural language when it develops in the context of a spoken language society. This is why Nicaraguan Sign Language is so interesting, which developed (among children!) like a pidgin>creole language in an almost entirely deaf community, which may be the closest a sign language could get to being natural since it comes from necessity instead of planning. By the time researchers came in to observe, it already had a basic grammar. </p>\n", "Id":"314", "ParentId":"285", "LastEditorUserId":"42", "CreationDate":"2011-09-20T14:30:16.800", "OwnerUserId":"42", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-20T14:59:36.397", "LastEditedUser":{"UpVotes":"108", "WebsiteUrl":"http://twitter.com/mollyocr", "Id":"42", "AccountId":"896571", "CreationDate":"2011-09-13T21:04:13.347", "AboutMe":"<p>BA in Linguistics. Currently working as a localization &amp; QA specialist at a translation company in Minneapolis. Studied: Latin, Spanish, French, Arabic, Polish, Mandarin. Conlanger. Sci fi &amp; fantasy nerd, experimental cook, songwriter, artist and craftist. Also, I have a dog.</p>\n", "Age":"28", "Location":"Minneapolis, MN", "DownVotes":"8", "Views":"24", "Reputation":"933", "DisplayName":"mollyocr", "LastAccessDate":"2012-09-13T19:49:49.973"}, "LastActivityDate":"2011-09-20T14:59:36.397", "Score":"0", "CommentCount":"1", "OwnerUser":{"UpVotes":"108", "WebsiteUrl":"http://twitter.com/mollyocr", "Id":"42", "AccountId":"896571", "CreationDate":"2011-09-13T21:04:13.347", "AboutMe":"<p>BA in Linguistics. Currently working as a localization &amp; QA specialist at a translation company in Minneapolis. Studied: Latin, Spanish, French, Arabic, Polish, Mandarin. Conlanger. Sci fi &amp; fantasy nerd, experimental cook, songwriter, artist and craftist. Also, I have a dog.</p>\n", "Age":"28", "Location":"Minneapolis, MN", "DownVotes":"8", "Views":"24", "Reputation":"933", "DisplayName":"mollyocr", "LastAccessDate":"2012-09-13T19:49:49.973"}}