{"OwnerUser":{"UpVotes":"308", "DownVotes":"10", "Id":"111", "AccountId":"514008", "Views":"172", "Reputation":"5430", "CreationDate":"2011-09-14T09:33:29.710", "DisplayName":"Alenanno", "LastAccessDate":"2014-01-19T00:38:35.883", "AboutMe":"<p>I'm a student majoring in Languages (branch: Linguistics), currently working as a freelance translator. I've recently discovered <a href=\"http://db.tt/WpiKeReH\" rel=\"nofollow\">Dropbox</a> and I'm going to use it for my needs! :)</p>\n\n<p><em><strong>I love</em></strong><br>\nLanguages, Movies (Fantasy, Sci-Fi, Tarantino, etc.), Music, 3D Graphics, books and so on. </p>\n\n<p>Appointed ♦ Moderator Pro Tempore on <a href=\"http://area51.stackexchange.com/proposals/6673/linguistics?referrer=GlDGLdkDYNxMg1X13CJ1vg2\">Linguistics SE</a>, <a href=\"http://area51.stackexchange.com/proposals/6388/chinese-language-usage?referrer=XzTG1Nz01tc01sJEhak_6g2\">Chinese SE</a> and the <a href=\"http://area51.stackexchange.com/proposals/10848/russian-language-usage?referrer=J7IYS3ZUomUDvVVb-6SmDQ2\">Russian SE</a> site. If you're interested in other Stack Exchanges, try the <a href=\"http://area51.stackexchange.com/proposals/42949/italian-language-usage?referrer=ALVtGpK0tjLp1Lw15QCaUA2\">Italian SE</a> site.</p>\n\n<p>I like to lurk on other sites' Metas. <em>Meta is fun!</em> </p>\n\n<p><strong>My feature requests</strong>:</p>\n\n<ol>\n<li><a href=\"http://meta.stackoverflow.com/q/135786/176533\">Alert a moderator when an answer is improved after a post notice</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/138273/176533\">Automatically add chat event to the community bulletin (or make it easier)</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/121363/176533\">Give 10k users the ability to see the total count of flags they've handled</a></li>\n</ol>\n\n<p><strong>Moderator issues</strong>: If you have concerns or want to contact me about my moderation, you can find/ping me either in the <a href=\"http://chat.stackexchange.com/rooms/1336/linguistics\">Linguistics SE chat room</a> or <a href=\"http://chat.stackexchange.com/rooms/1984/chinese-language-and-usage\">CL&amp;U chat room</a>; if I'm not there or I'm \"idle\", just ping me! Please <em>avoid</em> using my personal email for such things. Use the chat rooms.</p>\n\n<hr>\n\n<p><strong>Languages List</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <sup>Languages with  * = learning on my own</sup></p>\n\n<p><strong>Mother Tongue:</strong> Italian, Sardinian;<br>\n<strong>Fluent:</strong> English, Spanish;<br>\n<strong>Less Fluent:</strong> French, German, Russian;<br>\n<strong>Learning:</strong> Japanese*, Chinese*, Swedish*, Greek*, Finnish*;<br>\n<strong>Willing to learn:</strong> Welsh, Korean, Dutch, Arabic, Hebrew, Hindi [to be continued]</p>\n\n<p>Me gusta el Español.<br>\nJ'aime le Français.<br>\nDeutsch gefällt mir.<br>\nМне нравится Русский язык.<br>\n私は日本語が好きです。<br>\n我爱中文。<br>\nJag älskar Svenska.</p>\n"}, "comments":[], "Body":"<p>There is not a fixed set of factors, but one could be the one you listed, the <strong>need for economizing</strong>, which by the way is always strong and present regardless of the language. Languages always tend to say more with less effort and waste of energies (or sounds).</p>\n\n<p>Another factor, which I think is very prominent, is <strong>the lack (temporary or not) of competencies in the other language</strong>.</p>\n\n<p>What do I mean by this? If you're speaking one language and you just don't have the necessary competencies to say something (high register, specialized terminology, etc), you'll switch to the other one. This would happen if you knew that the other person has the same abilities that you do.</p>\n\n<p><a href=\"http://en.wikipedia.org/wiki/Code-switching\">Code-switching</a> happens in a community or in a group of people that share at least two languages (usually code-switching supposes the presence of bilingualism, or at least fluency in two languages from both speakers; it's related to <a href=\"http://en.wikipedia.org/wiki/Language_transfer\">Linguistic interference</a>), so you <em>know</em> subconsciously that the other person can speak the other language, otherwise you wouldn't switch. If you have the competencies but you feel a sudden loss of words, you'll switch, maybe just for that sentence/expression.</p>\n\n<p>Yet another factor, perhaps not applicable in your case but still worth to mention, is <strong>identity</strong>. For example, you speak a dialect with your family only and the official language of your country with the rest. One of your relatives moves away and they start speaking the official language more and the dialect less for various reasons. If you talk to them then, some code-switching might occur, because you sometimes use the dialect (being family) and other times switch to the main language (because maybe they keep using that one); they might do code-switching too, of course.</p>\n", "Id":"3143", "ParentId":"3141", "CreationDate":"2013-01-29T17:44:19.097", "Score":"6", "PostTypeId":"2", "OwnerUserId":"111", "LastActivityDate":"2013-01-29T17:44:19.097", "CommentCount":"2"}