{"OwnerUser":{"UpVotes":"263", "WebsiteUrl":"http://www.umich.edu/~jlawler", "Id":"482", "AccountId":"1019614", "CreationDate":"2011-11-04T19:51:14.297", "AboutMe":"<p>I'm a retired linguistics professor. \nI enjoy answering questions.</p>\n\n<ol>\n<li>My <a href=\"http://www.umich.edu/~jlawler\" rel=\"nofollow\">Website</a> at the University of Michigan</li>\n<li>My <em>alt.usage.english</em> <a href=\"http://www.umich.edu/~jlawler/aue\" rel=\"nofollow\">English Grammar</a> pages</li>\n<li><a href=\"http://www.umich.edu/~jlawler/NorWesCon.html\" rel=\"nofollow\">Details and handouts</a> from some recent talks.</li>\n<li>A term paper about K-12 <a href=\"http://www.umich.edu/~jlawler/LanguageScience.pdf\" rel=\"nofollow\"><em>Language Science</em></a></li>\n<li>Two <a href=\"http://www.umich.edu/~jlawler/210CourspackPart1.pdf\" rel=\"nofollow\">scanned</a> <a href=\"http://www.umich.edu/~jlawler/210CourspackPart2.pdf\" rel=\"nofollow\">coursepacks</a> from my <a href=\"http://www.umich.edu/~jlawler/210.html\" rel=\"nofollow\">Intro Ling class</a>. (each ~100 pp)</li>\n<li>Scanned <a href=\"http://www.umich.edu/~jlawler/wow/scans/\" rel=\"nofollow\">teaching materials</a> from my <a href=\"http://www.umich.edu/~jlawler/wow\" rel=\"nofollow\">Etymology class</a></li>\n<li><a href=\"http://www.umich.edu/~jlawler/Subversive.pdf\" rel=\"nofollow\">Abstract</a> of a recent talk (4/12/12 in Denton, TX)</li>\n</ol>\n", "Age":"72", "Location":"Bellingham WA", "DownVotes":"2", "Views":"96", "Reputation":"4431", "DisplayName":"jlawler", "LastAccessDate":"2014-01-18T23:44:21.787"}, "comments":[], "Body":"<p>The general belief of most linguists was expressed <a href=\"http://www.umich.edu/~jlawler/pdf-files/7-8-buch.pdf\" rel=\"nofollow\">here</a> in 1998 this way:</p>\n\n<blockquote>\n  <p>..the complexity and power required to analyze linguistic data is <strong>discontinuous</strong> in its distribution.</p>\n  \n  <p>Coarsely put, we have seen over and over that the simplest tools have the broadest coverage, and more and more complexity is required to expand the coverage less and less. Consider the\n  place of natural language as a whole on the Chomsky hierarchy, for instance. Chomsky\n  (1956) demonstrated that natural language is at least context-free in its complexity, and after a\n  number of failed proofs, it is now commonly agreed that natural language is strongly and\n  weakly trans-context-free (Shieber 1985, Kac 1987, Culy 1985, Bresnan et al. 1982). </p>\n  \n  <p>Yet\n  what is striking about these results is both the relative infrequency of constructions which\n  demonstrate this complexity and the increase in computational power required to account for\n  them. For example, the constructions which are necessarily at least context-free (such as\n  center embedding) seem fairly uncommon in comparison with constructions which could be\n  fairly characterized as finite state; the constructions which are necessarily trans-context-free\n  are even fewer. In other words, a large subset of language can be handled with relatively\n  simple computational tools; a much smaller subset requires a radically more expensive\n  approach; and an even smaller subset something more expensive still.<br>\n   -- Bayer <em>et al</em>, \"Theoretical and Computational Linguistics: Toward a Mutual Understanding\", p.224</p>\n</blockquote>\n\n<p>That's in terms of <strong>syntax</strong>, mind you, not morphology. But to the extent one considers morphology as a sort of phonological syntax, the same principles apply, provided one can distinguish and mark exceptions. Much of it is quite simple, even in a complex morphology. Some of it is harder; and agreement phenomena slide right over into syntax again.</p>\n\n<p>Finally, I've been informed by Jerry Sadock, an expert on West Greenlandic Eskimo languages, that polysynthetic Eskimo has recursive morphology; it works very simply through noun incorporation, since complement clauses are nouns. So one can theoretically make recursive words of countably infinite length, though performance constraints appear to make these rare.</p>\n", "Id":"3159", "ParentId":"3154", "CreationDate":"2013-02-01T17:37:02.817", "Score":"4", "PostTypeId":"2", "OwnerUserId":"482", "LastActivityDate":"2013-02-01T17:37:02.817", "CommentCount":"4"}