{"comments":[], "Body":"<p>What you're referring to is the fact that we can interpret speech acts that don't look like questions as questions because of other features. So even though the phrase you gave doesn't look like a question (e.g. word order inversion or inclusion of wh- pronouns for English) people can still interpret it as a question though other means.</p>\n\n<p>The most common reason these are interpreted as questions (in English at least) is because they occur with high rising intonation, which makes them sound like questions. Another reason may be that the person asking the 'question' gestures at the other person, indicating they would like them to contribute the relevant information. </p>\n\n<p>Linguists and philosophers like to talk about 'speech acts' when discussing how people communicate. Sometimes a speech act will be doing something different in conversation to what the grammar looks like. For example \"aren't you cold?\" is a question grammatically, but in interaction it's a suggestion (that the other person put on more clothing). Therefore, even though some things don't look like questions on the surface, their speech act function may actually be to elicit information like a question would. </p>\n\n<p>For more on speech acts here is a nice summary: <a href=\"http://online.sfsu.edu/kbach/spchacts.html\" rel=\"nofollow\">http://online.sfsu.edu/kbach/spchacts.html</a></p>\n\n<p>The two most often cited papers in this area are Austin (1962) and Searle (1969), and it's also closely linked to Grice's (1989) theories about Implicature.</p>\n\n<p>Austin, J. L. (1962) How to Do Things with Words, Cambridge, Mass.: Harvard University Press. (Develops the distinction between performative and constative utterances into the first systematic account of speech acts.) </p>\n\n<p>Grice, H. P. (1989) Studies in the Way of Words, Cambridge, Mass.: Harvard University Press. (The essays on meaning and conversational implicature provide a framework for distinguishing speaker meaning from linguistic meaning and for explaining their relationship.) </p>\n\n<p>Searle, J. (1969) Speech Acts: An Essay in the Philosophy of Language, Cambridge, Eng.: Cambridge University Press. (Presents a theory of speech acts relying on the notion of constitutive rules.) </p>\n", "Id":"3170", "ParentId":"3169", "CreationDate":"2013-02-05T21:41:47.377", "Score":"4", "PostTypeId":"2", "OwnerUserId":"64", "LastActivityDate":"2013-02-05T21:41:47.377", "OwnerUser":{"UpVotes":"126", "WebsiteUrl":"http://www.superlinguo.com", "Id":"64", "AccountId":"900445", "CreationDate":"2011-09-13T21:45:12.903", "AboutMe":"<p>I have a PhD in linguistics. My areas of interest include language documentation, Tibeto-Burman linguistics, gesture, language play, LOLspeak, evidentiality and making bad puns. I blog about language and linguistics at www.superlinguo.com</p>\n", "Age":"29", "Location":"Australia", "DownVotes":"6", "Views":"40", "Reputation":"2016", "DisplayName":"LaurenG", "LastAccessDate":"2013-10-26T00:28:12.653"}}