{"Body":"<p>This board is supposed to be for actual linguistics-based questions with possible fact-based answers and I don't mean to encourage these types of opinion-based questions here in the future but I do feel a bit bad for you since I don't know where else you could ask. I seem to remember a good linguistics thread over at the Something Awful Forums but that was quite a few years ago and if probably gone. So, in that spirit:</p>\n\n<p>Linguistics is the study of <em>language</em>, as opposed to the study of <strong>languages</strong>. It's a fine distinction that many have trouble understanding. A degree in linguistics is <strong>not</strong> about sitting in a classroom learning new languages (although this may be required for your individual research) but instead studying the structure of languages. This can be divided into grammar (syntax), meaning (semantics), pronunciation (phonology and phonetics. Phonetics being more concerned with the physical aspects of sound waves and sound production), social context (sociolinguistics), and geographical/historical context (historical/comparative linguistics). As you can see, linguistics is an incredibly diverse field and you need to do a lot of research into which aspect of language you'd be interested in studying.</p>\n\n<p>Your image of linguistics seems to be closer to sociolinguistics. In all honesty this doesn't seem to be a very popular field of study (I once had a graduate-level sociolinguistics course that only had 3 people in it including both me <strong>and</strong> the professor). Also similar, occasionally my phonologist and phoneticist friends conduct studies where they record people of various accents and dialects in order to examine pronunciation.</p>\n\n<p>My main concern is that you seem to misunderstand what linguistics is and have incorrect expectations as to what studying and working in linguistics is like. If you are interested in linguistics simply as a way to learn new languages I highly suggest you look at other degrees such as a literature degree (in your language of choice, of course) or maybe even translation (although they may expect you to already by bilingual. Check with prospective schools). If you're interested in meeting different cultures I'd suggest some kind of sociology or anthropology degree.</p>\n\n<p>I'm probably going to catch some flack for this but I'm going to say that <em>effectively</em> there are no prospects for a Linguistics graduate to get a job in the Linguistics field outside of academia (i.e. being a professor or paid researcher). By which I mean it's very unlikely you'll find a job which explicitly requires linguistic knowledge. But here's the good news: it's the same situation for pretty much every single degree except the hard sciences, engineering, computer science, statistics, and finance/accounting. Even business majors (excluding finance/accounting) will have a hard time finding a job that wouldn't also accept an English Lit. major. To a certain extent, undergrad degrees don't matter as long as you have one, so you might as well choose something you find interesting.</p>\n\n<p>As for Computational Linguistics, that's a whole different ball game. It's an interdisciplinary field (with cross-over skills that can qualify you for multiple types of careers) and it sits very much on the \"applied\" side of the theoretical/applied spectrum. Obviously, applied disciplines will have an easier time finding a job as they create more tangible outputs that companies can use and sell.</p>\n\n<p>Other interdisciplinary fields in linguistics include psycholinguistics (psychology + linguistics), historical linguistics (history + linguistics), sociolinguistics (sociology + linguistics), and neurolinguistics (neurology + linguistics). With the exception of neurolinguistics, I'd say these are all rather theoretical. You'd have more career opportunities but there are fewer employers looking for your exact skill set.</p>\n\n<p>Another problem is that few universities offer degrees or courses in these interdisciplinary fields at the undergrad level (probably historical and socio excepted). This means you either need to wait until graduate studies or take some sort of major/minor degree.</p>\n\n<p>To be frank, I do not think you are ready to study linguistics. Your expectations as to what linguistics is and what linguists do seems off and you have not done nearly enough research into what fields are entailed in linguistics. I would suggest going to the websites of prospective schools and seeing what courses linguistics students are required to take. Read the syllabuses. Don't just stop at first year courses but also look at second year and third year courses (just try not to get discouraged if you don't understand what upper-year courses are talking about. Remember, you'll have 1-2 years of training before you have to take those courses). See if the courses appeal to you. This will tell you if you want to study linguistics as well as give you a better idea of what is available. And, unless you have a career in mind that you want to work towards, don't worry too much about getting a job afterwards as the vast majority of people take careers completely unrelated to their degrees.</p>\n\n<p>And if you look at the courses and decided a degree in linguistics isn't right for you, don't be afraid to keep linguistics as a hobby. I think I'm right in saying that the vast majority of people on this StackExchange did not take linguistics as their undergrad nor made linguistics their career. I know I only became interested in linguistics in the final year of my undergrad.</p>\n", "Id":"3191", "ParentId":"3189", "LastEditorUserId":"1055", "CreationDate":"2013-02-12T01:10:00.723", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-02-12T01:25:03.430", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2013-02-12T01:25:03.430", "Score":"5", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}