{"Body":"<p>According to <a href=\"http://obcyjezykpolski.strefa.pl/?md=archive&amp;id=95\" rel=\"nofollow\">Maciej Malinowski</a>, the cause was accentuation. Until the end of the 17th century, \"dobry dzień\" was the literary form. This phrase has two accents in Polish: \"<b>dob</b>ry <strong>dzień</strong>.\" However, people started to shift the stress and pronounce it as \"dob<b>ry</b>dzień.\" That was because they started to think of the phrase as a single word. In Polish, words are stressed almost excusively on the penultimate syllable. (See the note at the bottom.) The same happened to the greeting \"dobra noc\" (<em>good night</em>). In this case the linked form has since become standard, and we write \"dobranoc\" and say \"dob<b>ra</b>noc\" instead of \"<b>dob</b>ra <strong>noc</strong>\". Now, Malinowski says, there were people (\"linguists\") who objected to that process. They came up with a solution, which was to introduce a new word order, \"dzień dobry\". This phrase has only one stressed syllable in it: \"dzień <b>dob</b>ry\", and a Pole doesn't have to consider it a single word to pronounce it this way. Thus the phrase was saved from the offending linking. We still write \"dzień dobry\" and not \"dzieńdobry\". </p>\n\n<p>Unfortunately, Malinowski doesn't substantiate his claim. I do not know where he got his information from. It could be a guess for all I know, but it doesn't seem improbable at all. Note that Belarussian retains both forms: \"добрыдзень\" and \"дзень добры\". </p>\n\n<p>According to <a href=\"http://poradnia.pwn.pl/lista.php?id=13789\" rel=\"nofollow\">Małgorzata Marcjanik</a>, \"dobry wieczór\" (<em>good evening</em>) was also changed to \"wieczór dobry\", but that form doesn't survive. Note that the phrase \"dobry wieczór\" also has two stresses in it: \"<b>dob</b>ry <b>wie</b>czór\". However, the attempt to change it to \"wieczór dobry\" seems inconsistent with what Malinowski says. \"Wieczór dobry\" also has two stresses: \"<b>wie</b>czór <b>dob</b>ry\". Also I don't know whether the spelling \"dobrywieczór\" was ever trying to creep into the written language.</p>\n\n<p><em>NOTE.</em> West Slavic languages are special among Slavic languages in that they all, or at least the standardized ones, have fixed stress. Among them, Polish is the only one with penultimate stres. There is one South Slavic language, Macedonian, with fixed antepenultimate stress.</p>\n", "Id":"3225", "ParentId":"1340", "LastEditorUserId":"691", "CreationDate":"2013-02-18T15:13:00.230", "OwnerUserId":"691", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-02-18T15:43:18.987", "LastEditedUser":{"UpVotes":"1", "WebsiteUrl":"http://students.mimuw.edu.pl/~mm262788", "Id":"691", "AccountId":"1182897", "CreationDate":"2012-01-19T17:49:40.933", "AboutMe":"<p>I'm a lower-mediocre graduate student in mathematics. I'm interested in non-commutative algebra.</p>\n", "Age":"26", "Location":"Warsaw, Poland", "DownVotes":"1", "Views":"1", "Reputation":"132", "DisplayName":"ymar", "LastAccessDate":"2014-01-07T21:40:40.827"}, "LastActivityDate":"2013-02-18T15:43:18.987", "Score":"3", "OwnerUser":{"UpVotes":"1", "WebsiteUrl":"http://students.mimuw.edu.pl/~mm262788", "Id":"691", "AccountId":"1182897", "CreationDate":"2012-01-19T17:49:40.933", "AboutMe":"<p>I'm a lower-mediocre graduate student in mathematics. I'm interested in non-commutative algebra.</p>\n", "Age":"26", "Location":"Warsaw, Poland", "DownVotes":"1", "Views":"1", "Reputation":"132", "DisplayName":"ymar", "LastAccessDate":"2014-01-07T21:40:40.827"}}