{"comments":[], "Body":"<p>Though there are some linguists who express hostility toward conlanging, most notably Yaguello in her book \"Lunatic Lovers of Language,\" I haven't heard of any general outcry from the linguistics community against conlanging.   However, I do believe that most linguists consider natural language to be the proper subject matter of linguistics.  </p>\n\n<p>As a conlanger, I think that this is as it should be for several reasons.   </p>\n\n<p>First, linguists discover, document, and interpret their data.   In linguistics, inventing the data is strictly forbidden for obvious reasons.  But when I devise a conlang, inventing the data is not only permitted--it is the whole point of my hobby.  I think that this makes conlanging something other than a science. </p>\n\n<p>Second, a great deal of theoretical debate in linguistics is devoted to the degree to which linguistic knowledge is innate and to the existence of language universals.  Since conlangs are almost never acquired naturally and can be designed with or without any of the proposed language universals, I don't see how the mere study of conlangs could have any bearing on such issues.  For example, inventing a language without recursion would not, as far as I know, shed any light on the controversy about whether recursion occurs in Piraha.  </p>\n\n<p>Third, although every good conlanger knows more about linguistics than most non-linguists do, conlanging involves making implicit or explicit whimsical or esthetic judgments about linguistic structures that have no place in linguistics.   To a linguist, ergativity is interesting and worthy of study.   To a conlanger, ergativity might be a <em>cool</em> feature to put in one's conlang, or conversely a <em>trite</em> feature since all the other conlangers are putting ergativity into their conlangs.  A conlanger might also believe that copying natural language ergativity <em>isn't weird enough</em>, and might therefore look for ways of conditioning the ergative/acccusative split that don't occur in natural languages.   Another conlanger might also think it would be <em>fun</em> to give ergative marking to some hypothetical relative of Latin.   For conlangers, there is no limit to the whimsy.  </p>\n\n<p>I have often likened the difference between conlanging and linguistics to the difference between painting monsters and studying zoology.  There are, I suppose, some zoologists who take an occasional interest in depictions of monsters, but it would not surprise me if most zoologists didn't share this interest.  </p>\n", "Id":"3240", "ParentId":"2670", "CreationDate":"2013-02-21T07:42:59.453", "Score":"4", "PostTypeId":"2", "OwnerUserId":"790", "LastActivityDate":"2013-02-21T07:42:59.453", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}