{"Body":"<p>From semiotics I gather that semantics is related to the abstract concept the word represents, while pragmatics is related to the purpose of its use. [S. Boell en D. Cecez-Kecmanovic, “Attributes of Information”, in AMCIS 2010 Proceedings, 2010, pp. 11.]</p>\n\n<p>For example, if I say that my heart rate is 120 BPM, there will be no misunderstanding about its conceptualisation; its meaning.\nStill, a medical doctor cannot draw any conclusion from just this information alone. Context is required, such as age, gender, current and very recent activity (running or sitting) in order to draw conclusions about a certain aspect of my health. </p>\n\n<p>Pragmatics define the sort of actions to take, which are dependent on the listener's goal. The pragmatics for a medical doctor examining a patient will therefore be quite different than those for a personal trainer coaching an Olympic athlete. Therefore the conclusion drawn (i.e. is a heart rate of 120BPM good or bad) is influenced by its use (pragmatics), while the meaning of \"a heart rate of 120BPM\" remains constant (semantics).</p>\n\n<p>Note that context, used above to indicate \"what else do we need to know before we can draw conclusions\", therefore depends on pragmatics. The context required for the medical doctor might be different than for the personal trainer.</p>\n", "Id":"3297", "ParentId":"2571", "LastEditorUserId":"1815", "CreationDate":"2013-03-01T17:51:12.860", "OwnerUserId":"1815", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-03-04T08:40:15.757", "LastEditedUser":{"UpVotes":"0", "WebsiteUrl":"", "DownVotes":"0", "Id":"1815", "AccountId":"2434230", "Views":"1", "Reputation":"11", "CreationDate":"2013-03-01T17:31:01.043", "DisplayName":"PaulBrandt", "LastAccessDate":"2013-03-04T08:52:43.597", "AboutMe":""}, "LastActivityDate":"2013-03-04T08:40:15.757", "Score":"1", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"", "DownVotes":"0", "Id":"1815", "AccountId":"2434230", "Views":"1", "Reputation":"11", "CreationDate":"2013-03-01T17:31:01.043", "DisplayName":"PaulBrandt", "LastAccessDate":"2013-03-04T08:52:43.597", "AboutMe":""}}