{"Body":"<p>Yes, there are.   As Acattle points out in his/her comment above, some people carefully refrain from swearing, even though the majority of Americans have become comfortable with a little profanity among adults.   Common epithets are another class of words that most people use but that some people won't use.  There are gentle people who won't use the term \"slut\" to designate a person known to be promiscuous.  Conversely, certain people refuse to use euphemisms in the belief that those who do use them are inauthentic or too timid to speak forthrightly.  </p>\n\n<p>However, there are at least two obvious norms that limit to one's ability to refuse to use certain words that most people use.   One is that most people expect a speaker to use a variety of language that the listener finds to be grammatically acceptable.  An almost certainly hypothetical native English speaker who refused to use \"the\" might find himself or herself labeled as too eccentric to be worth talking to.   The second norm is more important:  one must speak in a way that allows one to be understood if communication is one's goal.  If our almost certainly hypothetical native English speaker refused to use either the word \"person\" or any of its synonyms, he or she would have a tough time talking about everyone's favorite subject. </p>\n", "Id":"3304", "ParentId":"3303", "LastEditorUserId":"790", "CreationDate":"2013-03-03T04:27:39.420", "OwnerUserId":"790", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-03-03T04:33:05.483", "LastEditedUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}, "LastActivityDate":"2013-03-03T04:33:05.483", "Score":"1", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}