{"Body":"<p><strong>I would not separate lexical tone here.</strong> There are many other lexical tools. Depending on your native and studied languages, you will (or will not) be able to hear when these tools are used and use it by yourself. Here are some examples:</p>\n\n<ul>\n<li>Consonant-related &mdash; fricative, aspiration, palatalization:\n<ul>\n<li>A Russian speaker will quickly grasp palatalization, but aspiration makes a huge problem even for me, after some three years speaking Thai <strong>daily</strong>;</li>\n<li>The same Russian speaker will easily recognize a huge variety of Mandarin Chinese affricates <code>t͡s</code>, <code>t͡ɕ</code> or retroflex <code>ɻ</code> as they exist in Russian (to a certain proximity). At the same time, English speaker will have difficulties with them.</li>\n</ul></li>\n<li>Vowel-related &mdash; di- and triphthongs, long/short vowel length:\n<ul>\n<li>English speakers often have problems with <code>ɯ</code> and short <code>u</code>, but have no issue reproducing <code>ɤ</code>. Things are totally opposite for Russian speakers.</li>\n</ul></li>\n</ul>\n\n<p>The answer is common for all mentioned linguistic phenomenons.</p>\n\n<ul>\n<li>Good news: <strong>If a language learner is already familiar with a certain lexical tool, it will be easier for them to accept its existence and to start using it.</strong></li>\n<li>Bad news: it's almost certain that there are other lexical tools to become an issue when studying.</li>\n</ul>\n\n<p>Think if someone is telling a native English speaker about a language that has five more vowels: <code>ɯ</code>, <code>ɤ</code>, etc. &mdash; what would they answer? \"Yes, other vowels do exist, so what?\" They wouldn't be surprised there are languages with vowels. :) This is why it's important to learn many languages: the more you are aware of (not necessarily speaking fluently), the more tools you know and can use.</p>\n\n<p>Let's get back to tones.</p>\n\n<p>I have several Chinese friends who study Thai. Existence of lexical tones is something obvious for them. Since Thai has extra tones, comparing to Mandarin (namely, <em>low</em> and <em>middle</em> tones; plus, Mandarin <em>high</em> corresponds to Thai <em>high-rising</em>), those extra tones make some trouble to hear and reproduce for Chinese speakers, but no more than diphthongs or long/short vowels do, for example.</p>\n\n<p>Also, several Thai friends of mine have studied Mandarin, one is a professional Thai-Mandarin translator. Being curious, I asked them about their study. They have never complained on Chinese lexical tones. What really makes them trouble is Mandarin consonants.</p>\n\n<p>Personally, I have started with Mandarin Chinese, but then stopped my study for years. When it came to learning Thai, yes, my prior familiarity with Chinese tones helped me to skip several lessons of spoken Thai training. I would not say it was critical, however.</p>\n\n<hr>\n\n<p><strong>Update</strong>. One more thing, it seems to be related.<br>\nThis observation came to me when I was listening to Chinese and Thai songs. Compare:</p>\n\n<ul>\n<li><a href=\"http://www.youtube.com/watch?v=uQIJwqTw1AA\" rel=\"nofollow\">做你的愛人</a> or <a href=\"http://www.youtube.com/watch?v=t10cCF81zP4\" rel=\"nofollow\">自由飞翔</a> &mdash; tones follow the melody, even if they are incorrect;</li>\n<li><a href=\"http://www.youtube.com/watch?v=lGYXEGnK66s\" rel=\"nofollow\">นอนไม่หลับ</a> or <a href=\"http://www.youtube.com/watch?v=sk0E_LMiVnk#!\" rel=\"nofollow\">อยากรู้แต่ไม่อยากถาม</a> &mdash; simply read the lyrics, and the melody will arise by itself.</li>\n</ul>\n\n<p>Chinese speakers tend to minimize phonetic distance between the tones. No, I don't say they <em>ignore</em> it. They only emphasize tones when needed (e.g., the context allows a different word pronounced in another tone).<br>\nThai is the opposite. Native speakers highlight the tones pretty accurately.</p>\n", "Id":"3314", "ParentId":"3310", "LastEditorUserId":"1009", "CreationDate":"2013-03-04T15:26:30.030", "OwnerUserId":"1009", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-03-05T03:16:58.327", "LastEditedUser":{"UpVotes":"512", "WebsiteUrl":"http://weew-waaw.com", "Id":"1009", "AccountId":"947951", "CreationDate":"2012-05-15T02:50:16.013", "AboutMe":"<p><img src=\"http://i.stack.imgur.com/VxMqM.jpg\" alt=\"Weew-Waaw, Thai to English, Thai to Russian transcription\"><br>\nI'm working on a project of rule-based Thai transcription: (the link is temporarily unavailable)<br>\nTechnically, it is written in F# with a C# front-end.<br>\nI would be happy to get acquainted with those who are experienced with NLP (Natural Language Processing), just ping me in the SE chat. :-)</p>\n", "Age":"42", "Location":"Bangkok, Thailand", "DownVotes":"50", "Views":"36", "Reputation":"1656", "DisplayName":"bytebuster", "LastAccessDate":"2014-01-19T00:53:20.473"}, "LastActivityDate":"2013-03-05T03:16:58.327", "Score":"6", "CommentCount":"1", "OwnerUser":{"UpVotes":"512", "WebsiteUrl":"http://weew-waaw.com", "Id":"1009", "AccountId":"947951", "CreationDate":"2012-05-15T02:50:16.013", "AboutMe":"<p><img src=\"http://i.stack.imgur.com/VxMqM.jpg\" alt=\"Weew-Waaw, Thai to English, Thai to Russian transcription\"><br>\nI'm working on a project of rule-based Thai transcription: (the link is temporarily unavailable)<br>\nTechnically, it is written in F# with a C# front-end.<br>\nI would be happy to get acquainted with those who are experienced with NLP (Natural Language Processing), just ping me in the SE chat. :-)</p>\n", "Age":"42", "Location":"Bangkok, Thailand", "DownVotes":"50", "Views":"36", "Reputation":"1656", "DisplayName":"bytebuster", "LastAccessDate":"2014-01-19T00:53:20.473"}}