{"Body":"<p>From what I'm seeing it's generally accepted that most English speakers have a vocabulary size of <a href=\"http://en.wikipedia.org/wiki/Vocabulary#Native-language_vocabulary_size\">15000 to 20000 words</a>. It should be noted that some sources place this estimate as high as <a href=\"http://news.bbc.co.uk/2/hi/uk_news/magazine/8013859.stm\">50000 to 75000 words</a>.</p>\n\n<p>Of course, only a fraction of those words are used regularly. <a href=\"http://www.corpus4u.org/forum/upload/forum/2005062106260627.pdf\">This study</a> found that knowing as few as 2000 words could lead to a 95% comprehension rate for English speakers. If one increases their vocabulary size to 5000 words (250% the vocabulary size as before), the comprehension rate only increases to 96%. This is why focusing on just the most common words in a language, as you are doing, is a common tactic for language learners.</p>\n\n<p>For lower levels of competency, I've found this <a href=\"http://uk.answers.yahoo.com/question/index?qid=20100605200548AAWxJds\">Yahoo! Answer</a> (and several like it) suggesting that 400-500 words and 150 phrases are enough to <em>communicate</em> in a second language (albeit with a fair amount of difficulty). However, I cannot find any academic research to back up these claims.</p>\n\n<p>The exact number of words you need to know depends on how you define \"fluency\", the language you're speaking, and the context you're speaking in (for example, business speech, casual speech, and even academic speech are all different <a href=\"http://en.wikipedia.org/wiki/Register_%28sociolinguistics%29\">registers</a> with different vocabularies). Additionally, this number (as well as how you define \"word\") will change depending on the language.</p>\n\n<p>Another problem with these estimates is that they vary in how they define \"vocabulary size\". It could mean the number of words that a speaker knows and can produce in conversation or it could mean the number of words that a speaker is able to recognize in conversation, even if they would never use it.</p>\n\n<p>So in summary, the exact number of words one must need to know to be \"fluent\" in a language varies depending on how you define fluency, which language you're talking about, if you're talking about comprehension, speaking, or both, and how you define \"vocabulary size\". The best lower-bound estimate I can find is 2000 words. Note that that particular study was based only on comprehension, so maybe you could get away with a slightly smaller number of \"active\" or \"producible\" vocabulary (words you know how to use in conversation).</p>\n\n<p>However, as I'm sure you know, there's more to speaking a language fluently than vocabulary size alone. For starters, there's your grammar skill. Also, remember that \"fluency\" <a href=\"http://english.stackexchange.com/a/46250\">is derived from the same origin as \"fluid\"</a> so a big part of \"being fluent\" is being able to speak smoothly, evenly, and at a reasonable pace. Similarly you need to be able to listen and understand other speakers to be able to respond appropriately. This all take lots and lots of practice; preferably with native speakers. Even just getting your tongue used to pronouncing foreign words at a reasonable speed can be incredibly difficult. While learning the most frequent vocabulary words is a good exercise, it alone cannot teach you a language.</p>\n", "Id":"3335", "ParentId":"3333", "LastEditorUserId":"1055", "CreationDate":"2013-03-08T16:48:18.393", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-03-09T02:17:02.823", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2013-03-09T02:17:02.823", "Score":"6", "CommentCount":"2", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}