{"Body":"<p>If I had to describe that group under one label, I would use <strong>nominal verb</strong>, but be aware that <em>nominal</em> has various senses and may not be unambiguous without some explanation. <em>Nominal</em> in this sense refers to nouns, pronouns, adjectives, and participles/gerundives/gerunds alike; in short, anything that can function in ways similar to nouns or adjectives. In inflexional languages, this includes declension (case endings) as opposed to conjugation (the personal endings that verbs have). Nouns and adjectives are intimately connected in various ways, at least in Indo-European languages.</p>\n\n<h2>Verb and noun-adjective at the same time</h2>\n\n<p>The interesting thing about these forms is that they are both verb and noun/adjective at once; that's why <em>nominal verb</em> is the only label that seems to cover what they are. <strong>Externally</strong>, they function as <strong>nouns or adjectives</strong>, in that they can be the subject or object of verbs and prepositions or modify nouns, etc. (<em>I want [a pony | to run], she failed at [running | love], I see a [running | fast] donkey</em>).</p>\n\n<p><strong>Internally</strong>, however, they function mostly as <strong>verbs</strong>, in that they can have the kinds of arguments that finite verbs have, like subjects, objects, adverbial phrases, etc. Note that not every nominal verb can have all of these things in any situation, but in general they can have most.</p>\n\n<p>In short, whatever they depend on treats them as nouns or adjectives, while they themselves treat their own dependencies mostly as verbal arguments. That applies to participles/gerunds/infinitives in all languages I know, which are admittedly Indo-European; I'm not sure this category even makes sense in other linguistic families.</p>\n\n<h2>The infinitive as a noun</h2>\n\n<p>The infinitive is a dubious case, because it resembles a noun more or less depending on the language: in Greek, it can have prepositions and articles, whereas in Latin the gerund is used with prepositions and cases, not the infinitive. In English, the semi-preposition <em>to</em> still clearly points to the nominal origin of the infinitive in Proto-Germanic. In all of these languages, an infinitive can be the subject of a finite verb, and it can also be an object, in the sense that <em>(ego) volo vivere / I will live / (egô) mellô zôein</em> resemble the pattern finite verb + object.</p>\n\n<h2>A note on <strong>clauses</strong></h2>\n\n<p>It appears that two current definitions exist. Some branches of linguistic studies and disciplines use the strict definition of <em>clause</em>, which is \"a finite verb and all its dependencies, including its subject\".</p>\n\n<p>I am not entirely sure about the broader definition and how it differs from <em>verbal phrase</em>, but I think it is something like \"any kind of verb and its dependencies\". What constitutes a \"verb\" is defined by the kind of arguments it takes, I would say (in both definitions). I am not sure whether the broad definition includes the \"subject\" of a participle in the clause (probably yes).</p>\n", "Id":"3341", "ParentId":"3316", "LastEditorUserId":"82", "CreationDate":"2013-03-09T02:49:00.063", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-09-08T05:19:53.560", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-09-08T05:19:53.560", "Score":"2", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}