{"comments":[], "Body":"<p>That depends on dominant semantic scope of a vocabulary for a given language. Some languages, like English, Spanish or Chinese, have more than one meaning for an item.</p>\n\n<p>Others, like Japanese, Finnish or French, target at specific, or 'occasional' semantics. E.g, there are special words for 'nest' and 'a nest within a hollow of a tree trunk', 'alone pine' or 'pine in a forest' in Finnish, or special words for 'you-underling', 'you-equal' or 'you-superior' in Japanese.</p>\n\n<p>The former languages usually have fewer words in vocabularies as compared to the latter ones.</p>\n\n<p>Or the languages with greater number of cases might have no word for, say, 'at' or 'within', but a word like 'up' might have more than three different varieties.</p>\n", "Id":"3357", "ParentId":"3333", "CreationDate":"2013-03-11T19:34:59.017", "Score":"1", "PostTypeId":"2", "OwnerUserId":"1686", "LastActivityDate":"2013-03-11T19:34:59.017", "OwnerUser":{"UpVotes":"145", "DownVotes":"36", "ProfileImageUrl":"http://i.stack.imgur.com/rZ1Oc.jpg", "Id":"1686", "AccountId":"2130467", "Views":"63", "Reputation":"1112", "CreationDate":"2013-01-19T17:49:32.827", "DisplayName":"Manjusri", "LastAccessDate":"2014-01-18T20:17:27.900", "AboutMe":"<p>I have no native language. I am more or less getting by in some tongues, and I can read and/or swear in douzens of other languages, but this doesn't mean I am an expert in them. By January 2013 I am 34 and wish to see the latter number growing. </p>\n\n<p>I study [cognitive] psychology and am planning to obtain some certificates in computer languages and programming.</p>\n\n<p>I enjoy horse riding, travelling, good cuisine, green Japanese tea, Russian and Spanish literatures and friendly company.</p>\n\n<p><strong>Fluent In:</strong> Dutch, English, Finnish, French, Russian, Spanish and Swedish.</p>\n\n<p><strong>Less Fluent:</strong> Danish, Estonian, Polish and Bulgarian, </p>\n\n<p><strong>Learning:</strong> Arabic, Chinese, Innuit, Japanese, Komi, Sanskrit, Tibetan and Yoruba.</p>\n\n<p><strong>Planning to Learn:</strong> Tangut, C, C++ &amp; Pascal</p>\n"}}