{"Body":"<p>Whilst any character set is normally limited by the number of bits you use to represent any particular character ~ if every character has to fit in 8 bits, there can only be 256 of them ~ I doubt this was a massive problem in early computing.</p>\n\n<p>Japanese hackers could have just used a subset of Japanese that provided all the characters they needed, which isn't many for a programming language, and used short words or abbreviations to reduce the total number of characters in any file. Alternatively, they could have invented a magic character that switched which character set was being used, adding new, 255-character character sets at very little end cost, assuming those sets were optimised for writing a formal language which was itself optimised to use those sets, avoiding the need to constantly switch set.</p>\n\n<p>I don't think the <code>ls</code> command is shortened due to concerns about system resources; rather it was chosen to reduce the amount of characters a user had to type. Shell languages try to be very easy to enter as they are designed to be used interactively at a command line.</p>\n\n<p>In short, I disagree with the assertions above that suggest that having a large character set made early computing significantly more difficult. The challenges at that time were not significantly lessened by being able to readily type all the characters in your natural language.</p>\n\n<p>It's not true that everyone was working on computing at an even pace until we moved from entering binary to text, and then the people with small alphabets shot ahead.</p>\n\n<p>This is a case where size doesn't matter, much.</p>\n", "Id":"3363", "ParentId":"2090", "LastEditorUserId":"1852", "CreationDate":"2013-03-12T04:43:36.910", "OwnerUserId":"1852", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-03-12T13:05:56.190", "LastEditedUser":{"UpVotes":"0", "WebsiteUrl":"http://piousoft.blogspot.co.uk/", "Id":"1852", "AccountId":"1304091", "CreationDate":"2013-03-12T04:06:58.257", "AboutMe":"<p>I used to write graffiti for a living, but then found hacking. It's far more creative, far more subversive, can be done indoors and pays better, so now I'm one of those free software guys.</p>\n\n<p>I authored NotebookCloud last year, a web service for using IPython on AWS, and I'm currently divided between writing a browser based, Python IDE for Android, with support for Lego robots, and extending Markdown with web components.</p>\n\n<p>My favourite spaces right now are Python, Android, Lego and the Cloud.</p>\n", "Age":"35", "Location":"Cambridgeshire, United Kingdom", "DownVotes":"0", "Views":"0", "Reputation":"121", "DisplayName":"Carl Smith", "LastAccessDate":"2013-12-10T23:31:12.037"}, "LastActivityDate":"2013-03-12T13:05:56.190", "Score":"2", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://piousoft.blogspot.co.uk/", "Id":"1852", "AccountId":"1304091", "CreationDate":"2013-03-12T04:06:58.257", "AboutMe":"<p>I used to write graffiti for a living, but then found hacking. It's far more creative, far more subversive, can be done indoors and pays better, so now I'm one of those free software guys.</p>\n\n<p>I authored NotebookCloud last year, a web service for using IPython on AWS, and I'm currently divided between writing a browser based, Python IDE for Android, with support for Lego robots, and extending Markdown with web components.</p>\n\n<p>My favourite spaces right now are Python, Android, Lego and the Cloud.</p>\n", "Age":"35", "Location":"Cambridgeshire, United Kingdom", "DownVotes":"0", "Views":"0", "Reputation":"121", "DisplayName":"Carl Smith", "LastAccessDate":"2013-12-10T23:31:12.037"}}