{"OwnerUser":{"UpVotes":"4", "WebsiteUrl":"http://christophoronomicon.blogspot.com/", "Id":"45", "AccountId":"402526", "CreationDate":"2011-09-13T21:05:16.063", "AboutMe":"", "Age":"38", "Location":"Netherlands", "DownVotes":"0", "Views":"12", "Reputation":"533", "DisplayName":"Tsela", "LastAccessDate":"2012-10-11T15:15:46.777"}, "comments":[], "Body":"<p>As far as I know, in European Portuguese the use of the definite article with people's names is considered standard, and not using it is very formal. In Modern Greek (not a Romance or Germanic language, but still relevant) it is mandatory (except, naturally, in the vocative), and not using it would be considered ungrammatical.</p>\n\n<p>As for why it is considered \"bad style\" in languages that have it in dialects but not in the standard language, I think it's mostly a problem of the standard language being based on an older form than current vernaculars (Written French in particularly is quite archaising compared to Spoken French), a form where personal names cannot take the article. Since anything not part of the standard is considered \"wrong\" (the typical prescriptivist view), personal names with articles are considered \"wrong\" as well.</p>\n\n<p>The use of definite articles with personal names typically appears rather late in the evolution of definite articles. Definite articles typically originate from demonstrative determiners whose meaning gets eroded with time (from \"this man\" to \"the man\"). From anaphoric/cataphoric/spatial use to \"simple\" definition, the erosion of meaning carries on, and as it does the article's use becomes more and more mandatory, for more and more nouns (basically, it stops adding a specific meaning, and starts being seen as just something that must be used with nouns that are considered definite, even if they would still be considered definite without it). You can see this evolution by looking at how different languages use the definite article:</p>\n\n<ul>\n<li>In English, the definite article is still considered to add definition to a noun, and for this reason is normally not used with nouns that are semantically definite, like concepts (you say \"peace\", not *\"the peace\"), proper nouns (names of countries, regions, towns, etc.) and personal names;</li>\n<li>In French, the article has a much less strong meaning by itself, and is used more often than in English. For instance, concepts in French do take the article (\"la paix\"), as well as country and region names (\"la France, la Bretagne\"). Other proper nouns (e.g. names of towns) sometimes take the article and sometimes do not, and it's difficult to describe this use in terms of rules. As for personal names, they normally don't take the article, although some rural dialects do so (but the vast majority of French people, at least in France, don't use articles with personal names);</li>\n<li>In Modern Greek, the erosion of meaning is nearly complete (maybe because the definite article has been extant for more than 2000 years!): it doesn't really <em>add</em> definition to nouns, rather it <em>must</em> appear when a noun is definite, whether this definition is semantic, pragmatic, or due to other determiners. So in Greek the definite article is used with all proper nouns without exception, but it is even used in addition to the demonstrative adjectives (so \"this man\" is \"αυτός ο άνθρωπος\", literally \"this the man\").</li>\n</ul>\n\n<p>So, whether using the definite article with people's names is \"bad style\" or not could be said to depend on the prescriptivist's view of what the definite article's role is: if its role is to <em>add</em> definiteness to a noun, then it's more likely to be considered incorrect to add it to nouns that are already definite by meaning, like people's names. If its role, however, is merely to <em>indicate</em> that a noun is definite, then it is more likely to be acceptable to use it with nouns that are already semantically definite.</p>\n", "Id":"337", "ParentId":"5", "CreationDate":"2011-09-21T00:06:21.387", "Score":"11", "PostTypeId":"2", "OwnerUserId":"45", "LastActivityDate":"2011-09-21T00:06:21.387", "CommentCount":"1"}