{"comments":[], "Body":"<p>While others have provided informative answers to this question, I would argue that the <em>premise</em> of this question is not completely accurate. </p>\n\n<p>For example, in the <a href=\"http://ocw.mit.edu/courses/linguistics-and-philosophy/24-900-introduction-to-linguistics-spring-2005/study-materials/soundcorr.pdf\" rel=\"nofollow\">traditional distinctive feature set</a>, all phonemes (both vowels and consonants) are specified for the features [cons] and [son]. Further, it's true that there are additional features for which only vowels or only consonants are specified, but in a way this is an arbitrary distinction to single out. For example, in the same way that all vowels and sonorant consonants and glides are trivially [+son], all consonants besides /h/ and /ʔ/ are trivially considered [-spread] and [-constr], meaning those two features are not used to distinguish a vast majority of consonants.  The resulting effect is that the minus value for those features on most consonants doesn't amount to much more than a placeholder. One could easily assign a minus values for those features on vowels and it would bear the same significance.</p>\n\n<p>It's true that some of the features used to distinguish vowels appear to have redundant analogues in the set used to distinguish consonants (e.g. [rounded] and [labial]), but really that is just a side effect of the fact that they are derived from similar articulatory properties.  It is important to keep in mind that the distinctive features are just a convenient way to categorize phonemes at the <em>phonological</em> level (which is why I added the <em>phonology</em> tag to the post) and at the end of the day they are abstract labels derived mnemonically from articulatory (and in some cases acoustic) characteristics of the speech units with which they are associated.</p>\n", "Id":"3380", "ParentId":"3369", "CreationDate":"2013-03-13T14:50:15.347", "Score":"1", "PostTypeId":"2", "OwnerUserId":"385", "LastActivityDate":"2013-03-13T14:50:15.347", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}