{"Body":"<p>Although it is hard to prove, there are some indications that the largest amount of expressions is likely English:</p>\n\n<ol>\n<li>Unlike, for example, the French, English speakers have no problem with adopting foreign loanwords into their language.</li>\n<li>English is spoken as a first language in many countries on different continents. Each of these countries have one or more unique dialects with their own expressions and slang. </li>\n<li>English is the primary language of science and technology. Manuals, tutorials, and other technical documents may require the invention of new words or word forms (e.g. \"to google\")</li>\n<li>English is the universal language of the merchant marine and air travel. The specialized vocabulary used is simply not translatable in all languages. </li>\n<li>Because spelling has hardly changed over the centuries, old poetry and literature is still widely read. This prevents older expressions and antiquated words from being forgotten.</li>\n<li>The English language has a ridiculous amount of synonyms. See Roget's Thesaurus.</li>\n</ol>\n", "Id":"3403", "ParentId":"3393", "LastEditorUserId":"1055", "CreationDate":"2013-03-19T12:02:51.260", "OwnerUserId":"1877", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-03-19T16:32:19.643", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2013-03-19T16:32:19.643", "Score":"0", "CommentCount":"2", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://www.bakedpotatoes.tk", "DownVotes":"0", "Id":"1877", "AccountId":"2514719", "Views":"0", "Reputation":"9", "CreationDate":"2013-03-19T12:02:51.260", "DisplayName":"Allard Dubbeldam", "LastAccessDate":"2013-03-19T12:02:51.260"}}