{"OwnerUser":{"UpVotes":"47", "WebsiteUrl":"", "DownVotes":"1", "Id":"153", "AccountId":"871764", "Views":"33", "Reputation":"1445", "CreationDate":"2011-09-18T03:14:58.320", "DisplayName":"Floating Tone", "LastAccessDate":"2012-05-27T05:07:04.410", "AboutMe":"<p>I'm a PhD candidate in linguistics, with diverse interests including phonetics, phonology, morphology, language documentation, historical linguistics and sociolinguistics. I am particularly interested in the languages of Africa, Papua New Guinea and Australia. I'm also very interested in methods of making linguistic knowledge and materials more accessible and available to linguists and non-linguists alike.</p>\n"}, "comments":[], "Body":"<p>It's not arbitrary, and while the ease of rule-writing is certainly a consideration, this is not what determines which sound is the phoneme and which sound is the allophone. To re-use @Alek Storm's first example:</p>\n\n<blockquote>\n  <p>/p/ -> [b] / V_V</p>\n  \n  <p>/p/ -> [p] / otherwise</p>\n</blockquote>\n\n<p>It's true that this is a simpler analysis than trying to instead account for [b] becoming [p] in a wide range of environments. But, the actual reason why [b] is a variant of [p] is because [p] can occur anywhere, while [b] can only occur in a <strong>specific phonetic environment</strong>. That is, the voiceless bilabial plosive only becomes voiced when it occurs inter-vocalically, because the voicing of the surrounding vowels carries across to the otherwise voiceless plosive. So, when you start to find phones which seem to be variants of the same sound, you need to look at the environments they occur in to work out which phones have plausibly been affected by the surrounding phones, and which phones seem to be robust in a range of environments.</p>\n\n<p>That said, there are languages which permit a lot of 'free variation' (allophones that <em>don't</em> seem to arise through phonetic conditioning), in which case linguists might choose 'the phoneme' based on frequency, ease of explanation, or familiarity with one type of sound over another. But, in many analyses noting 'free variation', there do turn out to be phonetic factors governing the variation.</p>\n", "Id":"344", "ParentId":"342", "CreationDate":"2011-09-21T04:35:35.673", "Score":"5", "PostTypeId":"2", "OwnerUserId":"153", "LastActivityDate":"2011-09-21T04:35:35.673", "CommentCount":"5"}