{"Body":"<p>In short: immersion helps a great deal, but it is neither always essential, nor always sufficient.</p>\n\n<hr>\n\n<p>There are a few definition problems here. <strong>What counts as immersion</strong>, and which aspects of it do you consider essential?</p>\n\n<ol>\n<li><p>Exposure: reading and listening and watching people speak in a foreign language.</p></li>\n<li><p>Active use: producing sentences in the language yourself.</p></li>\n<li><p>Interaction: getting immediate feedback in the form of a natural conversation.</p></li>\n<li><p>Speech: all of the above in speech (so not only in written communication).</p></li>\n</ol>\n\n<p>I think by immersion you mean you get all of the above.</p>\n\n<hr>\n\n<p><strong>How well does one need to know a language</strong> for you to say that one has \"learned\" it? There is a very wide range between \"can buy bread at a supermarket\" or \"can read a comic book\" on one hand, and \"can successfully pose as a native speaker\" or \"can win literary prizes for writing novels in proper style\" on the other.</p>\n\n<hr>\n\n<p>While I think your progress will on average be slower without the above four points of immersion, you can certainly learn a language very well without some of them. If you watch a lot of French films, read a lot of French, chat with people on-line in French, but never visit a Francophone country, you can still learn to read, write, and speak very good French.</p>\n\n<p>Conversely, many people who have lived in France for several years will still make grammatical errors and have a fairly noticeable accent. Moreover, if you never read good literature, your French will most likely never approach that of an educated Frenchman, not even after 30 years of immersion.</p>\n\n<hr>\n\n<p>Conclusion:</p>\n\n<p>A. It is easier to learn skills associated with <strong>producing language</strong> by immersion than by other means, but you can still learn them;</p>\n\n<p>B. Immersion is not enough for other skills, such as <strong>educated reading and writing</strong>.</p>\n\n<p>C. It greatly depends on the person.</p>\n\n<p>Immersion should be considered an important and efficient tool, but it is neither absolutely essential nor always sufficient. The best and quickest way to learn a language and all its facets is by a <strong>combination of reading, writing, and immersion</strong> (so speaking and listening). Reading includes both novels and grammar books. Chatting on-line has some of the important aspects of immersion, but it is of course confined to writing.</p>\n", "Id":"3462", "ParentId":"3458", "LastEditorUserId":"82", "CreationDate":"2013-03-29T17:37:47.857", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-03-29T21:28:55.760", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-03-29T21:28:55.760", "Score":"4", "CommentCount":"9", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}