{"OwnerUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}, "comments":[], "Body":"<p>I don't know the history of the Miskito case, but doubling up on morphology is a known development in the history of language.  Here are two examples from English/Germanic:</p>\n\n<ol>\n<li><p>The English word <em>child</em> once had plural <em>childer</em> (regularized from\nthe original invariant   plural <em>child</em>).  Another pluralizer <em>-en</em>\nwas then added, giving modern <em>children</em></p></li>\n<li><p>In Proto-Germanic, there is a class of verbs called preterite presents.  These were perfective in Proto Indo-European, but reanalyzed as presents in Germanic.  The past tense was then formed by addition of a suffix (cognate with Mod. Engl. <em>-ed</em>).  So, the past tense forms of verbs carried two \"past\" markers -- the original PIE ablaut and the Germanic suffix.</p></li>\n</ol>\n\n<p>If I had to guess what happened in Miskito, I would say that these words were originally in an infixing class (<em>duri</em> ~ *<em>dwari</em>), and were subsequently reanalyzed as being a suppletive stem in the <em>-ka</em> class.  (Suppletion is the operation that occurs when a stem changes form after the addition of a suffix.  An example from Mod. Engl. verb inflection is the alternation between <em>bleed</em> and  <em>bled</em> (&lt; <em>bleed + ed</em>).)  But that analysis is only a guess.</p>\n", "Id":"347", "ParentId":"345", "CreationDate":"2011-09-21T07:24:35.243", "Score":"3", "PostTypeId":"2", "OwnerUserId":"46", "LastActivityDate":"2011-09-21T07:24:35.243", "CommentCount":"1"}