{"Body":"<p>Yes, this usage has been around for a long time and you're missing out. A simple look at Google's Ngram viewer shows that the rate of occurrence for both \"think that\" and \"thinking that\" have <a href=\"http://books.google.com/ngrams/graph?content=think+that%2Cthinking+that&amp;year_start=1800&amp;year_end=2012&amp;corpus=15&amp;smoothing=3&amp;share=\" rel=\"nofollow\">held relatively consistent since 1800</a>. Granted, Ngram Viewer only has data up to 2008, but it does suggest that the progressive construct \"thinking that...\" is not undergoing any particular surge in popularity.</p>\n\n<p>Of course, you might argue that those results are based on books and the phenomenon you're talking about is in informal speech. Unfortunately, I have no data on how this trend relates to informal speech but I would still say the results of Ngram Viewer evidence a historical precedent.</p>\n\n<p>Additionally, expanding somewhat on jlawler's answer, the progressive construct seems to place an emphasis on the act of thinking, creating slightly different semantic contexts:</p>\n\n<blockquote>\n  <p>(1) It's a bad idea<br>\n  (2) I think it's a bad idea<br>\n  (3) I'm thinking it's a bad idea</p>\n</blockquote>\n\n<p>To me (native Canadian-English speaker), these three sentences show different levels of confidence in the opinion \"it's a bad idea\". Without any \"think\" construct, (1) implies absolute certainty. The stative construct (2) implies a high level of certainty but leaves room for doubt (for illustration, let's say 80-95% confidence). Finally, the progressive construct (3) allows room for much more doubt (maybe 55-70% confidence). This is reflected below.</p>\n\n<blockquote>\n  <p>(4) It's a bad idea but I could be wrong<br>\n  (5) I think it's a bad idea but I could be wrong<br>\n  (6) I'm thinking it's a bad idea but I could be wrong</p>\n</blockquote>\n\n<p>While none of these sentences are <em>ungrammatical</em>, (4) seems marginally unacceptable to me. Given a choice between (5) and (6), I find (6) more natural.</p>\n\n<p>Along with this perceived confidence, (1), (2), and (3) also differ in perceived forcefulness. I can think of numerous times where I have used \"think\" to soften the impact of my opinion when talking to a superior.</p>\n\n<p>In summary, there seem to be multiple stylistic and societal factors which influence the choice of the progressive \"think\" construct over stative \"think\" construct (over no \"think\" at all). Combined with the historical precedent, I don't believe progressive \"think\" is a new phenomenon nor that it is overtaking stative \"think\" in any meaningful way.</p>\n\n<p>One final note, as I stated above, my answer relies heavily on my own personal intuition. I'd be very interested to hear what other native speakers think about my interpretation. It's entirely possible that I am part of the tend of this \"dying stative 'think'\" but I see no evidence suggesting that such a trend even exists.</p>\n", "Id":"3479", "ParentId":"3474", "LastEditorUserId":"1055", "CreationDate":"2013-04-01T02:30:05.807", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-04-01T02:45:19.140", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2013-04-01T02:45:19.140", "Score":"4", "CommentCount":"4", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}