{"Body":"<p>Yes, there are two main approaches to machine translation. Rules-based (as in <a href=\"http://babelfish.yahoo.com/\" rel=\"nofollow\">babelfish</a>) and statistics-based (as in <a href=\"http://translate.google.com/\" rel=\"nofollow\">google translate</a>). </p>\n\n<p>I don't think that statistical methods are ipso facto better than rules-based methods in all things. You get different types of errors, as you'll see if you try to translate the same text to the same language with both engines linked earlier. It'll depend on the recipients what types of errors still leave the text understandable. I use Babelfish when I need translation-help for English -> German because I consider the errors of Google's translation service to be worse than those of Babelfish, for the kind of texts I need to translate.</p>\n\n<p>Rules-based approaches takes time, money and trained personnel to make and test the rules. Statistics-based approaches needs large equivalent<sup>*</sup> corpora for each pair of languages it can translate to and from. Sometimes the former is easier to arrange than the latter, because of for instance copyright. For languages with few speakers rules-based is the only possibility since there exist no suffciently large corpora. That rules out statistical translation for most of the languages on this planet.</p>\n\n<p><sub>* Equivalent corpora: same genre of text. Corporas that have the same texts in different languages is even better but there aren't enough of those.</sub></p>\n", "Id":"351", "ParentId":"350", "LastEditorUserId":"119", "CreationDate":"2011-09-21T10:35:39.300", "OwnerUserId":"119", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-22T06:57:58.247", "LastEditedUser":{"UpVotes":"302", "DownVotes":"1", "Id":"119", "AccountId":"14652", "Views":"52", "Reputation":"3065", "CreationDate":"2011-09-14T14:24:24.227", "DisplayName":"kaleissin", "LastAccessDate":"2014-01-18T22:21:33.313", "AboutMe":"<p>Sysadmin/programmer by day, linguist by night.</p>\n"}, "LastActivityDate":"2011-09-22T06:57:58.247", "Score":"8", "OwnerUser":{"UpVotes":"302", "DownVotes":"1", "Id":"119", "AccountId":"14652", "Views":"52", "Reputation":"3065", "CreationDate":"2011-09-14T14:24:24.227", "DisplayName":"kaleissin", "LastAccessDate":"2014-01-18T22:21:33.313", "AboutMe":"<p>Sysadmin/programmer by day, linguist by night.</p>\n"}}