{"OwnerUser":{"UpVotes":"145", "DownVotes":"36", "ProfileImageUrl":"http://i.stack.imgur.com/rZ1Oc.jpg", "Id":"1686", "AccountId":"2130467", "Views":"63", "Reputation":"1112", "CreationDate":"2013-01-19T17:49:32.827", "DisplayName":"Manjusri", "LastAccessDate":"2014-01-18T20:17:27.900", "AboutMe":"<p>I have no native language. I am more or less getting by in some tongues, and I can read and/or swear in douzens of other languages, but this doesn't mean I am an expert in them. By January 2013 I am 34 and wish to see the latter number growing. </p>\n\n<p>I study [cognitive] psychology and am planning to obtain some certificates in computer languages and programming.</p>\n\n<p>I enjoy horse riding, travelling, good cuisine, green Japanese tea, Russian and Spanish literatures and friendly company.</p>\n\n<p><strong>Fluent In:</strong> Dutch, English, Finnish, French, Russian, Spanish and Swedish.</p>\n\n<p><strong>Less Fluent:</strong> Danish, Estonian, Polish and Bulgarian, </p>\n\n<p><strong>Learning:</strong> Arabic, Chinese, Innuit, Japanese, Komi, Sanskrit, Tibetan and Yoruba.</p>\n\n<p><strong>Planning to Learn:</strong> Tangut, C, C++ &amp; Pascal</p>\n"}, "comments":[], "Body":"<p>The main living dialects are:</p>\n\n<p>1) Moscovian (fast speech tempo, emphasised [a] in unstressed positions, longer [a] in stressed position)</p>\n\n<p>2) North-Western (much similar to modern literary standard)</p>\n\n<p>3) Southern (with fricative [γ])</p>\n\n<p>Caucasian Russian is regarded by some linguists as something between pidgeon and creole, although it does not differ much from the standard Russian.</p>\n\n<p>Siberian Russiad is much like a separate dialect (although some dialects, like <em>чалдонская поговорка</em>, are [almost?] extinct now.</p>\n\n<p>There are also sociolects (e.g. criminal slang, etc.) differing mainly in style.</p>\n\n<p>Some other regional variaties had prevailed, although the modern Russian is mainly a monocentric language with a prescreptive grammar.</p>\n\n<p>The Russian spoken by diaspora wordlwide varies greately, due either to conservation (e.g. Russian spoken by first wave emmigrés in France or China),  or because of borrwings and language contacts (Russian in America and in Baltic &amp; Nordic States).</p>\n", "Id":"3564", "ParentId":"1113", "CreationDate":"2013-04-16T15:08:55.967", "Score":"-1", "PostTypeId":"2", "OwnerUserId":"1686", "LastActivityDate":"2013-04-16T15:08:55.967", "CommentCount":"10"}