{"OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "comments":[], "Body":"<p>You seem to be a bit confused about your own question. You can't really tell us what you mean by \"congative benefit\" or how one would measure it. I think you may mean one of two things, so:</p>\n\n<h3>Linguistic Relativity</h3>\n\n<p>This is the assumption that the language you speak affects the way your brain works. That maybe one language makes math easier to comprehend and perform or that maybe another is better for thinking about spacial relationships. This is what's known as <a href=\"http://en.wikipedia.org/wiki/Linguistic_relativity\" rel=\"nofollow\">the Sapir-Whorf Hypothesis</a> (specifically, the strong version). It has been widely studied and, unfortunately, largely disproven.</p>\n\n<p>What you can find evidence for is that language provides very superficial differences. A popular experiment is to compare the adjectives generated by native speakers of two different languages when showed a noun that is masculine in one and feminine in another. These speakers tend to generate adjectives associated with the noun's gender in their native language. You can listen to <a href=\"http://www.npr.org/blogs/krulwich/2009/04/06/102518565/shakespeare-had-roses-all-wrong\" rel=\"nofollow\">this NPR clip</a>, but know that this program is a bit misleading because it presents this research as new (it isn't) and also know that this effect is not nearly as significant as the program tries to make it seem (it's not that speakers of a language where \"bridge\" is feminine <em>can't</em> see its masculine attributes or that they think those attributes do not exist, it's just that they show a <em>statistical preference</em> to generating feminine attributes). Also there is evidence to suggest that language plays a large role in <a href=\"http://www.blutner.de/color/Sapir-Whorf.pdf\" rel=\"nofollow\">colour perception</a> (starting on page 11).</p>\n\n<p>For this perspective, learning a language what classifies nouns differently than your native language could theoretically broaden your perception of objects and colours. However, don't get too excited. Most of the research is done on native speakers of languages. According to the <a href=\"http://en.wikipedia.org/wiki/Critical_period_hypothesis\" rel=\"nofollow\">critical period hypothesis</a>, by the time you're an adult your brain is pretty set in it's ways so I would expect any Sapir-Whorfian boost to your cognitive skills from learning a foreign language to be minimal.</p>\n\n<h3>Alzheimer's</h3>\n\n<p>While Sapir-Whorf is a more detailed and interesting answer, I heavily suspect that what actually happened is that you read <a href=\"http://www.guardian.co.uk/science/2011/feb/18/bilingual-alzheimers-brain-power-multitasking\" rel=\"nofollow\">an article saying that bilinguals delayed onset of Alzheimer's related dementia</a> and then extrapolated from there. Looking at that article we see similar vague references to <em>cognative skills</em> without explaination so to what it means:</p>\n\n<blockquote>\n  <p>Learning a second language and speaking it regularly can improve your cognitive skills...</p>\n</blockquote>\n\n<p>I actually <a href=\"http://cog.lab.yorku.ca/files/2007/11/Schweizer.pdf\" rel=\"nofollow\">found the original paper</a> for this research. The papers is rather unclear about at which age the bilingual patients acquired their second language, which I find a bit suspicious since language acquisition in children is <strong>very</strong> different from language acquisition in adults. Reading between the lines (and knowing the demographics of Toronto), it seems that most of the bilingual patients are immigrants to Canada, meaning many may have learned English as an adult. This is good news you for you.</p>\n\n<p>However, there is another problem. The paper talks about bilingualism as being a factor in \"building a cognitive reserve\", but they don't claim it's the only factor. Surely there must be other activities or combinations of activities that provide just as great a benefit. In fact, the paper draws a link between bilingualism and multitasking, that having to switch between the languages is what helps the patients.</p>\n\n<h3>Conclusion</h3>\n\n<p>So which language is the most beneficial? Well, so far as I can tell no research has been done on this. Your intuition seems to be that the most beneficial language is the one which is most different from your native language. While that certainly is logical, the common thread in the research I'm seeing is that the language that you learn is not nearly as important as the fact that you learn another language.</p>\n\n<p>I can tell you from experience that learning a language very different from your native language is difficult and frustrating and makes you likely to want to give up (I'm a native English speaker learning Korean). If the benefits are equal, you might as well learn something more closely related to your native language.</p>\n", "Id":"3567", "ParentId":"3531", "CreationDate":"2013-04-17T01:41:32.617", "Score":"1", "PostTypeId":"2", "OwnerUserId":"1055", "LastActivityDate":"2013-04-17T01:41:32.617", "CommentCount":"4"}