{"comments":[], "Body":"<p>Definitely. This is a little obscure, probably to obscure to be of any real use, but there is a chapter from the book <a href=\"http://rads.stackoverflow.com/amzn/click/3540375201\" rel=\"nofollow\">Aspects of Automatic Text Analysis</a>, <a href=\"https://dl.dropboxusercontent.com/u/84340191/2%20Mathematics%20of%20Semantic%20Spaces.pdf\" rel=\"nofollow\">The Mathematics of Semantic Spaces (PDF)</a>, that models semantics as a metric space. It's general calculus on metric spaces, and this is probably the limit of mathematical abstraction in applied linguistics that I've seen. Unless you've been introduced to some very high level math, this material won't make any sense.</p>\n\n<p>Other then that, I know acoustic phonetics has derivatives, integrals, limits, series, etc. For example, one way to describe a sound wave quantitatively is take it's <a href=\"https://en.wikipedia.org/wiki/Fourier_transform\" rel=\"nofollow\">Fourier transform</a> which  involves the evaluation of an integral. Then there's statistical analysis of corpora, where calculus isn't directly involved, but the formulas won't make any sense unless your familiar with the concepts of basic calculus. Things like weighting, infinite sums, neighbourhoods, continuity, finding volumes and lengths, optimization etc. are implicit in a lot of statistical measurements. <a href=\"https://en.wikipedia.org/wiki/Support_vector_machine\" rel=\"nofollow\">Including vector calculus.</a> A lot of linguistic models employ continuous sets, not just discrete sets, and require a metric or a topology to define the set as a mathematical space.</p>\n", "Id":"3592", "ParentId":"3287", "CreationDate":"2013-04-19T21:56:00.790", "Score":"1", "PostTypeId":"2", "OwnerUserId":"1162", "LastActivityDate":"2013-04-19T21:56:00.790", "OwnerUser":{"UpVotes":"23", "DownVotes":"0", "Id":"1162", "AccountId":"1586391", "Views":"2", "Reputation":"286", "CreationDate":"2012-07-04T22:46:56.807", "DisplayName":"taylor", "LastAccessDate":"2013-05-10T17:08:44.560"}}