{"Body":"<p>@AlekStorm's answer is pretty good, but I'd say that in practice there are at least two ways linguists decide which form is underlying.</p>\n\n<p>1) If you take two allophones, say (using relatively broad transcription) [t] and [ɾ]. You could, rather tediously, list all the contexts where [t] shows up, and all the contexts where [ɾ] shows up. Then, you can so some set operations. Call T the set where [t] shows up and D the context where [ɾ] shows up. It should be the case that T-D is a relatively small set of contexts, and D-T should be empty. In this case, [ɾ] has a restricted distribution, so the features of [t] could be considered underlying. This is similar to the elegance of description from @AlekStom's answer. Of course, in practice it will happen that neither A-B nor B-A is empty, and then everything gets more complicated.</p>\n\n<p>2) You can check to see if one allophone \"behaves\" as if it were the other. As with [t] and [ɾ], the diagnostic would be</p>\n\n<ul>\n<li>Does [t] ever behave as if it were a voiced, lenis segment?</li>\n<li>Does [ɾ] ever behave as if it were a voiceless segment?</li>\n</ul>\n\n<p>In fact, in many dialects [ɾ] does frequently behave as a voiceless segment, triggering changes in quality of its preceding vowel. For example, in Canadian English and some other dialects, there is the following distinction between <em>write</em> and <em>ride</em>.</p>\n\n<pre><code>raɪd   (ride)\nrʌɪt   (write)\n</code></pre>\n\n<p>When adding on the morpheme -er, the /t/ in <em>writer</em> is flapped.</p>\n\n<pre><code>raɪɾɚ   (rider)\nrʌɪɾɚ   (writer)\n</code></pre>\n\n<p>This case has the additional complication that both the [d] and the [t] are neutralized to [ɾ]. However, you could still argue that the vowel difference between [aɪ] and [ʌi] is triggered by voicelessness, so that the underlying form of the [ɾ] in <em>writer</em> is behaving as a voiceless segment.</p>\n\n<hr>\n\n<p>But, like I said, heuristics like these are not applicable to all analyses, and there are certainly underlying forms which have been posited on flimsy evidence. And thank god, because that means that linguists' work is not done!</p>\n", "Id":"360", "ParentId":"342", "LastEditorUserId":"28", "CreationDate":"2011-09-21T15:20:49.847", "OwnerUserId":"28", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-21T19:35:49.990", "LastEditedUser":{"UpVotes":"15", "DownVotes":"2", "Id":"28", "AccountId":"53332", "Views":"31", "Reputation":"1410", "CreationDate":"2011-09-13T20:55:31.697", "DisplayName":"JoFrhwld", "LastAccessDate":"2013-10-22T11:47:47.293"}, "LastActivityDate":"2011-09-21T19:35:49.990", "Score":"8", "CommentCount":"3", "OwnerUser":{"UpVotes":"15", "DownVotes":"2", "Id":"28", "AccountId":"53332", "Views":"31", "Reputation":"1410", "CreationDate":"2011-09-13T20:55:31.697", "DisplayName":"JoFrhwld", "LastAccessDate":"2013-10-22T11:47:47.293"}}