{"OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "comments":[], "Body":"<p>While I have been unable to find any excerpts from the book in question, <a href=\"http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.136.7335&amp;rep=rep1&amp;type=pdf\" rel=\"nofollow\">\"A Fundamental Algorithm for Dependency Parsing\"</a> by M. Covington references <a href=\"http://mitpress.mit.edu/books/computational-complexity-and-natural-language\" rel=\"nofollow\">\"Computational Complexity And Natural Language\"</a> by Barton, Berwick, and Ristad, saying:</p>\n\n<blockquote>\n  <p>Barton, Berwick and Ristad... prove that when lexical ambiguity and agreement features are present — that is, when words can be ambiguous and can be labeled with attributes — natural language parsing is NP-complete.</p>\n</blockquote>\n\n<p>I suspect this book may be of great interest to you.</p>\n\n<p>This conclusion is backed up by <a href=\"http://pagesperso.lina.univ-nantes.fr/~cdlh/papers/icgi.stringmax.pdf\" rel=\"nofollow\">\"Computational complexity of problems on probabilistic grammars and transducers.\"</a> by F. Casacuberta et al. which provides proofs that parsing of Stochastic Regular Grammars is NP-Hard as well as <a href=\"http://acl.ldc.upenn.edu/P/P02/P02-1003.pdf\" rel=\"nofollow\">\"Generation as Dependency Parsing\"</a> by A. Koller et al. which offers an ad hoc proof that parsing Topological Dependency Grammars is also NP-complete. As well as several other papers I found with a quick search on Google Scholar.</p>\n", "Id":"3630", "ParentId":"3629", "CreationDate":"2013-04-30T16:25:00.027", "Score":"1", "PostTypeId":"2", "OwnerUserId":"1055", "LastActivityDate":"2013-04-30T16:25:00.027", "CommentCount":"5"}