{"comments":[], "Body":"<p>The non-Pama-Nyungan languages with the highest numbers of speakers are Bininj Gun-Wok, Tiwi, Anindilyakwa and Murrinhpatha.</p>\n\n<ul>\n<li>Anindilyakwa: Spoken on Groote Eylandt, <a href=\"http://austlang.aiatsis.gov.au\" rel=\"nofollow\">AustLang</a> reports speaker numbers in the range 1,500-2,000, while the 2011 census indicates 1,500 speakers.</li>\n<li>Bininj Gun-Wok: this is a cover term for Mayali, Kunwinjku, Kune, Gundjeihmi, Kuninjku and Gundedjnjenghmi. This is a group of closely-related and mutually intelligible varieties spoken across central Arnhem Land. AustLang indicates total speaker numbers of around 1,300; the 2011 census indicates around 2,000 speakers.</li>\n<li>Murrinhpatha: spoken in the community of Wadeye (also known as Port Keats), this language has grown in speaker numbers due to having become the regional lingua franca. 2006 Census speaker numbers were 1,850, while the 2011 census gives it 2,400.</li>\n<li>Tiwi: The language of Bathurst and Melville islands, off the coast to the north of Darwin. Tiwi has undergone substantial change with a new variety emerging, called Modern Tiwi, while speaker numbers for old Tiwi have dropped greatly. Austlang reports speaker numbers over 1,700 while the 2011 census gives it over 2,200.</li>\n</ul>\n\n<p>On the basis of these figures it appears that Murrinhpatha currently is the non-Pama-Nyungan language with the largest number of speakers. Of course, the Indigenous Australian languages with the largest numbers of speakers are the creoles, Kriol (Kimberley and Arnhem Land regions) and Yumplatok (Torres Strait islands and Cape York peninsula). While these are not Pama-Nyungan, they are also conventionally not included in non-Pama-Nyungan.</p>\n", "Id":"3658", "ParentId":"3633", "CreationDate":"2013-05-08T05:33:51.113", "Score":"1", "PostTypeId":"2", "OwnerUserId":"363", "LastActivityDate":"2013-05-08T05:33:51.113", "OwnerUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}}