{"comments":[], "Body":"<p>In short: <strong>no</strong>, you need a diachronic definition.</p>\n\n<hr>\n\n<p>If <em>mouse</em> \"device\" had the plural <em>mouses</em>, and <em>mouse</em> \"animal\" had <em>mice</em>, would you say it was still polysemic? I think the answer has to be yes: the paradigm/inflexion is in the end not crucial. <em>Mouse</em> and <em>mouse</em> are still \"the same word\". So we cannot use that as a criterion to distinguish between true homonymy and polysemy.</p>\n\n<p>Another potential criterion could be, \"is the meaning of one sense of the word close to that of the other sense?\". But you can see how this is impracticable: polysemy can lead to wildly different senses, and homonymy can lead to similar senses, such as through <em>folk etymology</em>, where words converge because they are <em>perceived</em> as etymologically related.</p>\n\n<p>Then what should we use? I think the only criterion that can be rigorously applied to distinguish between the two kinds of same-sounding/written words is this:</p>\n\n<blockquote>\n  <p>In the history of this word, were the two senses ever marked as written or pronounced differently?</p>\n</blockquote>\n\n<p>If yes, it is a true homonym; is not, it is merely polysemy. Incidentally, one could argue that every word is polysemic, since all words can be used metaphorically.</p>\n\n<p>So the answer is, <strong>no</strong>, only a diachronic criterion works to distinguish between the two categories that our intuition wants to put different labels on.</p>\n", "Id":"3675", "ParentId":"3672", "CreationDate":"2013-05-09T04:58:28.283", "Score":"1", "PostTypeId":"2", "OwnerUserId":"82", "LastActivityDate":"2013-05-09T04:58:28.283", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}