{"OwnerUser":{"UpVotes":"23", "WebsiteUrl":"", "DownVotes":"5", "Id":"1832", "AccountId":"1670710", "Views":"4", "Reputation":"344", "CreationDate":"2013-03-07T05:57:57.617", "DisplayName":"limetom", "LastAccessDate":"2014-01-13T23:38:09.323", "AboutMe":""}, "comments":[], "Body":"<p>The most strikingly absurd thing here is that Ry큰ky큰an and Japanese may not be related. The only alternative claim at this point--made basically only by non-linguists in Japan--is that the 5 or so Ry큰ky큰an languages are merely dialects of Japanese. Even just a casual glace at all but the most divergent Japonic languages makes it really obvious that they are related.</p>\n\n<p>However, the biggest issue with this whole section and all possible evidence given is that they just aren't giving any convincing evidence that Japonic is related to any other language. There remains only one way to do this: rule out chance and borrowing of similar-looking forms and use the comparative method to show that a common ancestor can be reconstructed on the basis of (more or less) regular, recurrent sound correspondences. Campbell (2013)--or any other intro to historical linguistics textbook--covers this in great detail. By this test, they have failed to demonstrate it is an Altaic language. Additionally, while there was the hypothesis that Old Japanese did at one point have vowel harmony (cf. Whitman 1985), this has basically been abandoned (see Miyake 2003). The other two features don't do anything to tell us that Japanese is or is not related to the so-called Altaic languages, because they don't give us the regular, recurrent sound correspondences we need to show languages are related.</p>\n\n<p>There is on-going argument whether Japonic and Korean are related. See <a href=\"http://journals.cambridge.org/action/displayAbstract?fromPage=online&amp;aid=7807607\">Beckwith (2010)</a> for a review of two recent works. The consensus seems to be moving towards \"no\", but there are still some proponents. And none of these proponent--like Whitman (1990), for instance--would use structural similarities as this article does.</p>\n\n<p>That Japanese is related to Tibeto-Burman (or Dravidian or Zuni or whatever) is an extreme minority position and is again simply not supported by any real linguistic evidence.</p>\n", "Id":"3688", "ParentId":"3667", "CreationDate":"2013-05-11T09:33:31.080", "Score":"5", "PostTypeId":"2", "OwnerUserId":"1832", "LastActivityDate":"2013-05-11T09:33:31.080", "CommentCount":"2"}