{"comments":[], "Body":"<p>I'm not sure why people just comment and don't answer questions here, but I'm pasting a summary of a discussion with @KleinePrins:</p>\n\n<p>In <a href=\"http://www.ualberta.ca/~annemich/TesarSmolensky1998.pdf\" rel=\"nofollow\">this document</a>, you can find the definition as \"Underlying (input) material is parsed into syllable structure\". This wasn't clear to me at first, but then @KleinePrins elaborated:</p>\n\n<blockquote>\n  <p>\"I understand the definition as saying that the segments that are\n  considered input for the syllable structure have to be parsed to give\n  an output. The concept of parsing here could be a bit vague (and\n  perhaps that's what prof. Lawler meant with his comment), but I think\n  we could understand it as structure assignment. There's a good reading\n  about this: Tesar (2004). Computing Optimal Forms in Optimality\n  Theory. In McCarthy (ed). Optimality Theory in Phonology. Blackwell.\n  Hope this helps!\"</p>\n</blockquote>\n\n<p>I looked around at some examples to get a better understanding, and I think a relevant example is this:</p>\n\n<p>In Diola Fogny, a language in West Africa, the underlying form </p>\n\n<p><em>/na-min-min/</em> </p>\n\n<p>results in </p>\n\n<p><em>[namimmin]</em> </p>\n\n<p>If we assume Parse has a high ranking, then the underlying syllable structure remains, and it can be represented as <em>[na.mim.min]</em>, where the .'s separate syllables (notice how the placement of .'s makes it just like the placement of -'s in the underlying form).</p>\n", "Id":"3704", "ParentId":"3699", "CreationDate":"2013-05-13T15:54:09.383", "Score":"0", "PostTypeId":"2", "OwnerUserId":"1685", "LastActivityDate":"2013-05-13T15:54:09.383", "OwnerUser":{"UpVotes":"3", "WebsiteUrl":"http://someonesmall.com", "DownVotes":"0", "Id":"1685", "AccountId":"162583", "Views":"0", "Reputation":"188", "CreationDate":"2013-01-19T06:57:37.540", "DisplayName":"dmonopoly", "LastAccessDate":"2013-12-14T06:58:14.713", "AboutMe":"<p>See the website.</p>\n"}}