{"Body":"<p>Not many. The Romans borrowed plenty of Greek words, but mostly in technical senses; in Antiquity, many Greek words that were used in Latin were also considered a bit fancy and special, for better or worse.</p>\n\n<p>There were also some Greek words that were borrowed by the Romans so early in Roman history that they were probably no longer intuitively (or at all) felt to be Greek during the Empire; but the very large majority were not from Greek.</p>\n\n<p>In Christian times, some more Greek words were adopted from the New Testament and from ecclesiastical traditions in early Christianity; Christianity emerged in the eastern part of the Roman Empire, where literate people spoke Greek, not Latin (many people were bilingual, though, just as in the western part). But the number of Greek words was still fairly limited; for comparison, the proportion of French or Latin words in English is many, many times greater.</p>\n\n<hr>\n\n<p>Latin is from the Italic branch of languages, along with Oscan and a few more long-dead languages. Greek is from the Greek/Hellenic branch of languages. Both branches are part of the larger Indo-European language family, along with the Germanic branch (English etc.), the Slavic branch (Russian etc.), and several other branches.</p>\n\n<p>While it is true that Latin was influenced by Greek in ways other than vocabulary—such as grammar—, most similarities between Greek words and Latin words you observe are probably due to their common ancestor, the hypothetical Proto-Indo-European language, the ancestor of the Indo-European family of languages. All Indo-European languages retain much of their Proto-Indo-European inheritance.</p>\n\n<p>It is also true that some Indo-European branches are more closely related than others; but I believe the Italic branch was more closely related to the Celtic branch than to the Greek branch. It may be that Italic and Greek are more closely related than Germanic and Slavic, however.</p>\n", "Id":"3708", "ParentId":"3707", "LastEditorUserId":"82", "CreationDate":"2013-05-14T01:05:56.137", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-09-15T04:38:36.153", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-09-15T04:38:36.153", "Score":"12", "CommentCount":"2", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}