{"OwnerUser":{"UpVotes":"94", "DownVotes":"21", "Id":"126", "AccountId":"154977", "Views":"23", "Reputation":"1354", "CreationDate":"2011-09-14T15:07:55.557", "DisplayName":"prash", "LastAccessDate":"2014-01-18T18:45:53.780"}, "comments":[], "Body":"<p>As far as I know, Mattur's effort is the oldest one, but that began in <a href=\"http://www.hindu.com/mag/2008/03/02/stories/2008030250200800.htm\">1982</a>.</p>\n\n<p><a href=\"http://www.chitrapurmath.net/sanskrit/sanskrit_lifestyle.htm\">Ganoda</a> does not seem to be doing all that well. An article on <a href=\"http://horsesandswords.blogspot.com/2008/09/propagation-of-sanskrit.html\">Jhiri</a> is happy to call the Mattur experiment a failure. (It isn't, AFAIK.)</p>\n\n<p>As you can see <a href=\"http://connect.krishna.com/node/7769\">here</a>, and in the two links above, the motivation for speaking Sanskrit was to go back into tradition.</p>\n\n<p>The towns/villages that have adopted Sanskrit are too far apart for neologisms of one location to be understood in another. The occasional movies made in Sanskrit, are aimed for Sanskrit speakers across India, and not specifically aimed at these native speakers of Sanskrit. These movies are based on traditional stories and themes. There are some news telecasts on radio and TV (in Sanskrit), broadcast across the country.\nGiven:</p>\n\n<ol>\n<li>their motivations to adopt Sanskrit,</li>\n<li>how recently the efforts began,</li>\n<li>how far-apart these towns and villages are from each other,</li>\n<li>availability and themes of media in Sanskrit, and</li>\n<li>the intended audience of the media,</li>\n</ol>\n\n<p>I don't see how this kind of a Sanskrit can be an evolving language.</p>\n\n<p>Disclaimer: I have interacted with just one native speaker of Sanskrit, but that was over 15 years ago. He spoke just Sanskrit, I spoke no Sanskrit. Therefore, I cannot have first-hand information about the state of Sanskrit in these places.</p>\n", "Id":"374", "ParentId":"369", "CreationDate":"2011-09-21T22:14:24.863", "Score":"6", "PostTypeId":"2", "OwnerUserId":"126", "LastActivityDate":"2011-09-21T22:14:24.863", "CommentCount":"7"}