{"OwnerUser":{"UpVotes":"11", "WebsiteUrl":"http://markonmarkets.com", "Location":"Oregon", "Id":"1581", "DownVotes":"0", "AccountId":"218688", "Views":"4", "Reputation":"226", "CreationDate":"2012-12-13T17:18:17.527", "DisplayName":"Mark D", "LastAccessDate":"2014-01-04T00:19:50.220"}, "comments":[], "Body":"<p>I will attempt to answer this, but please understand that it is more of a guess since the comments to your question are correct.  This may not even be the kind of question that can be answered here.</p>\n\n<p>Remember that thou was more than just the \"second person singular\" - it was later an <em>informal</em> pronoun as well, and picked up connotations of referring to someone of lower social standing than yourself.  We can see different usages frozen in time in different contexts (religiously, thou lingered with a different connotation than it did in the phrase \"holier than thou\" or \"Get thee gone!\").  The meaning probably still continues to change*.</p>\n\n<p>Once \"thou\" had the connotation of suggesting the lower social status of someone, you can see how this would become problematic in a society that was becoming increasingly egalitarian (and perhaps still is).  At some point, the old \"familiar\" usage is polluted with a tinge of disdain/inferiority that was inappropriate for the context and it was preferable to borrow another form to show that the speaker was not presuming his own superiority.</p>\n\n<ul>\n<li>Note that Darth Vader says, \"<a href=\"http://www.youtube.com/watch?v=58JrxLL3u2s\" rel=\"nofollow\">What is thy bidding, my master?</a>\" in a context where he is kneeling in submission to his master.  A usage that, if it is not outright wrong, seems to hint at the complexities of the relationship as well as bringing in religious overtones and a \"cool factor\" that wouldn't exist with \"What is your bidding, my master?\"  Or, perhaps, the meaning has reversed and \"thou\" is meant to show <em>additional deference</em>.</li>\n</ul>\n", "Id":"3755", "ParentId":"3747", "CreationDate":"2013-05-22T22:48:01.747", "Score":"3", "PostTypeId":"2", "OwnerUserId":"1581", "LastActivityDate":"2013-05-22T22:48:01.747", "CommentCount":"6"}