{"OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://education.msu.edu/search/Formview.aspx?email=mweiss@msu.edu", "DownVotes":"0", "Id":"2097", "AccountId":"2344109", "Views":"0", "Reputation":"46", "CreationDate":"2013-05-24T01:34:53.673", "DisplayName":"Michael Weiss", "LastAccessDate":"2013-05-25T00:20:23.603", "AboutMe":"<p>Currently an assistant professor of mathematics education at Michigan State University.</p>\n"}, "comments":[], "Body":"<p>There has been a <strong>ton</strong> of research on the efficacy of phonics programs, but it is nearly all contentious and its significance hotly debated.  Back in the early 1990s (the heyday of the Hooked On program) things got so tense and politically charged that people referred to the \"Reading Wars\".  (Google it.)  On one side were the proponents of \"phonics first\", who argued that the work of decoding individual phonemes necessarily must precede the other skills that are part of reading; on the other side were the proponents of \"whole language\" instruction.  The Wikipedia article on \"Whole language\" has a good overview of the controversy.  Matters were made even more complicated by the fact that \"whole language\" was often mischaracterized (not only by its critics but also by some teachers who were supposed to implement it) as an approach that did not include phonics instruction at all, rather than an approach that insisted on phonics instruction only in the context of meaningful interaction with text.</p>\n\n<p>Suffice it to say that most academics who study literacy acquisition believe that the evidence clearly supports whole language as the preferred approach; skeptics, on the other hand, have produced voluminous critiques of the academic research, which they regard as ideologically biased.</p>\n\n<p>(Slightly OT digression:  The controversy over literacy instruction has much in common with the analogous politicization of math education, with which I am much more conversant.)</p>\n\n<p>(Much more OT afterthought:  It is both weird and delightful to see jlawler, a former college professor of mine who I have not seen in nearly 20 years, answering a question posed by my cousin.)</p>\n", "Id":"3759", "ParentId":"3732", "CreationDate":"2013-05-24T01:57:50.567", "Score":"3", "PostTypeId":"2", "OwnerUserId":"2097", "LastActivityDate":"2013-05-24T01:57:50.567", "CommentCount":"1"}