{"OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "comments":[], "Body":"<p>I found <a href=\"http://corpus.byu.edu/\" rel=\"nofollow\">this website</a> which might meet your needs but I honestly can't figure out exactly how you'd use it.</p>\n\n<p>If that doesn't work, it's easy enough to write your own program which reads a corpus, counts the bigrams, and outputs the data you're looking for. Even if you don't have any programming background, this is actually quite easy. I have given this task as an assignment to classes where the majority of students had little-to-no programming experience and that didn't have much trouble. Try a quick Google search for tutorials.</p>\n\n<p>The problem is choosing a corpus. Generally corpora tend to be specialized by the type of language included (such as only news articles, only tweets, only novels, etc.). You will need to take a look at what's available and decide which corpus (or combination of corpora) are right for you.</p>\n\n<p><a href=\"http://nltk.googlecode.com/svn/trunk/nltk_data/index.xml\" rel=\"nofollow\">This website</a> offers multiple corpora for free download as well as TREC offers <a href=\"http://trec.nist.gov/data.html\" rel=\"nofollow\">multiple corpora</a> across various types of language (some free, some requiring approval, and some requiring purchase).</p>\n", "Id":"3768", "ParentId":"3762", "CreationDate":"2013-05-25T04:06:35.143", "Score":"0", "PostTypeId":"2", "OwnerUserId":"1055", "LastActivityDate":"2013-05-25T04:06:35.143", "CommentCount":"1"}