{"Body":"<p>I think this is a very interesting question, though I have no idea for\nan objective way of assessing experimentally the scientific efficiency\nof a language, and even less for theorizing the results of such an\nexperiment.</p>\n\n<p>However the answers already given and their comments are rather\nsurprising to me as they appear almost exclusively concerned with\nterminology.</p>\n\n<p>Terminology seems to be the easy part. It does matter to\nsome extent, as science is always in need for new words. For example, it seems that English does not mind too much\ncreating new words, or assembling them into new expressions.  French\n(at least in France) seems more reluctant and less flexible.\nNeologisms are more awkward. It may be related to a traditionally more\nprescriptive view of the language, possibly due to the creation of the\nFrench Academy in the 17th century. It may also be due to even more\ncenturies of efforts to unify the country (which lead to political\ncentralisation), and unifying the language was one way to achieve\nthat (though <a href=\"http://rads.stackoverflow.com/amzn/click/0140260234\" rel=\"nofollow\">Language Myths</a> has <a href=\"http://vagabonddrifter.wordpress.com/2010/05/14/language-myths-some-languages-are-not-just-good-enough/\" rel=\"nofollow\">arguments</a> that may indicate that these considerations were not relevant). Still, France has managed to do reasonably well in the sciences.</p>\n\n<p>Terminology hurdles are somewhat easy to overcome. If a\nword is needed, one will be found or created, or borrowed.</p>\n\n<p>I think the issue of suitability for scientific thought has more to do\nwith morphology (inflexion) and syntax, inasmuch as they are the main\nvehicle for expressing relations in the semantics of sentences.</p>\n\n<p>Scientific thought is about establishing and organizing relations (temporal, causal, hypothetical\n...) between facts and phenomena, about organizing the world in a net\nof relations. If the kind of relation that is needed is not\nexpressible in the language, it will not be available in the thinking\nand the scientific knowledge will not be able to develop.</p>\n\n<p>This connects somewhat to the ideas of Thomas Kuhn regarding\nscientific revolutions which, according to him, are based on a\nconceptual change of perspective. But to work with new concepts, you\nmust be able to express them in your language. Progress in the\nmathematics has been highly dependent on the development of\nmathematical notation (the language of mathematics) to express the\nneeded concepts (the notation for zero is a classical example).</p>\n\n<p>The significant development of scientific reasonning in ancient Grece\nseems directly related to the development of rethorics, the art of\ndiscourse, which goes much beyond a mastery of terminology.</p>\n\n<p>To get back to more direct experience, the difficult part in learning\na new language (say Russian or ancient Greek, for example) is not so much\nlearning the vocabulary, or even the morphology and syntax rules. It\nis to grasp the semantic relations that are expressed with the\nmorphology and the syntax, and can be significantly different from\nother languages (I am thinking for example of verb tenses).</p>\n\n<p>I believe that it is precisely these structures that are essential for\nscientific thinking. Now, it would require more knowledge than I have\nto assess the suitability of this or that language, or language\nfeature, for science. It could even be that it depends on the kind of\nscience or of scientific activity.</p>\n\n<p><strong>Added after comments</strong> (June 7, 2013) :</p>\n\n<p>I am adding this to reply to comments. But I feel pushed to the limit\nof what I can assert credibly.</p>\n\n<p>I made the assumption that discourse structure and expression of\nrelations is expressed through syntax more than through\nterminology. The assumption is likely to result to some extent from my\nignorance and biases, and it would really require a systematic analysis\nin a variety of languages. This analysis itself would demand\nknowing/identifying the fundamental semantic concepts and relations\nthat are essential for science, probably through synchronic and\ndiachronic, and probably cultural (I am not sure what is the correct\ntechnical term) analysis scientific texts. They might even differ\nsomewhat according to the scientific areas concerned. I would be\nsuprised if nothing had been done/published already.</p>\n\n<p>Contrasting it with texts that give non scientific (to be defined,\nwithout anachronisms) explanations of the world might be useful too.</p>\n\n<p>The work of historians of science would probably be an important\nstarting point.</p>\n\n<p>Regarding isolation vs inflection, I have little to say. I am not\ncompetent to speak, but my intuitive understanding is that they both have\nexpressive power for structuring a sentence, which is really\nwhat I was trying to say. For example, if you cannot express clearly\nwhat is implied when you state that all linguists are liars, I am not\nsure you will be able to develop modern scientific knowledge and\ndiscourse.</p>\n\n<p>I am also wondering whether some languages might have a greater affinity\nfor ambiguity or multiplicity of meanings, and whether it could have\nan impact on scientific thinking.</p>\n\n<p>Regarding the tenses of verbs, it was in my personnal experience the\nfirst thing that struck me as capable of impacting systematically the\nway some people think of (for lack of a better expression) correlation\nof events. How much these variations may affect scientific thinking, I\ndo not know.</p>\n\n<hr>\n\n<p>Not totally unrelated reference. There was a SE discussion on programming languages and natural language: <a href=\"http://cs.stackexchange.com/questions/9581/are-programming-languages-becoming-more-like-natural-languages/12406\">Are programming languages becoming more like natural languages?</a></p>\n", "Id":"3809", "ParentId":"3318", "LastEditorUserId":"2129", "CreationDate":"2013-06-04T15:08:07.807", "OwnerUserId":"2129", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-06-07T22:44:40.250", "LastEditedUser":{"UpVotes":"15", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/zegup.png", "Id":"2129", "AccountId":"2350982", "Views":"3", "Reputation":"246", "CreationDate":"2013-06-03T21:52:14.630", "DisplayName":"babou", "LastAccessDate":"2014-01-11T10:17:24.477", "AboutMe":"<p>The name Babou was given to me by my grandson (two years old at the time). It actually means grandpa in Armenian and Swahili.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>babou AT inbox.com</p>\n"}, "LastActivityDate":"2013-06-07T22:44:40.250", "Score":"2", "CommentCount":"4", "OwnerUser":{"UpVotes":"15", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/zegup.png", "Id":"2129", "AccountId":"2350982", "Views":"3", "Reputation":"246", "CreationDate":"2013-06-03T21:52:14.630", "DisplayName":"babou", "LastAccessDate":"2014-01-11T10:17:24.477", "AboutMe":"<p>The name Babou was given to me by my grandson (two years old at the time). It actually means grandpa in Armenian and Swahili.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>babou AT inbox.com</p>\n"}}