{"Body":"<p>For your question to make sense, it would have to be a question about <em>particular language-orthography pairs</em> (and if in talking about sound-symbol correspondences we interpret \"sound\" to mean \"phoneme\", then the question is further restricted to <em>language-alphabet pairs</em>, excluding syllabaries and logographic orthographies).  So for example, you could ask whether the Roman alphabet as used to write Parisian French shows a 1:1 phoneme:grapheme relationship.  If you're interested in syllabaries, you would ask whether a 1:1 mapping existed between graphemes and <em>phonotactically legal syllable shapes</em> in that language (syllabaries are by definition not 1:1 with regard to phonemes).</p>\n\n<p>However, a further complication is that spoken languages change over time, and orthographies do not necessarily change along with them.  As such, even if a particular language-alphabet pairing has a one-to-one correspondence of phonemes to graphemes at one point in time, there is no guarantee it will remain so.</p>\n\n<p>As far as global patterns go, there is no systematic relationship between the orthography used to write a language and the genealogical history of that language.  For example, <strong>lots</strong> of languages all over the world from all different language families use the Roman alphabet, and in many of those cases they do so because: </p>\n\n<ol>\n<li><p>they had no orthography prior to contact with European anthropologists, linguists, and missionaries, and the development of their orthographies were strongly influenced by those Europeans, and/or</p></li>\n<li><p>their orthographies are very recent and are designed to make easy use of language technology (like computers).</p></li>\n</ol>\n\n<p>To give another example, the <a href=\"http://en.wikipedia.org/wiki/Mongolian_script\" rel=\"nofollow\">Mongolian script</a> is used to write Mongolian, Evenki, and Xibe, but in principle could be adapted to write many other languages too.  On the other hand, the Mongolian <em>language</em> is also commonly written using a slightly modified form of the Cyrillic alphabet.</p>\n", "Id":"3841", "ParentId":"3840", "LastEditorUserId":"1616", "CreationDate":"2013-06-09T17:57:53.743", "OwnerUserId":"1616", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-06-10T21:14:09.590", "LastEditedUser":{"UpVotes":"1", "WebsiteUrl":"http://dan.mccloy.info", "Location":"Seattle, WA", "Id":"1616", "DownVotes":"0", "AccountId":"1833084", "Views":"0", "Reputation":"176", "CreationDate":"2012-12-28T03:37:29.483", "DisplayName":"drammock", "LastAccessDate":"2013-09-20T22:25:00.903", "AboutMe":"<p>Phonetician</p>\n"}, "LastActivityDate":"2013-06-10T21:14:09.590", "Score":"3", "CommentCount":"10", "OwnerUser":{"UpVotes":"1", "WebsiteUrl":"http://dan.mccloy.info", "Location":"Seattle, WA", "Id":"1616", "DownVotes":"0", "AccountId":"1833084", "Views":"0", "Reputation":"176", "CreationDate":"2012-12-28T03:37:29.483", "DisplayName":"drammock", "LastAccessDate":"2013-09-20T22:25:00.903", "AboutMe":"<p>Phonetician</p>\n"}}