{"Body":"<p>As these terms originate in Indo-European grammar, I will focus on Indo-European languages; these names may not apply as well to non-Indo-European languages.</p>\n\n<hr>\n\n<p>The <strong>conjugation</strong> of a verb can mean two things: </p>\n\n<p>1.) All the finite forms of a verb.</p>\n\n<p>2.) All the inflected forms of a verb, including non-finite forms, like the infinitive and participles. I believe this usage is more common.</p>\n\n<p>A <strong>finite</strong> form of a verb is one that has an ending; conventionally, the suffixes used to form infinitives (what's in a name?) and participles are not considered endings, although one might question the rationale behind this.</p>\n\n<p>A verb <strong>ending</strong> is normally that part of a verb which expresses the features person and number (and usually mood). That is, a non-ending normally cannot express person or number or mood; but an ending <em>can</em> express more than person and number and mood (such as tense). You could say endings that express more than person, number, and mood are a contraction of some suffix with an ending, like the Latin imperfect (e.g. <em>stabam</em>, \"I stood\"), which is either analysed as <em>present stem + imperfect suffix -ba- + ending</em> (sta-ba-m), or as <em>present stem + imperfect ending</em> (sta-bam). We <em>usually</em> say the tense is included in the ending in such cases, of which there are many, but in other situations it is more practical to treat the suffix or contraction as a separate morpheme.</p>\n\n<p>Strictly speaking, an <strong>ending / finite form</strong> is a kind of <strong>inflected form</strong> (finite inflexion), and an <strong>inflected form</strong> is a kind of <strong>suffixed form</strong>. Often, but not always, we use <em>suffix</em> to mean \"non-inflexional suffix\", because we already call inflected forms \"inflected\"— although inflected forms are also said to have inflexional suffixes in some contexts. \"Inflected forms\" normally does include all finite forms / endings.</p>\n\n<p><strong>Tense</strong> is a difficult concept of which different people use different definitions. An ending can be said to express tense, although there are endings that do not express tense. The forms of the Greek optative, for example, are always finite, but they never express a tense, while the endings of the imperfect do express tense (even though they are always finite too). <em>Luoi</em> = \"may he unbind\" (optative), which can be used in present, future, or past sentences alike, i.e. there is no real tense in it.</p>\n\n<p><strong>Aspect</strong> can be expressed in suffixes, in (suppletive) stems, in additional words, but also in endings, if you consider something like <em>-bam</em> above to be a single morpheme.</p>\n\n<hr>\n\n<p>In English, most endings have contracted or disappeared in ways that make different persons, moods, and numbers invisible. There is still <em>-s</em> in the 3rd person present singular indicative for most verbs, and the most important and frequent verb of all, <em>to be</em>, still has many distinctive endings; but most other Indo-European languages have many more visible endings. The \"invisible endings\" in English finite verbs are often called <em>zero endings</em>, an kind of <em>zero inflexion</em>.</p>\n\n<p>Because of this, many linguists have resorted to using the present tense v. the (synthetic) past tense as a more practical way of distinguishing between finite and non-finite forms. English doesn't really have endings that can be conveniently separated from tense, so a problem as with the Greek optative endings above (which have no tense) does not occur in English. So a way to test whether a verb form is a finite form or not is by testing whether it can be put in the (synthetic) past tense and present tense without changing the structure of the sentence. <em>He goes to school => he went to school</em>: that is possible, so it must be a finite form. </p>\n", "Id":"3859", "ParentId":"3857", "LastEditorUserId":"82", "CreationDate":"2013-06-15T15:03:37.457", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-06-17T18:25:06.840", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-06-17T18:25:06.840", "Score":"1", "CommentCount":"14", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}