{"Body":"<p>The truth is more in depth...we all know that the Library of Vatican holds many secrets unrevealed yet...recently the former secretary of John Paul II Pope thanked to people living around Carpathian mountains for the Latin language. Dacians spoke the vulgar latin before romans...romans are descending from dacians...not to mention that the oldest written text was dacian not Sanskrit as was thought before( see <a href=\"http://en.wikipedia.org/wiki/T%C4%83rt%C4%83ria_tablets\" rel=\"nofollow\">tablets from Tartaria-Romania</a>). Romans conquered 16% from Dacia's territory for 165 years(romans occupied Britain for 400 years and Israel for 350 years nobody there speak latin derived language)...the rest remained free and is hard to believe that the free dacian women came and had kids with roman soldiers (which mostly of them were mercenaries so they couldn't speak latin themselves) went back to unoccupied territory of Dacia and taught their children in the \"their father's\" language...Trajan didn't needed translators during the 2 wars he had with dacians, in Rome on their Triumphal Arch are statues of dacians ...what that does mean? Just facts that are worth to think of and see a sense thru. Interested in opinions based on this theory...</p>\n", "Id":"3879", "ParentId":"375", "LastEditorUserId":"51", "CreationDate":"2013-06-19T15:10:04.270", "OwnerUserId":"2176", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-06-19T15:20:10.010", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2013-06-19T15:20:10.010", "Score":"-2", "CommentCount":"1", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2176", "AccountId":"2919140", "Views":"0", "Reputation":"1", "CreationDate":"2013-06-19T15:09:21.157", "DisplayName":"user2176", "LastAccessDate":"2013-06-19T15:09:21.157"}}