{"Body":"<p>All etymological dictionaries (Walde, Meillet) say that <em>uncia</em> is derived from Proto-Indo-European *<em><a href=\"http://gtb.inl.nl/iWNTLINKS/DATADIR/paginazy.html?EWN%20/iWDB/search?actie=article_content&amp;wdb=EWN&amp;id=ewn003733\" rel=\"nofollow\">oi-nos</a></em>, \"one\", the same stem as Latin <em>unus</em>, \"one\", and English <em>one/an</em>. (This stem at some point replaced in many languages the older stem used for \"one\", <em>sem-</em>, as reflected in English (through Latin) <em>simple, single, simultaneous</em>, etc.) Walde on <em>uncia</em> suggests that its original meaning was \"unit\":</p>\n\n<blockquote>\n  <p>...als *<em>oin(i)cia</em> \"Einheit\" zu <em>ūnus</em>...</p>\n</blockquote>\n\n<hr>\n\n<p>So how did a word related to \"one\" come to mean \"one twelfth\"? Meillet doesn't know:</p>\n\n<blockquote>\n  <p>Le nom de l'unité fractionnelle est évidemment dérivé de <em>ūnus</em> ; et tous les autres s'y rattachent. Il s'agit de termes techniques dont la formation est <strong>singulière</strong>.</p>\n</blockquote>\n\n<p>So it was an idiomatic development in older Latin. Because <em>uncia</em> was mainly the smallest unit of weight in early Republican currency, perhaps the smallest unit was simply called \"one-ness\" or \"unit\".</p>\n\n<p>It just so happened that an <em>uncia</em> was taken as 1/12th of an <em>as</em>, which was the central coin of the new Roman system introduced ca. 280 BC and based on the older system of the <em><a href=\"http://en.wikipedia.org/wiki/Aes_grave\" rel=\"nofollow\">aes grave</a></em> (\"signed bronze\"), where one unit of <em>aes grave</em> equalled twelve <em>unciae</em>, small \"pellets\" of bronze. Note that the weight represented by the <em>uncia</em> was also an important quantity that was often used, so <em>uncia</em> and <em>as</em> were the two main coins, and also the smallest and the largest, respectively. As a unit of weight, <em>uncia</em> was also used outside coins. Coins like the <em>denarius</em>, worth ten <em>asses</em>, were only introduced later; the word <em>de-n-arius</em> simply means something like \"tenner\" (cf. English <em>de-cimal</em>). </p>\n\n<p>However, an <em>uncia</em> was also one twelfth of a <em>pes</em>, a foot, like the English word <em>inch</em>, no doubt related. I don't know whether the unit of length or the unit of weight (from which English <em>ounce</em>) was older, so I don't know which influenced which.</p>\n\n<hr>\n\n<p>There were many <strong>duodecimal numeric systems</strong> in use around the Mediterranean, so it seems likely that the <em>uncia</em> was at some point equalled to the smallest \"unit\" in any duodecimal system. I believe duodecimal systems are ultimately related to <strong>sexagesimal systems</strong> (=5x12) <a href=\"http://en.wikipedia.org/wiki/Ancient_Mesopotamian_units_of_measurement\" rel=\"nofollow\">as used in ancient Mesopotamia</a>. There are more ways you can divide twelve into integers than, say, ten: you can divide twelve by 2, 3, 4, and 6, while ten can only be divided by 2 and 5, so twelve as a base was more useful in many simple physical transactions and quick calculations. Remnants of such a system in modern cultures are the way our hours and minutes are 60 times the smaller unit, and the way we use sexagesimal minutes and seconds in angles (360°=6x60). And of course the fact that we have twelve hours in a day.</p>\n\n<hr>\n\n<p>I can only hypothesise about the origin of the root <em>un-</em> \"one\" in counting, but <a href=\"http://en.wikipedia.org/wiki/Sexagesimal\" rel=\"nofollow\">Wikipedia on <em>Sexagesimal</em></a> offers this interesting bit of information:</p>\n\n<blockquote>\n  <p>It is possible for people to count on their fingers to 12 using one hand only, with the thumb pointing to each finger bone on the four fingers in turn. A traditional counting system still in use in many regions of Asia works in this way, and could help to explain the occurrence of numeral systems based on 12 and 60 besides those based on 10, 20 and 5. In this system, <strong>the one (usually right) hand counts repeatedly to 12, displaying the number of iterations on the other (usually left), until five dozens, i. e. the 60, are full.</strong></p>\n</blockquote>\n\n<p>It just so happens that a Latin word *<em>uncia</em> (apparently unattested but noted by Meyer-Lübke) for \"finger joint\" is mentioned in Meillet and Walde. It is mentioned under and apparently derived from <em>uncus</em>, \"curved\". Perhaps the root *<em>un(i)(c)-</em> for \"one\" originated in this practice of counting by finger joint, where you have twelve finger joints in the right hand for the thumb to touch? </p>\n\n<p>Note that <em>uncus</em> is apparently related to <em>unguis</em> \"claw\" (v. Meillet) and to English <em>ungulate</em>, <em>anchor</em>, and <em>angle</em> (all from Latin), and to English \"nail\" (from Proto-Germanic, v. Walde). The Proto-Indo-European root was apparently something like *<em>-nk-</em>, \"bend\" (Oxford English Dictionary); in some languages, a \"vulgar\" vowel like <em>u-</em> was prefixed (Meillet: \"populaire\"), resulting in <em>uncus</em> etc.</p>\n\n<p>If a <em>uncia</em> is related to <em>uncus</em>, then the precursor of <em>unus</em> \"one\" must be derived from <em>uncia</em>; but then this must have happened before the Italic and Germanic branches of Proto-Indo-European diverged, since the Germanic languages also have words for \"one\" based on this Proto-Indo-European precursor of <em>unus</em>. It seems unlikely that both <em>uncus</em> and <em>uncia</em> survived through the Proto-Gallo-Italic phase into Latin for so long and made it unscathed, especially considering that <em>unus</em> would still have had to drop its <em>-k-</em> sound! Therefore, if <em>uncia</em> \"1/12\" should be related to <em>uncus</em> \"curved\", it would have to be unrelated to <em>unus/one</em>; but the relation between <em>unus</em> and <em>uncia</em> appears to be undisputed, so it seems the <em>uncus</em> and <em>uncia</em> are not related. Perhaps there was some sort of folk etymology, where speakers or writers mixed up words and their etymologies?</p>\n", "Id":"3884", "ParentId":"3883", "LastEditorUserId":"82", "CreationDate":"2013-06-20T17:36:16.163", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-09-08T04:48:14.923", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-09-08T04:48:14.923", "Score":"9", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}