{"OwnerUser":{"UpVotes":"302", "DownVotes":"1", "Id":"119", "AccountId":"14652", "Views":"52", "Reputation":"3065", "CreationDate":"2011-09-14T14:24:24.227", "DisplayName":"kaleissin", "LastAccessDate":"2014-01-18T22:21:33.313", "AboutMe":"<p>Sysadmin/programmer by day, linguist by night.</p>\n"}, "comments":[], "Body":"<p>Why would an organization <strong>want</strong> to create a language? For what purpose would it be used? Who would pay for it?</p>\n\n<p>If you're thinking of a language that would suit as a lingua franca, we already have one, it's called English. <strong>Best</strong> is not the issue here, a language needn't be \"good\" in order to be popular.</p>\n\n<p>Just making a language, by committee or not, won't make it be used as a means of communication. It must have something extra, like a community of some sorts, which for instance Esperanto has.</p>\n\n<p>Having some organization decree that some specific language is to be used instead of some other language rarely ends well. It has been used as an important and integral part of indoctrination and wholesale destruction of local and indigenous culture for centuries. Did you know there once were \"schools for the primitives\", in at least the US (american indians), Australia (aborigines) and even my own country Norway (sami). Kids were taken from their parents and punished harshly for using their mother tongues and/or keeping to their parents beliefs and customs. Another tried and tested technique is a little more direct: genocide. Both methods have proven to work splendidly when the goal is to replace one language with another.</p>\n\n<p>What organization in its right mind would risk that blemish on its reputation today?</p>\n\n<p>Besides, the purpose of linguistics is not to create language but to study it. While there are linguist that dabble in language construction, it is generally not to create the final and best language to replace all other languages, just as botanist aren't in the business of making the one, true plant to supercede all other plants. Linguists do not weight features up against each other and attempt to prove that, say, three tenses is better than five. Linguists describe, they do not prescribe.</p>\n", "Id":"3899", "ParentId":"3898", "CreationDate":"2013-06-23T20:40:25.487", "Score":"9", "PostTypeId":"2", "OwnerUserId":"119", "LastActivityDate":"2013-06-23T20:40:25.487", "CommentCount":"10"}