{"Body":"<p>Sometimes you have to take transcriptions in dictionaries with a grain of salt. When an American English dictionary gives /ɜr/ for <em>bird</em>, I think you can safely take that as equivalent to <a href=\"https://en.wikipedia.org/wiki/R-colored_vowel\" rel=\"nofollow\">/ɝ/</a> (although see @jlawler's comment under @sjiveru's answer regarding phonemic specifications in broader, cross-dialectal arenas). </p>\n\n<p>The job of a dictionary transcription is to serve as a guide to the pronunciation of the word, not to provide a phonological analysis, although in giving a phoneme-level transcription it is implicitly assuming one. Since different dictionaries use different phonemic schemes, the user has to be wary when interpreting a given dictionary's choice of symbols. If a dictionary gives /shərt/ for <em>shirt</em>, for example, the /ər/ sequence should not be interpreted as a sequence of /ə/ plus /r/ any more than /sh/ should be interpreted as /s/ plus /h/. More than likely the two-symbol string is being used to represent a single sound. Sometimes this can be confirmed by listening to the recorded pronunciation that often accompanies transcriptions in online dictionary entries. Indeed, if you downloaded one of these sound files and examined a spectrogram of it, you'd be hard-pressed to segment the vocalic portion of the word into two separate vowels. </p>\n\n<p>Now, as for the distinction between [ɹ] and [ɝ]: From a phonologist's perspective, the distinction is not really one of pronunciation, but one of syllable structure. When this sound is used as an onset of a syllable, for example, it is treated as a consonant, and when it is used as a nucleus it is treated as a vowel. Conventionally the former is transcribed as [ɹ] and the latter as [ɝ] (or [ɚ] if it's unstressed). This can be viewed as parallel to the distinction between [j] and [i]. For some speakers there may be slight articulatory differences between the two, such as duration or degree of retroflection, but that is not the primary consideration in assigning them two different symbols. To make the relationship between the two more transparent, some use the <a href=\"http://en.wikipedia.org/wiki/Syllabic_consonant\" rel=\"nofollow\">syllabic</a> diacritic under the [ɹ] when it functions as a nucleus: [ɹ̩].</p>\n", "Id":"3914", "ParentId":"3912", "LastEditorUserId":"385", "CreationDate":"2013-06-25T17:49:59.837", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-06-27T17:45:34.683", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2013-06-27T17:45:34.683", "Score":"3", "CommentCount":"7", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}