{"Body":"<p><a href=\"http://scholar.google.co.kr/scholar?q=sentiment+classification&amp;btnG=&amp;hl=en&amp;as_sdt=0%2C5\" rel=\"nofollow\">Sentiment Classification</a> is a still developing field so I don't feel comfortable saying that there is a right or a wrong way to approach your problem. Your approach would theoretically work but it is a bit simplistic. Consider the following:</p>\n\n<p>First, how will you choose your word list? Will it be manually compiled? How will you make sure it is representative and has wide enough coverage to actually be useful?</p>\n\n<p>Second, how will you choose your coefficients? From your description, I'm assuming all coefficients will be <code>+1</code> or <code>-1</code>, but surely a word like \"excellent\" conveys more positivity than a mere \"good\" and reflecting this in your coefficients would improve accuracy. How will your coefficients reflect this? How do you know they are accurate?</p>\n\n<p>I would suggest you read a few papers on Sentiment Classification (perhaps starting with the Google Scholar link I gave at the beginning of my answer) to get a general understanding of modern techniques.</p>\n\n<p>From what I'm seeing, most solutions use some manually annotated sentiment corpus, like the <a href=\"http://mpqa.cs.pitt.edu/\" rel=\"nofollow\">Multiple Perspective Question Answer (MPQA) Corpus</a> and perform machine learning techniques (usually <a href=\"https://en.wikipedia.org/wiki/Support_vector_machine\" rel=\"nofollow\">SVM</a> or <a href=\"http://en.wikipedia.org/wiki/Maximum_entropy_classifier\" rel=\"nofollow\">MaxEnt</a>) to decide which words and features are strong indicators of sentiment and what their optimal coefficient should be.</p>\n\n<p>There are lots of machine learning libraries to help you with the programming component. A simple Google search should help you find a suitable language for your programming language of choice.</p>\n", "Id":"3939", "ParentId":"3938", "LastEditorUserId":"1055", "CreationDate":"2013-07-01T01:54:20.150", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-07-01T16:03:19.517", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2013-07-01T16:03:19.517", "Score":"3", "CommentCount":"3", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}