{"OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "comments":[], "Body":"<p>There are several factors in play here, all of which differ according to each person's situation:</p>\n\n<ol>\n<li><p>Many people in fact find it much easier to learn to speak a new language than to learn to read and write it.</p></li>\n<li><p>There seems to be a split between people who pick up speaking more easily and those who pick up comprehending more easily.</p></li>\n<li><p>When comprehending a language, either by listening or by reading, you don't need to know as much minutiae of the grammar since context resolves a lot of unknowns and ambiguities. But when speaking or writing some people are more concerned with being very grammatically correct than just being understood. And perhaps more so in writing.</p></li>\n<li><p>It's naturally easier to comprehend a language closely related to one you already know. Now some language pairs such as Danish and Swedish are orthographically very similar but phonologically quite different. Other language pairs such as Hindi and Urdu are very similar in phonology, lexicon, and grammar; but have radically different orthographies.</p></li>\n</ol>\n\n<p>I have some advice if you are quite good at the passive side of a language - comprehending via either reading or listening, but not so good at the active side - speaking or writing:</p>\n\n<ol>\n<li><p>Immersion = The deep end. If you spend time in a place this language is native you will be forced to use it to meet your needs, and you will be surrounded by its appearance and its sounds all day every day.</p></li>\n<li><p>Relax = Let go. You will make more errors but just like learning to ride a bicycle you need to keep trying so you can get the practice you need to improve. So don't worry about correctness and just try to communicate.</p></li>\n<li><p>Alcohol helps with 2. (-;</p></li>\n</ol>\n", "Id":"3940", "ParentId":"3935", "CreationDate":"2013-07-01T03:18:36.057", "Score":"3", "PostTypeId":"2", "OwnerUserId":"51", "LastActivityDate":"2013-07-01T03:18:36.057", "CommentCount":"1"}