{"Body":"<p>Is it always, though? Try reading some Mandarin, Tamil, Hebrew or Japanese, and you might have a different take on it. Actually, I'd argue that <em>reading</em> Mandarin is probably harder than speaking it.</p>\n\n<p>One reason it's often easier to read foreign languages is that they often use similar writing conventions to the ones you already know. The script is the often the same (or related); spaces and punctuation are used in a similar manner to encode word boundaries and prosodic features. Also, in languages related to each other, related vocabulary often retains similar spelling even if actual pronunciation has diverged. One might also point to stylistical features of written languages - while register and modality (spoken vs. written) are separate features (you can colloquially write a chat message or very formally give a speech), there's a high degree of correlation: so written language tends to be more precise, use more international vocabulary (at least in some languages), and avoids more obscure or recent idioms.</p>\n\n<p>Then there's also the fact that spoken information in general is volatile and, due to background noise, production errors and perception errors, has a low-quality signal. By contrast, written language - at least in its digital variety - is very unambiguous and can be reread as often as you like (much easier even than rewinding on an audio track for example). But try reading foreign language handwriting and you'll see how much this breaks down when letters are not so clearly distinguishable anymore.</p>\n", "Id":"3942", "ParentId":"3935", "LastEditorUserId":"51", "CreationDate":"2013-07-01T05:34:35.530", "OwnerUserId":"1380", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-07-02T13:58:24.950", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2013-07-02T13:58:24.950", "Score":"2", "OwnerUser":{"UpVotes":"14", "WebsiteUrl":"", "DownVotes":"5", "Id":"1380", "AccountId":"1907225", "Views":"8", "Reputation":"529", "CreationDate":"2012-10-05T03:06:16.113", "DisplayName":"Fryie", "LastAccessDate":"2014-01-09T09:48:02.760", "AboutMe":"", "Age":"26"}}