{"comments":[], "Body":"<p>It is perhaps worth thinking separately about I. preverbs used with verbs of motion, and II. preverbs used with other verbs.</p>\n\n<p>I. For verbs of motion, the preverb has a strictly lexical function: it shows which direction the motion takes place.  For სვლა, change in tense is shown by using a different stem, so, for example, in მოდის (X comes) and მოვა (X will come), we understand which is present and which is future not from the presence or absence of a preverb, but from the choice of stem.  Other verbs that use preverbs in this way are \"to run\", e.g. მორბის (X runs here/X comes running) მოირბინს (X will run here/X will come running), and bring/take/carry/fetch... For example, მომაქვს (I am bringing X here), მოვიტან (I will bring X here).</p>\n\n<p>II. For other verbs, remember that preverbs are only used in the I and II conjugations.  The III conjugation forms its future stem by circumfixing ი...ებ, while the IV circumfixes ე...ებ.  As for the function of a preverb, its addition changes presents to futures, imperfects to conditionals and imperfective aorists to perfective aorists (however, imperfective, i.e. preverbless, aorists don't seem to be particularly common).</p>\n\n<p>However, to return to your question, it is not only the verb of motion that takes a preverb in the present tense...  As an exception to what I wrote above, some III conjugation verbs can take preverbs in the present tense, so from ლაპარაკობს (X speaks), we can derive მოლაპარაკობს (X comes speaking) მილაპარაკობს (X goes speaking).  As far as I know, these forms only exist in the present series...  It is tempting to think that when used like this, preverbs keep their lexical meaning, but I don't know enough Georgian to know if this is always the case.</p>\n\n<p>Finally, there are also some other verbs that, for some reason, take a preverb in the present series.  The only one I can remember at the moment is შე(მო)=ჰ-კივის (X screams at Y) შე(მო)=ჰ-კივლებს (X will scream at Y).</p>\n\n<p>I do apologise for the rather disorganised state of my answer: it reflects my own rather tenuous grasp of the subject, but all the same, I do hope that it will be of some help.</p>\n", "Id":"3963", "ParentId":"1553", "CreationDate":"2013-07-04T14:01:43.783", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2104", "LastActivityDate":"2013-07-04T14:01:43.783", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2104", "AccountId":"2818521", "Views":"0", "Reputation":"166", "CreationDate":"2013-05-26T18:41:51.217", "DisplayName":"A Parmar", "LastAccessDate":"2013-10-16T21:55:16.307"}}