{"comments":[], "Body":"<p>Divergence of language has most commonly been represented as a tree model, but there is a counterpart in the form of the wave model. When the Neogrammarians in the late 19th century posited that sound change is regular and exceptionless, dialectologists argued against this and the family tree model:</p>\n\n<blockquote>\n  <p>The alternative to the family tree model which was put forward was the “wave theory,” [...] The “wave theory” was intended to deal with changes due to contact among languages and dialects, where changes were said to emanate from a center as waves on a pond do when a stone is thrown into it, and waves from one center of dispersion (where the stone started the waves) can cross or intersect outward moving waves coming from other dispersion centers (started by other stones thrown into the water in other locations). Changes due to language contact (borrowing) were seen as analogous to successive waves crossing one another in different patterns. (Campbell 2000: 92-93)</p>\n</blockquote>\n\n<p>There seem to be some similarities between the wave model and the rhizome concept, but I'm not sure to what extent these hold. For example (comparing with the wikipedia page on rhizome), chronology is relevant in the wave model, and the 'disturbances' do leave traces. Note that in the wave model, there is still a proto-language from which the dialects developed - a single point of origin. There are however multiple sources that contributed linguistic features/innovations to a particular dialect.</p>\n\n<p>Most importantly, it is understood these days that it is not a question of either the tree model or the wave model that is most representative, but that both are needed to explain language divergence. For example:</p>\n\n<blockquote>\n  <p>Linguists have traditionally represented patterns of divergence within a language family in terms of either a ‘splits’ model, corresponding to a branching family tree structure, or the wave model, resulting in a (dialect) continuum. Recent phylogenetic analyses, however, have tended to assume the former as a viable idealization also for the latter. <strong>But the contrast matters, for it typically reflects different processes in the real world: speaker populations either separated by migrations, or expanding over continuous territory</strong>. Since history often leaves a complex of both patterns within the same language family, ideally we need a single model to capture both, and tease apart the respective contributions of each. (Heggarty, Maguire &amp; McMahon 2010)</p>\n</blockquote>\n\n<p>To conclude: I'm not really sure what a rhizomatic model of language divergence would entail. But since the tree and the wave model are both needed to explain different processes, I don't think the rhizome alone could better represent language change. (And, to my knowledge the term rhizome is not used in relation to language change).</p>\n\n<ul>\n<li><p>Campbell, Lyle. 2000. “The History of Linguistics.” In The Handbook of Linguistics, 81–104. Blackwell Publishers.</p></li>\n<li><p>Heggarty, Paul, Warren Maguire, and April McMahon. 2010. “<a href=\"http://academia.edu/1088940/Splits_or_waves_Trees_or_webs_How_divergence_measures_and_network_analysis_can_unravel_language_histories\" rel=\"nofollow\">Splits or Waves? Trees or Webs? How Divergence Measures and Network Analysis Can Unravel Language Histories</a>.” Philosophical Transactions of the Royal Society B: Biological Sciences 365 (1559): 3829 –3843.</p></li>\n</ul>\n", "Id":"3967", "ParentId":"3965", "CreationDate":"2013-07-05T01:32:06.627", "Score":"0", "PostTypeId":"2", "OwnerUserId":"444", "LastActivityDate":"2013-07-05T01:32:06.627", "OwnerUser":{"UpVotes":"127", "WebsiteUrl":"", "Location":"Netherlands", "Id":"444", "DownVotes":"2", "AccountId":"902812", "Views":"19", "Reputation":"934", "CreationDate":"2011-10-23T14:14:27.380", "DisplayName":"arjan", "LastAccessDate":"2014-01-14T14:07:55.473", "AboutMe":""}}