{"Body":"<p>This is a bit old but I ran across it in the evaluation thread and I thought it could really use some work.  PARSE and FILL are paired constraints that in the early days of OT were used to drive epenthesis/deletion, and have largely been replaced by more general MAX and DEP.</p>\n\n<p>The term \"parse\" here refers to the relationship between a string and some kind of structural representation (e.g. a tree, a syllabic forest, etc.), exactly as you find in syntax.  A string is parsed if every token finds a place in a structural representation; it is overparsed if the structural representation includes some pronounced slots (e.g. leaf nodes in a prosodic tree/forest) that don't correspond to any tokens in the strings, and it is underparsed if there are tokens that don't make it into the tree.  In a syllabic representation, being present in the tree means something has to be pronounced, and being not present means that whatever is missing is not pronounced.</p>\n\n<p>PARSE is violated by underparsing, which if the structure is a syllable structure, amounts to deletion of the underparsed segment.  FILL is violated by overparsing, which in this case is an empty segment, leading to epenthesis.  (The choice of segment is made by other constraints.)</p>\n\n<p>Some examples pulled/elaborated from McCarthy's <a href=\"http://rads.stackoverflow.com/amzn/click/052179644X\" rel=\"nofollow\">\"A thematic guide to Optimality Theory\"</a>, p. 13, without correct IPA: (What I am elaborating is the necessary rankings that McCarthy leaves implicit in the discussion) </p>\n\n<ul>\n<li>English /bomb/ goes to [bam], because PARSE is outranked by constraints against this type of syllable-final cluster, and is also outranked by FILL.  (Evidence McCarthy gives that the b is there underlyingly comes from e.g. \"bombard\", \"bombardier\".)  If FILL had outranked PARSE, we'd expect epenthesis of a neutral vowel instead, leading to...  </li>\n<li>Spanish /skwela/ goes to [&lt;>skwela] (\"escuela\"), where &lt;> is filled in by a default/neutral vowel, probably a schwa.  Here a constraint against word-initial OCP violations (or something) would outrank FILL, which outranks PARSE, and so we get epenthesis (prothesis more specifically) to break the syllable cluster across a syllable boundary.  With this example, something more would have to be said to block epenthesis between the consonants, perhaps a constraint in favor of morphological contiguity; word initial VC syllables are pretty marked.  </li>\n</ul>\n\n<p>Presumably, the \"miracle\" referred to in the comments is that there was unpronounced and/or abstract structure in the output phonological representation, but aside from that (which is not all that crazy itself), there is nothing particularly complicated or miraculous about the implementation of these constraints.  They have fallen out of favor, and did so pretty early, because (i) they aren't very general, and in particular don't capture more general insights about markedness and faithfulness that MAX and DEP do, and (ii) tie epenthesis and deletion too closely to prosodic structure, and leave a lot of related phenomena hard to explain.  MAX and DEP (and IDENT) cover all the same cases plus much more, don't presuppose anything about the relation of segments to the prosodic structure they appear in, or require any abstract structure.</p>\n", "Id":"3982", "ParentId":"3699", "LastEditorUserId":"345", "CreationDate":"2013-07-08T19:25:29.507", "OwnerUserId":"345", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-07-08T20:42:21.317", "LastEditedUser":{"UpVotes":"4", "WebsiteUrl":"http://www.cog.jhu.edu/~rawlins/", "Id":"345", "AccountId":"513980", "CreationDate":"2011-09-28T22:20:39.537", "AboutMe":"<p>I'm a linguist specializing in formal semantics and pragmatics.</p>\n", "Age":"35", "Location":"Baltimore, MD", "DownVotes":"1", "Views":"16", "Reputation":"490", "DisplayName":"kgr", "LastAccessDate":"2013-07-30T15:43:17.413"}, "LastActivityDate":"2013-07-08T20:42:21.317", "Score":"3", "OwnerUser":{"UpVotes":"4", "WebsiteUrl":"http://www.cog.jhu.edu/~rawlins/", "Id":"345", "AccountId":"513980", "CreationDate":"2011-09-28T22:20:39.537", "AboutMe":"<p>I'm a linguist specializing in formal semantics and pragmatics.</p>\n", "Age":"35", "Location":"Baltimore, MD", "DownVotes":"1", "Views":"16", "Reputation":"490", "DisplayName":"kgr", "LastAccessDate":"2013-07-30T15:43:17.413"}}