{"comments":[], "Body":"<p>The difference you point to has to do with the position of predicative and non-predicative expressions in sentences. English usually places non-predicative PPs after the predicate, e.g. </p>\n\n<p>(1) a.  It was funny for the kids.\n    b. *It was for the kids funny. </p>\n\n<p>In this example, <em>funny</em> is a predicative adjective; it forms the predicate with <em>was</em>. German and (I assume) Dutch have two options for placing non-predicative expressions. The standard position is in the Mittelfeld (middle field) before the predicative expression, but they can also be placed in the Nachfeld (after field) after the predicative expression, e.g.</p>\n\n<p>(2) a.  Es war fuer die Kinder lustig. (It was for the kids funny.)\n    b. ?Es war lustig fuer die Kinder. (It was funny for the kids.) </p>\n\n<p>The first sentence is considered good German, whereas the second sentence has a looser feel; it belongs to a conversational register or is used to place emphasis on the PP. </p>\n\n<p>To answer the question more directly, <em>so</em> is a predicative expression in the original Dutch example. As such, there are options and tendencies where non-predicative material should appear in relation to the predicate. English tends to keep the words of a predicate closer together, only certain adverbials can split the predicate, e.g. <em>It was definitely funny</em>, whereas German and Dutch often split the words of a predicate, creating what is known as a Mittelfeld (middle field), in which all sorts of non-predicate material is placed. But heavier constituents (e.g. PPs) can at times also appear in the Nachfeld (after field) after the predicative expression depending on register or desire for emphasis. </p>\n\n<p>To understand this explanation, one needs to have some understanding of predicates and how they are manifest in German/Dutch and English. Wikipedia has a couple of articles that can help establish some of the necessary background knowledge:</p>\n\n<p><a href=\"http://en.wikipedia.org/wiki/Vendler_classes\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Vendler_classes</a></p>\n\n<p><a href=\"http://en.wikipedia.org/wiki/Predicative_expression\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Predicative_expression</a></p>\n", "Id":"4010", "ParentId":"2760", "CreationDate":"2013-07-15T14:01:09.740", "Score":"2", "PostTypeId":"2", "OwnerUserId":"2247", "LastActivityDate":"2013-07-15T14:01:09.740", "OwnerUser":{"UpVotes":"5", "DownVotes":"1", "Id":"2247", "AccountId":"3045491", "Views":"34", "Reputation":"565", "CreationDate":"2013-07-14T16:52:54.170", "DisplayName":"Tim Osborne", "LastAccessDate":"2014-01-01T04:26:20.267"}}