{"OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2252", "AccountId":"1877670", "Views":"0", "Reputation":"21", "CreationDate":"2013-07-16T13:32:35.233", "DisplayName":"augur", "LastAccessDate":"2013-07-16T16:20:14.470"}, "comments":[], "Body":"<p>Levin calls it a middle construction in English Verb Classes and Alternations. She provides lots of references. Of the two names you're asking about, only \"mediopassive\" seems to be used in the titles, while \"middle\" is far more common.</p>\n\n<p>Condoravdi, C. (1989) \"The Middle: Where Semantics and Morphology Meet,\" Student Conference in Linguistics 1989, MIT Working Papers in Linguistics 11, MIT,\nCambridge, MA, 16-30.</p>\n\n<p>Croft, W.A. (1991) Syntactic Categories and Grammatical Relations, University of\nChicago Press, Chicago, IL.</p>\n\n<p>Curme, G.O. (1931) A Grammar of the English Language, D.C. Heath, Boston. Reprinted 1977 by Verbatim, Essex, CT.</p>\n\n<p>Davidse, K. (1992) \"Transitivity/Ergativity: The Janus-Headed Grammar of Actions and Events,\" in M. Davies and L. Ravelli, eds., Advances in Systemic Linguistics, Pinter, London, 105-135.</p>\n\n<p>Dezso, L. (1980) \"Middle and Causative Constructions in English and Hungarian,\" in W. Nemser, Studies in English and Hungarian Contrastive Linguistics, Akademiai Kiado, Budapest, 207-231.</p>\n\n<p>Dixon, R.M.W. (1991) A New Approach to English Grammar, On Semantic Principles, Oxford University Press, Oxford.</p>\n\n<p>Doran, E. and M. Rappaport Hovav (1991) \"Affectedness and Extemalization,\" NELS 21, 81-94.</p>\n\n<p>Emonds, J.E. (1976) A Transformational Approach to English Syntax, Academic Press, New York.</p>\n\n<p>Erades, P.A. (1950) \"Points of Modern English Syntax,\" English Studies 31, 153-157.</p>\n\n<p>Fagan, S. (1988) \"The English Middle,\" Linguistic Inquiry 19, 181-203.</p>\n\n<p>Fagan, S.M.B. (1992) The Syntax and Semantics of Middle Constructions, Cambridge\nUniversity Press, Cambridge.</p>\n\n<p>Fellbaum, C. (1985) \"Adverbs in Agentless Actives and Passives,\" Papers from the\nParasession on Causatives and Agentivity, CLS 21 , Part 2, 21-31 .</p>\n\n<p>Fellbaum, C . (1992) \"Review of R.M.W. Dixon: A New Approach to English Grammar.\nOn Semantic Principles,\" Language 68, 642-645.</p>\n\n<p>Gawron, M.J. (1983) Lexical Representations and the Semantics of Complementation, Doctoral dissertation, University of California, Berkeley, CA.</p>\n\n<p>Geniusiene, E. (1987) The Typology of Reflexives, Mouton de Gruyter, Berlin.</p>\n\n<p>Grady, M. (1965) \"The Medio-Passive Voice in Modern English,\" Word 21, 270-272.</p>\n\n<p>Hale, K.L. and S.J. Keyser (1986) \"Some Transitivity Alternations in English,\" Lexicon Project Working Papers 7, Center for Cognitive Science, MIT, Cambridge, MA.</p>\n\n<p>Hale, K.L. and S.J. Keyser (1987) \"A View from the Middle,\" Lexicon Project Working Papers 1 0, Center for Cognitive Science, MIT, Cambridge, MA.</p>\n\n<p>Hale, K.L. and S.J. Keyser (1988) \"Explaining and Constraining the English Middle,\" in C. Tenny, ed. (1988), 41-58.</p>\n\n<p>Halliday, M.A.K. (1967) \"Notes on Transitivity and Theme in English Part I,\" Journal ofLinguistics 3, 37-81.</p>\n\n<p>Halliday, M.A.K. (1968) \"Notes on Transitivity and Theme in English Part III,\" Journal ofLinguistics 4, 179-215.</p>\n\n<p>Hatcher, A.G. (1943) \"'Mr. Howard Amuses Easy',\" Modern Language Notes 58, 8-17.</p>\n\n<p>Jaeggli, O.A. (1986) \"Passive,\" Linguistic Inquiry 17, 587-622.</p>\n\n<p>Jespersen, 0. (1927) A Modern English Grammar on Historical Principles, Part 3\nSyntax, Vol. 2, Carl Winter, Heidelberg.</p>\n\n<p>Keyser, S.J. and T. Roeper (1984) \"On the Middle and Ergative Constructions in\nEnglish,\" Linguistic Inquiry 15, 381--416.</p>\n\n<p>Keyser, S.J. and T. Roeper (1992) \"Re: The Abstract Clitic Hypothesis,\" Linguistic Inquiry 23, 89-125.</p>\n\n<p>Poutsma, H. (1904) A Grammar of Late Modern English, P. Noordhoff, Groningen.</p>\n\n<p>Roberts, I.G. (1987) The Representation of Implicit and Dethematized Subjects, Foris, Dordrecht.</p>\n\n<p>Stroik, T. (1992) \"Middles and Movement, \"Linguistic Inquiry 23, 127-137.</p>\n\n<p>Sunden, K.F. (1916a) The Predicational Categories in English (Essay 1), The University Press, Uppsala.</p>\n\n<p>Sunden, K.F. (l916b) A Category of Predicational Change in English (Essay II), The University Press, Uppsala. (Published together with Sunden (1916a).)</p>\n\n<p>Van Oosten, J. (1977) \"Subjects and Agenthood in English,\" CLS 13 , 459-47 1.</p>\n\n<p>Wilkins, W. (1987) \"On the Linguistic Function of Event Roles,\" BLS 13, 460-472.</p>\n\n<p>Williams, E. (1981) \"Argument Structure and Morphology,\" The Linguistic Review 1, 81-114.</p>\n\n<p>Zubizarreta, M.L. (1987) Levels of Representation in the Lexicon and in the Syntax, Foris, Dordrecht.</p>\n", "Id":"4021", "ParentId":"3998", "CreationDate":"2013-07-16T13:32:58.830", "Score":"2", "PostTypeId":"2", "OwnerUserId":"2252", "LastActivityDate":"2013-07-16T13:32:58.830", "CommentCount":"7"}