{"comments":[], "Body":"<p>Esperanto does both. One can introduce a neologism, a new international term. Or by combining existing word parts. Not introducing new words is considered optimal, as it saves in words to know. However the new combination must be understandable, and optimally intuitively formable.</p>\n\n<p>Sometimes the terms exist in parallel, until a concensus crystalizes. Usage, listing in partial dictionaries of communities, communications. There are unfortunately no accelerating, prescriptive institutions. An Akademio de Esperanto is rather conservative.</p>\n\n<p>Originally <strong>komput-i</strong> meant <em>count</em> as in Geiger counter. Computer got a neologismo <strong>komputero†</strong>, <strong>komputoro†</strong>, but nowadays <strong>komput-il-o</strong> (tool to compute) and <strong>komput-i</strong> is enlarged to mean <em>compute</em>.</p>\n\n<p>In the early years there was <strong>hospital-o</strong> and <strong>mal-san-ul-ej-o</strong> (quite notorious).\nThe term <strong>malsanulejo</strong>, comparable with the German <em>Krankenhaus</em>*, means literally place (-ej) of persons (-ul) with property sick (mal-san-a), opposite (mal-) of healthy (san). The term <strong>malsanulejo</strong> can be nicely used as negative example of Esperanto, but in fact is quite popular.</p>\n\n<p>Then there are terms without need for introducing neologisms. Animal related names are a positive example of active language possession.</p>\n\n<ul>\n<li>hundo = dog, hundino = female dog, virhundo = male dog, hundido = dog welp, hundejo = dog kennel.</li>\n<li>ĉevalo = horse, ĉevalino, virĉevalo, ĉevalido, ĉevalejo.</li>\n<li>koko = chicken, ...</li>\n</ul>\n\n<p>There are stricter guide lines to a good neologism, as Esperanto serves some (European) language families.\n - The esperantized spelling should be phonetic, though keep visual similarities. <strong>ĝeneral-a</strong> = (adj.) general, not ĵenerala (more phonetic).\n - The term should not already exist as other word, or have several meanings internationally.\n - The term should not be too similar to existing words.</p>\n", "Id":"4028", "ParentId":"4009", "CreationDate":"2013-07-19T10:22:06.677", "Score":"5", "PostTypeId":"2", "OwnerUserId":"1611", "LastActivityDate":"2013-07-19T10:22:06.677", "OwnerUser":{"UpVotes":"6", "DownVotes":"0", "Id":"1611", "AccountId":"960307", "Views":"4", "Reputation":"181", "CreationDate":"2012-12-26T17:41:32.873", "DisplayName":"Joop Eggen", "LastAccessDate":"2014-01-16T17:34:00.430", "AboutMe":"<p>Speaking Esperanto, Dutch, English, German.</p>\n"}}