{"OwnerUser":{"UpVotes":"13", "WebsiteUrl":"", "DownVotes":"1", "Id":"2132", "AccountId":"2572199", "Views":"6", "Reputation":"701", "CreationDate":"2013-06-04T23:59:57.060", "DisplayName":"Sjiveru", "LastAccessDate":"2014-01-18T21:42:32.287", "AboutMe":"<p>Still in training, but hopefully somewhat knowledgeable. Historical linguistics is awesome.</p>\n"}, "comments":[], "Body":"<p>Languages definitely change at different rates. A clear contrast is between Icelandic and some dialects of Norwegian - Icelandic has one of the slowest rates of change observed (Icelandic schoolkids can read the Norse sagas as easily as English-speaking schoolkids can read Shakespeare), but certain Norwegian dialects have some of the highest rates observed. And yet both are North Germanic - clearly speed of change is independent of the actual language that's changing.</p>\n\n<p>It's not clear at all what causes these disparities. To some degree, isolation seems to be a factor, but it's not obvious which direction it pushes (Norwegian dialects were pretty isolated from each other due to mountains, and Icelandic has been pretty isolated from the rest of the world due to location). Other factors may include how many people are learning the language as adults (more learners tends to lead to innovations that simplify things), and the level of visibility of a written prestige/standard variety (since standard/prestige varieties tend to be based on older forms of the language, and speakers may want to emulate prestigious writing styles in speech). There may be additional factors as well, some of which might well be due to the language itself - for example, if a language ends up in some kind of unstable state (say, with a very unbalanced vowel system), it may suddenly right itself, thus triggering a cascade of further changes (say, if rebalancing the vowel system results in ambiguity in person-marking verb suffixes; then the person-marking suffixes will themselves change). Indeed, there's so many potential factors affecting speed-of-change that it's very hard to isolate any one to study it.</p>\n\n<p>While some aspects of the mechanics of linguistic change are fairly well understood (we have a pretty good idea about how things like phonemic imbalances and articulatory difficulty can cause change), other factors (for example, things like sound changes not caused by either of the above) are less well understood. Rate-of-change and change timing are things that we just don't really know that much about yet.</p>\n", "Id":"4034", "ParentId":"4033", "CreationDate":"2013-07-20T23:03:48.163", "Score":"7", "PostTypeId":"2", "OwnerUserId":"2132", "LastActivityDate":"2013-07-20T23:03:48.163", "CommentCount":"2"}