{"Body":"<p>What is most effective for you depends on your goal, and partly on your learning type. Basically, if you want to translate from L1 to L2 learn words in this direction, if you want translate from L2 to L1 then the other way around. If you mostly want to be able to express yourself in the L2 then L1 to L2 is probably better (given these two choices), since learners tend to find this direction harder and have to spend more time memorising pairs for this direction.</p>\n\n<p>You mentioned you are aware of other ways of extending your vocabulary. Rote learning L1-L2 word pairs has fallen a bit out of fashion in language teaching as far as I can tell. Being able to define a word in the L2, or being able to name the target word after reading a definition/description/<a href=\"http://en.wikipedia.org/wiki/Cloze_test\" rel=\"nofollow\">cloze test</a> is now often preferred than just going for L1-L2 word pair memorisation. Still, you should go with what works best for you depending on your learning style and your aims. Personally, I like learning L1-L2 word pairs since it works for me in many (not all) occasions. But I wouldn't chose it as my preferred method to teach to students learning a foreign language.</p>\n", "Id":"4043", "ParentId":"3669", "LastEditorUserId":"51", "CreationDate":"2013-07-22T19:06:03.860", "OwnerUserId":"2278", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-07-23T01:23:21.457", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2013-07-23T01:23:21.457", "Score":"3", "CommentCount":"2", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}