{"comments":[], "Body":"<p>That varies greatly throughout languages. </p>\n\n<p>In ergative <a href=\"http://en.wikipedia.org/wiki/Sumerian_language#Nominal_morphology\" rel=\"nofollow\">Sumerian</a> (which did not necessary have copula sentences, for there has been no commonly accepted theory of Sumerian syntax and Sumerian had polypersonal-like clauses similar to those of modern Basque) a subject of an equative sentence was in Absolutive case:</p>\n\n<p><strong>za-e lugal ursag-me-en [thou+ABS king+ABS hero+ABS-art] = Thou art the king, the hero.</strong></p>\n\n<p>There are no exactly copula sentences in Sumerian with (presumably) sentence-final existensial verbs.</p>\n\n<p>Ergative was used mostly as a case to express an animate subject (although there were some examples of birds or cities mentioned in the same case as ergative subjects, these words were regarded  in Sumerian as inanimate).</p>\n\n<p>The concept of equation was expressed in Sumerian by <a href=\"http://en.wikipedia.org/wiki/Equative_case\" rel=\"nofollow\">Equative cas</a>e and, in some examples, by <a href=\"http://en.wikipedia.org/wiki/Comitative_case\" rel=\"nofollow\">Comitative</a> (namely, in phrases like comparing oneself with smb). </p>\n\n<p><a href=\"http://en.wikipedia.org/wiki/Basque_grammar#The_cases\" rel=\"nofollow\">In Basque</a>, subjects of equative sentences are often presented by Absolutive regardless on their animacy/inanimacy, e.g.:</p>\n\n<p><strong>Hiri hori oso polita da. = [Town that very beautiful is]. = That town is very beautiful</strong></p>\n\n<p>Basque also has sentence-final equative verbs, but sentence-final verbs are not copulas.</p>\n\n<p>Just like Japanese, which has sentence-final [equative] verbs and/or adjective predicates, and Equative -yori, but there is no Ergative in Japanese. </p>\n\n<p>Alternatively, Finnish language has two forms of adjective predicate with preceding (existential) copula, but there is no Ergative in it, either. Well, at least there is no <em>explicit</em> ergativity in its commonly recognised system.</p>\n\n<p>Therefore, of all the languages I am familiar with, Sumerian seems to be the only language matching the criteria you have set.</p>\n", "Id":"4044", "ParentId":"4037", "CreationDate":"2013-07-23T16:21:14.013", "Score":"2", "PostTypeId":"2", "OwnerUserId":"1686", "LastActivityDate":"2013-07-23T16:21:14.013", "OwnerUser":{"UpVotes":"145", "DownVotes":"36", "ProfileImageUrl":"http://i.stack.imgur.com/rZ1Oc.jpg", "Id":"1686", "AccountId":"2130467", "Views":"63", "Reputation":"1112", "CreationDate":"2013-01-19T17:49:32.827", "DisplayName":"Manjusri", "LastAccessDate":"2014-01-18T20:17:27.900", "AboutMe":"<p>I have no native language. I am more or less getting by in some tongues, and I can read and/or swear in douzens of other languages, but this doesn't mean I am an expert in them. By January 2013 I am 34 and wish to see the latter number growing. </p>\n\n<p>I study [cognitive] psychology and am planning to obtain some certificates in computer languages and programming.</p>\n\n<p>I enjoy horse riding, travelling, good cuisine, green Japanese tea, Russian and Spanish literatures and friendly company.</p>\n\n<p><strong>Fluent In:</strong> Dutch, English, Finnish, French, Russian, Spanish and Swedish.</p>\n\n<p><strong>Less Fluent:</strong> Danish, Estonian, Polish and Bulgarian, </p>\n\n<p><strong>Learning:</strong> Arabic, Chinese, Innuit, Japanese, Komi, Sanskrit, Tibetan and Yoruba.</p>\n\n<p><strong>Planning to Learn:</strong> Tangut, C, C++ &amp; Pascal</p>\n"}}