{"OwnerUser":{"UpVotes":"13", "WebsiteUrl":"http://metaphorhacker.net", "Location":"UK", "Id":"2121", "DownVotes":"1", "AccountId":"2843698", "Views":"6", "Reputation":"453", "CreationDate":"2013-06-01T07:00:55.230", "DisplayName":"Dominik Lukes", "LastAccessDate":"2014-01-05T22:31:39.843", "AboutMe":"<p>My primary research is in figurative language and discourse but I've also taught intro to general linguistics, basic phonology and language and education. I'm interested in bi-lingualism, social variation, anthropological linguistics and blog about all on MetaphorHacker.net.</p>\n\n<p>I've also been involved in teaching foreign languages and teacher training. I've taught Czech to foreigners and co-written a grammar and textbook (see Czechly.com) and I've worked as a regional language specialist for the US Peace Corps. I've also been the academic director of a private TEFL teacher training school.</p>\n"}, "comments":[], "Body":"<p>I think even a better question would be <strong>do any languages have sentences?</strong> Sentence is an artifact of writing and punctuation. You can see how this study found it hard to compare sentence length in writing and speech for this very reason: <a href=\"http://www.grsampson.net/ASoc.html\" rel=\"nofollow\">http://www.grsampson.net/ASoc.html</a>. In many ways, it's not that different from asking 'Do all languages have paragraphs' where the answer is obvious.</p>\n\n<p>However, all languages have some sort of a clause-type thing allowing them to express predication, attribution, etc. See Dixon's Basic Linguistic Theory: <a href=\"http://www.amazon.co.uk/Basic-Linguistic-Theory-Volume-ebook/dp/B0030XN0B0\" rel=\"nofollow\">http://www.amazon.co.uk/Basic-Linguistic-Theory-Volume-ebook/dp/B0030XN0B0</a>. All languages also must have means of expressing cohesion and coherence (texture) although this is much less studied in cross linguistic perspective. Punctuated sentences are a kind of cohesive device.</p>\n", "Id":"4046", "ParentId":"3270", "CreationDate":"2013-07-23T16:58:45.943", "Score":"3", "PostTypeId":"2", "OwnerUserId":"2121", "LastActivityDate":"2013-07-23T16:58:45.943", "CommentCount":"1"}