{"OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2279", "AccountId":"3084582", "Views":"0", "Reputation":"21", "CreationDate":"2013-07-23T19:39:21.763", "DisplayName":"Bart Anderson", "LastAccessDate":"2013-07-23T19:39:21.763"}, "comments":[], "Body":"<p>That's a very interesting question and the answer sheds a light into what makes Esperanto unique. </p>\n\n<p>English is a wide-open language, very free in creating new words and idioms (e.g. \"spam,\" \"copasetic,\" \"hang 'em high.\")  This gives English an openness and freedom, but also makes it hard for people to learn.  It can lead to impreciseness and sloppiness.</p>\n\n<p>French, in contrast, has traditionally been more disciplined in its vocabulary.  Instead of 17 synonyms for one concept, French might have one or two.  As a result, I find that French texts are often easier to read.</p>\n\n<p>In Esperanto, the process of word adoption is out in the open. There is long and often heated discussion about the introduction of new words.  People become aware of the implication of creating a new word from existing roots and affixes, versus importing a new word from English.</p>\n\n<p>From what I can tell, there are two different currents of thought.  On the one hand, writers like Jorge Camacho want the freedom and expressivity of new borrowings.</p>\n\n<p>On the other hand, people like Claude Piron, Renato Corsetti and Anna Lowenstein argue that it's far better to use the native roots of Esperanto.  For one thing, the imported words tend to be from English and Romance languages. This makes the language more European-centric, and harder for speakers of non-European languages. In fact, harder for everybody.</p>\n\n<p>Instead, they recommend using the existing Esperanto roots as much as possible. The Esperanto system is so regular and productive, it's a shame not to take full advantage of it. </p>\n\n<p>Piron's book on the subject:\n<a href=\"http://homepage.ntlworld.com/edmund.grimley-evans/piron/La_bona_lingvo.html\" rel=\"nofollow\">http://homepage.ntlworld.com/edmund.grimley-evans/piron/La_bona_lingvo.html</a> </p>\n", "Id":"4048", "ParentId":"4009", "CreationDate":"2013-07-23T19:39:21.763", "Score":"2", "PostTypeId":"2", "OwnerUserId":"2279", "LastActivityDate":"2013-07-23T19:39:21.763", "CommentCount":"1"}