{"comments":[], "Body":"<p>English <em>spelling</em> did deteriorate, due to almost abruptive historical changes. It will never become phonetic (nation versus national), and we won't see much reform there besides through/thru. So evolution is not an automatically proceding process.</p>\n\n<p>We live with a much richer language in qualitative terms. Philosophics showed the historical introduction of a Greek notion for (non-religious) <em>soul</em> (Latin animus). So nowadays we have a bag of notions like <em>creative</em>, <em>tolerance</em>, <em>open-minded</em>. Nevertheless philosophy, or psychology did contribute nothing to our linguistic mental toolset describing mental processes themselves. We did not become better argumentators. And are still as gullible to wrong arguments (financially supporting child raising, despite world over-population; energy saving lamps, despite very toxic waste). Despite better <em>expressiveness</em>. So the <strong>meta-level</strong> of language did not evolve.</p>\n\n<p>It is interesting in this respect to look at the artificial language Esperanto. (I am Esperantist <em>and</em> anglophile.) The language can be seen to correct many of the grown short-commings of evolution: instead of the many suffixes to make a word adjective (-al, -ic, -ive) or noun there is just one -a or -o. The spelling is again phonetic. Rules are few and without exception. A linguistic evolution in general has no such opportunity to make a clean break. Modern Hebrew was such a forced effort and might be worth readding upon.</p>\n\n<p>In general language evolution is a process of <strong>growth</strong>, friction and fitting. Missing are aspects of the biological evolution that made so good <em>survivors</em>: hunt, competition for the same resources, colaboration, genetic reproduction. Hence language <em>evolution</em> is nothing to be overly optimistic about. Especially as there is a large qualitative equality between languages. Historical or otherwise.</p>\n", "Id":"4087", "ParentId":"4080", "CreationDate":"2013-07-31T09:40:51.580", "Score":"1", "PostTypeId":"2", "OwnerUserId":"1611", "LastActivityDate":"2013-07-31T09:40:51.580", "OwnerUser":{"UpVotes":"6", "DownVotes":"0", "Id":"1611", "AccountId":"960307", "Views":"4", "Reputation":"181", "CreationDate":"2012-12-26T17:41:32.873", "DisplayName":"Joop Eggen", "LastAccessDate":"2014-01-16T17:34:00.430", "AboutMe":"<p>Speaking Esperanto, Dutch, English, German.</p>\n"}}