{"Body":"<p>To elaborate on jlawler and Ryno's comments, you are very very very unlikely to find the kind of data you want precompiled and available on the web. The reason is A) it's pretty easy to do yourself, and B) it isn't particularly useful once you get past an introductory level, i.e. there are probably better ways to judge the \"Englishness\" of words than just looking at their bigrams.</p>\n\n<p>First, you need a corpus. Obviously not every corpus will have every word in it which might leave some rare, but valid, bigrams out. You could use multiple corpora but realistically it won't make much difference. The <a href=\"http://icame.uib.no/brown/bcm.html\" rel=\"nofollow\">Brown Corpus</a> is freely available and is used a lot in this sort of thing. Alternatively, you could grab a bunch of books off of <a href=\"http://www.gutenberg.org/\" rel=\"nofollow\">Project Gutenberg</a>.</p>\n\n<p>I'm assuming you have at least some programming knowledge since you talk about needing to scan a large text, so once you have your reference corpus it should be trivial to scan through it and create a list of all unique bigrams or compute bigram probabilities. Typically when computing bigram probabilities you should use <a href=\"https://en.wikipedia.org/wiki/Naive_Bayes_classifier\" rel=\"nofollow\">Naive Bayes</a> (<code>P(AB) = P(B|A) = C(AB)/C(A)</code>, where <code>C()</code> is the count) instead of raw probabilities (<code>count of the bigram / total number of bigrams</code>). This is because the independence assumption (<code>P(AB) = P(B|A)</code>) means you can compute probabilities one [additional] letter at a time.</p>\n\n<p>Beyond bigram or full-word based solutions, there is <a href=\"http://stackoverflow.com/questions/1891404/how-do-you-create-an-english-like-word\">a similar question over on StackOverflow about English-like word <em>generation</em></a> (instead of <em>detection</em>) which takes a syllabic approach. Essentially you have 2 lists; valid onset/nucleus (or onset/vowel, i.e. the first half of a syllable) pairs and valid nucleus/coda (i.e. the second half of the syllable) pairs. These are then stitched together in <a href=\"https://en.wikipedia.org/wiki/Markov_chain\" rel=\"nofollow\">a Markov chain</a> resulting in valid English syllables. The important part is that these pairs are not a fixed length, for example <code>\"-a\" + \"at\" = \"at\"</code> vs. <code>\"-stre\" + \"ength\" = \"strength\"</code>. From here building valid English words is trivial (off the top of my head I can't think of invalid coda/onset combinations nor any valid syllable-initial/final pairs that cannot also be word-initial/final). Of course, this still leaves the problem of data since syllabifying itself is non-trivial.</p>\n", "Id":"4099", "ParentId":"4082", "LastEditorUserId":"1055", "CreationDate":"2013-08-02T02:22:11.490", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-08-05T13:07:39.673", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2013-08-05T13:07:39.673", "Score":"3", "CommentCount":"3", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}