{"comments":[], "Body":"<p>Language <strong>can</strong> \"improve\" over time as well as \"just changing\".</p>\n\n<p>This is not to say that each change is an improvement or that improvements never come with negative side effects or that improvements must necessarily grow to outnumber negative properties. This also does not negate the fact than any concept can be expressed in any language.</p>\n\n<p>Languages actually can adapt innovations either invented by a speaker or observed in use in another language.</p>\n\n<p>The obvious is example is the acquisition of a writing system and literacy. Once a language can be written it is possible to communicate over greater distances are timespans. Few people would argue that any language was not improved when it gained a way to be written.</p>\n\n<p>Most of the world's languages either have no writing system, only gained a writing system in the 20th century, or have small literate populations despite governments or missionaries devising an orthography. Yet which seldom-written languages are prominent world or national languages?</p>\n\n<p>Another example would be borrowing, calquing, or devising words for new concepts. Whether a language has an academy or not, speaker populations will begin referring to new concepts such as horses, guns, cars, satellites, sushi, computers, e-mail, etc.</p>\n\n<p>Now could it possible for languages to acquire other improvements such as grammar and syntax? I seem to recall reading somewhere once that features such as relative clauses or some forms of recursion were not always universal but were passed from language to language much like other good ideas. I find this possibility very tantalizing and would like to read any references about it. Please add a comment (-:</p>\n", "Id":"4100", "ParentId":"4080", "CreationDate":"2013-08-02T06:08:43.630", "Score":"1", "PostTypeId":"2", "OwnerUserId":"51", "LastActivityDate":"2013-08-02T06:08:43.630", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}