{"Body":"<p>This phenomenon is one of a family of phenomena known as <strong>Canadian Raising</strong>. \"Traditional\" Canadian raising involves the systematic vowel quality distinction made for the diphthongs  /aɪ/ and /aʊ/ when they are followed by a voiced vs. a voiceless consonant. Generally they are realized as [ʌɪ] and [ʌʊ], respectively (or some similar variants), before a voiceless consonant.</p>\n\n<p>There are several varieties of this phenomenon, however, and the one to which you are referring happens to be the one that I speak. I was born and raised in New Jersey, USA, which is one of the regions where this variety is commonly found. I make the voiced/voiceless distinction for /aɪ/ but not for /aʊ/. I maintain the distinction even when the underlying voicing distinction is neutralized, as in the flapping examples you mentioned, like <em>writer</em> and <em>rider</em>.</p>\n\n<p>Those facts alone may not be that surprising, but there are certain seemingly exceptional examples in my dialect that make it less than straightforward to analyze from a phonological perspective. For example, in most cases the raising is only \"triggered\" when the voiceless consonant is in the same morpheme as the diphthong--so [ʌɪ] appears in <em>ice cream</em> but not <em>I scream</em>. But there are exceptions to this generalization--[ʌɪ] occurs in <em>high school</em> (when it refers to the institution of secondary education). Also, as you mentioned, the raised version of the diphthong occurs in some cases before voiced consonants! It appears in <em>spider</em>, <em>idle</em>, and <em>cyber</em>, for example. Finally, it can even appear before [nt], as in <em>pint</em> (as opposed to <em>pined</em>).</p>\n\n<p><strong>Because of the exceptional examples in my dialect, a phonologist who believes in phonemes would have to concede that I actually have two separate phonemes, /aɪ/ and /ʌɪ/, in my inventory.</strong> There's no other way to explain minimal pairs like <em>cider</em> vs. <em>sider</em> and <em>high school</em> (the lexicalized compound) vs. <em>high school</em> (meaning 'a school that is high'). When I first mentioned all of these examples to a colleague of mine, she wouldn't believe me; she thought I was making them up. She finally came around when I pointed her to <a href=\"http://en.wikipedia.org/wiki/Canadian_raising#Varieties\" rel=\"nofollow\">this Wikipedia article</a>! In analyzing my dialect I would still posit a regular rule/constraint that keeps /aɪ/ from surfacing as [aɪ] before voiceless coda consonants, but such a rule would not be <em>sufficient</em> to cover all the cases.</p>\n\n<p>Just for fun, I'm listing some additional notable examples below:</p>\n\n<blockquote>\n  <p><strong>No raising:</strong> IC, bisexual, flyswatter, high, rider, tidy, pie plate, Pythagoras, pined, highchair, high-speed, IT, wi-fi, bystander, bifocals, Lysander, sider, slider, cyborg, hyperbole</p>\n  \n  <p><strong>Raising:</strong> icy, bicycle, ice water, height, writer, tighty, disciple, python, pint, high school (compound), mighty, wife, feisty, license, Lysol, cider, spider, cyberspace, hyper</p>\n</blockquote>\n\n<p>UPDATE: I've realized, after looking at the above examples, that syllable structure might play a role. The reason is that I have a very strong intuition that the raising is obligatory in monosyllabic words that end in a voiceless coda. Give me a nonce word with one syllable and a voiceless coda, and the vowel can never be realized as the non-raised /aɪ/. Further, if you look at the apparent exceptions in the \"no raising\" group above, such as <em>Pythagoras</em> and <em>bifocals</em>, what they appear to have in common is that the syllable following the diphthong-containing syllable always appears to be stressed (either primarily or secondarily). In words like <em>python</em> and <em>bicycle</em> (and of course <em>writer</em>) I have the intuition that the following syllable is unstressed and therefore the voiceless consonant is ambisyllabic (i.e. behaving both as a coda and an onset). This doesn't explain the exceptions that go in the other direction (i.e. raising occurring before voiced consonants), but at least it allows us to formulate the raising rule (or constraint) in a way that makes it exceptionless! This would also explain why I would raise the diphthong in polysyllabic nonce printed words like <em>griter</em> but not in those like <em>gritatious</em>.</p>\n", "Id":"4104", "ParentId":"4103", "LastEditorUserId":"385", "CreationDate":"2013-08-02T15:14:18.347", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-08-05T20:04:13.853", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2013-08-05T20:04:13.853", "Score":"3", "CommentCount":"3", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}