{"OwnerUser":{"UpVotes":"2", "WebsiteUrl":"http://folk.uio.no/sverrej/", "DownVotes":"1", "Id":"105", "AccountId":"510125", "Views":"2", "Reputation":"289", "CreationDate":"2011-09-14T05:45:56.533", "DisplayName":"Sverre", "LastAccessDate":"2013-11-09T14:44:26.807", "AboutMe":""}, "comments":[], "Body":"<p>There's no need to invoke ordered rules in order to explain the vowel distinction between 'writer' and 'rider'. In both cases, the vowel is simply the same as in the non-derived forms 'write' and 'ride', where the distinction between /t/ and /d/ is still present, and it's this distinction between /t/ and /d/ that's responsible for the difference in the articulation of the /ai/ diphthong.</p>\n\n<p>The reason you can't detect any difference between the vowels in 'matter' and 'madder' is that these two words aren't derived from base forms where a /t/ and /d/ is present. You're actually being tricked by knowing their spelling. If you didn't, you wouldn't have any idea that one was spelled with 't' and the other with 'd', since these consonants are in fact always pronounced the same (as a flapped [ɾ]).</p>\n\n<p>This explains the lack of vowel differences in 'liter' vs. 'leader'. The word 'liter' isn't derived from a base with 't'. The word has a flap [ɾ], which is voiced, and vowels are lengthened before voiced consonants. Since both 'liter' and 'leader' (derived from 'lead') have the vowel before a voiced consonant, their vowels are the same.</p>\n\n<p>So what about 'sighter' vs 'cider'? Here you would expect the diphthong in 'cider' to behave like it does before other voiced consonants, since it has a voiced [ɾ]. As musicallinguist says in his answer, the 'Canadian raising' phenomenon typically affects /ai/ before voiceless consonants, but it actually affects some words where /ai/ is before voiced consonants as well. One of the words musicallinguist mentions that he has Canadian raising in is indeed 'cider', and I can verify that (not as a native speaker, but I have definitely heard people pronounce it like that). Other words where you have an 'unexpected' raised /ai/ include words like 'tiger'. I don't know if anyone has a good explanation for these exceptions.</p>\n\n<p>In 'slighter' vs. 'slider', you find a contrast in the vowels because they behave \"normally\", i.e. just like 'writer' vs. 'rider' (since they're derived from 'slight' and 'slide').</p>\n", "Id":"4106", "ParentId":"4103", "CreationDate":"2013-08-02T20:36:17.243", "Score":"0", "PostTypeId":"2", "OwnerUserId":"105", "LastActivityDate":"2013-08-02T20:36:17.243", "CommentCount":"7"}