{"Body":"<p>Mathematics teachers would have to use both jargon and metalanguage to teach mathematics.</p>\n\n<p>Check out the Wikipedia definition of \"jargon\": \"the technical terminology or characteristic idiom of a special activity occupational or social group.\"  For example, biology has its own jargon. Witness terms like <a href=\"http://dictionary.reference.com/browse/eukaryotes\" rel=\"nofollow\">\"eukaryotes\"</a> <a href=\"http://dictionary.reference.com/browse/prokaryotes?s=t\" rel=\"nofollow\">\"prokaryotes\"</a> and so on.</p>\n\n<p>Mathematics has its own jargon too. Even those among us who hardly use any math on the job probably remember some mathematical jargon from high school:   \"sine,\" \"cosine,\" \"hypotenuse,\" \"parabola,\" etc.</p>\n\n<p>Math instructors would have to teach the meanings of terms from mathematical jargon, and in doing so would have to use metalanguage. Metalanguage is a language or vocabulary used to talk about language. In other words, it's language about language. For example, in the sentences below a) is not metalanguage but b) is.</p>\n\n<blockquote>\n  <p>a) The sun came up yesterday.<br>\n  b) \"unglaublich\" is a German word that translates as \"unbelievable.\"</p>\n</blockquote>\n\n<p>At this point someone might claim that the two sentences represent the same kind of language. The problem with this claim is that \"unglaublich\" is neither an English word nor a noun phrase. So if we admit that sentence b) makes sense, then we have to admit that language-about-language has some rules that are distinct from those of non-meta-language--in this instance, distinct rules about what can qualify as a noun phrase.</p>\n\n<p>So now we come to the day in mathematics class when the teacher tells his students the following:  \"The hypotenuse is the longest side of a right triangle.\"</p>\n\n<p>By defining a term, the teacher is using metalanguage. From then on, the teacher uses \"hypotenuse\" freely with his math students in sentences like \"The square of the hypotenuse is equal to the sum of the squares of the two other sides of a right triangle.\" This illustrates a math teacher's necessary use of jargon.   </p>\n", "Id":"4119", "ParentId":"4110", "LastEditorUserId":"1055", "CreationDate":"2013-08-05T23:18:58.610", "OwnerUserId":"790", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-08-06T00:13:53.553", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2013-08-06T00:13:53.553", "Score":"1", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}