{"comments":[], "Body":"<p>Another construction you may want to bear in mind involves a kind of ellipsis operation called 'gapping'. This is pretty vanishingly rare in written English, and not very common in spoken English, but i mention it here for the sake of completeness:</p>\n\n<p>(1) Some ate pizza, and others {ate} pasta\n(2) I should call you, or you {should call} me?</p>\n\n<p>The braces indicate that a string can be deleted under identity. Note that this looks like deletion of a non-constituent, but it's generally analysed as involving movement of an argument from out of the VP, followed by deletion of the entire VP.</p>\n\n<p>It only really happens in coordination constructions, and it tends to be subject to fairly strict locality. Shouldn't be too difficult to write a rule for.</p>\n\n<p>Another instance which hasn't been mentioned is coordination of more than two elements, i.e.</p>\n\n<p>\"You, me and John should go to the cinema together.\"</p>\n\n<p>Not sure if your parser pays attention to punctuation - if it does you could write a special rule for this, taking advantage of the comma separating the first two elements.</p>\n\n<p>One last thing - don't have the rep to comment directly, but it's not quite right semantically to say that \"They made Jim a lieutenant\" is an identificational construction that <em>equates</em> its two object NPs. Rather, [Jim a lieutenant] is syntactically a small-clause, with <em>predicational</em> semantics. [a lieutenant] is a predicative DP which takes the individual-denoting DP [Jim] as its argument. Note that the predicative element in a small clause can just as easily be an adjective: \"They made Jim angry\".</p>\n", "Id":"4130", "ParentId":"4075", "CreationDate":"2013-08-07T11:38:50.027", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2328", "LastActivityDate":"2013-08-07T11:38:50.027", "OwnerUser":{"UpVotes":"123", "WebsiteUrl":"https://sites.google.com/site/patrickdelliott/", "ProfileImageUrl":"http://i.stack.imgur.com/HGYBE.jpg", "Id":"2328", "AccountId":"3146009", "CreationDate":"2013-08-07T11:16:59.797", "AboutMe":"<p>I'm a PhD student in Linguistics at University College London. My primary area of interest is generative linguistics, and specifically syntactic and semantic theory. More narrowly still, i'm interested in ellipsis, comparatives, and binding theory. <a href=\"https://twitter.com/patrickdelliott\" rel=\"nofollow\">Follow me on twitter!</a></p>\n", "Location":"London, United Kingdom", "DownVotes":"43", "Views":"43", "Reputation":"970", "DisplayName":"P Elliott", "LastAccessDate":"2014-01-19T02:32:31.120"}}