{"OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "comments":[], "Body":"<p>There's more than one way to analyse just about anything in linguistics.</p>\n\n<p>Sometimes which cases a language is analysed to have depends on the number of inflected forms that nominals can take. Well after taking into account which parts of the inflection are due to other factors such as number and gender.</p>\n\n<p>Sometimes which cases a language is analysed to have is based on comparison with a previously analysed language due to tradition. This was once very common using Classical languages such as Latin and Ancient Greek as a basis.</p>\n\n<p>Sometimes which cases a language is analysed to have is based on traditional analysis of the language as it was in former times even though it may have changed quite a bit since. Georgian is usually considered to have the same cases as Old Georgian but in fresh analyses it's been noted that some of the postpositions have </p>\n\n<p>It could even be possible to analyse which cases a language has based more on syntax that morphology, especially for languages which have both inflectional and analytic features. For instance, genitive and dative might be considered to be two cases in a language even though they may share a single inflectional form.</p>\n\n<p>So let's look at English. English nominals are nouns, adjectives, and pronouns.</p>\n\n<p>Nouns have two forms or four forms depending on how the possessive is analysed: dog, dog's, dogs, dogs'</p>\n\n<p>Since number is not related to case this leaves either one or two cases, depending on whether you analyse possessive to be a case. In English three of the forms are the identical in pronunciation but differ in orthography.</p>\n\n<p>Adjectives have three forms, none of which reflect case: big, bigger, biggest.</p>\n\n<p>Pronouns have more forms which reflect cases than nouns have. But again it depends on analysis. Pronouns often share a kind of paradigm with possessive adjectives and are often suppletive: I, me, my, mine.</p>\n\n<p>So pronouns in English would usually be labelled \"subject\" and \"object\" and then nouns and adjectives have a \"possessive\". But not necessarily in your preferred analysis.</p>\n\n<p>You could compare the English \"subjective case\" to \"nominative case\", English \"objective case\" to \"dative case\", an English \"possessive case\" to \"genitive case\".</p>\n\n<p>You could analyse English as having just one case for nouns and two cases for pronouns and not count possessive as a case at all.</p>\n\n<p>So you see there is no \"natural law\" - there's just many ways to describe what happens using terminology that fits to varying degrees across many languages.</p>\n", "Id":"4140", "ParentId":"4135", "CreationDate":"2013-08-09T03:34:21.960", "Score":"1", "PostTypeId":"2", "OwnerUserId":"51", "LastActivityDate":"2013-08-09T03:34:21.960", "CommentCount":"6"}