{"OwnerUser":{"UpVotes":"123", "WebsiteUrl":"https://sites.google.com/site/patrickdelliott/", "ProfileImageUrl":"http://i.stack.imgur.com/HGYBE.jpg", "Id":"2328", "AccountId":"3146009", "CreationDate":"2013-08-07T11:16:59.797", "AboutMe":"<p>I'm a PhD student in Linguistics at University College London. My primary area of interest is generative linguistics, and specifically syntactic and semantic theory. More narrowly still, i'm interested in ellipsis, comparatives, and binding theory. <a href=\"https://twitter.com/patrickdelliott\" rel=\"nofollow\">Follow me on twitter!</a></p>\n", "Location":"London, United Kingdom", "DownVotes":"43", "Views":"43", "Reputation":"970", "DisplayName":"P Elliott", "LastAccessDate":"2014-01-19T02:32:31.120"}, "comments":[], "Body":"<p>Seeing this question reminded me of a section in Peter Matthews book 'Syntax' (1981) (it's meant to be a textbook, but it's more like a monograph really). In Chapter 4, p84-93, there's an explicit comparison and evaluation of dependency grammars vs. constituency grammars.</p>\n\n<p>Matthews shows that for any d-grammar, there is a ps-grammar which will generate the same set of sentences, and vice versa - that is to say that d-grammars and ps-grammars are <strong>weakly equivalent</strong>.</p>\n\n<p>Matthews goes on to discuss a different and more interesting way in which the two can be compared: Can an analysis in one framework be shown, in each instance, to be isomorphic to an analysis in the opposing framework? In other words, can we say everything using d-grammar that we can using a ps-grammar, and vice versa? If the answer is yes, then the two are <strong>strongly equivalent</strong> (Chomsky '63, <em>formal properties of grammar</em>). As far as i understand it, strongly equivalent grammars are essentially notational variants.</p>\n\n<p>In comparing d-grammars and ps-grammars, we shouldn't necessarily pay too much heed to the variable simplicity of the <em>notation</em> - we can only use this as an argument if it's already been established that the two are strongly equivalent.</p>\n\n<p>Matthews pretty convincingly shows that there is no mechanical procedure from which d-trees can be derived from ps-trees, and no mechanical procedure from which ps-trees can be derived from d-trees across the board. There are things of descriptive value that can be said in d-grammars that can't be said in ps-grammars, and vice versa, and therefore they aren't strongly equivalent. You could entertain the idea of combining the two representations (which is something like what we have in, e.g. modern minimalism), although this is something that Matthews ultimately rejects in favour of his own d-grammar, for interesting and unrelated reasons.</p>\n\n<p>Dick Hudson is a proponent of 'word grammar', a modern theory in the d-grammar school, and he has some powerful arguments in his various papers (available here: <a href=\"http://www.phon.ucl.ac.uk/home/dick/wg.htm#main_ideas\" rel=\"nofollow\">http://www.phon.ucl.ac.uk/home/dick/wg.htm#main_ideas</a>) that a d-grammar is to be preferred to a ps-grammar. Given that ps-grammars and d-grammars aren't mere notational variants, it seems to me that one or the other will ultimately turn out to be a more accurate abstraction over speakers' mental representations. Ultimately, that's still an open question.</p>\n", "Id":"4141", "ParentId":"3420", "CreationDate":"2013-08-09T21:01:58.043", "Score":"2", "PostTypeId":"2", "OwnerUserId":"2328", "LastActivityDate":"2013-08-09T21:01:58.043", "CommentCount":"1"}