{"Body":"<p>I agree with P Elliot above, that your two sentences are:</p>\n\n<p>with regards fact \"X\" (as an example, \"swans are white\")</p>\n\n<p>I know X, that you know as well. (I know that swans are white too.)<br>\nvs<br>\nI know that you know X (but may not know it myself). (I know that you know what colour swans are.)</p>\n\n<p>(As has been pointed out in comments, purely syntactically, the first version of \"I know what you know\" implies that I share all of your knowledge, not just a specific fact.  However, I feel that in use, nobody would ever suggest that they know everything another person knows, and so there must be an implied context to the use of this sentence.  The discussion around the differences between the two sentences, and other potential cases of this ambiguity still apply whether we are talking about a specific context or a general totality of knowledge, so this point is largely irrelevant to the rest of the discussion.)</p>\n\n<p>In thinking about these two a little more, I came up with this, that I think also explains the ambiguity well:<br>\n1) I can answer [a question/all the questions] that you can.<br>\n2) I know [a question/all the questions] that you can answer.  </p>\n\n<p>In speaking each of the sentences, it would be emphasis that would separate the two.  \"I KNOW what you know\" is different from \"I know WHAT you know.\"  </p>\n\n<p>Besides re-phrasing, which could be done in many ways, an example above in this answer, I can't think of how you could distinguish the two in writing.</p>\n\n<p>I am trying to think of how to classify verbs where this kind of ambiguity, and coming up blank.  The reason that it works with \"know\" is that the object of \"know\" is a fact, and \"the thing you know\" and \"that you know a thing\" are both facts.  Of course, with any verb, if the object of the verb, call it \"X\" is a \"Y\" then \"the thing that you X\" must also be a \"Y\", but \"that you X a thing\" is always going to be a fact.  So a verb that can be applied to a fact in this manner, should be a possible candidate for this ambiguity.  </p>\n\n<p>As you pointed out, it doesn't work with \"think\", because although you can \"think\" a fact, the phraseology is somewhat different.  \"I think what you think\" (I think like you) vs \"I think that you think [that].\" (I know what you think)  Attempting to force the sentences into the same structure to allow the ambiguity brings us back to using the word \"know\".  </p>\n\n<p>One other word I've found that works is \"say\".  \"I say what you say\" can mean \"I say the same thing as you\" or \"I tell you what to say\".  </p>\n\n<p>\"I suspect what you know\" also has similar ambiguity - but only because suspect basically means \"think I know\" so the sentence \"I think I know what you know\" still contains your original sentence.</p>\n\n<p>I can't help with other languages, but I suspect that any with common forms in the declension of a noun, or a specific form for a verb when it's used in a noun phrase, will have this same feature.</p>\n", "Id":"4144", "ParentId":"4142", "LastEditorUserId":"2008", "CreationDate":"2013-08-10T02:30:34.267", "OwnerUserId":"2008", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-08-10T17:48:20.457", "LastEditedUser":{"UpVotes":"1", "DownVotes":"1", "Id":"2008", "AccountId":"1628523", "Views":"6", "Reputation":"139", "CreationDate":"2013-04-29T20:11:44.157", "DisplayName":"Ryno", "LastAccessDate":"2014-01-13T20:53:52.207"}, "LastActivityDate":"2013-08-10T17:48:20.457", "Score":"-1", "CommentCount":"16", "OwnerUser":{"UpVotes":"1", "DownVotes":"1", "Id":"2008", "AccountId":"1628523", "Views":"6", "Reputation":"139", "CreationDate":"2013-04-29T20:11:44.157", "DisplayName":"Ryno", "LastAccessDate":"2014-01-13T20:53:52.207"}}