{"OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}, "comments":[], "Body":"<p>Some varieties of English have plural personal pronouns that are composed in roughly the way you're asking.</p>\n\n<h2>Southern US English</h2>\n\n<p><a href=\"http://en.wikipedia.org/wiki/Y%27all\"><em>you'all</em>/ <em>y'all</em></a> is composed of the 2nd p. singular pronoun + plural marker <em>all</em>. Because there is now a separate 2nd p. plural pronoun <em>you</em> tends to be restricted to singular reference.</p>\n\n<p>I understand the other comments as saying that Japanese <em>tachi</em> in <em>watashi-tachi</em> is a plural marker that it is also used in other circumstances as a plural marker. <em>you'all</em> doesn't meet that definition because it's not grammaticalised as a morphological plural marker. But it marks plurality lexically and <em>could</em> in the future be grammaticalised as a plural marker.</p>\n\n<h2>Tok Pisin</h2>\n\n<p>Tok Pisin is an English-based creole (more specifically: English is the lexifier language) spoken in Papua New Guinea. The morpheme <em>pela</em> (from English <em>fellow</em>) argueably works as a plural (or not-singular) marker in the <a href=\"http://en.wikipedia.org/wiki/Tok_Pisin\">pronoun system</a>:</p>\n\n<ul>\n<li>1st (exclusive) singular: <em>mi</em></li>\n<li>1st (exclusive) plural: <em>mipela</em></li>\n<li>2nd singular: <em>yu</em></li>\n<li>2nd plural: <em>yupela</em></li>\n</ul>\n\n<p>The Dual is marked in the following way:</p>\n\n<ul>\n<li>1st (exclusive) dual: <em>mitupela</em></li>\n<li>2nd dual: <em>yutupela</em></li>\n</ul>\n\n<p>This is why I said <em>pela</em> might be interpreted as not-singular because it's also used in the dual (and trial where it exists).</p>\n\n<p>3rd person dual conforms to the system: <em>tupela</em></p>\n\n<p>But 3rd personal singular and plural have suppletive forms: <em>em</em> and <em>ol</em></p>\n\n<p>Again, as far as I know <em>pela</em> is not used as a plural marker otherwise. But the meaning of the pronouns is still compositional in that there is a person morpheme (e.g. <em>mi</em>), a dual morpheme (<em>tu</em>), and a non-singular morpheme (<em>pela</em>) that combine to form the various pronouns.</p>\n", "Id":"4148", "ParentId":"4145", "CreationDate":"2013-08-10T10:45:43.800", "Score":"9", "PostTypeId":"2", "OwnerUserId":"2278", "LastActivityDate":"2013-08-10T10:45:43.800", "CommentCount":"4"}