{"Body":"<p>Evidence on first language acquisition can be acquired in a controlled or naturalistic setting (and in other ways too, but this is a major distinction).</p>\n\n<p>In a <strong>controlled setting</strong> all factors other than the one(s) you are interested in are held constant. Participants should have the same age, sex, socio-economic background or at least you include roughly equal numbers of both sexes etc. and check whether it makes a difference. Then you present the same stimuli in the same way and see what happens, or vary them in a specific manner between gropus. From an experimental and extremely unethical point of view, the ideal experiment would be taking children a birth, assigning them to different groups and presenting each group with input that differs in some way you are interested in. Needless to say, nobody will do exactly that.</p>\n\n<p>In a <strong>naturalistic setting</strong> the researcher tries to influence the result as little as possible. You try to generalise from what you see happening 'in real life' - for example that 90 % of all children acquiring English in the UK from monolingual patterns have mastered irregular past tense verbs by age 3 (I'm making up the numbers here). One problem here is that the presence of a researcher might <a href=\"http://en.wikipedia.org/wiki/Observer%27s_paradox\" rel=\"nofollow\">change the outcome</a>.</p>\n", "Id":"4158", "ParentId":"4154", "LastEditorUserId":"2278", "CreationDate":"2013-08-10T17:20:00.790", "OwnerUserId":"2278", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-08-10T17:31:01.313", "LastEditedUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}, "LastActivityDate":"2013-08-10T17:31:01.313", "Score":"1", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}