{"OwnerUser":{"UpVotes":"1", "DownVotes":"0", "ProfileImageUrl":"https://www.gravatar.com/avatar/?s=128&d=identicon&r=PG&f=1", "Id":"2358", "AccountId":"3163004", "Views":"3", "Reputation":"126", "CreationDate":"2013-08-12T17:00:49.507", "DisplayName":"Kevin Russell", "LastAccessDate":"2013-10-14T17:34:33.220"}, "comments":[], "Body":"<p>Probably the most common explanation of how vowel harmony starts is that it's a grammaticalization of the phonetic effect of coarticulation, where the properties of one segment influence how the speaker articulates surrounding segments.</p>\n\n<p>For example, when an upcoming syllable contains a round vowel, it's common for speakers to begin rounding their lips partway through the <em>preceding</em> syllable or earlier (even two or three syllables earlier). In speech communities where speakers do a lot of vowel-to-vowel coarticulation, it's possible that learners in future generations will reanalyze what they hear as being contrastive rounding (or whatever) on more than one syllable.</p>\n\n<p>There's probably no relation to the size of the vowel inventory. In the 1990s, Sharon Manuel proposed that languages with larger vowel inventories tend to allow less vowel-to-vowel coarticulation (so maybe we could hypothesize they'd be less likely to develop vowel harmony in the future), but her proposed relationship between inventory size and coarticulation hasn't really held up beyond the languages she first looked at.</p>\n\n<p>Prosody should definitely have a role according to this story. Segments in prosodically strong positions tend to exert stronger coarticulatory effects on their prosodically weak neighbours than vice versa. So along with other tendencies (like right-to-left being more common than left-to-right), you'd expect more languages to develop harmony patterns where features spread <em>from</em> prosodically strong segments than <em>to</em> them.</p>\n", "Id":"4174", "ParentId":"4139", "CreationDate":"2013-08-12T17:27:59.720", "Score":"4", "PostTypeId":"2", "OwnerUserId":"2358", "LastActivityDate":"2013-08-12T17:27:59.720", "CommentCount":"1"}