{"OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://pne.livejournal.com/", "Location":"Hamburg, Germany", "Id":"248", "DownVotes":"0", "AccountId":"44165", "Views":"1", "Reputation":"71", "CreationDate":"2011-09-22T09:40:49.953", "DisplayName":"Philip Newton", "LastAccessDate":"2011-09-22T14:31:40.503", "Age":"40"}, "comments":[], "Body":"<p>I remember reading in a book Eskimo-Aleut languages that the author disagreed with the concept of phonemes and allophones. He said (about Greenlandic; my translation from the German):</p>\n\n<blockquote>\n  <p>Under certain conditions only [f x χ ɬ], under others, only [v ɣ ʁ l]. These conditions are the quantity. <em>[Summary of the remainder of the paragraph: the former only occur long, the latter only short. -PN]</em></p>\n  \n  <p>There are linguists who would not simply describe this fact and leave it at that. In a <em>functionalistic</em> analysis, they would combine those sounds to four units called <em>phonemes</em>: they would combine [f] and [v], [x] and [ɣ], [χ] and [ʁ], and [ɬ] and [l]; and one would come up with labels for the phonemes such as /f x χ ɬ/ or /v ɣ ʁ l/. The situation where one phoneme corresponds to a number of different sounds is then called <em>allophony</em>. The really interesting question, however, is what the point of the concept of allophony is. There are some notes on this in Holst (2001: 38, 48f.), but they are not particularly numerous.</p>\n  \n  <p>Functionalists start from the presupposition that languages are composed of units of sound whose differences distinguish meaning. For example, the German words <em>Paß</em> [pas] and <em>Baß</em> [bas] have two separate units in their respective onsets which determine the meaning difference between the two words. There are, however, cases where differences of sound cannot make a difference in meaning, because the language system <em>[what I would call the phonology, PN]</em> regulates which sound appears where. For example, in German, the sound [x] only appears after back vowels and [ç] appears in other positions. This is a complementary distribution. The situation with Greenlandic [f] and [v], etc., is another example. When functionalists encounter such cases, they deny that those sounds are individual units of the respective language, say that this is a case of allophony, and combine the two (or more) sounds to a single phoneme. This course of action is, however, absurd. Afundamental trait of science is that it is <em>empirically</em> founded: observations are made and then conclusions are drawn. If one observes, for example, that German [x] and [ç] are in complementary distribution, then one may and should state this, but one may not reinterpret the data. The basic assumption of functionalism, which was stated at the beginning of this paragraph, is incorrect: languages are simply <em>not</em> composed of units of sounds, the distinctions between which always cause differences in meaning. One encounters the truth of this statement empirically again and again.</p>\n  \n  <p>It has to be stated clearly: the concept of allophony is pure nonsense. Such combining of sounds are not legitimate in a scientific treatment of language and should therefore be refrained from.</p>\n</blockquote>\n\n<p>(Jan Henrik Holst, <em>Einführung in die eskimo-aleutischen Sprachen</em>, Helmut Buske Verlag, Hamburg 2005. ISBN 3-87548-386-3. Pages 39f. Notes in <em>[italics and square brackets]</em> are mine.)</p>\n", "Id":"418", "ParentId":"212", "CreationDate":"2011-09-22T14:03:37.997", "Score":"2", "PostTypeId":"2", "OwnerUserId":"248", "LastActivityDate":"2011-09-22T14:03:37.997", "CommentCount":"2"}