{"Body":"<p>In thinking about this it's important to distinguish between phonetics and phonology.</p>\n\n<p>Phonetically a diphthong is a sequence of two vowel targets, wherein the tongue starts at one vowel position and moves to another. For this reason it may sometimes be described as a combination of vowel and glide, but it's best to understand the articulatory facts of what it involves, movement from one tongue 'vowel' position to another, as opposed to the steady-state articulation found in simple 'monopthongal' vowels.</p>\n\n<p>The evidence for this can come from simply hearing the vowel movement, as well as from various kinds of imaging such as spectrograms, ultrasounds, x-rays, etc.</p>\n\n<p>Phonologically such an articulation can function as a single phoneme, as in the diphthongs of English. But a sequence of two phonemes consisting of vowel + vowel, or vowel + glide, can (eg in fast speech) be phonetically identical to a diphthong.</p>\n\n<p>As for English diphthongs, a standard phonemic analysis of English will reveal a set of vowel phonemes. In every variety of English that I'm aware of some of those vowel phonemes will be realised as diphthongs, involving an articulatory movement from one vowel target to another, as revealed by the kinds of evidence already mentioned. Some of the evidence of the phonemic status of these diphthongs in English includes:</p>\n\n<ul>\n<li>standard minimal sets: 'beet, bit, bet, bait, bite, boat, bout,\nbought, boot' etc</li>\n<li>Diphthong as sole syllabic nucleus, eg 'how', 'boat', 'I'</li>\n<li>Participation in same tense-lax contrasts as monopthongal vowels, eg\n'divine-divinity', cf. 'serene-serenity'</li>\n</ul>\n", "Id":"4197", "ParentId":"4186", "LastEditorUserId":"363", "CreationDate":"2013-08-15T06:16:49.753", "OwnerUserId":"363", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-08-22T04:18:29.613", "LastEditedUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}, "LastActivityDate":"2013-08-22T04:18:29.613", "Score":"5", "CommentCount":"8", "OwnerUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}}