{"OwnerUser":{"UpVotes":"3", "DownVotes":"1", "Id":"518", "AccountId":"1050676", "Views":"4", "Reputation":"264", "CreationDate":"2011-11-18T22:46:18.720", "DisplayName":"Adele C", "LastAccessDate":"2014-01-19T01:50:39.710", "AboutMe":"<p>Hi there.  I'm a college student originally from Upstate NY, USA.  My stunted childhood was spent reading too many books and hoping I would grow up to be Han Solo.  Still waiting on that last bit.</p>\n\n<p>I spend most of my free time knitting polyhedral dice.</p>\n"}, "comments":[], "Body":"<p>My understanding of \"infelicitous\" and \"ungrammatical\" are that they describe two entirely separate situations.  Your definition of ungrammaticality is sound- something that violates syntactic or morpho-syntactic rules is ungrammatical.  However, in my experience \"infelicitous\" is used in the study of pragmatics to describe an utterance that is grammatical but cannot occur. </p>\n\n<p>The term is used to describe performative speech acts- sentences that cause actions to occur ('I christen this child \"Jim,\"' or \"I sentence you to death').  Each utterance has felicity conditions, or situations that must be true in order for the utterance to be true and have the effect the speaker wanted.  In the case of \"I sentence you to death,\" the speaker must be a judge, in a courtroom, somewhere that has the death penalty, talking to a criminal.</p>\n\n<p>If any of these conditions are not true, the statement is infelicitous and has no effect.  So, if a judge were, say, at the movies and someone was talking very loudly, the judge could say \"I sentence you to death,\" but <em>it wouldn't work</em>.  The felicity conditions of being in a courtroom and talking to a criminal have been violated.  No one would say that the sentence \"I sentence you to death,\" is ungrammatical, but it is infelicitous because it cannot succeed under the given conditions.</p>\n", "Id":"4201", "ParentId":"4196", "CreationDate":"2013-08-15T12:25:01.387", "Score":"4", "PostTypeId":"2", "OwnerUserId":"518", "LastActivityDate":"2013-08-15T12:25:01.387", "CommentCount":"1"}