{"Body":"<p>You asked if English diphthongs could be analyzed instead as long vowels, but that doesn't make sense. Long vowels don't change in quality (phonologically) over their duration. But you are asking about sounds such as \"hey\", \"no\", \"cow\", \"toy\", which clearly do change. Actually, I realize you probably have a <a href=\"http://en.wikipedia.org/wiki/Vowel_length#Traditional_long_and_short_vowels_in_English_orthography\" rel=\"nofollow\">confusion of definitions between linguistic long vowels and \"long vowels\" as taught in elementary school</a>.</p>\n\n<p>Could it be vowel hiatus? Well that would mean that each vowel is treated as belonging in a separate syllable. But in the example words I gave above, we English speakers clearly treat those as monosyllabic.</p>\n\n<p>So the real tricky question is whether these sequences are true VV diphthongs or actually VC and CV glides. The tricky thing is that all the glides in my dialect of English (Western Canadian) end on either a [j] or [w] sound, which, when I say it that way would mean these aren't really diphthongs. But [j] can also be interpreted as [i] and [w] as [u].</p>\n\n<p>To me it is instinctive that they are phonological diphthongs, but that is probably not a good enough answer. But ask yourself, do you consider the \"y\" in \"fly\" to be a legitimate vowel sound in English or merely an [a] sound followed by a [j]? It is curious that 4 out of the 5 names of our vowels in english are actually pronounced as diphthongs. As Manjusri hinted at, an understanding of moras would be helpful. Briefly, a diphthong in any language must have two moras (same with long vowels), however a glide belongs in either the onset (no mora) of a syllable or in its coda. Then things get complicated. Depending on the language, and depending on sound, the coda may or may not carry a mora. Unfortunately I think English is ambiguous about this. If it could be shown that the purported [j] or [w] at the end of a syllable had no mora then that would be proof that it is really a glide sitting in the coda rather than the second half of a diphthong, sitting in the nucleus. I don't think you can find such proof though.</p>\n", "Id":"4205", "ParentId":"4186", "LastEditorUserId":"2373", "CreationDate":"2013-08-16T19:10:54.437", "OwnerUserId":"2373", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-08-17T17:22:14.257", "LastEditedUser":{"UpVotes":"3", "DownVotes":"0", "ProfileImageUrl":"https://www.gravatar.com/avatar/?s=128&d=identicon&r=PG&f=1", "Id":"2373", "AccountId":"139820", "Views":"3", "Reputation":"196", "CreationDate":"2013-08-16T17:48:57.747", "DisplayName":"Moss", "LastAccessDate":"2013-12-18T02:51:26.983"}, "LastActivityDate":"2013-08-17T17:22:14.257", "Score":"2", "CommentCount":"5", "OwnerUser":{"UpVotes":"3", "DownVotes":"0", "ProfileImageUrl":"https://www.gravatar.com/avatar/?s=128&d=identicon&r=PG&f=1", "Id":"2373", "AccountId":"139820", "Views":"3", "Reputation":"196", "CreationDate":"2013-08-16T17:48:57.747", "DisplayName":"Moss", "LastAccessDate":"2013-12-18T02:51:26.983"}}