{"comments":[], "Body":"<p>It is probably better to talk about the order of constituents rather than words - since it is syntactic constituents that can be moved around, but not single words:</p>\n\n<blockquote>\n  <p>Rose was driving the car.</p>\n  \n  <p>The car, rose was driving.</p>\n  \n  <p>*Car, rose was driving the.</p>\n</blockquote>\n\n<p>You seem to be asking two questions</p>\n\n<blockquote>\n  <p>(1) What is the motivation for word order changes?</p>\n  \n  <p>(2) What mechanisms of changing word order are used in isolating languages?</p>\n</blockquote>\n\n<p>I will first try to answer (1):</p>\n\n<h2>(1) What is the motivation for word order changes?</h2>\n\n<p>Sentences can be analysed, in terms of how they present information, into two parts:</p>\n\n<ol>\n<li>What the sentence is about (<strong>theme</strong>).</li>\n<li>New information about the theme (<strong>rheme</strong>)</li>\n</ol>\n\n<p><em>The king helped the people</em> is a statement about what the king did and might be part of a larger section telling his story: <em>he was intelligent, had to spend his childhood in another country, and after his return, the king helped the people.</em></p>\n\n<p>But <em>The people were helped by the king</em> is a statement about the people: <em>During the great famine everybody was hungry and desperate. In kingdom A many died, but in kingdom B the people were helped by the king.</em></p>\n\n<p>Since themes are usually known to those involved in the conversation (<strong>discourse-given</strong>), they tend to be definite. Usually the subject of a sentence is also its theme because prototypical themes/subjects are high on the <a href=\"http://en.wikipedia.org/wiki/Animacy\" rel=\"nofollow\">animacy hierarchy</a> - such as humans. On top of the animacy hierarchy are those involved in a conversation, who can be referred to with <strong>I, we, you</strong>, and these are always discoure-given. So it makes sense that subjects, which are often rhemes, usually come at the beginning of a sentence.</p>\n\n<h2>(2) What mechanisms of changing word order are used in isolating languages?</h2>\n\n<p>Syntactic means such as those referred to by jlawler are available in English and some other languages, such as French. Here's an example of a <a href=\"http://en.wikipedia.org/wiki/Cleft_sentence\" rel=\"nofollow\">cleft</a> sentence:</p>\n\n<blockquote>\n  <p>It was Hector I wanted to see, not Juliette.</p>\n  \n  <p>C'était Hector que je voulais voire, pas Juliette.</p>\n</blockquote>\n\n<p>In spoken language intonation is at least as important as syntactic mechanisms. <em>Hector</em> receives a pitch accent (major intonation movement) in the following sentences, where <em>Hector</em> is extraposed.</p>\n\n<blockquote>\n  <p>Hector I wanted to see, not Juliette.</p>\n  \n  <p>Hector je voulais voire, pas Juliette.</p>\n</blockquote>\n", "Id":"4236", "ParentId":"4219", "CreationDate":"2013-08-22T16:11:58.907", "Score":"2", "PostTypeId":"2", "OwnerUserId":"2278", "LastActivityDate":"2013-08-22T16:11:58.907", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}