{"Body":"<blockquote>\n  <p>what about the names of people, languages, cultures - are there any\n  general rules for where they come from?</p>\n</blockquote>\n\n<p>I'm especially fascinated by the ethnic adjectives we assign to the people and languages of a given place.</p>\n\n<p>In English, we have a euphonic (literally translated from Greek: \"good sounds\"; i.e. it \"sounds good\" to us) sense that gives us \"Seattleite\" for Seattle, but \"British\" for Britain and \"Kansan\" for Kansas.  \"Kansite\" doesn't \"sound right\" to us.  We have an impressive list of potential suffixes to chose from when forming a new ethnic.</p>\n\n<p>\"England\" is a great example of the kind of compound toponym you mention that evolved over time.  It was originally Engla-land (<em>engle</em> the Anglos + <em>land</em> land of) in Old English and the haplology reduced the repeating \"la-la\" in the middle to form \"England\".  Even with a steadfast rule of compounding toponyms from -land, -ton, etc., they are still susceptible to the evolution of cultural euphonics and their modern snapshot may not be immediately recognizable as an old compound.</p>\n", "Id":"4247", "ParentId":"3718", "LastEditorUserId":"986", "CreationDate":"2013-08-24T18:17:46.400", "OwnerUserId":"986", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-08-26T20:14:02.643", "LastEditedUser":{"UpVotes":"0", "WebsiteUrl":"http://minoan.deaditerranean.com", "DownVotes":"0", "Id":"986", "AccountId":"1472276", "Views":"1", "Reputation":"1", "CreationDate":"2012-05-09T02:35:33.483", "DisplayName":"kiminoa", "LastAccessDate":"2013-08-28T15:19:05.647", "AboutMe":""}, "LastActivityDate":"2013-08-26T20:14:02.643", "Score":"0", "CommentCount":"5", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://minoan.deaditerranean.com", "DownVotes":"0", "Id":"986", "AccountId":"1472276", "Views":"1", "Reputation":"1", "CreationDate":"2012-05-09T02:35:33.483", "DisplayName":"kiminoa", "LastAccessDate":"2013-08-28T15:19:05.647", "AboutMe":""}}