{"OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}, "comments":[], "Body":"<p>It really depends on the relationship between the categories and what you want to use your agreement scores for.</p>\n\n<p>Let's say you want to annotate verb phrases for tense and aspect, such as</p>\n\n<blockquote>\n  <p><em>has been working</em></p>\n  \n  <p>Perfect: yes</p>\n  \n  <p>Past: no</p>\n  \n  <p>Progressive: yes</p>\n</blockquote>\n\n<p>Then it would make sense to compute IAA for all features combined if what you need is accuracy in the annotation of all features. That IAA is lower overall is not a problem per se since whatever benchmark you are using (comparing two human raters as benchmark, and one automatic with one human rater as test case, for example) will also be lower.</p>\n\n<p>On the other hand you will <strong>lose information by computing combined IAA</strong>. It might be of interest whether there is more agreement for annotating <em>perfect</em> than for annotation <em>progressive</em>, for example. This will help in identifying categories that need to be clarified or need clearer guidelines for annotation. Unless you have dozens of features, it might make sense to <strong>compute both combined and single IAAs</strong> to get the whole picture.</p>\n\n<p>Another point is whether the features you want to annotate belong to the <strong>same category</strong>. If you rate syntactic and semantic features of verb phrases it will probably make less sense to calculate combined IAA:</p>\n\n<blockquote>\n  <p><em>has been working</em></p>\n  \n  <p>SYNTACTIC: Perfect: yes, Past: no, Progressive: yes</p>\n  \n  <p>SEMANTIC: Telic: no, ...</p>\n</blockquote>\n\n<p>Here it would make sense to calculate IAA separately for syntactic and semantic features.</p>\n", "Id":"4252", "ParentId":"4248", "CreationDate":"2013-08-25T14:54:18.317", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2278", "LastActivityDate":"2013-08-25T14:54:18.317", "CommentCount":"2"}