{"comments":[], "Body":"<p>I would submit that prosody could play a role in disambiguating the two readings, at least in English. As a native speaker, if I heard someone say (out of the blue):</p>\n\n<blockquote>\n  <p>1) <strong><em>I</em></strong> know what <strong><em>you</em></strong> know.</p>\n</blockquote>\n\n<p>I would interpret it as, \"I have knowledge about the same things you have knowledge about.\" On the other hand, if I heard:</p>\n\n<blockquote>\n  <p>2a) I know what you <strong><em>know</em></strong>.</p>\n</blockquote>\n\n<p>or</p>\n\n<blockquote>\n  <p>2b) I <strong><em>know</em></strong> what you <strong><em>know</em></strong>.</p>\n</blockquote>\n\n<p>I would interpret it as, \"I know which subjects you have knowledge about.\"</p>\n\n<p>The reason is that we tend to emphasize things that we are comparing or contrasting entities in parallel constructions (a phenomenon known as <em>contrastive focus</em>) and to de-emphasize things that are repeated or taken for granted in the context of the conversation (things that are <em>given</em> or <em>presupposed</em>). </p>\n\n<p>In (1), the two instances of <em>know</em> are referring to the same knowledge, so they are de-emphasized, but the pronouns (i.e. the \"knowers\") are different, so contrastive focus is utilized. This version of the utterance would have the same prosodic pattern as something like, \"I watched what you watched\" (in response to the question, \"What did you watch on TV last night?\"). </p>\n\n<p>Emphasis on the last content word in a phrase or a clause (without getting theory-specific here) can also signal focus on that whole constituent (known as <em>broad focus</em>). In both (2a) and (2b), the constituent \"what you know\" is being focused as new information, and so the last word, <em>know</em>, gets emphasized. Whether the first <em>know</em> is emphasized or not could depend on the speech rate as well as the context. In faster speech or in a context where the topic of the speaker's knowledge is given (e.g. if the speaker is answering the question \"What do you know?\") the first <em>know</em> may not get emphasized. But in more careful speech or in a context where the topic of the speaker's knowledge hasn't been established (e.g. if the speaker is responding to the question \"Why are you smiling?\") the first <em>know</em> may get emphasized. The prosodic patterns given in (2a) and (2b) would be appropriate for something like \"I ate what you cooked\" (in response to \"What did you eat for dinner tonight?\" or \"Why did you get sick last night?\"). </p>\n", "Id":"4256", "ParentId":"4142", "CreationDate":"2013-08-25T23:50:03.310", "Score":"2", "PostTypeId":"2", "OwnerUserId":"385", "LastActivityDate":"2013-08-25T23:50:03.310", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}