{"OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "comments":[], "Body":"<p><strong>Yes</strong> they are antonyms. That doesn't affect whether they may have other, possibly even overlapping or seemingly contradictory relationships, such as being co-hyponyms.</p>\n\n<p>Antonyms are two words which are opposites. That seems pretty simple. But in fact you have to think about what \"opposite\" means, and what it means for words in particular.</p>\n\n<p>In the end it comes down to semantics like so many other things, and people will surely come up with multiple analyses.</p>\n\n<ul>\n<li>Antonyms can be adjectives naming properties: <em>short</em> vs <em>long</em>.</li>\n<li>They can be abstract nouns naming properties: <em>shortness</em> vs <em>length</em>.</li>\n</ul>\n\n<p>If a property can possess a value along a scale then generally values toward each end of the scale are seen as opposites.</p>\n\n<p>Then there are properties which can have one of two values, which can of course be analysed as a special case of the previous.</p>\n\n<p>I'm sure some people analyse \"male\" and \"female\" to be antonyms, and people who would strongly refute it. They can certainly be argued against semantically.</p>\n\n<p>If two words are nouns then they need refer to objects having one property which has \"opposing\" values. Some nouns have more than one property capable of this. Others have none.</p>\n", "Id":"4278", "ParentId":"4258", "CreationDate":"2013-08-27T03:12:21.103", "Score":"1", "PostTypeId":"2", "OwnerUserId":"51", "LastActivityDate":"2013-08-27T03:12:21.103", "CommentCount":"2"}