{"Body":"<p>The exact <a href=\"http://en.wikipedia.org/wiki/Origin_of_language\" rel=\"nofollow\">origin of language</a> is (and most likely will forever remain) a mystery. That Wikipedia article should give you a quick overview of the various competing theories. To oversimplify, verbal language provided a survival advantage, allowing people to warn each other about danger with enough detail to effectively avoid it, all while keeping hands free for locomotion, fighting, and grabbing. While this explains why language survived, it does <strong>not</strong> explain how language came to be in the first place. Evolution has no foresight and just because a trait is advantageous doesn't mean evolution will make it happen (how many animals have wheels?).</p>\n\n<p>As for the case of why some languages thrive while others die off quietly, unfortunately the answer is simple socioeconomic and sociopolitical factors combined with sheer luck. Why is English so widely spoken across the world? Because English speaking countries had enough political and economic power and influence to spread it across the world. Why do other languages die? Typically because it is displaced by a more politically/socially powerful one. That or all the speakers simply die out/are killed. So if the survival of a language is based on the speakers' sociopolitical power, what makes one group more powerful than another? I don't know but I highly doubt it has anything to do with language. In the 19th and early 20th centuries people believed that the language one spoke significantly affected their cognitive abilities (the <a href=\"http://en.wikipedia.org/wiki/Linguistic_relativity\" rel=\"nofollow\">Sapir-Whorf hypothesis</a>) but these claims have largely been disproven and few linguistics believe in them these days.</p>\n\n<p>The most interesting part of your question is the last bit. If language changes over time, what governs those changes? Why do certain changes stick and others die out? I recently sat in on a lecture about <a href=\"http://idiom.ucsd.edu/~ackerman/web_contents/Paris_2011.pdf\" rel=\"nofollow\">the Low Entropy Conjecture</a>. While I am oversimplifying the issue, Professors Malouf and Ackerman calculated the <a href=\"http://en.wikipedia.org/wiki/Entropy_%28information_theory%29\" rel=\"nofollow\">Shannon Entropy</a> (the measure of uncertainty in Information Theory) of verbal conjugations in various languages and found that in all cases the results were much lower than those expected by chance. Their conjecture basically states that languages change to become less entropic (i.e. less random) over time. Extrapolating from this, any change that is successfully adopted into a language would have to reduce the possibility of misunderstanding. It's a neat idea but it's a very very new area of study.</p>\n", "Id":"4287", "ParentId":"4286", "LastEditorUserId":"1055", "CreationDate":"2013-08-28T06:54:08.453", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-08-28T07:06:40.617", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2013-08-28T07:06:40.617", "Score":"3", "CommentCount":"7", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}