{"OwnerUser":{"UpVotes":"108", "WebsiteUrl":"http://twitter.com/mollyocr", "Id":"42", "AccountId":"896571", "CreationDate":"2011-09-13T21:04:13.347", "AboutMe":"<p>BA in Linguistics. Currently working as a localization &amp; QA specialist at a translation company in Minneapolis. Studied: Latin, Spanish, French, Arabic, Polish, Mandarin. Conlanger. Sci fi &amp; fantasy nerd, experimental cook, songwriter, artist and craftist. Also, I have a dog.</p>\n", "Age":"28", "Location":"Minneapolis, MN", "DownVotes":"8", "Views":"24", "Reputation":"933", "DisplayName":"mollyocr", "LastAccessDate":"2012-09-13T19:49:49.973"}, "comments":[], "Body":"<p>First comes research, of course. If it's an undocumented language, you learn about the languages that are potentially related or nearby it, as well as the culture of the people who speak it. </p>\n\n<p>So often the real issues of documenting a previously undocumented language are social or political, so in all likelihood there are many battles to fight before you'd ever actually study the language itself. A professor of mine had to meet with the tribal council of a Menominee res many times as they repeatedly changed their mind back and forth over whether she was welcome. And this was documenting a language the speakers of which literally only number in the double digits.</p>\n\n<p>Once you're in good graces, learn the phrases for \"more slowly please\" or \"please repeat that.\" If you're really starting with nothing in common, I'd imagine you'd have to start with objects you can point to. <a href=\"http://www.uiowa.edu/intlinet/unijos/nigonnet/nlp/200words.pdf\">Here's a great word list to start with.</a> (Also, <a href=\"http://blog.globalizationpartners.com/when-there-are-no-words.aspx\">here's a lovely article</a> on interacting with others when there's no language shared.)</p>\n\n<p>When you have the basics of the language down, being <em>prepared</em> for your time with your subjects is very important. It helps you collect data you can actually use. Wanna know how the language handles plurals? Hold up one leaf, then hold up two. Hold up one rock, then hold up two. </p>\n\n<p>Although I hope there are completely undocumented languages out there for us to discover, I think most commonly field linguists these days are trying to document endangered and moribund languages, and that's an easier process because there is probably a younger generation that is bilingual who can interpret. </p>\n\n<p>There are all sorts of practical considerations too: obtaining permission from speakers to record them, what kind of technology you need to record them and analyze the data, etc. Also, invest in some Moleskine notebooks. </p>\n\n<p>When it comes to the language itself, I highly recommend <a href=\"http://rads.stackoverflow.com/amzn/click/0521588057\">Describing Morphosyntax: A Guide for Field Linguists</a>. It really is a handbook for the first time field linguist and walks through every item one should consider when documenting a language: the language's genetic affliations, sociolinguistic concerns, morphological typology, defining the grammatical categories of the language, constituent order typology, pragmatics of the language, etc. </p>\n\n<p>(Also, it's a must for anyone making their own conlang.)</p>\n", "Id":"429", "ParentId":"370", "CreationDate":"2011-09-22T18:07:35.883", "Score":"10", "PostTypeId":"2", "OwnerUserId":"42", "LastActivityDate":"2011-09-22T18:07:35.883", "CommentCount":"3"}