{"Body":"<p>In Latin, this is called the <em>genitivus explicativus, definitivus, appositivus</em> or <em>epexegeticus</em>: the genitive defines or describes in other words what the head word is or consists in (not <em>consists of</em>). It exists in various Indo-European languages, possibly in all, including Latin, Greek, German, English, Dutch, French... In languages without cases, a preposition meaning \"of\" is normally used instead of / as the genitive.\n<a href=\"http://de.wikipedia.org/wiki/Genitiv\" rel=\"nofollow\">http://de.wikipedia.org/wiki/Genitiv</a></p>\n\n<p>There is some connection with the <em>genitivus partitivus</em>, which describes what parts the head word consists of or includes: <em>a box of matches, a cup of coffee, a regiment of archers</em>.</p>\n\n<p>Note that most cases and prepositions have widely different meanings. The preposition <em>of</em> in English has always been strongly associated with the older genitive case (which developed into <em>'s</em>). Similarly, many other languages also have a preposition they strongly associate with the genitive: Dutch <em>van</em>, German <em>von</em>, (late?) Latin <em>de</em>. This strong association, which may have been already present, was often strengthened as languages lost their cases. There is also cross-contamination between languages: the Latin use of the genitive and <em>de</em> may have influenced that of the Germanic languages in the Middle Ages. But some uses of the genitive were most probably already present in Proto-Indo-European, like possession. The same applies to other cases and prepositions, to varying degrees.</p>\n", "Id":"4293", "ParentId":"4292", "LastEditorUserId":"82", "CreationDate":"2013-08-28T20:26:49.170", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-09-08T06:35:45.880", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-09-08T06:35:45.880", "Score":"5", "CommentCount":"4", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}