{"Body":"<p>Although I am not an ASL speaker (signer? user?), your question interested me. After some quick research, the simple answer to your question seems to be <a href=\"http://en.wikipedia.org/wiki/American_Sign_Language_grammar#Syntax\" rel=\"nofollow\">yes, word order matters in ASL</a>. Strictly speaking, ASL sentences follow the a basic SVO sentence structure.</p>\n\n<p>Languages typically have <a href=\"https://courses.cit.cornell.edu/psych215/PDF-files/language-acq-II.pdf\" rel=\"nofollow\">a trade off between strict word order and inflectional complexity</a> (see slide 13). In a language with no morphological case markings <strong>and</strong> free word order it would be impossible tell what was the subject and what was the object. Therefore, languages with free word order require morphological case markings while languages with strict word orders tend to lose case markings over time since they are redundant (or perhaps it is more accurate the say that strict word orders develop to allow case markings to be omitted).</p>\n\n<p>So far as I can tell, ASL does not have any case marking signs, thus word order must be respected. I'd actually be interested to know if there are any sign languages which do have such markings.</p>\n\n<p>It is important to note that ASL sentences can contain a \"topic\" which occurs at the beginning of the sentence. Therefore, a signer may wish to emphasize the object of a sentence by moving it to the front of the sentence, marking it as the sentence's topic. English doesn't really have a concept of topic but other languages do. For example, Korean, which assigns case morphologically, uses <a href=\"http://en.wikipedia.org/wiki/Topic_marker#Korean%3a_.EB.8A.94.2F.EC.9D.80\" rel=\"nofollow\">the 은/는 marker to denote topic</a>. If it helps, you can think of it as a combination of \"Yoda speak\" and <a href=\"http://en.wikipedia.org/wiki/Wh-movement#Basic_examples\" rel=\"nofollow\">wh-fronting</a>.</p>\n\n<p>It is also worth noting that some sources claim that <a href=\"http://www.ddeafworld.com/\" rel=\"nofollow\">ASL users are typically familiar enough with English word order that they can understand English-ordered ASL</a>, I suspect this is because, in addition to the fact that not all hearing-impaired people are completely deaf and thus may have learned English, even ASL users need to learn written English. However, <a href=\"http://lifeprint.com/asl101/pages-layout/grammar.htm\" rel=\"nofollow\">ASL grammar is <strong>not</strong> the same as English grammar</a>.  Some of the big differences are the ability to omit subjects and the lack of a \"to be\" verb in ASL. I found <a href=\"http://doug.stringham.net/uvuasl/3330/3330_linguisticdifferences.pdf\" rel=\"nofollow\">this paper that summarizes a lot of the differences between ASL and English</a></p>\n\n<p>Finally, as jlawyer mentioned, sentences in ASL are not typically a linear set of independent signs. <a href=\"http://en.wikipedia.org/wiki/American_Sign_Language_grammar#Affixes\" rel=\"nofollow\">Signs may be combined</a> to change their meanings as well as <a href=\"https://www.youtube.com/watch?v=d4GsZ9P5DKY\" rel=\"nofollow\">the spacial relationships between signs</a> is important to meaning.</p>\n", "Id":"4316", "ParentId":"4314", "LastEditorUserId":"1055", "CreationDate":"2013-08-30T02:52:27.150", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-08-30T16:13:13.537", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2013-08-30T16:13:13.537", "Score":"7", "CommentCount":"2", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}