{"Body":"<p>There are some standards, but they tend to be organization specific (such as <a href=\"http://en.wikipedia.org/wiki/Defense_Language_Proficiency_Tests\" rel=\"nofollow\">DLPT</a> for the US military, or <a href=\"http://en.wikipedia.org/wiki/ILR_scale\" rel=\"nofollow\">ILR</a> for US Foreign Service Officials), or language specific (such as <a href=\"http://www.jlpt.jp/e/about/levelsummary.html\" rel=\"nofollow\">Japanese Language Proficiency Test</a>). </p>\n\n<blockquote>\n  <p><em>what taxonomy do they use to separate those who are remarkably fluent from those at various degrees of being less so</em>  </p>\n</blockquote>\n\n<p>In the case of JLPT, the lowest level test (N5) corresponds roughly to a first semester college course in Japanese. The next levels, N4, N3 and N2 correspond roughly to 1 year, 2-3 years and 3-4 years of university level study respectively. If you can pass N1, you can probably do well going to a university in Japan, or work in an office environment in Japan (where everyone else speaks Japanese). </p>\n\n<p>In Europe, you'll find the CERF<a href=\"http://en.wikipedia.org/wiki/Common_European_Framework_of_Reference_for_Languages\" rel=\"nofollow\">4</a> (Common European Framework of Reference for Languages) ratings on many people's CVs or résumés.  There are three levels with sub-levels within each.</p>\n\n<blockquote>\n<pre><code>A. Basic Speaker\n A1. Breakthrough or beginner\n A2. Waystage or elementary\nB. Independent Speaker\n B1. Threshold or intermediate\n B2. Vantage or upper intermediate\nC. Proficient Speaker\n C1. Effective Operational Proficiency or advanced\n C2. Mastery or proficiency\n</code></pre>\n</blockquote>\n\n<p>Stealing shamelessly from wikipedia, here is a description of what is to be expected at each level.</p>\n\n<pre>\nlevel   description\nA1  Can understand and use familiar everyday expressions and very basic phrases\n        aimed at the satisfaction of needs of a concrete type. Can introduce \n        him/herself and others and can ask and answer questions about personal \n        details such as where he/she lives, people he/she knows and things \n        he/she has. Can interact in a simple way provided the other person \n        talks slowly and clearly and is prepared to help.\nA2  Can understand sentences and frequently used expressions related to \n        areas of most immediate relevance (e.g. very basic personal and family \n        information, shopping, local geography, employment). Can communicate \n        in simple and routine tasks requiring a simple and direct exchange of \n        information on familiar and routine matters. Can describe in simple \n        terms aspects of his/her background, immediate environment and matters \n        in areas of immediate need.\nB1  Can understand the main points of clear standard input on familiar \n        matters regularly encountered in work, school, leisure, etc. Can \n        deal with most situations likely to arise whilst travelling in an \n        area where the language is spoken. Can produce simple connected \n        text on topics which are familiar or of personal interest. Can \n        describe experiences and events, dreams, hopes & ambitions and \n        briefly give reasons and explanations for opinions and plans.\nB2  Can understand the main ideas of complex text on both concrete \n        and abstract topics, including technical discussions in his/her \n        field of specialisation. Can interact with a degree of fluency \n        and spontaneity that makes regular interaction with native \n        speakers quite possible without strain for either party. Can \n        produce clear, detailed text on a wide range of subjects and \n        explain a viewpoint on a topical issue giving the advantages \n        and disadvantages of various options.\nC1  Can understand a wide range of demanding, longer texts, and \n        recognise implicit meaning. Can express him/herself fluently \n        and spontaneously without much obvious searching for expressions. \n        Can use language flexibly and effectively for social, academic \n        and professional purposes. Can produce clear, well-structured, \n        detailed text on complex subjects, showing controlled use of \n        organisational patterns, connectors and cohesive devices.\nC2  Can understand with ease virtually everything heard or read. \n        Can summarise information from different spoken and written \n        sources, reconstructing arguments and accounts in a coherent \n        presentation. Can express him/herself spontaneously, very \n        fluently and precisely, differentiating finer shades of meaning \n        even in the most complex situations.\n</pre>\n", "Id":"433", "ParentId":"423", "LastEditorUserId":"259", "CreationDate":"2011-09-22T21:07:38.107", "OwnerUserId":"117", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-09T04:22:00.013", "LastEditedUser":{"UpVotes":"0", "WebsiteUrl":"http://www.arttaylor.com", "Id":"259", "AccountId":"82042", "CreationDate":"2011-09-23T00:12:35.620", "AboutMe":"<p>CTO at commerce-related startup.  Hobbies include programming languages.</p>\n", "Age":"42", "Location":"California", "DownVotes":"0", "Views":"0", "Reputation":"103", "DisplayName":"Art Taylor", "LastAccessDate":"2011-09-23T00:12:35.620"}, "LastActivityDate":"2011-10-09T04:22:00.013", "Score":"10", "OwnerUser":{"UpVotes":"80", "Location":"Denver, CO", "DownVotes":"1", "Id":"117", "AccountId":"46214", "Views":"11", "Reputation":"609", "CreationDate":"2011-09-14T13:41:53.967", "DisplayName":"Tangurena", "LastAccessDate":"2013-10-09T17:10:34.627", "AboutMe":"<p>I am a .NET developer.</p>\n"}}