{"OwnerUser":{"UpVotes":"108", "WebsiteUrl":"http://twitter.com/mollyocr", "Id":"42", "AccountId":"896571", "CreationDate":"2011-09-13T21:04:13.347", "AboutMe":"<p>BA in Linguistics. Currently working as a localization &amp; QA specialist at a translation company in Minneapolis. Studied: Latin, Spanish, French, Arabic, Polish, Mandarin. Conlanger. Sci fi &amp; fantasy nerd, experimental cook, songwriter, artist and craftist. Also, I have a dog.</p>\n", "Age":"28", "Location":"Minneapolis, MN", "DownVotes":"8", "Views":"24", "Reputation":"933", "DisplayName":"mollyocr", "LastAccessDate":"2012-09-13T19:49:49.973"}, "comments":[], "Body":"<p>It all depends on what you include in your definition of \"grammatical gender.\" Let me esplain. No, there is too much; let me sum up: Grammatical gender or noun class is a grouping of nouns that are morphologically marked in the same way. What morphological changes do these words suffer when I want to say x? Gender is separate from case, though, which is the morphological markers that tell how a noun (and adjectives, et al) function in a sentence. </p>\n\n<p>Like you said, Polish has essentially five noun classes, but it's really three components that make up this grammatical gender: gender (masculine, feminine, neuter), personhood (personal, non-personal) and animacy (animate, inanimate) -- but personhood and animacy only affect the masculine gender resulting in what looks like five noun classes, the ones listed in the question.</p>\n\n<p>Note that \"grammatical gender\" is not necessarily related to gender/sex in the real world -- and grammatical animacy does not always match real world animacy either. These terms are used only to designate classes of words that take certain inflections. Of course, there is usually a lot of semantic overlap between grammatical gender and real world sex and gender roles.</p>\n\n<p>It's all in how you name things. For most Indo-European languages, I think it's easiest to group gender, personhood and animacy together into the idea of \"gender\" or \"noun class.\" In fact, <a href=\"http://homer.members.pgv.at/INDOEURO/gender.htm\" rel=\"nofollow\">some</a> hypothesize that PIE originally distinguished between animate and inanimate nouns, then the animate group distinguished between masculine and feminine. It explains the masculine/feminine/neuter paradigm. </p>\n\n<p>Other languages address things like gender, animacy and personhood in different ways: Navajo uses word order to rank animacy of nouns in a sentence. Japanese uses a different existential/possessive verb for animate or inanimate nouns. Arabic marks gender on pronouns, which means in the 2nd person, the form changes depending on who you're speaking to. Animacy affects ergative languages in different ways, depending on where the language draws its line in the hierarchy of animacy.</p>\n", "Id":"434", "ParentId":"379", "CreationDate":"2011-09-22T22:29:59.103", "Score":"3", "PostTypeId":"2", "OwnerUserId":"42", "LastActivityDate":"2011-09-22T22:29:59.103", "CommentCount":"5"}