{"OwnerUser":{"UpVotes":"47", "WebsiteUrl":"", "DownVotes":"1", "Id":"153", "AccountId":"871764", "Views":"33", "Reputation":"1445", "CreationDate":"2011-09-18T03:14:58.320", "DisplayName":"Floating Tone", "LastAccessDate":"2012-05-27T05:07:04.410", "AboutMe":"<p>I'm a PhD candidate in linguistics, with diverse interests including phonetics, phonology, morphology, language documentation, historical linguistics and sociolinguistics. I am particularly interested in the languages of Africa, Papua New Guinea and Australia. I'm also very interested in methods of making linguistic knowledge and materials more accessible and available to linguists and non-linguists alike.</p>\n"}, "comments":[], "Body":"<p>@hippietrail, re: your query about which language the documentation should actually begin in, it's generally thought that your work is most valid if all of the data are collected through the actual language you are documenting. This means that you can either essentially start out 'mute', and learn from scratch, or try to learn some of the language before you start the project. This is all well and good, but for languages that are under-documented (or undocumented), you would be lucky to find sufficient materials available to help you learn the language on your own, before going into the field. </p>\n\n<p>So, mostly, people will first learn the lingua franca of the area - if you plan to work on a small native language of Africa, the lingua franca might be Arabic, French, English, or a dominant native language like Kiswahili. And yes, in Australia, the lingua franca might be Kriol. </p>\n\n<p>Then, ideally, you'd gradually learn the language you are actually documenting, and use this to verify data you already have, and continue collecting more.</p>\n\n<p>In reality, this situation won't always work - it's far more time consuming for the linguist if it's necessary to get an extra language or two under your belt before getting down to the nuts and bolts of documentation, and funding might not always allow for those extra few months as a learner. Not all language documentation entails years spent working on the one language - sometimes an opportunity arises to just work on a language for a short time, or on a specific feature, and it's important to make the most of these opportunities because some documentation is still better than no documentation. In those situations, you might be more likely to end up working with educated speakers who are as fluent in English (or any given language) as you, and that's ok too, as long as you're aware of the possible pitfalls of the 'translation method'.</p>\n", "Id":"437", "ParentId":"370", "CreationDate":"2011-09-22T23:15:05.573", "Score":"3", "PostTypeId":"2", "OwnerUserId":"153", "LastActivityDate":"2011-09-22T23:15:05.573", "CommentCount":"1"}