{"OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}, "comments":[], "Body":"<p>By 'natural' you seem to be referring to what sounds (or phonemes) can be combined in what order. This is called <strong>phonotactics</strong>.</p>\n\n<p>For example, <em>mo</em> in your example <em>mobify</em> is a combination of a consonant and a vowel that fairly often occurs in English, in words such as <em>motor</em> (<em>for simplicity I'm ignoring here that spelling doesn't exactly reflect pronunciation - ultimately phonotactics is about what sounds/phonemes can combine and English spelling can be very misleading when it comes to pronunciation - but I hope the examples are straightforward</em>).</p>\n\n<p>But your example <em>jlkrtz</em> cannot be an English word because several combinations in this word are 'illegal' in the sense that they do not follow the sound laws of English. <em>jl</em> is not a legal consonant cluster, <em>kr</em> is, but <em>krtz</em> is not. </p>\n\n<p>English does allow fairly long consonant clusters, such as in <em>twelfths</em> /twɛlfθs/ (four consonants in the coda). But consonant clusters of this length are rare and only a fraction of all possible combinations are allowed. Just try replacing /θ/ with /b/, /p/, /m/, /n/, /z/ or /k/, none of these are allowed.</p>\n\n<p>For further details take a look at the 14 rules in this <a href=\"https://en.wikipedia.org/wiki/Phonotactics#English_Phonotactics\">Wikipedia article</a>.</p>\n\n<p><strong>P.S.:</strong> Nobody really pronounces very long consonant clusters except in very special contexts. <em>twelfths</em> has /twɛlfθs/ as so-called citation form. This pronunciation would be used when talking to learners of English (including children) or when speakers are aiming for very clear and accurate pronunciation. But in any common communication task at least one of the four coda consonants would usually be left out, even by newsreaders.</p>\n", "Id":"4376", "ParentId":"4375", "CreationDate":"2013-09-02T20:05:42.897", "Score":"10", "PostTypeId":"2", "OwnerUserId":"2278", "LastActivityDate":"2013-09-02T20:05:42.897", "CommentCount":"2"}