{"OwnerUser":{"UpVotes":"16", "WebsiteUrl":"http://www.math.u-psud.fr/~fouquet/", "DownVotes":"0", "Id":"1707", "AccountId":"1575488", "Views":"8", "Reputation":"461", "CreationDate":"2013-01-28T10:33:35.847", "DisplayName":"Olivier", "LastAccessDate":"2014-01-18T22:01:23.260"}, "comments":[], "Body":"<p>The assumption that language evolution is in any way analogous to darwinian species evolution seems to me to be completely incorrect. Here are two among the major differences:</p>\n\n<p>1) Species evolution is driven by differential rate of reproductive success between individuals, themselves dependent of differential heritable traits. Languages evolution does not function in this way at all, with differential rate of reproductive success probably ill-defined. Even if it were, it would be correlated to socio-historical phenomena and presumably not at all to heritable characteristics of languages. It is the Roman legions, not Latin's case system, which spawned the Romance family.</p>\n\n<p>and most importantly </p>\n\n<p>2) One of the core logical concepts of (contemporary) darwinian species evolution is the distinction between heritable and non-heritable traits; only the former contributing to evolution. In fact, the very premises on which your question is built require this concept; otherwise there is no meaningful distinction between genotype (the material encoding heritable traits) and phenotype (actual expressed observable characteristic of an individual). However, language acquired traits are of course heritable: if a language looses the masculine/feminine distinction in the course of its history, for instance, it is very likely that many of its offsprings will also lack this distinction.</p>\n\n<p>So I think it extremely unlikely that languages could have traits in their purported genotype which are not in their phenotype (so heritable traits with no observable expression) or conversely traits in their phenotype which are not in their genotype (so observable traits which are nonetheless not heritable). Or in other words, I doubt that the genotype-phenotype distinction makes any sense for languages.</p>\n\n<p>Your question as an interesting spin-off though: once understood that language evolution does not obey the rules of darwinian species evolution, one could wonder which formal rules it does obey. Heritability of acquired traits would be there maybe alongside drive to simplicity (because of the acquisition of languages by infants) and some interactions with phonology and morpho-syntax (inflectional systems probably cannot survive high rates of syncretism, for instance).</p>\n", "Id":"4382", "ParentId":"4381", "CreationDate":"2013-09-04T11:27:34.887", "Score":"5", "PostTypeId":"2", "OwnerUserId":"1707", "LastActivityDate":"2013-09-04T11:27:34.887", "CommentCount":"4"}