{"Body":"<p>The answer to your question, properly generalized, is the object of much active research. Of course, one can make lists of verbs allowing active, unaccusative (or ergative) and mediopassive constructions in a given language, but the theoretical generalizations allowing one to predict what will be in these lists does not exist, as far as I know.</p>\n\n<p>To give a flavor of the difficulty, notice that given an appropriate context, French transitive verbs tend to accept a mediopassive construction, even  those like <em>kill</em> which resist it strongly in Germanic languages. UPDATE: Contrast for instance</p>\n\n<p>I sell apples/I kill ants.</p>\n\n<p>Apples sell easily/*Ants kill easily.</p>\n\n<p>with</p>\n\n<p>Je vends des pommes/Je tue des fourmis.</p>\n\n<p>Les pommes se vendent bien/Les fourmis se tuent facilement.</p>\n\n<p>where the last sentence is perhaps a bit strange out of context but perfectly OK embedded in an appropriate discourse e.g</p>\n\n<p>J'ai de gros problèmes de fourmis dans mon jardin. Les fourmis noires sont absolument increvables mais heureusement les fourmis rouges se tuent assez facilement. (I have huge ant problems in my garden. Black ants are absolutely indestructible but fortunately red ants kill rather easily).</p>\n\n<p>This is even more so in other Romance languages (the Spanish equivalent of Ants kill easily, for instance, seems quite natural). On the other hand of the spectrum, all Japanese transitive verbs have an ergative form.</p>\n\n<p>For recent research on the topic, you can read the work of Artemis Alexiadou, for instance.   </p>\n", "Id":"4390", "ParentId":"4289", "LastEditorUserId":"1707", "CreationDate":"2013-09-05T13:40:18.287", "OwnerUserId":"1707", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-09-05T15:02:01.027", "LastEditedUser":{"UpVotes":"16", "WebsiteUrl":"http://www.math.u-psud.fr/~fouquet/", "DownVotes":"0", "Id":"1707", "AccountId":"1575488", "Views":"8", "Reputation":"461", "CreationDate":"2013-01-28T10:33:35.847", "DisplayName":"Olivier", "LastAccessDate":"2014-01-18T22:01:23.260"}, "LastActivityDate":"2013-09-05T15:02:01.027", "Score":"1", "CommentCount":"5", "OwnerUser":{"UpVotes":"16", "WebsiteUrl":"http://www.math.u-psud.fr/~fouquet/", "DownVotes":"0", "Id":"1707", "AccountId":"1575488", "Views":"8", "Reputation":"461", "CreationDate":"2013-01-28T10:33:35.847", "DisplayName":"Olivier", "LastAccessDate":"2014-01-18T22:01:23.260"}}