{"comments":[], "Body":"<p>There are many non-Semitic languages written in Arabic-based script.</p>\n\n<ul>\n<li>Persian or Farsi, presently used in Iran is an Indo-European language and use a variant of the Arabic script.</li>\n<li><a href=\"http://en.wikipedia.org/wiki/Mozarabic_language\" rel=\"nofollow\">Mozarabic language</a> was a language used by Spanish Christians back when Arabic was the main language of learning and literature. It is primarily written in the Arabic script. It is a Romance language, and its vocabulary was derived from Latin</li>\n<li>During the sultanates era, Malay (which is an Austronesian language) used to be written in an Arabic script, see <a href=\"http://en.wikipedia.org/wiki/Jawi_alphabet\" rel=\"nofollow\">Jawi</a>. Today people use the Latin alphabet, but Jawi is still used in several context. In fact, I have first-hand experience with Jawi writing, so I am going to elaborate.</li>\n</ul>\n\n<p>In Riau, an Indonesian province which is the Indonesian centre of Malay culture, Jawi (or as we call it, <em>Arab Melayu</em>) is taught in school all the way to high school. It is also widely used in road signs, signs of buildings, and even a few books. To handle the difficulties you highlighted, there are several rules/changes.</p>\n\n<ul>\n<li>Non-original arabic letters are introduced to represent sounds that doesn't exist in arabic. Some are borrowed from the Persian script, and it introduced several new ones to represent sounds that doesn't exist in Arabic or Persian.</li>\n<li>Many vowels are represented by their closest consonant, e.g. waw (normally representing w) also represents u and o sounds. This isn't that far from the original Arabic usage because waw is also used in Arabic to represent long u sound.</li>\n<li>The schwa vowel does not appear in the written form</li>\n<li>The a sound can be represented in several ways, there is a slightly complicated rule regarding this.</li>\n<li>Arabic loanwords are written in the original Arabic form, so the above rules are ignored.</li>\n</ul>\n\n<p>There are several other rules, but it's not that complicated. I remember reading the rules which fits merely 2 or 3 book pages including examples, and after this I never have any problem with this subject in school. After certain level, this subject involves studying Malay literature, culture and history in full Jawi text.</p>\n", "Id":"4394", "ParentId":"4365", "CreationDate":"2013-09-08T07:28:42.777", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2447", "LastActivityDate":"2013-09-08T07:28:42.777", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2447", "AccountId":"1969036", "Views":"1", "Reputation":"11", "CreationDate":"2013-09-08T06:48:29.903", "DisplayName":"user69715", "LastAccessDate":"2014-01-01T06:06:00.083"}}