{"OwnerUser":{"UpVotes":"78", "WebsiteUrl":"http://www.lac.u-psud.fr/spip.php?rubrique256", "Id":"120", "AccountId":"112131", "CreationDate":"2011-09-14T14:29:11.410", "AboutMe":"<p>Researcher in quantum information, mainly on cryptography.</p>\n", "Age":"38", "Location":"Paris, France", "DownVotes":"0", "Views":"1", "Reputation":"222", "DisplayName":"Frédéric Grosshans", "LastAccessDate":"2013-12-26T17:11:29.637"}, "comments":[], "Body":"<p>A language, is a mean of communication shared by a community and which includes a grammar and the ability to speak about anything. It is the most often verbal, and is often associated with a way to write it down. There are some exception, the most prominent being the <a href=\"https://en.wikipedia.org/wiki/Sign_language\" rel=\"nofollow\">sign languages</a> used by deaf communities.</p>\n\n<p>However, the same language can have several material forms which do not change them enough so that they are considered a different language. For example, English can be spoken, written down by hand, typed in an email, written in <a href=\"https://en.wikipedia.org/wiki/Braille\" rel=\"nofollow\">Braille</a> or signed as <a href=\"https://en.wikipedia.org/wiki/Manually_coded_English\" rel=\"nofollow\">manually coded English</a>, it stays the same language: English. On the other hand, an email can be in English, German or French, the technique of transmission stays the same, but the language change.</p>\n\n<p>Some means of communication share some properties of languages, and are therefore sometimes called \"language\", but they are not real language in the linguistic sense :</p>\n\n<ul>\n<li><p><a href=\"https://en.wikipedia.org/wiki/Body_language\" rel=\"nofollow\">Body language</a> is a (often subconcious) way to transmit some informations. But it is of course impossible for body language to convey any moderate elaborate meaning like \"Don't forget to buy Apples at the market tomorrow\", while it's trivial in any language (spoken or signed). </p></li>\n<li><p>Computer languages and the mathematical formalism have some structure which may recall natural languages's grammar, and the capacity to convey some elaborate meaning, but they lack the possibility to speak about anything a true language has.</p></li>\n<li><p>Secret languages like <a href=\"https://en.wikipedia.org/wiki/Pig_Latin\" rel=\"nofollow\">Pig Latin</a> or <a href=\"https://en.wikipedia.org/wiki/Thieves%27_Cant\" rel=\"nofollow\">Thieves' cant</a> are often a variation of a natural language, either through a systematic rule (Pig Latin) or a a different vocabulary (Thieves' cant), but they often preserve a lot of the original language characteristic, and they are rarely a true distinct language, but mainly an encrypted version of it.</p></li>\n</ul>\n", "Id":"4400", "ParentId":"4396", "CreationDate":"2013-09-08T15:39:52.467", "Score":"1", "PostTypeId":"2", "OwnerUserId":"120", "LastActivityDate":"2013-09-08T15:39:52.467", "CommentCount":"0"}