{"comments":[], "Body":"<p>A good way to have rough but well informed advices on how to process scripts is to look at the <a href=\"http://www.unicode.org/versions/latest/\" rel=\"nofollow\">Unicode standard</a>. The result does not contain all the nuance needed for a high quality typography, but still a lot of information.</p>\n\n<p>The document to read here is the <a href=\"http://www.unicode.org/reports/tr14/\" rel=\"nofollow\">Unicode Standard Annex 14: Line Breaking algorithm</a> and the accompanying <a href=\"http://www.unicode.org/Public/UNIDATA/LineBreak.txt\" rel=\"nofollow\"><code>LineBreak.txt</code> data file</a> . There, the paragraph 3.1 says :</p>\n\n<blockquote>\n  <p>Three principal styles of context analysis determine line break opportunities.</p>\n  \n  <ol>\n  <li>Western: spaces and hyphens are used to determine breaks</li>\n  <li>East Asian: lines can break anywhere, unless prohibited</li>\n  <li>South East Asian: line breaks require morphological analysis</li>\n  </ol>\n  \n  <p>The Western style is commonly used for scripts employing the space character. Hyphenation is often used with space-based line breaking to provide additional line break opportunities—however, it requires knowledge of the language and it may need user interaction or overrides.</p>\n  \n  <p>The second style of context analysis is used with East Asian ideographic and syllabic scripts. In these scripts, lines can break anywhere, except before or after certain characters. The precise set of prohibited line breaks may depend on user preference or local custom and is commonly tailorable.</p>\n  \n  <p>Korean makes use of both styles of line break. When Korean text is justified, the second style is commonly used, even for interspersed Latin letters. But when ragged margins are used, the Western style (relying on spaces) is commonly used instead, even for ideographs.</p>\n</blockquote>\n\n<p>If you look the details of the <code>LineBreak.txt</code> file, you'll see that all Han (Hanzi/Kanji/Hanja) characters, most of the Kana, the Yi syllabic characters and some pictographic symbols (e.g. ☺, ),  are in the ID (for IDeographic) class, which allows breaking at any place, also in the middle of a word. The presence of the <a href=\"https://en.wikipedia.org/wiki/Yi_script\" rel=\"nofollow\">modern Yi script</a>, which is a pure syllabary, in this list shows that this property of breaking at any moment is more linked to tradition than to the logographic/phonetic nature of the script.</p>\n\n<p>Two other logographic script are encoded in Unicode 6.2, Egyptian hieroglyphs and Sumero-Akkadian cuneiform. In both cases, the corresponding characters are of category AL, like western alphabets. This means no line-breaking, axcept at specipc places, allowed by punctuation (including spaces and word divider.)  Note that the <a href=\"https://en.wikipedia.org/wiki/Quadrat_%28hieroglyph_block%29\" rel=\"nofollow\">grouping of signs in hieroglyphic texts</a> is considered beyond the scope of Unicode (see p. 25/488 of the Unicode Standard 6.2 <a href=\"http://www.unicode.org/versions/Unicode6.2.0/ch14.pdf\" rel=\"nofollow\">(pdf)</a>). This add a structure inside a line and clearly forbids linebreaking for Egyptian compound.</p>\n", "Id":"4418", "ParentId":"1124", "CreationDate":"2013-09-10T16:14:03.997", "Score":"3", "PostTypeId":"2", "OwnerUserId":"120", "LastActivityDate":"2013-09-10T16:14:03.997", "OwnerUser":{"UpVotes":"78", "WebsiteUrl":"http://www.lac.u-psud.fr/spip.php?rubrique256", "Id":"120", "AccountId":"112131", "CreationDate":"2011-09-14T14:29:11.410", "AboutMe":"<p>Researcher in quantum information, mainly on cryptography.</p>\n", "Age":"38", "Location":"Paris, France", "DownVotes":"0", "Views":"1", "Reputation":"222", "DisplayName":"Frédéric Grosshans", "LastAccessDate":"2013-12-26T17:11:29.637"}}