{"comments":[], "Body":"<p>I won't claim to be an expert on statistical machine translation (SMT) by any means, but as I understand it (an understanding with which my cursory Googling appears to agree), differing word orders is actually quite a large problem in SMT, and causes many problems, as you expect. As with any difficult problem, there are dozens of solutions which have been attempted to varying degrees of success.</p>\n\n<p>Theoretically, if your statistical language model is robust enough, these differences in word order would be accounted for even without any foreknowledge of either language. The problem is that a model that robust is expensive: not just in the traditional sense, but also in processing power. I imagine that evaluating texts with such a model would take a prohibitively long amount of time.</p>\n\n<p>So basically, yes: all of the solutions of which I am aware are given at least <strong>some</strong> amount  of data about the structure of a language, and then the statistical model expands from there. One approach which shows up in many results in my Google search is <strong>word reordering</strong> -- basically (at least as I understand it, and perhaps a bit oversimplified), finding the best 1:1 correspondence in word order and evaluating the texts with the statistical model from there.</p>\n", "Id":"442", "ParentId":"387", "CreationDate":"2011-09-23T00:49:01.347", "Score":"4", "PostTypeId":"2", "OwnerUserId":"30", "LastActivityDate":"2011-09-23T00:49:01.347", "OwnerUser":{"UpVotes":"25", "WebsiteUrl":"http://rintaun.tumblr.com", "Id":"30", "AccountId":"221520", "CreationDate":"2011-09-13T20:56:36.397", "AboutMe":"<p>I graduated from Ohio University in 2011 with a B.A. in Linguistics with a minor in Japanese. Nearly half of my time enrolled at Ohio was spent studying at Chubu University near Nagoya, Japan. I plan eventually to go to graduate school for foreign language education, to become certified to teach Japanese at the secondary level.</p>\n\n<p>In the mean time, however, I program (primarily in PHP and SQL). I also recently began working as a freelance Japanese-to-English translator, though I've translated anime and manga as a hobby in the past.</p>\n", "Age":"27", "Location":"Pittsburgh, PA", "DownVotes":"3", "Views":"10", "Reputation":"486", "DisplayName":"rintaun", "LastAccessDate":"2013-12-04T21:12:24.253"}}