{"comments":[], "Body":"<blockquote>\n  <p><strong>Q:</strong> A word like the name \"Barry\" might be very common in one of the corpus files (say a novel) and this will result in a larger than expected frequency for this word if you simply add all of its occurrences in the corpus and divide my 7 million.</p>\n</blockquote>\n\n<p>Many corpora (except very large ones) only include parts of larger texts like novels (such as 2,000 words) to circumvent this problem. If, however, you have to use a corpus where such imbalances occur there is a way to address this problem.</p>\n\n<ul>\n<li>If you want to <strong>estimate the frequency of a word type</strong> you could give two normalised frequencies. An uncorrected frequency, and a corrected frequency that excludes tokens found in texts where the word on question is very frequent. For example, if the uncorrected frequency of <em>work</em> in the corpus is 50 per million words (pmw) you could exclude all texts where <em>work</em> is more than five times as frequent (more than 250 pmw) and calculate the corrected frequency based on the remaining texts in the corpus.</li>\n<li>If you want to <strong>compare the frequency of a word in two corpora</strong> the cut-off criterion should be the same for both corpora. It could for example be 5 times the average frequency of the word in both corpora. In any case you need to validate claims that a word is more frequent in one corpus by using a statistical test such as the <a href=\"http://ucrel.lancs.ac.uk/llwizard.html\" rel=\"nofollow\">log likelihood test</a>.</li>\n</ul>\n\n<blockquote>\n  <p><strong>Q:</strong> Words under a certain frequency should be ignored but how do I establish this threshold frequency? For example, if the word \"Cranberry\" occurs twice in the entire corpus, I can hardly claim that its frequency is 2/7000000.</p>\n</blockquote>\n\n<p>Yes, you can, and in fact that is the only thing you can claim about the frequency of the word in the <em>corpus</em>. A different question is whether the word in question can be claimed to be <strong>more or less frequent in corpus A than in corpus B</strong>. That can be tested using the log likelihood test.</p>\n\n<p>You could also ask</p>\n\n<blockquote>\n  <p>Given a frequency x of a word in a corpus, what is the likelihood that the true frequency of the word in the population is y?</p>\n</blockquote>\n\n<p>This could be operationalised by imagining that you compile another corpus (with texts from the same registers!). What is then the likelihood that in the new corpus the frequency of the word is y?</p>\n\n<p>Let's say in corpus x the word has a frequency of 2 pmw and you want to know how likely it is that in the population it is 20 pmw. Assuming your first corpus has 1,000,000 words, we imagine that you compile another corpus of 1,000,000 words and you find the word in question 20 times in that corpus. Using the <a href=\"http://ucrel.lancs.ac.uk/llwizard.html\" rel=\"nofollow\">log likelihood calculator</a>, you get a log likelihood (also called G2) of 17.09. If you scroll down on the webpage you find a key for the log likelihood values, which tells you</p>\n\n<pre><code>99.99th percentile; 0.01% level; p &lt; 0.0001; critical value = 15.13 \n</code></pre>\n\n<p>Your G2 of 17.09 is higher than the critical value of 15.13, i.e. it is extremely unlikely that in the population the word occurs with a frequency of 20 pmw. In fact, there is a likelihood greater than 0.95 that the word is not more frequent than 8 pmw in the population (test this by putting 8 instead of 20 for the second corpus in the form).</p>\n", "Id":"4432", "ParentId":"4429", "CreationDate":"2013-09-12T14:42:23.650", "Score":"2", "PostTypeId":"2", "OwnerUserId":"2278", "LastActivityDate":"2013-09-12T14:42:23.650", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}