{"Body":"<p>The question concerns why certain semantic features seem to be 'unmarked'. As an example, we can consider the fact that, at least in certain (especially older) varieties of English, the masculine pronoun <em>he/him</em> is used as the 'default'. Consider a scenario where a class consisting of both male and female students have finished their homework, (1) is generally considered to be felicitous, whereas (2) is not:</p>\n\n<blockquote>\n  <p>(1) Every student has finished his homework<br>\n  (2) # Every student has finished her homework</p>\n</blockquote>\n\n<p>(2) is only licit in a scenario where it is <em>known</em> by the speaker that <em>every</em> student who has finished her homework is female.</p>\n\n<p>Within formal semantics, so-called 'phi-features', such as gender features, are modelled as <em>presupposition triggers</em>. This means that a gendered pronoun is treated in formal semantics as a partial function from individuals to individuals. For example, we can treat the denotation of 'she' as a partial function from individuals to individuals just in case the referent is female - the output of the function is undefined for non-female referents. We capture the unmarkedness of 'he' by not associating the feature [masculine] with <em>any</em> presupposition. Semantically, 'he' merely denotes the referent. The feature [masculine] is semantically vacuous.</p>\n\n<p>We now introduce the pragmatic principle 'maximise presupposition', which means, without getting into the formal specifics, that given a set of alternative sentences, we prefer to use the alternative that is presuppositionally stronger. This explains the fact that, if all students are known to be female, (2) is licit, whereas (1) is not. (1) and (2) are semantically identical aside from the fact that (2) is presuppositionally stronger, and in this instance, the presupposition associated with (2) (that every student is female) is satisfied.</p>\n\n<p>The masculine pronoun can only be used when the presupposition associated with the feminine pronoun is not met. (2) presupposes that for each student, that student is female. In a scenario with a mixed-gendered class, the presupposition is not met, which explains why (2) is infelicitous in this scenario, whereas (1) is not. Since [masculine] does not introduce any presupposition, the masculine pronoun may be used in a mixed-gender scenario.</p>\n\n<p>Similar analyses can be (and have been) given for animacy and number features. See Yasutada Sudo's (2012) thesis for an excellent overview of the pertinent data and the formal specifics of the kind of analysis i outline here: <a href=\"http://web.mit.edu/ysudo/www/pdf/dissertation-final.pdf\" rel=\"nofollow\">http://web.mit.edu/ysudo/www/pdf/dissertation-final.pdf</a></p>\n\n<p><strong>Note</strong> Before someone points it out, i want to make it clear that in <em>my</em> English, the masculine pronoun isn't unmarked. Rather i use the plural pronoun 'they' as a bound pronoun in a mixed gender scenario, or in a scenario where gender isn't known. It's relatively trivial to give an account of this variety in a similar framework: We simply say that both [masculine] and [feminine] are presupposition triggers, whereas 'they' is semantically vacuous. The role of number features introduces additional complications here, but they can be accommodated. See the linked-to thesis for details.</p>\n", "Id":"4434", "ParentId":"4433", "LastEditorUserId":"2328", "CreationDate":"2013-09-12T19:23:09.777", "OwnerUserId":"2328", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-09-12T19:29:02.397", "LastEditedUser":{"UpVotes":"123", "WebsiteUrl":"https://sites.google.com/site/patrickdelliott/", "ProfileImageUrl":"http://i.stack.imgur.com/HGYBE.jpg", "Id":"2328", "AccountId":"3146009", "CreationDate":"2013-08-07T11:16:59.797", "AboutMe":"<p>I'm a PhD student in Linguistics at University College London. My primary area of interest is generative linguistics, and specifically syntactic and semantic theory. More narrowly still, i'm interested in ellipsis, comparatives, and binding theory. <a href=\"https://twitter.com/patrickdelliott\" rel=\"nofollow\">Follow me on twitter!</a></p>\n", "Location":"London, United Kingdom", "DownVotes":"43", "Views":"43", "Reputation":"970", "DisplayName":"P Elliott", "LastAccessDate":"2014-01-19T02:32:31.120"}, "LastActivityDate":"2013-09-12T19:29:02.397", "Score":"3", "CommentCount":"2", "OwnerUser":{"UpVotes":"123", "WebsiteUrl":"https://sites.google.com/site/patrickdelliott/", "ProfileImageUrl":"http://i.stack.imgur.com/HGYBE.jpg", "Id":"2328", "AccountId":"3146009", "CreationDate":"2013-08-07T11:16:59.797", "AboutMe":"<p>I'm a PhD student in Linguistics at University College London. My primary area of interest is generative linguistics, and specifically syntactic and semantic theory. More narrowly still, i'm interested in ellipsis, comparatives, and binding theory. <a href=\"https://twitter.com/patrickdelliott\" rel=\"nofollow\">Follow me on twitter!</a></p>\n", "Location":"London, United Kingdom", "DownVotes":"43", "Views":"43", "Reputation":"970", "DisplayName":"P Elliott", "LastAccessDate":"2014-01-19T02:32:31.120"}}