{"OwnerUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}, "comments":[], "Body":"<p>Guglielmo Cinque wrote a book called <em>Adverbs and Functional Heads: A cross-linguistic perspective</em> wherein he (ambitiously) tries to construct a cross-linguistic universal hierarchy of functional categories.  He relies on adverb placement, for example facts like the following:</p>\n\n<pre>\n(1)  John luckily mistakenly kissed Mary\n(2) *John mistakenly luckily kissed Mary\n(3)  John mistakenly tenderly kissed Mary\n(4) *John tenderly mistakenly kissed Mary\n</pre>\n\n<p>The contrast between (1) and (2) shows that adverbs related to the speaker's perception of the event (luckily) must precede adverbs related to the subject's state of mind (mistakenly).  And subject-oriented adverbs precede adverbs describing the event itself (tenderly), as (3) and (4) show.  He has many, many more categories of adverbs than just these, and by pairwise comparisons he puts them all into an ordered sequence.  He then argues that each adverb is associated with a functional head, and that the heads are also so ordered.</p>\n\n<p>Mark Baker proposed the mirror principle in <a href=\"http://www.jstor.org/stable/4178442\" rel=\"nofollow\">this paper</a> (JSTOR link).  It says that, of two affixes, the one which is syntactically closer to the stem must be morphologically colser to the stem as well.  So in a structure like the following, wherein Z is the root and X and Y are suffixes, we predict Z-Y-X and not Z-X-Y.</p>\n\n<pre>\n   XP\n  /  \\\n X   YP\n    /  \\\n   Y    Z\n</pre>\n\n<p>Cinque's universal hierarchy plus the Mirror Principle plus some version of the Head Movement Constraint (no skipping positions as you move up the tree gathering affixes) gets you what you want.  If some relatively high functional head is expressed as a verbal affix, the stem must have moved at least that far, so the lower head must also be affixed to the root, closer than the higher one.</p>\n\n<p>I don't know Bybee's work and my recollection of the details of Cinque is hazy, but they seem to roughly align in the order you say.</p>\n", "Id":"448", "ParentId":"365", "CreationDate":"2011-09-23T04:08:58.013", "Score":"4", "PostTypeId":"2", "OwnerUserId":"46", "LastActivityDate":"2011-09-23T04:08:58.013", "CommentCount":"1"}