{"Body":"<p>It is standard to talk about the <em>prosodic hierarchy</em>, which is a theoretical construct that divides utterances into smaller, phonologically relevant constituents called <em>phrases</em>, which are in turn divided into smaller constituents called <em>prosodic words</em>, and so on. There is not an absolute consensus as to what the exact levels of the prosodic hierarchy are or even how many there are, and (as with many theoretical constructs in linguistics) slightly different models lend themselves to different languages. For example, the mora is a prosodic unit that is more motivated in some languages than in others.</p>\n\n<p>Here is a (non-exhaustive) list of levels in the hierarchy:</p>\n\n<ul>\n<li>Utterance </li>\n<li>Phrase (some distinguish a <em>major phrase</em> and a <em>minor\nphrase</em>) </li>\n<li>Word</li>\n<li>Foot </li>\n<li>Syllable </li>\n<li>Mora</li>\n</ul>\n\n<p>Generally, each presumed level in the prosodic hierarchy is motivated by the observation that certain phonological processes (some may be prosodic in nature and others may be segmental) are associated with that constituent. For example, in standard Japanese there is a prosodic constituent called the <em>accentual phrase</em>, in which only one accented syllable may occur. If multiple words that are lexically accented are combined into a single accentual phrase, all but one of the accents gets deleted.</p>\n\n<p>Often, presumed prosodic constituents are motivated by more phonetic-y phenomena. For example, in English it is common to observe the lengthening of word-final, phrase-final, and utterance-final syllables. In many languages there is also a pitch reset (where the downward trend of the overall pitch range—sometimes called <em>declination</em>—stops and starts again at a higher pitch) at phrase boundaries.</p>\n\n<p>The usage of the term <em>prosody</em> in the conlang grammar you linked to is a bit confusing and seems to conflate <em>prosody</em> and <em>intonation</em>. It's not really that languages \"distinguish\" between \"sentence\" and \"phrase\" prosody; rather, as described above, different phonological and phonetic processes are observed to occur at different prosodic levels (i.e. over different prosodic constituents).</p>\n\n<p>Often-cited references for the prosodic hierarchy include those by Selkirk, Pierrehumbert and Beckman, and Hayes. I'm not sure how technical you want to get, but if you search for \"prosodic hierarchy\" online, you'll find links to online course materials that are relevant for your question.</p>\n", "Id":"4490", "ParentId":"4489", "LastEditorUserId":"385", "CreationDate":"2013-09-16T12:24:02.650", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-09-16T15:52:59.233", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2013-09-16T15:52:59.233", "Score":"5", "CommentCount":"1", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}