{"comments":[], "Body":"<p>The take of an Israeli linguist:</p>\n\n<p>There must be a consensus among scholars about one thing: Modern Israeli Hebrew emerged as a result of language revival, and as such its development from its so-called origins is different from the development of nearly all other living languages today (and all fully-fledged languages spoken by a monolingual community). At the absence of documented precedents of language revival, there can't be any research-based 'developmental model' relevant for Modern Hebrew, so any 'scholarly' opinion, even by the most learned and experienced historical linguists, would be of limited value. It is not proper to compare contact influences of Norman French on English or Slavonic on Romanian etc., because English/Romanian/etc. were living mother tongues at the time they were influenced, while Modern Israeli Hebrew, at its very beginning, was not.</p>\n\n<p>I think most scholars think that Zuckermann claims the obvious: Hebrew was revived by speakers of other languages (mostly Indo-European), albeit with profound knowledge of Classical Hebrew (a semitic language) as a second language. It is thus inevitable that the revived language would bear grammar components of both Classical Hebrew and the revivers' native language(s). Very few linguists would be concerned with this question further, because linguists are language analysts - they analyze language components, which are uncountable and unweightable - one can't really say 'there are N,M,O Classical Hebrew components with the respective weights 1/2/3, P,Q Yiddish components with weights 1,2, X independently-innovated components with weight 1, therefore Modern Hebrew is Semitic/Indo-European/What-have-you'. Once we agree that Modern Hebrew emerged based on substantial contributions of two or more sources, it makes little scientific sense characterize the language 'as a whole'. Zuckermann's insistence on discussing the holistic nature of Modern Hebrew as 'mixed', and his dedication of time and effort to this discussion, is simply considered as non-scientific. This is further exacerbated by his insistence on the label, i.e. the use of 'Israeli' instead of 'Hebrew'. Thus, it is most likely that scholars would merely dismiss Zuckermann's strong claims about the nature and origin of Modern Hebrew, but at the same time agree with some/most of his specific claims about the origin of specific components of Modern Hebrew grammar.</p>\n\n<p>The second part of the original question is particularly problematic: Is a grammatical component retained from Classical Hebrew essentially 'Semitic'? What if it had been borrowed into Classical Hebrew from Classical Egyptian or from Philistine? Is a component retained from Yiddish necessarily 'Indo-European'? What if it was a Yiddish innovation not shared with any Indo-European language? What if it was borrowed into Yiddish from Liturgical Hebrew, and it's retention in Modern Hebrew is faithful to its use in Yiddish, not in Liturgical Hebrew? What about Modern Hebrew grammatical innovations, which are plenty (e.g. the stress system)? Can they be assigned any genetic label other than 'Modern Hebrew'?</p>\n", "Id":"4498", "ParentId":"89", "CreationDate":"2013-09-17T09:55:57.970", "Score":"10", "PostTypeId":"2", "OwnerUserId":"2480", "LastActivityDate":"2013-09-17T09:55:57.970", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2480", "AccountId":"3314380", "Views":"0", "Reputation":"101", "CreationDate":"2013-09-17T09:55:57.970", "DisplayName":"Roy", "LastAccessDate":"2013-09-17T09:55:57.970"}}