{"Body":"<p>UPDATE: This update aims at clarifying many points which were raised in comments. Many thanks to dainichi for correcting the Japanese (all remaining embarrassing errors of course remain solely my own). </p>\n\n<p>I'm going to make two assumptions. The first is that the Japanese sentence you have in mind is (1), the most literal translation I can imagine.</p>\n\n<p>(1) 象は　鼻が　長い。</p>\n\n<p>Zoo-ha hana-ga nagai\nElephant TOP trunk NOM long</p>\n\n<p>The second is that you are looking for an answer within X-bar theory as it is currently understood and practiced. Then </p>\n\n<p>[.TopP [.TopP [.N Zoo  ] ha ] [.TP Hana [.T -i [.Adj Naga  ]] ] ]</p>\n\n<p>with post-syntactic addition of the NOM marker <em>ga</em> and morphological head movement of the bare adjective to the tense marker seems a plausible enough representation, though of course much investigations would be needed in order to determine if it is anywhere near correct. This representation (hopefully) obeys some of the standard constraints nowadays commonly believed (by people doing that kind of stuff) to hold for arborescent representations, namely: it is a binary tree and it satisfies Kayne's Linear Correspondence Axiom. In particular, it is very much <em>not</em> flat.</p>\n\n<p>I am afraid I'm unable to understand P Elliott remarks in comments. Is the problem that I used bare phrase structures notations rather than pure X-bar notations? I will say this though, I took Atamiri's question to be whether X-bar theory treated topic sentences as flat trees, so I proposed a not too absurd tree showing that this was not the case. This tree embodies a number of assumptions, most conspicuously that topic elements are base-generated above TP (but many other, starting with the status of the nominative marker or the status of adjective in Japanese predication relations). I made a minimal effort to make non-absurd choices but my intention was not to accurately describe predication in Japanese.</p>\n\n<p>Finally, non-contrastive topics in Japanese are indeed usually thought to be base generated in the left periphery. Contrastive topics probably move. See for instance :</p>\n\n<p>On the position of topics in Japanese (Reiko Vermeulen)</p>\n\n<p>Topic prominency in Japanese (Kishimoto Hideki)</p>\n\n<p>UPDATE2: P Elliott correctly remarks in comments that a PRO should probably appear somewhere in the TP. I must confess that I have no clear idea where it should be, and so omitted it.</p>\n", "Id":"4502", "ParentId":"4494", "LastEditorUserId":"1707", "CreationDate":"2013-09-18T14:00:16.877", "OwnerUserId":"1707", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-09-19T14:56:49.790", "LastEditedUser":{"UpVotes":"16", "WebsiteUrl":"http://www.math.u-psud.fr/~fouquet/", "DownVotes":"0", "Id":"1707", "AccountId":"1575488", "Views":"8", "Reputation":"461", "CreationDate":"2013-01-28T10:33:35.847", "DisplayName":"Olivier", "LastAccessDate":"2014-01-18T22:01:23.260"}, "LastActivityDate":"2013-09-19T14:56:49.790", "Score":"3", "CommentCount":"15", "OwnerUser":{"UpVotes":"16", "WebsiteUrl":"http://www.math.u-psud.fr/~fouquet/", "DownVotes":"0", "Id":"1707", "AccountId":"1575488", "Views":"8", "Reputation":"461", "CreationDate":"2013-01-28T10:33:35.847", "DisplayName":"Olivier", "LastAccessDate":"2014-01-18T22:01:23.260"}}