{"Body":"<p>acattle's comment that there is a trade-off between inflectional complexity and strict word order is a good answer to your question. I think it would really help to illustrate this with some examples.</p>\n\n<p>First of all, let's look at <strong>English word order</strong> (actually it's the order of <strong>constituents</strong>, not words):</p>\n\n<blockquote>\n  <p>Subject Verb Object</p>\n  \n  <p>The dog bit the man.</p>\n  \n  <p>The man bit the dog.</p>\n</blockquote>\n\n<p>English word order is SVO. If you move the object to subject position and subject to object position the meaning of the sentence changes fundamentally. <em>The dog bit the man</em> is not the same as <em>The man bit the dog.</em></p>\n\n<p>In German, however, you can reverse the order of these consituents without changing the (truth-conditional) meaning of the sentence:</p>\n\n<blockquote>\n  <p>Der Hund biß den Mann. (SVO)</p>\n  \n  <p>Den Mann biß der Hund. (OVS)</p>\n</blockquote>\n\n<p><em>Den Mann</em> is accusative, so although it's in first position in the second sentence, it's still clear that <em>the man/den Mann</em> is the object in both sentences. Word order is free in German in the sense that these two sentences describe the same action. However, OVS word order is marked and might be used to stress the identity of the object, somewhat like <em>It was the man that was bitten by the dog, not the woman.</em></p>\n\n<p>In German you can move constituents around because they are marked by case. In English you can't, but there are other strategies to do that: <em>It was the man that was bitten by the dog</em> shows two: Passive and it-cleft. </p>\n\n<p>(Other aspects like verb-second word order and the Vorfeld - Mittelfeld - Nachfeld distinction only show that German word order is not completely free - But still it is much more flexible than English word order.)</p>\n\n<p>However, German also has these syntactic options. As a native speaker of German and with some experience in teaching English to advanced learners of English, I don't really see how English discourse structure should be terribly hard to learn for native speakers of German. There are some idiosyncrasies, in the sense that one particular structure is more appropriate in a certain context in English, but another one in German. But you get that with any pair of two languages. What I do think is challenging, particularly for advanced learners of English, are choices in English syntax where there is no hard and fast rule. For example whether to use simple past or present perfect to express an action in the past, or whether to use the of-genitive or the s-genitive/possessive.</p>\n\n<p>Your friends might find English discourse structure challenging for their particular reasons - After all learners are individuals and everybody has their own way of learning a foreign language. Also, I think what you perceive as difficult in a foreign language and what actually is difficult for you can be two very different things (that's my personal experience from teaching - So I don't have any actual data to back this up).</p>\n", "Id":"4526", "ParentId":"4523", "LastEditorUserId":"2278", "CreationDate":"2013-09-23T08:03:21.037", "OwnerUserId":"2278", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-09-23T10:52:20.427", "LastEditedUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}, "LastActivityDate":"2013-09-23T10:52:20.427", "Score":"4", "CommentCount":"4", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}