{"Body":"<p>Copular clauses in English generally have a \"Topic BE Focus\" structure, rather than a \"Focus BE Topic\" structure. That is, the phrase that you're predicating something about precedes the copula; what you're predicating of that phrase follows the copula. </p>\n\n<p>In your example, you were predicating something about \"the guy behind you\", namely that you were mistaken as to his identity. You weren't predicating something about your wife (as you would have been if you had said \"I thought you were behind me\").</p>\n\n<p>This raises the non-linguistic question, which I'm not sure how to answer, of <em>why</em> we cognitively frame cases of mistaken identity in this way rather than the reverse: after all, if you're wrong about the identity of X because you think it's Y, aren't you also wrong about the identity of Y? But that's not how we think about it. If you were asked \"Whose identity were you mistaken about, in that scenario?\" you would answer \"The guy behind me\", not \"My wife\".</p>\n\n<p>In a similar vein, your example 2b would be fine in a scenario (a weird one, but bear with me) where the boy has learned a wrong meaning for the word \"mother\", and thinks it means \"any woman whose hand one happens to be holding\". Describing that case you could, I think, perfectly well say 2b. This is because what the boy is mistaken <em>about</em> is (the meaning of) \"his mother\", so that goes into the Topic position, while in 2a what he is mistaken about is the identity of \"the woman whose hand he was holding\".</p>\n", "Id":"4537", "ParentId":"4535", "LastEditorUserId":"2411", "CreationDate":"2013-09-24T02:10:01.033", "OwnerUserId":"2411", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-09-24T02:43:08.473", "LastEditedUser":{"UpVotes":"80", "WebsiteUrl":"", "DownVotes":"24", "Id":"2411", "ProfileImageUrl":"https://www.gravatar.com/avatar/5e5b9f5cfa370b99b7b7fdaa27454de1?s=128&d=identicon&r=PG&f=1", "AccountId":"3231657", "Views":"10", "Reputation":"1342", "CreationDate":"2013-08-28T19:22:30.673", "DisplayName":"TKR", "LastAccessDate":"2014-01-19T02:45:52.557", "AboutMe":""}, "LastActivityDate":"2013-09-24T02:43:08.473", "Score":"5", "OwnerUser":{"UpVotes":"80", "WebsiteUrl":"", "DownVotes":"24", "Id":"2411", "ProfileImageUrl":"https://www.gravatar.com/avatar/5e5b9f5cfa370b99b7b7fdaa27454de1?s=128&d=identicon&r=PG&f=1", "AccountId":"3231657", "Views":"10", "Reputation":"1342", "CreationDate":"2013-08-28T19:22:30.673", "DisplayName":"TKR", "LastAccessDate":"2014-01-19T02:45:52.557", "AboutMe":""}}