{"comments":[], "Body":"<p>As a native speaker of French, my feeling is that your premise that the phenomenon is primarily of cognitive origin is most likely false. It is not the case, I think, that I conceptualize water differently when thinking/speaking in French or in English, it is rather that the same cognitive process are not syntactically encoded in the same ways in these two languages. Common nouns in French syntactically require an article, no matter what, so speakers have to resort to some choices when none is especially obvious from a cognitive or referential point of view.</p>\n\n<p>For pure predicative assertions as <em>L'eau est liquide, Le tigre est un animal</em> no choice is possible as far as I can tell: the definite article has to be used. But as soon as one leaves this simple context, my intuition is not so good. For instance <em>Un chimpanzé adore les bananes</em> (A chimp loves bananas) and <em>Le chimpanzé adore les bananes</em> (The chimp loves bananas) both seem equally degraded with respect to the perfect <em>Les chipanzés adorent les bananes</em> but nevertheless acceptable to my ear (with the meaning Chimps love bananas). Even predication relations which are somewhat qualified open choices: <em>L'eau est liquide</em> but both <em>L'eau à 0 degré est solide</em> and <em>Une eau à 0 degré est solide</em> (with a subtle difference in meanings that is not so easy to describe).</p>\n\n<p>Note finally that some Romance language, e.g Spanish, have an extra syntactic mark that can be adduced to an indefinite noun (this is sometimes called differential object marking) with subtle impacts on definiteness, specificity and the syntactic properties of the object.   </p>\n", "Id":"4551", "ParentId":"3013", "CreationDate":"2013-09-26T08:13:38.087", "Score":"2", "PostTypeId":"2", "OwnerUserId":"1707", "LastActivityDate":"2013-09-26T08:13:38.087", "OwnerUser":{"UpVotes":"16", "WebsiteUrl":"http://www.math.u-psud.fr/~fouquet/", "DownVotes":"0", "Id":"1707", "AccountId":"1575488", "Views":"8", "Reputation":"461", "CreationDate":"2013-01-28T10:33:35.847", "DisplayName":"Olivier", "LastAccessDate":"2014-01-18T22:01:23.260"}}