{"Body":"<p>Istvan Kecskes uses the term \"situation-bound utterance\" (SBU) to identify \"highly conventionalized, prefabricated pragmatic units whose occurrences are tied to standardized\ncommunicative situations\". Kecskes (following a line of thought in linguistic pragmatics led by Coulmas, 1981) notes that \"set phrases\" (that is, prefabricated pragmatic units) can be classified on a continuum from least obligatory in a given situation to most obligatory, i.e., an SBU. An example of an SBU is the set phrase \"all aboard!\" that is tied to the situation of boarding a train. SBUs differ from idioms for their situational obligatoriness and also for their semantic transparency. To differentiate between an idiom and an SBU, take \"he has kicked the bucket\" vs. \"he has gone on\". The idiom is not semantically transparent (it doesn't mean what its words say).</p>\n\n<p>This is all to say that there are many kinds of \"set phrases\" in language, and linguists set out to identify them and give them precise terminology.</p>\n\n<ul>\n<li><p>Coulmas, Florian, 1981. Conversational Routine: Explorations in Standardized Communicative Situations and Prepatterned Speech. The Hague, Mouton.</p></li>\n<li><p>Kecskes, Istvan, 1997. A cognitive-pragmatic approach to situation-bound utterances. Paper Presented to Chicago Linguistics Society, March 7, 1997.</p></li>\n<li><p>Kecskes, I., 2000. A cognitive-pragmatic approach to situation-bound utterances. Journal of Pragmatics 32 (6), 605–625.</p></li>\n<li><p>Kecskes, Istvan, 2003. Situation-Bound Utterances in L1 and L2. Mouton de Gruyter, Berlin/New York.</p></li>\n</ul>\n", "Id":"4601", "ParentId":"4596", "LastEditorUserId":"51", "CreationDate":"2013-10-02T10:47:05.827", "OwnerUserId":"2534", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-10-02T10:57:25.223", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2013-10-02T10:57:25.223", "Score":"2", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2534", "AccountId":"3381315", "Views":"1", "Reputation":"41", "CreationDate":"2013-10-02T10:47:05.827", "DisplayName":"Ned Danison", "LastAccessDate":"2013-10-21T11:05:35.083"}}