{"Body":"<p>There is a technique in NLP called <a href=\"http://nlp.stanford.edu/projects/shallow-parsing.shtml\" rel=\"nofollow\">shallow semantic parsing</a> that you might find useful. As others have pointed out in the comments, it's a very demanding task. Humans use a lot of information that's not readily available to an automatic semantic parser, not only from the context, but also real world knowledge that prompts us to exclude very unlikely interpretations (and only reconsider them if other more likely interpretations don't seem to make sense).</p>\n\n<p>The <a href=\"http://www.ark.cs.cmu.edu/SEMAFOR/\" rel=\"nofollow\">SEMAFOR</a> project by the Stanford NLP group has built such a <a href=\"http://demo.ark.cs.cmu.edu/parse\" rel=\"nofollow\">semantic parser</a> and they provide a demo. You can probably download it and use it on your corpus. I haven't used this tool, but others from the same group. If you aren't scared by using a command line and figuring out a few things (it's rarely as easy as just installing some software and running it) you will likely be able to run it on your computer. They also provide further references on their website.</p>\n\n<p>I ran some of your sentences in the demo, and results are mixed. The verb <em>live</em> seems to be recognised only in the sense of *Live*1 = to reside. The adjective is treated as something different from the verb. Phrasal verbs and idioms such as <em>live it up</em> seem to be beyond the current abilities of the parser.</p>\n\n<p><img src=\"http://i.stack.imgur.com/RCEXX.png\" alt=\"I prefer to live in a house.\">\n<img src=\"http://i.stack.imgur.com/VSHOV.png\" alt=\"Live and breathe football.\">\n<img src=\"http://i.stack.imgur.com/6LxiX.png\" alt=\"Live it up girl!\">\n<img src=\"http://i.stack.imgur.com/dJoN8.png\" alt=\"Kennedy was shot on live TV.\">\n<img src=\"http://i.stack.imgur.com/IL6G5.png\" alt=\"The match was shown live on the sports channel.\"></p>\n\n<p>I suspect part of the reason why results are not ideal is that the semantic parser builds upon the results of a syntactic parser. Syntactic parsing is quite complex and computationally demanding. Even for simple sentences different well-formed parses are possible. Consider the following two sentences:</p>\n\n<blockquote>\n  <p>Yesterday I shot an elephant in my pyjamas. How he got into my pyjamas I don't know.</p>\n</blockquote>\n\n<p>(apparently a quote by <a href=\"http://books.google.de/books?id=W4ZEWYUdk5MC&amp;pg=PA8&amp;lpg=PA8&amp;dq=%22Yesterday%20I%20shot%20an%20elephant%20in%20my%20pyjamas%22&amp;source=bl&amp;ots=g2UCpwiXt-&amp;sig=-Ry9L0onk-OijWE8zBAJbmeIj7U&amp;hl=en&amp;sa=X&amp;ei=px5OUuKBPcOn0AWYloDYCA&amp;ved=0CFEQ6AEwBw#v=onepage&amp;q=%22Yesterday%20I%20shot%20an%20elephant%20in%20my%20pyjamas%22&amp;f=false\" rel=\"nofollow\">Groucho Marx</a>)</p>\n\n<p>The joke rests upon the fact that <em>in my pyjamas</em> can be an adjective phrase that qualifies <em>elephant</em> or an adverbial phrase that qualifies the verb. Most people's initial interpretation is the latter because elephants rarely wear anything. We usually don't even notice that the former alternative (adjective phrase qualifying <em>elephant</em>) is a possible parse. Humans integrate syntactic and semantic parsing, but AFAIK current NLP applications can't do that.</p>\n\n<p>Semantic parsing is an area of active research, and the Stanford parser is not the only around. An alternative is the <a href=\"http://ucrel.lancs.ac.uk/usas/\" rel=\"nofollow\">UCREL Semantic Analysis System</a>.</p>\n", "Id":"4608", "ParentId":"4598", "LastEditorUserId":"2278", "CreationDate":"2013-10-04T01:52:16.883", "OwnerUserId":"2278", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-10-04T09:13:07.897", "LastEditedUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}, "LastActivityDate":"2013-10-04T09:13:07.897", "Score":"2", "CommentCount":"7", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}