{"OwnerUser":{"UpVotes":"232", "WebsiteUrl":"http://www.flickr.com/photos/aedia/", "Id":"77", "AccountId":"394997", "CreationDate":"2011-09-13T23:41:02.527", "AboutMe":"<p>Visit the new <a href=\"http://ell.stackexchange.com\">English Language Learners</a> beta!</p>\n\n<p>I am a native speaker of American English. </p>\n\n<p>My background is in computer science. I am fueled by coffee and a painful degree of empathy with usability test subjects.</p>\n\n<p>I currently convert technical details to plain language for normal people, and convert normal language to technical details for programmers.</p>\n", "Age":"30", "Location":"United States", "DownVotes":"1", "Views":"13", "Reputation":"424", "DisplayName":"aedia λ", "LastAccessDate":"2013-09-16T20:25:09.320"}, "comments":[], "Body":"<p>I think what you're asking is: what processes caused these changes in French so that the spelling no longer matches the pronunciation? <a href=\"http://en.wikipedia.org/wiki/History_of_French#Overview\" rel=\"nofollow\">Wikipedia provides a summary of some of the key changes</a> that have occurred (also see the nice example of <em>chanter</em> conjugations with IPA):</p>\n\n<blockquote>\n  <ul>\n  <li>The loss of almost all final consonants.</li>\n  <li>The subsequent loss of final /ǝ/, which caused the appearance of many newly final consonants.</li>\n  <li>The loss of the formerly strong stress that had characterized the language throughout much of its history and triggered many of the phonetic deformations.</li>\n  <li>Significant transformations in the pronunciation of vowels, especially nasal vowels.</li>\n  </ul>\n</blockquote>\n\n<p>This is a broad question: a series of <a href=\"http://en.wikipedia.org/wiki/Sound_change\" rel=\"nofollow\">sound changes</a> produced this outcome, such as <a href=\"http://en.wikipedia.org/wiki/Lenition#Sound_changes_associated_with_lenition\" rel=\"nofollow\">lenition</a> resulting in latent or \"mute\" final consonants. </p>\n\n<p>One possible reason French is different from other Romance languages in this respect is due to the different impact of its <a href=\"http://en.wikipedia.org/wiki/History_of_French#Impact_of_substrate_and_superstrate_languages\" rel=\"nofollow\">superstrate and substrate languages</a>:</p>\n\n<blockquote>\n  <p>Some of the changes have been attributed to substrate influence—i.e. to carry-over effects from Gaulish (Celtic) or superstrate—influence from Frankish (Germanic).</p>\n</blockquote>\n\n<p>Regarding spelling, much of <a href=\"http://en.wikipedia.org/wiki/French_orthography#Middle_French\" rel=\"nofollow\">French orthography</a> was established based on the spelling from Old French, but when printing of dictionaries occurred, printers might retain or change spellings based on etymological assumptions if it \"reflect[ed] corresponding distinctions in the spelling of the underlying Latin words\". The <a href=\"http://en.wikipedia.org/wiki/Acad%C3%A9mie_fran%C3%A7aise\" rel=\"nofollow\">Académie française</a> also perhaps contributes to retaining historical spellings, but keep in mind that languages like English have undergone significant pronunciation change and the orthography has not kept up.</p>\n", "Id":"464", "ParentId":"459", "CreationDate":"2011-09-23T18:31:28.960", "Score":"9", "PostTypeId":"2", "OwnerUserId":"77", "LastActivityDate":"2011-09-23T18:31:28.960", "CommentCount":"2"}