{"OwnerUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}, "comments":[], "Body":"<p>There isn't much information on the language referred to by the OP as \"Fifa'a\", but there is some information on a group of people in Saudi Arabia called the Fayfa. The Fayfa are described <a href=\"http://www.peoplegroups.org/Explore/groupdetails.aspx?peid=42795\" rel=\"nofollow\">in this evangelical religious website</a> as speaking Mehri. Additionally, the <a href=\"http://worldmap.org/maps/other/profiles/saudi%20arabia/Saudi%20Arabia.pdf\" rel=\"nofollow\">Missionary Atlas Project</a> lists the \"Fayfa\" people and also describes them as speaking Mehri. This makes it likely that this is the language the OP (based on his informant) refers to as \"Fifa'a\" so I proceed on this assumption.</p>\n\n<p>The Fayfa people of Saudia Arabia speak Mehri, a <a href=\"http://www.ethnologue.com/language/gdq\" rel=\"nofollow\">Yemeni language</a> classified as a member of the <a href=\"https://en.wikipedia.org/wiki/Mehri_language\" rel=\"nofollow\">South Arabian subgroup</a> of the South Semitic group of languages (within the Semitic branch of the Afro-Asiatic family). The Arabic languages (which includes Saudi Arabic), on the other hand, are classified within the Central Semitic group (etc) so are quite distantly related to Mehri. This means that Arabic and Fayfa are definitely not mutually intelligible and can therefore be described as distinct languages.</p>\n\n<p>The majority of Mehri speakers are in Yemen, but there are also a number in Oman. There is a modest body of work on Mehri, some of which is listed at <a href=\"http://www.language-archives.org/language/gdq\" rel=\"nofollow\">OLAC</a>.</p>\n", "Id":"4653", "ParentId":"4039", "CreationDate":"2013-10-08T05:55:11.027", "Score":"4", "PostTypeId":"2", "OwnerUserId":"363", "LastActivityDate":"2013-10-08T05:55:11.027", "CommentCount":"10"}