{"OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2327", "AccountId":"3109264", "Views":"0", "Reputation":"21", "CreationDate":"2013-08-06T22:35:39.677", "DisplayName":"Stephen C", "LastAccessDate":"2013-10-15T22:35:50.720"}, "comments":[], "Body":"<p>First, I am going to address Tangurena's answer (I don't have enough reputation to add a comment).\nYour claim of Japan occupying Korea for 1600 years is very misleading to say the least.\nJapan occupied Korea during 1910 - 1945. It is a such a shame to Koreans that they call it as 경술국치 (pronounced as Kyung-Sool-Gook-Chi), meaning national shame in the year of Kyung-Sool. Here's a wikipedia article about the treaty that took place: <a href=\"http://en.wikipedia.org/wiki/Japan%E2%80%93Korea_Treaty_of_1910\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Japan%E2%80%93Korea_Treaty_of_1910</a></p>\n\n<p>Only other time that Japan invaded Korea as a country was after Toyotomi Hideyoshi united Japan (much thanks to Oda Nobunaga) and invaded Korea from 1592 - 1598. At one point they even took over the capital but Korean king at the time fled to northern part of the country, and the legendary admiral Yi Sun-sin defeated &amp; sank numerous Japanese ships to force them to retreat back to Japan. After Toyotomi Hideyoshi died, eventually all of the Japanese troops fled back to Japan.\n<a href=\"http://en.wikipedia.org/wiki/Japanese_invasions_of_Korea_(1592%E2%80%931598)\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Japanese_invasions_of_Korea_(1592%E2%80%931598)</a></p>\n\n<p>One can even argue that some kingdoms (like Baekje) in Korea ruled Japanese provinces in the ancient times and did in fact influence languages and some of the cultures. Also they served as a gateway for Japan to obtain Chinese goods/cultures/ etc.\n<a href=\"http://en.wikipedia.org/wiki/Baekje\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Baekje</a></p>\n\n<p>For outsiders, a good way to visualize the relationships between Korea, Japan and China might be that of France, England, and Rome. Given that relationship, it is easy to make connections for both Japanese and Korean languages to Chinese and there are definitely few features (such as writing systems for both countries have been borrowing from Chinese for much of their history as well as many words having roots originating from Chinese language).</p>\n\n<p>So my \"open\" answer to the question of the thread is that, yes, there are definitely some influences between these two countries - both affecting each other. But keep in mind that these two are separated by sea so it is different than some of the European countries who shares borders with other countries where language can easily be influenced by each other.</p>\n\n<p>Also Korea is made up of 70 ~ 80% mountainous terrain which affects the \"sharing\" of the language. So the caveat is that each region developed their own features while the sharing and influencing were going on.</p>\n", "Id":"4657", "ParentId":"41", "CreationDate":"2013-10-08T18:17:05.040", "Score":"0", "PostTypeId":"2", "OwnerUserId":"2327", "LastActivityDate":"2013-10-08T18:17:05.040", "CommentCount":"1"}