{"Body":"<p>While there are comprehensive definitions of <em>subject</em>, they won't apply to every language. Some languages use a <a href=\"http://en.wikipedia.org/wiki/Topic%E2%80%93comment\" rel=\"nofollow\">topic-comment</a> structure instead, such as Japanese.</p>\n\n<p>Most communication is intended to convey propositions to the listeners. Propositions generally start with a piece of known information, and then add a new piece of information. Sometimes the new information is communicated through nouns or adjectives (such as <em>John is a man</em> or <em>John is tall</em>) and sometimes through verbs (<em>John is running</em>.) In all three of these examples <em>John</em> is the topic, and in English <em>John</em> is in the subject position.</p>\n\n<p>The contrasting position is usually called the <em>object</em>. Transitive sentences will have both a subject and an object (<em>John kicked the ball</em>.) In these cases John has the <em>role</em> of <em>actor</em>, while the ball has the role of <em>undergoer</em>. But roles do not always correspond to the same grammatical position. In <em>passive</em> sentences the undergoer becomes the subject (<em>The ball was kicked</em>.)</p>\n\n<p>So for these reasons you can't always identify the subject based on the meaning of the sentence. But you can identify it based on factors such as:</p>\n\n<ul>\n<li>Case - some languages have case for all nouns, but English only has it for pronouns. <em>I</em> is nominative and only appears in the subject position, while <em>me</em> is accusative, and does not appear in the subject position (usually. Let's not get into this discussion, but sentences like this will often be made by many native English speakers: <em>John and me are going to the beach</em>)</li>\n<li>Verb agreement - in many languages the verb will agree with the subject. In English we say <em>I <strong>was</strong> jumping</em> and <em>They <strong>were</strong> jumping</em>. In some languages though the verb is also marked for the object!</li>\n<li>Syntactic position - in many languages the subject must appear in a fixed position. In English it is before the verb. But there are other constructions which can change it around, such as Left-dislocation: <em>The girl, the dog bit</em>.</li>\n</ul>\n", "Id":"4662", "ParentId":"4661", "LastEditorUserId":"2555", "CreationDate":"2013-10-09T00:27:07.920", "OwnerUserId":"2555", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-10-09T01:28:24.917", "LastEditedUser":{"UpVotes":"70", "WebsiteUrl":"", "Location":"Australia", "Id":"2555", "DownVotes":"16", "AccountId":"3401915", "Views":"6", "Reputation":"311", "CreationDate":"2013-10-07T08:31:40.093", "DisplayName":"curiousdannii", "LastAccessDate":"2014-01-15T22:35:43.143", "AboutMe":""}, "LastActivityDate":"2013-10-09T01:28:24.917", "Score":"1", "CommentCount":"4", "OwnerUser":{"UpVotes":"70", "WebsiteUrl":"", "Location":"Australia", "Id":"2555", "DownVotes":"16", "AccountId":"3401915", "Views":"6", "Reputation":"311", "CreationDate":"2013-10-07T08:31:40.093", "DisplayName":"curiousdannii", "LastAccessDate":"2014-01-15T22:35:43.143", "AboutMe":""}}