{"Body":"<p>Thanks for that. I would point out the following:</p>\n\n<ol>\n<li><p>If you try to use 'object' to define 'subject', you are simply avoiding the issue. Without a robust definition of 'subject', it is pointless to talk of object.</p></li>\n<li><p>Without a definition of subject, how can you talk of 'subject position'?\nSee if you can tell me the subject, and therefore the 'subject position' of this German sentence:\nDie Katze biss die Frau. \nSince feminine nominative and accusative case are identical, it is impossible to say which is which. Case was invented to indicate the roles of arguments. It is a very flawed invention.</p></li>\n<li><p>'John is a man.' or 'John is tall.' are not propositions, but statements. If you wish to identify the 'subject' of 'John is a man' which criteria would you apply? Languages that use case will show both to be nominative, the case often associated with 'subject'. If you say the first noun is the subject, you mentioned left dislocation, which will immediately contradict this.</p></li>\n<li><p>Chinese has no verb inflections. Do you wish to say Chinese has no concept of subject, as has been mooted by some? (I'll provide a name later, can't find it right now).</p></li>\n<li><p>If you wish to identify 'is' as a verb, tell me if you think it is passive or active.</p></li>\n<li><p>In the market place stood a tall statue. Syntax will not define the subject.</p></li>\n<li><p>If position, case, syntax and verb agreement (cf my German sentence die Frau biss ..., die Katze biss ...) do not identify 'subject', ask yourself what are you doing to identify subject. You are using an art, but not a science.</p></li>\n</ol>\n\n<p>In summary, I would say, with respect, your intuitive grasp of what 'subject' is, is entirely arbitrary, English orientated and not useful.</p>\n", "Id":"4665", "ParentId":"4661", "LastEditorUserId":"2566", "CreationDate":"2013-10-09T03:40:22.543", "OwnerUserId":"2566", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-10-09T04:20:04.497", "LastEditedUser":{"UpVotes":"0", "DownVotes":"0", "ProfileImageUrl":"https://www.gravatar.com/avatar/?s=128&d=identicon&r=PG&f=1", "Id":"2566", "AccountId":"3410700", "Views":"3", "Reputation":"7", "CreationDate":"2013-10-08T23:42:22.350", "DisplayName":"Pedro Rodriguez", "LastAccessDate":"2013-11-13T03:48:39.037"}, "LastActivityDate":"2013-10-09T04:20:04.497", "Score":"-2", "CommentCount":"4", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "ProfileImageUrl":"https://www.gravatar.com/avatar/?s=128&d=identicon&r=PG&f=1", "Id":"2566", "AccountId":"3410700", "Views":"3", "Reputation":"7", "CreationDate":"2013-10-08T23:42:22.350", "DisplayName":"Pedro Rodriguez", "LastAccessDate":"2013-11-13T03:48:39.037"}}