{"OwnerUser":{"UpVotes":"23", "WebsiteUrl":"", "DownVotes":"5", "Id":"1832", "AccountId":"1670710", "Views":"4", "Reputation":"344", "CreationDate":"2013-03-07T05:57:57.617", "DisplayName":"limetom", "LastAccessDate":"2014-01-13T23:38:09.323", "AboutMe":""}, "comments":[], "Body":"<p>Cognates are only words shared in two sister varieties that have been inherited genetically from a parent variety. From Campbell and Mixco's <em>A Glossary of Historical Linguistics:</em></p>\n\n<blockquote>\n  <p><strong>cognate</strong> A word (or morpheme) that is related to a word (morpheme) in sister languages by reason of these words (morphemes) having been inherited by the related languages from a common word (morpheme) of the <strong>proto-language</strong> from which they descend. For example, Italian <em>cane</em> /kane/, Portuguese <em>cão</em> /kãũ/, French <em>chien</em> /syɛ̃/ ‘dog’, are all cognates, since they descend in these Romance languages from the same original word in Latin (ancestor of the Romance languages): <em>canis</em> ‘dog’. (Campbell and Mixco 2007: 33-4)</p>\n</blockquote>\n\n<p>For your hypothetical examples:</p>\n\n<ul>\n<li>The first one is uncontroversially a cognate.</li>\n<li>In your second example, the OE form and the ModE form (but <em>not</em> the form from wherever it originated) are cognate.</li>\n<li>In your third example, the ModE form and the form in language X are <em>not</em> cognate because they don't go back to a common origin.</li>\n<li>And equally, the ModE form and the form in language Y (a descendant of language X) are also not cognate, as they do not go back to a common genetic ancestor (to be clear, the forms, not the languages).</li>\n</ul>\n\n<p>Common ancestors are <em>only</em> genetic ancestors, despite how people might informally use \"common ancestor\". Chinese 豆腐 (standard Mandarin <em>dòufu</em>) was loaned into both Japanese, as 豆腐 <em>toufu</em>, and into Korean, as 두부 <em>dubu</em>. These forms share a common origin (a loan from some Sinitic language at some point into Korean and Japanese), but they aren't from a common ancestor (Chinese, Japanese, and Korean are not related). The Mandarin, Hakka (<em>teu<sup>55</sup> fu<sup>55</sup></em>), and Hokkien (<em>tāu-hū</em>) forms, on the other hand, are cognate.</p>\n", "Id":"4669", "ParentId":"4667", "CreationDate":"2013-10-09T09:13:05.887", "Score":"3", "PostTypeId":"2", "OwnerUserId":"1832", "LastActivityDate":"2013-10-09T09:13:05.887", "CommentCount":"11"}