{"Body":"<p>If you are still a student (or if there is a university in your city), I suggest emailing or making an appointment to talk to some professors specializing in AI. Preferably ones specializing in Natural Language Processing (NLP) or Computational Linguistics (CL) but even if they don't they can still give you relevant advice and point you to the proper people.</p>\n\n<p>Other than that, you can take an online course. <a href=\"https://www.coursera.org/\" rel=\"nofollow\">Coursera.org</a> is a website devoted to providing free access to courses written by professors from world-leading institutions. Currently they have not one, but two introductory NLP/CL courses. One from <a href=\"https://www.coursera.org/course/nlp\" rel=\"nofollow\">Standford University</a> and one from <a href=\"https://www.coursera.org/course/nlangp\" rel=\"nofollow\">Columbia University</a>. The Stanford class in particular was co-created by Dan Jurafsky who also co-wrote <a href=\"http://rads.stackoverflow.com/amzn/click/0131873210\" rel=\"nofollow\">the textbook that most introductory NLP/CL courses use</a>. Just click the \"preview\" button on those courses' websites and you should have access to all the slides and video lectures in the course.</p>\n\n<p>At the time of writing it appears that the Columbia course is about to begin a 10 week long session, meaning the materials are unavailable for preview. However, if you register for the course you will get access to the materials as the course progresses. Not only that but you will get to participate in weekly assignments, get feedback from other users and TAs, and at the end get a nice certificate of completion which, if nothing else, shows employers and potential professors that you're serious about your studies.</p>\n\n<p>These courses should give you an overview of NLP/CL tasks and techniques. You can use this to guide any further research.</p>\n\n<p>I would also caution you that <strong>linguistics is not learning and speaking languages</strong>. It is the study of the underlying mechanics of language which all languages share. I'd start by reading <a href=\"http://rads.stackoverflow.com/amzn/click/0061336467\" rel=\"nofollow\">The Language Instinct by Steven Pinker</a>. It's very basic and written for a general audience but it provides a nice overview. If you enjoy that and want to learn more then <a href=\"http://ocw.mit.edu/index.htm\" rel=\"nofollow\">MIT OpenCourseWare</a> has slides for MIT's introductory <a href=\"http://ocw.mit.edu/courses/linguistics-and-philosophy/24-901-language-and-its-structure-i-phonology-fall-2010/\" rel=\"nofollow\">phonology</a>, <a href=\"http://ocw.mit.edu/courses/linguistics-and-philosophy/24-902-language-and-its-structure-ii-syntax-fall-2003/\" rel=\"nofollow\">syntax</a>, and <a href=\"http://ocw.mit.edu/courses/linguistics-and-philosophy/24-903-language-and-its-structure-iii-semantics-and-pragmatics-spring-2005/\" rel=\"nofollow\">semantics</a> courses. With that foundation you can explore <a href=\"http://ocw.mit.edu/courses/index.htm#linguistics-and-philosophy\" rel=\"nofollow\">all the Linguistics courses MIT offers</a> and see if any interest you.</p>\n", "Id":"4676", "ParentId":"4670", "LastEditorUserId":"1055", "CreationDate":"2013-10-09T14:51:49.100", "OwnerUserId":"1055", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-10-10T00:21:58.033", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "LastActivityDate":"2013-10-10T00:21:58.033", "Score":"4", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}