{"Body":"<p>This proposal creates a lot more problems than it solves. First, I don't think the rarity of the biphonemic sequence /kw/ is that problematic: plain velars are relatively infrequent in any case, so it's not too strange if /kw/ happens not to occur in the subset of the PIE lexicon that has been reconstructed. Especially so given that it would have competed with a similar-sounding single phoneme /kʷ/, which might easily have led to merger, or else possibly to dissimilation into /ḱw/. (There are also of course IE scholars who don't believe in the plain velar series at all and think that there were only two velar series, in which case the problem doesn't arise, but this is a minority position.)</p>\n\n<p>Secondly, changing all the reconstructed /kʷ/ into /kw/ actually creates a massive statistical anomaly, since labiovelars are at least as common as plain velars; so this would mean that PIE has more instances of /k/ followed by /w/ than it had of /k/ followed by all other sounds combined, which is highly improbable.</p>\n\n<p>Third, you'd have to explain why this biphonemic sequence shows up as a single phoneme in most of the daughter languages. For example, in the satem languages, why would /w/ have been lost after a velar but not otherwise? In Greek, why would */ḱw/ yield /pp/ (as in <em>hippos</em>), but */kw/ yield /p/ or /t/ and not /pp/ or /tt/?</p>\n\n<p>Replacing labiovelars with labials leads to other problems: you would have to say that */p/ became /kʷ/ or /kw/ in some branches, to account for e.g. Latin <em>aqua</em>, which is a bizarre and to my knowledge unattested change. This would also have to be parallel innovation in those branches, so it's no better in that sense than the standard */kʷ/ > /p/ change. Moreover, it would have to be irregular, since obviously most instances of PIE */p/ remain labial in all the languages.</p>\n", "Id":"4683", "ParentId":"4679", "LastEditorUserId":"2411", "CreationDate":"2013-10-10T02:26:36.570", "OwnerUserId":"2411", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-10-17T03:39:45.293", "LastEditedUser":{"UpVotes":"80", "WebsiteUrl":"", "DownVotes":"24", "Id":"2411", "ProfileImageUrl":"https://www.gravatar.com/avatar/5e5b9f5cfa370b99b7b7fdaa27454de1?s=128&d=identicon&r=PG&f=1", "AccountId":"3231657", "Views":"10", "Reputation":"1342", "CreationDate":"2013-08-28T19:22:30.673", "DisplayName":"TKR", "LastAccessDate":"2014-01-19T02:45:52.557", "AboutMe":""}, "LastActivityDate":"2013-10-17T03:39:45.293", "Score":"5", "CommentCount":"3", "OwnerUser":{"UpVotes":"80", "WebsiteUrl":"", "DownVotes":"24", "Id":"2411", "ProfileImageUrl":"https://www.gravatar.com/avatar/5e5b9f5cfa370b99b7b7fdaa27454de1?s=128&d=identicon&r=PG&f=1", "AccountId":"3231657", "Views":"10", "Reputation":"1342", "CreationDate":"2013-08-28T19:22:30.673", "DisplayName":"TKR", "LastAccessDate":"2014-01-19T02:45:52.557", "AboutMe":""}}