{"OwnerUser":{"UpVotes":"1", "Location":"Los Angeles", "DownVotes":"0", "Id":"2576", "AccountId":"2345905", "Views":"3", "Reputation":"131", "CreationDate":"2013-10-10T06:28:24.713", "DisplayName":"rsandell", "LastAccessDate":"2013-11-13T05:53:40.460"}, "comments":[], "Body":"<p>The word for 'path' certainly contained an ablauting laryngeal suffix, as the Avestan paradigm of the word demonstrates:</p>\n\n<ul>\n<li>acc.sg. paṇtąm &lt; *pént-oH-m̥ (cf. Skt. pántham) [NB Av. ą &lt; ā / _m$]</li>\n<li>gen.sg. paθō &lt; *pn̥t-H-ós (cf. Skt. patháḥ)</li>\n</ul>\n\n<p>The PIE accent/ablaut type here is amphikinetic (e-grade root and o-grade suffix in the strong stem, zero grade of both root and suffix in the weak steam, with accent on the root in the strong stem and the ending in the weak stem). </p>\n\n<p>A laryngeal is necessary in order to account for the Avestan θ [interdental fricative] and Sanskrit th [voicless aspirate], continuing Proto-Indo-Iranian *th. Only when the laryngeal is directly adjacent to the stop does θ result (Skt. has evidently imported the voiceless aspirate throughout the whole paradigm: pántham &lt;&lt; *pántam). Proto-Indo-Iranian *th exists only in forms that are reconstructable to Proto-Indo-Iranian, or to Proto-Indo-European voiceless stop + laryngeal sequences (thus, the same applies to PIIr. *ph [> Av. f and Skt. ph] and *kh [> Av. x and Skt. kh]). For instance, the 2.sg. ending of the perfect, Av. -θa, Skt. -tha, Greek -θa, Hitt. -ta is to be reconstructed as PIE *-th2e, thus accounting at one stroke for the a-vocalism in the Greek ending and the voiceless aspirate in the Indo-Iranian forms. </p>\n\n<p>Whether the laryngeal is to be reconstructed as *h1 or *h2 not wholly certain, though *h2 seems more likely. In all instances in which the quality of a laryngeal that produces a voiceless aspirate in Indo-Iranian is clearly discernible, the laryngeal is *h2. For instance: Skt. <em>rátha-</em> 'chariot' &lt; *rot-h2-o, cf. Lat. <em>rota</em>; Skt. pr̥thú- 'broad', cf. Grk. πλατύς. Hence, Mayrhofer (1986), for instance, holds that only *h2 produces aspiration on stops in Indo-Iranian. The best possible example for aspiration by *h1 is perhaps the 2.pl.pres. ending of Vedic, -tha, which corresponds to Greek -τε, thus potentially implying a form *-th1e. Vedic 2.pl.pres. -tha otherwise lacks an explanation.</p>\n\n<p>The derivational suffix *-eh1 would certainly be uncommon; I cannot call to mind any other words that decisively show it. I believe that scholars in Leiden follow Pedersen (<em>La cinquieme declenasion latine</em>) in accepting a derivational suffix *-eh1 as the origin for Lithuanian nouns in <em>-ė</em> (as well as perhaps contributing to the Latin fifth declension). Others (e.g., Weiss) take the Latin fifth declension as a Latin-internal development from certain nouns that contained <em>ē</em> for other reasons (e.g., <em>rēs</em> and <em>diēs</em>), and reject the potential Baltic connection, in which case little basis would exist for the assumption of a derivational suffix *-eh1. *-eh2, in this specific instance, is also peculiar, since it primarily derives feminine nouns, and 'path' is a masculine in both Skt. and Avestan. Alternatively, *-h2 here could be a collective derivational suffix (compare Skt. <em>rátha</em> 'chariot' &lt; 'set of wheels' above), in which case a 'path' would be 'a group/set of <em>pont</em>-' (whatever exactly a *<em>pont-</em> might have been -- we have no such root noun).   </p>\n\n<p>Further inflection off of another inflectional form (as Mark Beadles suggests) is highly unlikely -- such \"decasuative\" derivation is typologically unsubstantiated. </p>\n\n<p>If truly pressed, I'd reconstruct *pónt-eh2- / *pn̥t-h2-, but we cannot be wholly certain.</p>\n", "Id":"4688", "ParentId":"2580", "CreationDate":"2013-10-10T07:39:39.893", "Score":"4", "PostTypeId":"2", "OwnerUserId":"2576", "LastActivityDate":"2013-10-10T07:39:39.893", "CommentCount":"2"}