{"Body":"<p>Depending upon the specific view that one accepts concerning the development of the accent systems of Baltic and Slavic, the Baltic cognate would compel a reconstruction with *h2. </p>\n\n<p>Lithuanian (nom.) <em>móteris</em> [the acute diacritic here indicates the surface word accent] ‘woman’ belongs to the third accent class, which indicates that the stem <em>moteri-</em> contained a so-called \"acute\" intonation (the use of the terms \"acute\" and \"circumflex\" in Baltic and Slavic accentology is fraught and convoluted -- beware). If one follows the position of Kortlandt (though also more or less sustained in Petit's recent <em>Untersuchungen zu den baltischen Sprachen</em>) that only IE laryngeals or voiced stops in syllable codas could eventually produce \"acute\" intonation, then the reconstruction *meh2-ter- would be necessary. </p>\n\n<p>Furthermore, insofar as one does analyze the word into a root and suffix -ter, <em>no</em> IE root whatsoever that participates in derivation lacks a consonant following the root's full-grade (<em>confer</em> the roots in the <em>Lexicon der Indogermanischen Verben</em>). IE grammatical elements that lack final consonants consist exclusively of particles (e.g., *su 'good, well'), prepositions (e.g., *pro ‘before’), and pronouns.  Thus, IE constraints on licit root structures would exclude *mā- as a root. So even setting the Baltic considerations aside, *meh2-ter remains a preferable reconstruction.    </p>\n", "Id":"4689", "ParentId":"1314", "LastEditorUserId":"2576", "CreationDate":"2013-10-10T08:05:51.343", "OwnerUserId":"2576", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-10-10T20:53:42.073", "LastEditedUser":{"UpVotes":"1", "Location":"Los Angeles", "DownVotes":"0", "Id":"2576", "AccountId":"2345905", "Views":"3", "Reputation":"131", "CreationDate":"2013-10-10T06:28:24.713", "DisplayName":"rsandell", "LastAccessDate":"2013-11-13T05:53:40.460"}, "LastActivityDate":"2013-10-10T20:53:42.073", "Score":"6", "OwnerUser":{"UpVotes":"1", "Location":"Los Angeles", "DownVotes":"0", "Id":"2576", "AccountId":"2345905", "Views":"3", "Reputation":"131", "CreationDate":"2013-10-10T06:28:24.713", "DisplayName":"rsandell", "LastAccessDate":"2013-11-13T05:53:40.460"}}