{"Body":"<p>Very few of the case markers you are asking about have any kind of an accepted etymology. Most of the time, it's because we just don't have any evidence to go on. Generally, they all share their functions and forms throughout the Japonic languages, so we have no real evidence to call them anything other than what they were, even going back to Proto-Japonic times.</p>\n\n<p>But first, a detour. The \"existential verb\" you're talking about is not an existential verb at all, but a copula. In Vovin (2005, 2009)'s analysis of Old Japanese, the copula <em>n-</em> is a defective verb, only having three forms: an infinitive <em>n-i</em> <code>|COP-INF|</code>, an attributive (used to form relative clauses) <em>n-ö</em> <code>|COP-ATTR|</code>, and a subordinating converb form (used to link sentences) <em>n-i-te</em> <code>|COP-INF-SUB|</code> (Vovin 2009: 511-37). You can find reflexes of this not only in modern Japanese, but also in the related Ryukyuan languages, so the copula <em>n-</em> certainly goes back to Proto-Japonic.</p>\n\n<p>As far as I know, <em>=ga</em> (PJ *<sup>ŋ</sup>ga) has no known etymology other than just a possessive case marker with a subject-marking usage. </p>\n\n<p>It's conceivable that the genitive case marker <em>=no</em> (PJ *nə) and the attributive form of the copula <em>no</em> (also PJ *nə) are related (and even today most people continually confuse them--traditional Japanese approaches to grammar don't even recognize the copula <em>n-</em>).</p>\n\n<p><em>na</em>, which is used in modern Japanese to use certain nouns (also called adjectival nouns or <em>na</em>-adjectives) as attributives of some other noun is clearly a special attributive form of the copula. As far as I know, this is an innovation only found in Late Middle Japanese (so at the earliest around 1200 CE) (Frellesvig 2010: 341-2). Frellesvig seems to think LMJ <em>na</em> is from ealier <em>naru</em>, but he doesn't say whether this is from even earlier <em>n(-i) ar-u</em> <code>|COP(-INF) exist-FIN|</code> or from <em>nar-u</em> <code>|become-FIN|</code>.</p>\n\n<p>The dative-locative case marker <em>=ni</em> is also of unclear etymological origin beyond being the Proto-Japonic dative-locative case marker *nəi (Vovin 2005: 148, reconstruction Whitman 1985: 36-8).</p>\n", "Id":"4691", "ParentId":"4687", "LastEditorUserId":"51", "CreationDate":"2013-10-10T11:36:04.350", "OwnerUserId":"1832", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-10-10T11:46:45.693", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2013-10-10T11:46:45.693", "Score":"4", "CommentCount":"3", "OwnerUser":{"UpVotes":"23", "WebsiteUrl":"", "DownVotes":"5", "Id":"1832", "AccountId":"1670710", "Views":"4", "Reputation":"344", "CreationDate":"2013-03-07T05:57:57.617", "DisplayName":"limetom", "LastAccessDate":"2014-01-13T23:38:09.323", "AboutMe":""}}