{"comments":[], "Body":"<p>The OED's etymology of <em>short</em> is as follows:</p>\n\n<p><i>Old English sc(e)ort = Old High German scurz &lt; Germanic type *skurto- (comparative *skurtizon- , Old English scyrtra ), whence Dutch schorten , Old Norse skorta to lack; for other derivatives see shirt n., skirt n.</p>\n\n<p>The Germanic adjective is commonly regarded as a popular Latin *excurtus ( &lt; Latin ex- + curtus ). On this view it would be parallel in origin with the synonymous Old Frisian, Old Saxon kurt , Dutch kort , Old High German (Middle High German, modern German) kurz , a West Germanic adoption of Latin curtus . The Romanic languages, however, afford no evidence of a popular Latin *excurtus , and it is unlikely that such a form existed. It is possible that Germanic *skurto- may be an altered adoption of Latin curtus , with prefixed s either due to some Germanic analogy or attracted from the ending of a preceding word in some Latin context. Some scholars, however, regard *skurto- as a native Germanic word, &lt; a root *skert- (supposed to be evidenced in Middle High German scherze , scherzel small piece) &lt; pre-Germanic *skerd- , an extension of *sker- to cut (see shear v.).</i></p>\n\n<p>That is: German <em>kurz</em> is a borrowing from Latin <em>curtus</em> (which gives the Romance forms <em>court, corto, curzu</em>, etc.). English <em>short</em> is either a borrowing from the same source with an added initial <em>s-</em> whose origin isn't understood, or else it's not from Latin at all, but from a PIE root *<em>sker-</em>. (If the latter, it would likely still be cognate with Latin <em>curtus</em>, which is from PIE *<em>ker-</em>; since many PIE roots appear in two forms, with and without an initial <em>s-</em>, the two roots would probably be ultimately the same.)</p>\n", "Id":"4716", "ParentId":"2850", "CreationDate":"2013-10-12T18:11:22.317", "Score":"0", "PostTypeId":"2", "OwnerUserId":"2411", "LastActivityDate":"2013-10-12T18:11:22.317", "OwnerUser":{"UpVotes":"80", "WebsiteUrl":"", "DownVotes":"24", "Id":"2411", "ProfileImageUrl":"https://www.gravatar.com/avatar/5e5b9f5cfa370b99b7b7fdaa27454de1?s=128&d=identicon&r=PG&f=1", "AccountId":"3231657", "Views":"10", "Reputation":"1342", "CreationDate":"2013-08-28T19:22:30.673", "DisplayName":"TKR", "LastAccessDate":"2014-01-19T02:45:52.557", "AboutMe":""}}