{"Body":"<p>I'm not an expert in the classical Arabic language nor in the \"Tajweed\" science but I can contribute with the little bit I know ... my clarification can be summarized in some points:</p>\n\n<p>First of all, we have to know that the word \"Allah\" is a \"classical\" Arabic  word (very ancient) consisting  of the word \"ilah\" (god) linked to the definite article \"al\" to say \"The God\" (The One [not any one]) : that's a proper noun (so, without plural nor feminine) and it's not the equivalent of the English word \"god\" or \"dieu\" in French ...</p>\n\n<p>That's an exceptional word  that has an <strong>eccentric spelling</strong> - did you even notice? - and, an <strong>eccentric pronunciation</strong> (and that's the subject of your question).\nIf we know that the \"L\" (ل) [lām] in almost all Arabic recitations of the \"Qur'an\" and, before that, in almost all dialects is not an  emphatic consonant (it's rather pronounced with some thinness), how this happened with the word \"Allah\" ?</p>\n\n<p>There are two reasons for the \"tafkhim\" (thickening) of the \"lām\" in the word \"Allah\" :</p>\n\n<ul>\n<li>the first is to avoid the confusion with the name of an historical<br>\npagan divinity called \"allat\" - which is linguistically a word from\nthe same roots, ends with \"t\" instead of an \"h\" and having a <strong>thin\n\"L\"</strong> .</li>\n<li>the second is the <strong><em>Glorification of the name of The God</em></strong> (yes, almost\nall Arabian tribes were not monotheistic but they knew that \"Allah\"\nis \"The authentic God\")</li>\n</ul>\n\n<p>see<br>\n <a href=\"http://forums.mrkzy.com/t21613.html\" rel=\"nofollow\">http://forums.mrkzy.com/t21613.html</a></p>\n\n<p>I have to mention that the \"lām\" in the word \"Allah\" is not always thickened, that's to say there are cases making the \"lām\" thin if the word \"Allah\" comes after a \"Kasra\" (almost after an [i]), as in [ لِلَّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الأرْضِ] or in [بسم الله],\nand I have also to mention that in the method of recitation of \"Warch\" (a famous reader of the Qur'an), the emphatic \"L\" , thus the famous /lˤ/ , happens in other cases (known as the \"L\"s of warch : لامات وَرْشٌ), like in: يصلى,فصل ,ويصّالحا,فلما فصل طالوت بالجنود ,صلى,طال ...</p>\n\n<p>see</p>\n\n<ul>\n<li><a href=\"http://vb.tafsir.net/tafsir19763/\" rel=\"nofollow\">http://vb.tafsir.net/tafsir19763/</a> </li>\n<li><a href=\"http://telmwarsh2.wordpress.com/2010/05/30/%D8%AA%D8%BA%D9%84%D9%8A%D8%B8-%D8%A7%D9%84%D9%84%D8%A7%D9%85%D8%A7%D8%AA-2/\" rel=\"nofollow\">http://telmwarsh2.wordpress.com/2010/05/30/%D8%AA%D8%BA%D9%84%D9%8A%D8%B8-%D8%A7%D9%84%D9%84%D8%A7%D9%85%D8%A7%D8%AA-2/</a></li>\n</ul>\n\n<p>Finally, it's worth saying that language it's not a Darwinian realm, it's rather a complex confluence of historical and geographical events added to some rare \"mutations\": some phonemes or letters can persist without being even used (the German alphabet contains the letter x but it is used only for borrowed words ...)!</p>\n\n<hr>\n\n<p>(Sorry for the links, they are in Arabic, I will try to find English links if there are any ones.)</p>\n", "Id":"4744", "ParentId":"1032", "LastEditorUserId":"51", "CreationDate":"2013-10-17T22:56:51.167", "OwnerUserId":"2586", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-10-18T03:33:01.703", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2013-10-18T03:33:01.703", "Score":"0", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"", "DownVotes":"0", "Id":"2586", "AccountId":"2202823", "Views":"11", "Reputation":"21", "CreationDate":"2013-10-12T15:26:56.210", "DisplayName":"jihed gasmi", "LastAccessDate":"2013-12-23T16:41:46.597", "AboutMe":"<p><em>Caterpillar</em>: Who... are... you?</p>\n\n<p><em>Alice</em>: Why, I hardly know, sir.\n I've changed so much since this morning, you see...</p>\n\n<p><em>Caterpillar</em>: No, I do not C, explain yourself.</p>\n\n<p><em>Alice</em>: I'm afraid I can't explain myself, you see, because I'm not myself, you know.</p>\n\n<p><em>Caterpillar</em>: I do not know.</p>\n\n<p><em>Alice</em>: I can't put it any more clearly, sir, because it isn't clear to me. </p>\n"}}