{"comments":[], "Body":"<p>Recently, the <a href=\"http://phonotactics.anu.edu.au/\" rel=\"nofollow\">World Phonotactics Database</a> was launched. While I've noticed some errors in languages I'm familiar with, it may be useful to check there. </p>\n\n<p>First off, is there a trend across languages in terms of syllable structure? To start with, let's look at how many consonants can be in an onset. Their sample contains 2,338 languages. Of these, 2 do not allow onsets, 1,363 allow for at most 1 consonant in their onset position, 727 allow for at most 2 onset consonants, 229 allow for at most 3 consonants, 15 allow for at most 4 consonants, and 2 allow for at most 6 consonants (note that they have no languages in their sample with at most 5 onset consonants).</p>\n\n<p>Let's also look at how many consonants can be in a coda. They again sample from 2,338 languages. Of these, 485 languages do not allow for coda consonants, 1,373 allow for at most 1 coda consonant, 358 allow for at most 2 coda consonants, 107 allow for at most 3 coda consonants, 12 allow for at most 4 coda consonants, and 3 allow for at most 5 coda consonants.</p>\n\n<p>With this in mind, I think it's likely that what we're seeing in the rest of the world--where \"familiar\" languages allow for complex onsets and codas--is actually a result confirmation bias. Indo-European languages, for instance, with the exception of highly divergent languages like English or Russian, really only allow for at most 2 or 3 onset consonants (2s include Armenian, Spanish, and Punjabi; and 3s include Albanian, Irish, and Lithuanian).</p>\n\n<p>In most of the world's languages, a CV structure is preferred. This is, as far as I'm aware, a very old typological generalization. <a href=\"http://typo.uni-konstanz.de/archive/nav/browse.php?number=687\" rel=\"nofollow\">The Universals Archive</a> cites Jakobson and Hale (1956) as the first statement of this structure being a linguistic universal.</p>\n", "Id":"4756", "ParentId":"3780", "CreationDate":"2013-10-20T04:13:56.667", "Score":"1", "PostTypeId":"2", "OwnerUserId":"1832", "LastActivityDate":"2013-10-20T04:13:56.667", "OwnerUser":{"UpVotes":"23", "WebsiteUrl":"", "DownVotes":"5", "Id":"1832", "AccountId":"1670710", "Views":"4", "Reputation":"344", "CreationDate":"2013-03-07T05:57:57.617", "DisplayName":"limetom", "LastAccessDate":"2014-01-13T23:38:09.323", "AboutMe":""}}