{"Body":"<p><strong>[Edit:</strong> Some people consider only <em>be/être</em> a copula; verbs like <em>seem/sembler, become/devenir</em>, etc. they consider lexical verbs. I believe their reason is that they consider only <em>be</em> devoid of any non-grammatical function, whereas <em>seem</em> also means \"affect the perception of others\", and <em>become</em> \"change\".</p>\n\n<p>I have only ever encountered this narrow sense in certain branches formal linguistics of the Anglo-Saxon school, not in other disciplines or places, but it has some merit, and perhaps it is more widespread than I know. It is something to take into account when you see someone talking about \"copulae\"; if only writers always had the time to define their terms... <strong>]</strong></p>\n\n<hr>\n\n<p>The idea is that <strong>lexical verbs express more than a mere grammatical function</strong>, while auxiliary verbs express only grammatical function, such as tense, number, or modality. Some consider copulae lexical verbs, others do not.</p>\n\n<hr>\n\n<blockquote>\n  <p>I can't see you.</p>\n</blockquote>\n\n<p>The auxiliary modal verb <em>can</em> merely adds a notion of modality and presentness to the action or state of seeing.</p>\n\n<p>However, the distinction is one of convenience, not a rigid or even consistent one. What comprises a grammatical function and what lexical content is a semantic criterion, and not one that can be easily defined or tested.</p>\n\n<blockquote>\n  <p>The suicide note rules out murder.</p>\n</blockquote>\n\n<p>What meaning does <em>rules out</em> add? You could say it merely adds a notion of impossibility and nothing else, just like <em>can't</em>. But we normally call <em>rule (out)</em> a lexical verb.</p>\n\n<blockquote>\n  <p>Brahma is swimming.</p>\n</blockquote>\n\n<p>In the present continuous, <em>be</em> is commonly considered an auxiliary verb.</p>\n\n<blockquote>\n  <p>Brahma was a man.</p>\n  \n  <p>This man is Brahma .</p>\n</blockquote>\n\n<p>As a copula, it is sometimes considered lexical, sometimes non-lexical. What meaning does it add? It mainly establishes identity between <em>Brahma</em> and <em>a/this man</em>. It also expresses (or implies?) that <em>Brahma</em> existed.</p>\n\n<blockquote>\n  <p>Brahma existed as a man.</p>\n</blockquote>\n\n<p><em>Existed as</em> mainly expresses existence, but also identity. <em>Exist</em> is commonly treated as a lexical verb. But is it all that different from <em>be</em>? Should <em>exist as</em> be considered a copula? No, because copulae must take a subject complement (<a href=\"http://linguistics.stackexchange.com/a/1676/82\">among other requirements</a>), which cannot be introduced by <em>as</em> in this way.</p>\n\n<blockquote>\n  <p>Brahma was in love with Sita.</p>\n  \n  <p>Brahma felt love for Sita.</p>\n</blockquote>\n\n<p>Here <em>be</em> assigns an attribute/property to the subject in the form of a prepositional phrase, the state of being in love. But <em>feel</em> can do the same thing by means of a noun, although it is limited to feelings, unlike <em>be</em>.</p>\n\n<hr>\n\n<p>So whether or not you find existence and identity (copula + noun) or existence and attribute/property (copula + adjectival phrase) a mere grammatical function should determine whether or not you call copulae lexical verbs. It is a choice.</p>\n", "Id":"4762", "ParentId":"4759", "LastEditorUserId":"82", "CreationDate":"2013-10-20T12:37:10.550", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-10-21T10:28:38.507", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-10-21T10:28:38.507", "Score":"3", "CommentCount":"20", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}