{"OwnerUser":{"UpVotes":"6", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/tqgTp.png", "Id":"177", "AccountId":"896176", "CreationDate":"2011-09-19T16:30:42.833", "AboutMe":"<p>Linguistics grad student. Research interests lie in formal semantics, the morphosyntax-semantics interface.</p>\n", "Location":"Canada", "DownVotes":"0", "Views":"9", "Reputation":"396", "DisplayName":"user177", "LastAccessDate":"2014-01-09T01:15:39.280"}, "comments":[], "Body":"<p>Algonquian languages are often used as examples of systems that use animacy as a grammatical category. For the most part, it falls into real-world animacy vs inanimacy, but there are cases where there are mismatches between real-world animacy and the grammatical category. This is always one-way - i.e., all real-world animate entities will be grammatically animate, but some real-world inanimate entities will be grammatically animate. (cf.Goddard 2001)</p>\n\n<p>For example, in Blackfoot, the word for \"knife\" <em>isttoan</em> is grammatically animate, where real-world knives are inanimate. Another example of the arbitariness of the animate/inanimate distinction is the words for an earthenware vs metal bowl. Both types of dishes are <em>ko's</em>, but the earthenware bowl is grammatically inanimate, whereas the metal dish is grammatically animate. (cf. Frantz &amp; Russell 1989/1995, Wiltschko 2009).</p>\n\n<p>(I haven't answered unequivocally \"yes\" to the question, however, because some have argued that Algonquian nominal systems should not be divided according to animacy, but to a \"noble\"/\"ignoble\"  or \"esteem/no-esteem\" distinction (cf. Maillard 1964 for Micmac). And Wiltschko, for example, has proposed that the animate/inanimate distinction in Blackfoot is morphosyntactically parallel to the mass/count distinction as opposed being morphosyntactically parallel to a gender distinctions.)</p>\n", "Id":"477", "ParentId":"451", "CreationDate":"2011-09-23T22:05:33.613", "Score":"4", "PostTypeId":"2", "OwnerUserId":"177", "LastActivityDate":"2011-09-23T22:05:33.613", "CommentCount":"1"}