{"Body":"<p>The key point is the definition of meaning. This definition is probably not limited to linguistic. In fact many applications learn what we could call the meaning of things in completely different ways and for completely different objectives.</p>\n\n<p>In purely linguistic approaches the followings come to my mind:</p>\n\n<ul>\n<li>Clique detection in synonymy graph. Defining a word by its set of pure synonym</li>\n<li>Semantic structure of word paraphrases. You can for example (among many) take a look at <a href=\"http://www.coli.uni-saarland.de/courses/syntactic-theory-09/literature/MTT-Handbook2003.pdf\" rel=\"nofollow\">MTT</a>. But also leveraging sentence semantic structure for word disambiguation... </li>\n</ul>\n\n<p>You can also see the problem in term of image processing, vision. One can learn the meaning of the word <em>chair</em> only looking at pictures of chairs. Many algorithms exist for object and scene classification:</p>\n\n<ul>\n<li><a href=\"http://www-cvr.ai.uiuc.edu/ponce_grp/publication/paper/cvpr06b.pdf\" rel=\"nofollow\">spatial pyramid of bag of visual word</a>, is one of them</li>\n</ul>\n\n<p>You can also see meaning identification as a classification problem. One can argue that nobody knows the real true meaning of \"chair\", \"conscience\" or \"love\", but our ability to distinguish between two concepts of different meaning is essential. Applications and techniques used vary but it then fall down to a classification problem with well known algorithms (CART, logistic regression ...). The purpose can be again disambiguation of polemic word, sense cluster identification, machine translation. In this case the meaning of a given word is a just a point in a machine learning model. </p>\n", "Id":"4774", "ParentId":"4768", "LastEditorUserId":"996", "CreationDate":"2013-10-22T22:48:03.853", "OwnerUserId":"996", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-12-25T23:04:08.147", "LastEditedUser":{"UpVotes":"20", "Location":"paris", "DownVotes":"0", "Id":"996", "AccountId":"126801", "Views":"0", "Reputation":"101", "CreationDate":"2012-05-10T18:49:35.620", "DisplayName":"Ugo", "LastAccessDate":"2014-01-16T07:49:22.670"}, "LastActivityDate":"2013-12-25T23:04:08.147", "Score":"0", "CommentCount":"2", "OwnerUser":{"UpVotes":"20", "Location":"paris", "DownVotes":"0", "Id":"996", "AccountId":"126801", "Views":"0", "Reputation":"101", "CreationDate":"2012-05-10T18:49:35.620", "DisplayName":"Ugo", "LastAccessDate":"2014-01-16T07:49:22.670"}}