{"OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "comments":[], "Body":"<p>I'm a native speaker of American English, and none of the examples you have given strikes me as marked in any way.</p>\n\n<p>I don't know what the latest discourse-structure-based theories of focus would say about these examples, but my intuition is that <strong>they illustrate focus avoidance on \"given\" constituents</strong>. <em>men</em>, <em>food</em>, and <em>guy</em> are somehow \"given\" in their respective contexts. It's true that those words may not have literally been uttered yet at the time they appear in the discourse, but there is something generic about the entities to which they refer in those contexts, in a pragmatic sense. </p>\n\n<p>What is informative in the first discourse, for example, is the race of the men.  Leading up to the mention of the men, the expectation is built up that St. Nicholas is accompanied by some perhaps unexpected entity. His being accompanied by men is not so remarkable (with the introduction of the phrase <em>accompanied by</em> one is biased to expect some category of human), but the fact that they are black is what the speaker expects to be novel and informative for the listener. It's true that one could think of <em>black</em> as being contrasted with other races, but I don't think this is contrastive focus in the usual sense, since the speaker isn't explicitly contrasting it with another specific race. If St. Nicholas were accompanied by six to eight black <em>sheep</em>, I would expect the prominence marking to shift to <em>sheep</em>, since people are not usually accompanied by sheep.  In that case the focus would actually be ambiguous--it could be marking narrower focus on just sheep or broader focus on the entire constituent <em>black sheep</em>.</p>\n\n<p>In the second example, <em>food</em> is somewhat expected after <em>We've ordered...</em>, but the fact that it's Chinese is informative (and in this particular case enticing--it's a selling point to get the listener to help the speaker) to the listener.  Again, had they ordered Chinese <em>dancers</em>, I would have expected <em>dancers</em> to be prominent.</p>\n\n<p>In the third example, the characters have all been talking about the person who has breached their security--the <em>guy</em>. Even more than in the previous two examples, the <em>guy</em> part of <em>crazy guy</em> is given explicitly in the discourse--he's the topic of their conversation. I should mention that, to my ears, the prominence pattern is actually not so clear in this example--I can convince myself that the speaker is putting prominence on <em>crazy</em> or that he's putting it on <em>guy</em> (it's not just about which has higher pitch--sometimes prominent syllables can get lower pitch in English). If he is placing prominence on <em>guy</em>, I would believe that he is contrasting it with the terrorists mentioned by the other character--\"not a terrorist (or a group of terrorists)--just a guy\".</p>\n\n<p>I don't have data on this, but my impression is that these focus phenomena are not unique to American English. I've definitely heard British speakers use similar patterns.  The same holds for earlier generations of speakers. </p>\n", "Id":"4783", "ParentId":"4781", "CreationDate":"2013-10-24T15:23:38.190", "Score":"3", "PostTypeId":"2", "OwnerUserId":"385", "LastActivityDate":"2013-10-24T15:23:38.190", "CommentCount":"6"}