{"OwnerUser":{"UpVotes":"512", "WebsiteUrl":"http://weew-waaw.com", "Id":"1009", "AccountId":"947951", "CreationDate":"2012-05-15T02:50:16.013", "AboutMe":"<p><img src=\"http://i.stack.imgur.com/VxMqM.jpg\" alt=\"Weew-Waaw, Thai to English, Thai to Russian transcription\"><br>\nI'm working on a project of rule-based Thai transcription: (the link is temporarily unavailable)<br>\nTechnically, it is written in F# with a C# front-end.<br>\nI would be happy to get acquainted with those who are experienced with NLP (Natural Language Processing), just ping me in the SE chat. :-)</p>\n", "Age":"42", "Location":"Bangkok, Thailand", "DownVotes":"50", "Views":"36", "Reputation":"1656", "DisplayName":"bytebuster", "LastAccessDate":"2014-01-19T00:53:20.473"}, "comments":[], "Body":"<p><em>Correct me if I misunderstood your question.</em> Assuming that you refer to a fixed combination of morphemes, e.g., fixed root, derivational morphemes, and inflectional morphemes, just as in German <code>nimmst ... mit</code> (as a 2nd person singular present indicative form of <code>mitnehmen</code> lexeme).</p>\n\n<p>What you are talking about seems to be simply <code>word</code>, <a href=\"http://en.wikipedia.org/wiki/Morphological_parsing\" rel=\"nofollow\">morphologically unparsed</a>, or <code>word form</code>.<br>\nSpecifically answering your question, whether <code>word</code> is:</p>\n\n<ul>\n<li><em>an independent lexical unit, independent from the original verb</em> — <strong>No</strong>:\n<ul>\n<li>not a lexical unit, since <a href=\"http://en.wikipedia.org/wiki/Lexicon#Size_and_organization\" rel=\"nofollow\">Lexicon deals with Lexemes</a>, not with individual word forms;</li>\n<li>not an independent one. If you define \"independent\" is that you can <em>use</em> it independently, you really can do it in only a tiny subset of sentences that require only this particular word form;</li>\n</ul></li>\n<li><em>it has it's own special meaning</em> — <strong>One or many</strong>, indistinguishable if you <em>really</em> analyze the word alone;\n<ul>\n<li>Consider English <code>works</code> — it can be either a noun (in plural form), a verb (3rd person singular), or a family name (a proper noun). Even if you stick to verbs, I believe it's easy to find counter-examples in virtually every language;</li>\n</ul></li>\n<li><em>and, unlike other verbs, it's invariable</em> — <strong>Yes</strong>, it's invariable. However, how can we compare a whole lexeme (a complete set of its forms) and one of its particular word forms?</li>\n</ul>\n", "Id":"4794", "ParentId":"4793", "CreationDate":"2013-10-26T12:47:14.653", "Score":"0", "PostTypeId":"2", "OwnerUserId":"1009", "LastActivityDate":"2013-10-26T12:47:14.653", "CommentCount":"2"}