{"comments":[], "Body":"<p>It seems that Legate's work is not conclusive and definitive, per <a href=\"http://web.uni-frankfurt.de/fb10/fery/publications/Prosodic_and_morphosyntactic_aspects_of_discontinuous_NPs.pdf\" rel=\"nofollow\">Fanselow &amp; Féry</a>: </p>\n\n<blockquote>\n  <p>\"Recall that Hale (1983) and Jelinek (1984) proposed an analysis for Warlpiri working with multiple independent modifications of a single argument slot by different autonomous nominal expressions rather than with discontinuous noun phrases in a strict sense. On the other hand, Legate (2002) argues for a configurational analysis of Warlpiri, in the spirit of Rizzi (1997), in which the language would allow discontinuous noun phrases just like German does. The limitations of our data do not permit us to settle such issues.\"</p>\n</blockquote>\n\n<p>According to <a href=\"http://www.mohamedrabeea.com/books/book1_10618.pdf\" rel=\"nofollow\">Falk</a>, Legate's approach is circular: </p>\n\n<blockquote>\n  <p>Attempts have been made in the structurally oriented literature to discover indirect arguments\n  for VP in non-configurational languages; one recent example is Legate (2001) on Warlpiri. Typically,\n  these studies demonstrate that non-configurational languages have subject/non-subject\n  asymmetries in some area of the grammar, such as anaphora, and then argue that such asymmetries\n  require a VP node. However, this argumentation is circular: nobody denies the existence\n  of subject/non-subject asymmetries – the disagreement is over how best to express them formally.\n  Since the basic intuition behind constituent structure is that sentences are built out of\n  hierarchically arranged “pieces” (constituents), what is missing is direct evidence for the VP as\n  a “piece” of structure. While it is true that absence of evidence is not evidence of absence, the\n  absence of such evidence in the literature – despite the theoretical importance of demonstrating\n  that non-configurational languages have a VP – is, to my mind, significant.</p>\n</blockquote>\n\n<p>It would then follow that <a href=\"http://dspace.mit.edu/handle/1721.1/8152\" rel=\"nofollow\">Legate's work</a> can't be applied with Wubuy, yet.</p>\n", "Id":"4796", "ParentId":"4789", "CreationDate":"2013-10-26T15:10:37.947", "Score":"0", "PostTypeId":"2", "OwnerUserId":"1601", "LastActivityDate":"2013-10-26T15:10:37.947", "OwnerUser":{"UpVotes":"3", "DownVotes":"0", "Id":"1601", "AccountId":"262132", "Views":"1", "Reputation":"106", "CreationDate":"2012-12-20T03:21:37.733", "DisplayName":"Axen Zhyrkhinsky", "LastAccessDate":"2014-01-05T12:38:01.483"}}