{"Body":"<p>For Zhuang, the entry by Luo Yongxian in the Routledge language family series for the Tai-Kadai languages is a good overview.  The Institute of Language and Culture for Rural Development at Mahidol University in Bangkok, in conjunction with one of the ethnic minority universities in China, has also produced a multilingual dictionary for one variety of Zhuang – it has Northern Zhuang, Chinese, Thai and English arranged in columns for easy comparison.  The title is simply NZ… Dictionary, published in 2006.  It lacks a real grammar overview, but it would complement Luo well.  It’s part of a series of five volumes covering the different Tai languages spoken in China.</p>\n\n<p>There’s an orthographic convention for Zhuang that is worth knowing at the outset – tone is indicated with final consonants.  For example, the word ‘boux’ is pronounced [pou] with the ‘x’ indicating 33 tone.  (This word, meaning ‘male’ or a classifier for people, is cognate with Thai ผู้ .)  Hmong uses a similar system, I believe.</p>\n\n<p>I am wondering a bit about the geography of your travels.  I would assume you will be crossing into Yunnan province, but Zhuang is mainly spoken in Guangxi, the next province over which borders on Vietnam.  There is an area of Yunnan where Zhuang is spoken called Wenshan, but most of the Tai language speakers in Yunnan speak something else.  In Sipsongbanna, which is where you’d be if you crossed at Botan, one of the major languages is Tai Lue.  A missionary linguist named William Hanna recently published a ‘Dai Lue-English Dictionary’ with Silkworm Books which looks quite good.  It seems to contain some general linguistic background on the language besides the dictionary entries, and it uses the distinctive script of Tai Lue.</p>\n", "Id":"4798", "ParentId":"4787", "LastEditorUserId":"2619", "CreationDate":"2013-10-27T08:10:23.673", "OwnerUserId":"2619", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-10-30T04:25:27.373", "LastEditedUser":{"UpVotes":"42", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/WDpU9.jpg", "Id":"2619", "AccountId":"3471110", "Views":"9", "Reputation":"176", "CreationDate":"2013-10-22T02:54:37.193", "DisplayName":"user2619", "LastAccessDate":"2014-01-16T18:07:58.383"}, "LastActivityDate":"2013-10-30T04:25:27.373", "Score":"2", "CommentCount":"3", "OwnerUser":{"UpVotes":"42", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/WDpU9.jpg", "Id":"2619", "AccountId":"3471110", "Views":"9", "Reputation":"176", "CreationDate":"2013-10-22T02:54:37.193", "DisplayName":"user2619", "LastAccessDate":"2014-01-16T18:07:58.383"}}