{"comments":[], "Body":"<p>I think you might be conflating <a href=\"http://linguistics.stackexchange.com/questions/3398/understanding-voiced-consonants/3401#3401\">phonetic and phonemic voicing</a>. If you are really talking about phonetic voicing, the answer is that <strong>it is quite common to find affricates that are only partially voiced.</strong> As @jlawler points out, the phoneme /dʒ/ in English is considered phonologically voiced, and it contrasts with /tʃ/. But phonetically, what is broadly transcribed as [dʒ] (as for the word <em>judge</em>) is often only partially voiced. In phrase-initial [dʒ] it is quite common for the stop closure to be completely unvoiced and for voicing to turn on at the beginning or partway through the fricative noise, and in phrase-final [dʒ] it is quite common for voicing to turn off before the fricative noise altogether or early on in the fricative noise. Even when the segment is in the middle of a phrase or word, flanked by vowels, it is not uncommon to see part of it devoiced. There are several cues to phonemic voicing in English, so even though there is the /tʃ/-/dʒ/ contrast in the phonology, there definitely is not a phonetic <em>requirement</em> that voicing continue throughout this phonologically voiced affricate. I haven't looked at spectrograms of Portuguese affricates, but I suspect that the same holds in that language. And, as @jlawler points out, in a language that doesn't have the phonological contrast that English has, there is likely to be even more flexibility phonetically. In fact, I would wager that languages with an absolute phonetic requirement that an affricate be fully (phonetically) voiced are rare.</p>\n\n<p>Phonologically, if one believes in phonemes and features, each affricate is treated as a single unit and it either has the feature [+voice] or [-voice], so <strong>it doesn't make sense to talk about \"partial voicing\" of affricates in a phonological context.</strong> And in the Portuguese example, one wouldn't analyze the surface cluster in <em>podes</em> as a single phoneme, so it isn't a relevant example for phonological requirements on affricates.</p>\n", "Id":"4803", "ParentId":"4792", "CreationDate":"2013-10-28T14:58:20.283", "Score":"4", "PostTypeId":"2", "OwnerUserId":"385", "LastActivityDate":"2013-10-28T14:58:20.283", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}