{"Body":"<p>Good question. Your examples are convincing. As I see it, there are four possibilities:</p>\n\n<ol>\n<li><em>Fortunately</em> is not a real sentence adverb; real sentence adverbs do modify the entire sentence.</li>\n<li><em>Fortunately</em> does in fact modify a sentence, but this is obscured by ellipsis.</li>\n<li>The same adverb can be a sentence adverb in some sentences but not others.</li>\n<li>The term <em>sentence adverb</em> does not adequately describe the category of adverbs we have in mind.</li>\n</ol>\n\n<hr>\n\n<p>1) <strong>Does <em>fortunately</em> happen to be a bad example?</strong> Let's take a few other, similar words, then.</p>\n\n<blockquote>\n  <p>a) The cat became agitated. <strong>However</strong>, the mouse was absent from the kitchen.</p>\n  \n  <p>b) The cat was in the kitchen. The mouse, <strong>however</strong>, was not.</p>\n  \n  <p>c) I bought a pair of <strong>hopefully</strong> unused socks at the market.</p>\n</blockquote>\n\n<p>Here it can be seen that <em>however</em> modifies the entire sentence in a), but only <em>the mouse</em> in b) (contrasting it with <em>the cat</em>). And <em>hopefully</em> clearly modifies only <em>unused</em> in c), which is perhaps a bit informal, but not uncommon.</p>\n\n<hr>\n\n<p>2) One could say your example is really an <strong>elliptical form</strong> of a full secondary sentence:</p>\n\n<blockquote>\n  <p>a) The man fell from the tenth story; <strong>fortunately</strong> [it was / he fell] onto a pile of pillows.</p>\n</blockquote>\n\n<p>I find this doubtful.</p>\n\n<blockquote>\n  <p>b) The cat was in the kitchen. The mouse, <strong>however</strong>, was not.</p>\n</blockquote>\n\n<p>It seems impossible to reconstruct this as ellipsis.</p>\n\n<blockquote>\n  <p>c) I bought a pair of — <strong>hopefully</strong> [they are] unused — socks at the market.</p>\n</blockquote>\n\n<p>This perhaps possible, but it seems weak. And it cannot work for <em>however</em>. It seems far more likely that the subconscious sometimes wants to treat <em>hopefully</em> like other <em>-ly</em> words and have it modify an adjective. I hear an English monk sharpening his razor.</p>\n\n<hr>\n\n<p>3) Perhaps <strong>the same adverb can sometimes be a sentence adverb, but at other times modify only a single constituent.</strong> This would then have to apply to most sentence adverbs. The problem or issue is that most adverbs that we normally do not consider sentence adverbs can also do this:</p>\n\n<blockquote>\n  <p>d) The mouse was <strong>often</strong> absent from the kitchen.</p>\n  \n  <p>e) The <strong>often</strong> absent mouse was dearly missed by the cat.</p>\n</blockquote>\n\n<p>What makes this different from <em>fortunately</em> and <em>however</em>? The main difference seems to be that the latter are about the attitude of the speaker towards the text, modality, whereas <em>often</em> is not. In the case of <em>fortunately</em>, its meaning does not change between its use as a sentence modifier and its use as modifying a constituent. It would not seem warranted to call <em>the word</em> a sentence adverb in one sentence and a normal adverb in another, if its meaning does not change; then we could just as well call <em>often</em> a sentence modifier in d), which seems trivial.</p>\n\n<hr>\n\n<p>4) <strong>It doesn't seem to make sense to use <em>sentence adverb</em> at all</strong>, because it suggests that certain adverbs modify only whole sentences and other adverbs do not. Instead, the essence of what makes <em>fortunately</em> etc. special is that they express the attitude of the speaker towards the text, somewhat like modal verbs. Perhaps the intended category should be called <em>modal adverbs</em> instead. Or perhaps we are dealing with more than one category: <em>however</em> could be called a discursive adverb, as it does not really express a modal attitude, but rather the speaker's attitude towards the ordering of the text (in casu a contrast). An attitudinal adverb?</p>\n\n<p>Note that the word <em>disjunct</em> has similar problems, because it implies that the adverb is entirely separate from the rest of the clause and does not modify a constituent.</p>\n", "Id":"4810", "ParentId":"4805", "LastEditorUserId":"2411", "CreationDate":"2013-10-29T12:04:33.427", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-10-30T10:00:28.900", "LastEditedUser":{"UpVotes":"80", "WebsiteUrl":"", "DownVotes":"24", "Id":"2411", "ProfileImageUrl":"https://www.gravatar.com/avatar/5e5b9f5cfa370b99b7b7fdaa27454de1?s=128&d=identicon&r=PG&f=1", "AccountId":"3231657", "Views":"10", "Reputation":"1342", "CreationDate":"2013-08-28T19:22:30.673", "DisplayName":"TKR", "LastAccessDate":"2014-01-19T02:45:52.557", "AboutMe":""}, "LastActivityDate":"2013-10-30T10:00:28.900", "Score":"2", "CommentCount":"28", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}