{"Body":"<p>It exists in Greek and Latin, and probably in most other Indo-European languages—at least in the ones I know: Dutch, French, German, Italian.</p>\n\n<p>In order to create an indefinite relative pronoun in Latin, one uses an extended form of the interrogative pronoun, doubling it, so <em>quidquid</em> instead of <em>quid</em> \"what\"; or one adds <em>-cumque</em> to the relative pronoun, so <em>quodcumque</em> instead of <em>quod</em> \"(that) which\". The indicative mood is used.</p>\n\n<p>Catullus describes how Egnatius is always grinning, whatever happens, <em>Carmen</em> 39, 5–7:</p>\n\n<blockquote>\n  <p>... si ad pii rogum fili  <em>[if at the pyre of a loyal son]</em><br>\n  lugetur, orba cum flet unicum mater,  <em>[people mourn, when the bereft mother bemoans her only son,]</em><br>\n  renidet ille. <strong>quidquid est, ubicumquest,</strong>    <em>[he grins. Whatever it is, wherever he is,]</em><br>\n  <strong>quodcumque agit</strong>, renidet. ...  <em>[whatever is happening, he grins]</em>  </p>\n</blockquote>\n\n<p>In Greek, there are many ways to form indefinite pronouns. One can add a form of the interrogative pronoun <em>tis</em> to the relative pronoun <em>hos</em>, but there are other ways. The indefinite clause is normally in the subjunctive mood. An example from Xenophon, <em>Memorabilia</em> 2.3, 6:</p>\n\n<blockquote>\n  <p>ἄλλοις μὲν ἀρέσκειν δύναται, ἐμοὶ δὲ <strong>ὅπου ἂν παρῇ</strong> πανταχοῦ καὶ ἔργῳ καὶ λόγῳ ζημία μᾶλλον ἢ ὠφέλειά ἐστιν.<br>\n  <em>[he can be pleasant to others, but to me, whenever he is there, he is in all respects, both in deed and in word, harmful rather than helpful.]</em><br>\n  Marchant (1923) translates: \"he is pleasant enough to other people, but whenever he is near me, he invariably says and does more to hurt than to help me\".</p>\n</blockquote>\n\n<p>It is much easier to find an antecedentless (and postcedentless) indefinite pronoun when it refers to something adverbial (a time or place) rather than a thing or person. Both Latin and Greek are (far) more likely to add an antecedent than English or Dutch. I was able to find a Latin example, but not a Greek example. Nevertheless, I think the origin of our antecedentless indefinite clause lies in indefinite clauses that do have antecedents, as in Latin and Greek.</p>\n\n<hr>\n\n<p>An different but interesting development in French is that of the word <em>quoique</em>, \"what which\", similar to Latin <em>quidquid</em>. It can mean \"whatever\"; but it has also developed a meaning \"however\", and even \"although\", as a full conjunction. That is, there is no longer a \"what\" to fulfil the function of a subject or object in the subordinate clause. <a href=\"http://books.google.nl/books?id=epk8G-OHJ18C&amp;pg=PA12&amp;lpg=PA12&amp;dq=voltaire%20quoique&amp;source=bl&amp;ots=nhWrbZhMH6&amp;sig=W_NAylOHOGa0570SmYm0SeNniHU&amp;hl=en&amp;sa=X&amp;ei=5MlxUt32L4ed0QWV5oCgCw&amp;redir_esc=y#v=onepage&amp;q=voltaire%20quoique&amp;f=false\" rel=\"nofollow\">La Harpe</a> to Voltaire (s.xviii):</p>\n\n<blockquote>\n  <p><strong>Quoique</strong> éloigné du centre de notre littérature, vous en êtes toujours l'âme et l'honneur. <em>[However far removed from the centre of our literature, you are still/always its soul and honour.]</em> Modifying the adjective <em>éloigné</em>.</p>\n</blockquote>\n\n<p><a href=\"http://books.google.nl/books?id=r-2w6K9GPk8C&amp;pg=PA40&amp;lpg=PA40&amp;dq=voltaire%20quoique&amp;source=bl&amp;ots=BXBdFQo-L6&amp;sig=cAcmB_oGf_cw3Pwct05J1X2VLb8&amp;hl=en&amp;sa=X&amp;ei=5MlxUt32L4ed0QWV5oCgCw&amp;redir_esc=y#v=onepage&amp;q=quoique&amp;f=false\" rel=\"nofollow\">Calmet</a> (s.xviii):</p>\n\n<blockquote>\n  <p>Les écrivains sacrés, <strong>quoique</strong> remplis d'une lumière supérieure et infallible, s'expriment d'ordinaire d'une façon humaine et populaire; ... <em>[The sacred writers, though full of a superior and infallible light, normally expressed themselves in a human and popular manner; ...]</em> Modifying the entire clause (leaving out the finite verb as in English).</p>\n</blockquote>\n\n<p>Indefinite relative clauses seem to be intimately connected with a concessive (\"although\") connotation in many languages.</p>\n", "Id":"4824", "ParentId":"4818", "LastEditorUserId":"82", "CreationDate":"2013-10-31T03:02:22.927", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-10-31T04:23:50.413", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-10-31T04:23:50.413", "Score":"1", "CommentCount":"2", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}