{"comments":[], "Body":"<p>It's tough.  On the one hand, in phonetic changes like the <a href=\"https://secure.wikimedia.org/wikipedia/en/wiki/Northern_cities_shift\">Northern Cities Shift</a>, it is possible to record successive generations of speakers and measure acoustically how their vowel production (in this case) slowly moves through vowel space.  </p>\n\n<p>It gets trickier for change that is categorical in nature (rather than continuous).  <a href=\"http://repository.upenn.edu/dissertations/AAI3271774/\">Johnson's dissertation</a> tracks a known merger (between <em>cot</em> and <em>caught</em>) along the boundary, and identifies certain families in non-merged territory where children appear to suddenly merge these sounds.  Predicting entirely new changes is a tricky business – it is possible to say what changes are likely to happen in a language, but their realization depends on many factors, some of them completely random.  In general, I'd say that we don't yet have the ability to predict a novel categorical change in a specific time window (50 years, like your question).  </p>\n\n<p>To give one concrete example, English has been \"likely\" to develop negative concord (NC) for centuries as the next step in the <a href=\"https://secure.wikimedia.org/wikipedia/en/wiki/Jespersen_cycle\">Jespersen Cycle</a>.  Optional NC is nearly ubiquitous in low-prestige vernacular speech, but it has not entered the standard language in a unified way, due (in all likelihood) to prescriptive norms against it.</p>\n", "Id":"484", "ParentId":"463", "CreationDate":"2011-09-24T07:37:53.810", "Score":"13", "PostTypeId":"2", "OwnerUserId":"46", "LastActivityDate":"2011-09-24T07:37:53.810", "OwnerUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}}