{"comments":[], "Body":"<p>Similarities between the personal pronouns of languages of northern Eurasia (not just IE and Uralic) has been noted many times by different individuals. It's been claimed to be evidence for the proposed <a href=\"https://en.wikipedia.org/wiki/Nostratic_languages#Personal_pronouns\" rel=\"nofollow\">Nostratic</a> family and other similar controversial macro-family proposals.</p>\n\n<p>Since these proposals are not mainstream, there are several possible mainstream explanations:</p>\n\n<ol>\n<li>/m/ for first person and /t/ or /s/ for second person may represent a universal linguistic tendency like mama/nana and papa/tata words for \"mother\" and \"father\". This explanation doesn't seem plausible because the phenomenon seems to be largely confined to the Old World (except sub-Saharan Africa). For example in Americas the pattern /n/ - /m/ seems to be much more common.</li>\n<li>Pure chance. Widely used function words (like personal pronouns) tend to be short and chance resemblances are almost inevitable. But locality of the phenomenon seems to suggest a rather different explanation.</li>\n<li>Areal features due to language contact (borrowing in this case). It's often stated that pronouns are rarely borrowed and it seems to hold true for most historically known Eurasian languages. But it's also known that some other languages (like Pirahã) borrowed their whole set of personal pronouns. So, maybe, this constraint holds true in only certain cultural settings. It may well be the case that pronouns <em>were</em> borrowed in Eurasia in prehistorical times.</li>\n</ol>\n", "Id":"4851", "ParentId":"1005", "CreationDate":"2013-11-05T15:20:33.953", "Score":"1", "PostTypeId":"2", "OwnerUserId":"805", "LastActivityDate":"2013-11-05T15:20:33.953", "OwnerUser":{"UpVotes":"20", "Location":"Istanbul, Turkey", "DownVotes":"1", "Id":"805", "AccountId":"538434", "Views":"5", "Reputation":"347", "CreationDate":"2012-02-29T19:39:29.067", "DisplayName":"cyco130", "LastAccessDate":"2014-01-09T03:11:01.960", "AboutMe":"<p>Musician, amateur programmer and amateur linguist. Small projects in sourceforge as <a href=\"http://sourceforge.net/users/cyco130/\" rel=\"nofollow\">TrayGun Software</a>.</p>\n\n<p>Grew up with Atari-8 bit, then Borland Pascal, then Delphi. Nowadays mostly using Qt and C++. Reasonably fluent in 6502 and x86 assembler, Pascal, C, C++, Eiffel and knows his way around many other languages.</p>\n", "Age":"35"}}