{"OwnerUser":{"UpVotes":"20", "Location":"Istanbul, Turkey", "DownVotes":"1", "Id":"805", "AccountId":"538434", "Views":"5", "Reputation":"347", "CreationDate":"2012-02-29T19:39:29.067", "DisplayName":"cyco130", "LastAccessDate":"2014-01-09T03:11:01.960", "AboutMe":"<p>Musician, amateur programmer and amateur linguist. Small projects in sourceforge as <a href=\"http://sourceforge.net/users/cyco130/\" rel=\"nofollow\">TrayGun Software</a>.</p>\n\n<p>Grew up with Atari-8 bit, then Borland Pascal, then Delphi. Nowadays mostly using Qt and C++. Reasonably fluent in 6502 and x86 assembler, Pascal, C, C++, Eiffel and knows his way around many other languages.</p>\n", "Age":"35"}, "comments":[], "Body":"<p>In Turkish, some subject + verb groups tend to form a close association, a tendency to stay together and not to allow other words to appear in between. It appears to be motivated by the low animacy of the subject. It is mildly similar to split ergativity. For example:</p>\n\n<pre><code>Adamı köpek ısırdı.\nman+definite-accusative dog bite+past-tense\n</code></pre>\n\n<p>Here, the subject + verb group \"köpek ısır-\" shows a strong tendency to remain together at the expense of natural SOV word order. Because the word \"adam\" (man) has higher animacy than the word \"köpek\" (dog), the topic of the sentence shifts from the subject to the direct object. The subject + verb group \"duman çık-\" shows a similar tendency. Sometimes these rigid groups may accept a subjective \"-en\" participle instead of the expected objective.</p>\n\n<p>The actual rules are way more complicated (and possibly not entirely analyzed) but there is a chapter devoted to the subject in <a href=\"http://www.idefix.com/kitap/turkcede-niteleme-sifat-islevli-yan-tumceler-fatma-erkman-akerson/tanim.asp?sid=AB7YLY4YYT7NMZMM25QN\" rel=\"nofollow\">this book</a>.</p>\n", "Id":"4852", "ParentId":"4838", "CreationDate":"2013-11-05T15:51:24.017", "Score":"0", "PostTypeId":"2", "OwnerUserId":"805", "LastActivityDate":"2013-11-05T15:51:24.017", "CommentCount":"4"}