{"Body":"<p>@TIKSN, please be patient and read the following:</p>\n\n<p>By definition we are always biased when we judge an experience unsuccessful or unuseful when we do not give everything we can to make it successful or useful. You will always find what you are looking for.</p>\n\n<p>The primary goal of Esperanto as an auxiliary language is to \"facilitate the communication\" so people can rapidly and easily communicate and learn about each other cultures. Hence its nature as \"auxiliary\".</p>\n\n<p>Esperanto is a highly agglutinative language, because it uses a word-building mechanisms to rapidly build new words from roots.</p>\n\n<p>In the same time, its regular grammatical structure allows learners to easily develop a feel for nouns, verbs and adjectives. A straight forward simplified pronunciation: One grapheme (smallest writing unit) corresponds to one phoneme(unit of sound). As a result it allows learners to become quite proficient with a minimum amount of effort and time.</p>\n\n<p>Knowing that, there is more than 6000 languages in the word, to not overlook anyone of them: national, regional, tribal... and each one is tied to a country, region, culture, history... Why should one or few national languages be better than others? Isn't that language discrimination?</p>\n\n<p>Esperanto doesn't belong to any country, and everyone can adopt it. Because it has indo-European roots and highly agglutinative characteristics, it offers a very  quick and easy solution to communicate between people of different cultures and languages without any military, colonial or economic hegemony. It helps preserving the diversity of languages which is as important as the diversity of species.</p>\n\n<p>I am not blaming main languages themselves, but the way they aquired their \"International legitimacy\".\nThis is not the case with Esperanto, it is only a vector of communication intended to be a springboard to other languages and their cultures.\nWith esperanto we immediately start efficiently communicating each using his/her own culture. The culture of Esperanto is what we obtain as the result of intercultural communication.</p>\n\n<p>When Learning a language and live it day by day it is like discovering a parallel world with its reality and its people.</p>\n\n<p>I regularly participate in local, regional and international meetings, congresses... and I can find people speaking Esperanto in every country I visits\nI have friends ALL over the world with whom I speak only esperanto. I have build many projects, professionally with esperanto collegues and my friend childrens have Esperanto as their native language.</p>\n\n<p>Comparing to other languages, it is very young but mature enough to be efficiently used for international communication.</p>\n\n<p>For sure, it is going to be tough to go against the historical determinism of the main languages, but it is worth it.</p>\n\n<p>Take a look at these websites for more inf.</p>\n\n<p>lernu.net<br>\nikurso.net<br>\nedukado.net</p>\n\n<hr>\n\n<p>Here is a recently appeared book about the subject, might interest you.</p>\n\n<p>Esperanto as a starter language for child second-language learners in the primary school,</p>\n\n<p>Karen Roehr-Brackin, Angela Tellier, Lingvistiko, Esperanto UK, 2013 (2a eld.).</p>\n\n<p>Resumoj de la malkovroj faritaj kadre de la projektoj \"Springboard to Languages\". Prezo: 12.30 EUR. Pliaj informoj, reta mendilo: <a href=\"http://katalogo.uea.org?inf=9012\" rel=\"nofollow\">http://katalogo.uea.org?inf=9012</a>             </p>\n", "Id":"4854", "ParentId":"3520", "LastEditorUserId":"2688", "CreationDate":"2013-11-06T01:02:52.767", "OwnerUserId":"2688", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-11-15T00:41:30.107", "LastEditedUser":{"UpVotes":"0", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/wcnGI.jpg", "Id":"2688", "AccountId":"986839", "Views":"1", "Reputation":"7", "CreationDate":"2013-11-05T23:57:12.787", "DisplayName":"AJN", "LastAccessDate":"2014-01-14T05:29:41.100"}, "LastActivityDate":"2013-11-15T00:41:30.107", "Score":"0", "CommentCount":"16", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/wcnGI.jpg", "Id":"2688", "AccountId":"986839", "Views":"1", "Reputation":"7", "CreationDate":"2013-11-05T23:57:12.787", "DisplayName":"AJN", "LastAccessDate":"2014-01-14T05:29:41.100"}}