{"OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "comments":[], "Body":"<p>The main problem is that most words cannot be translated one to one. For simple, concrete words like <em>fire</em>, it's less of a problem. But consider a word like <em>up</em>. It has many different senses that would all need to be translated into different words in those other languages: it can mean \"upwards\", \"finished\", etc. Or consider a word like <em>certainly</em>. It can mean \"as is certain\", but also \"granted\" as in a concession. Etc. That's why even the simplest dictionaries have multiple senses for most words. I'll end with the entry for <a href=\"http://dictionary.reference.com/browse/up\"><em>up</em> on dictionary.com</a>, a relatively simple dictionary:</p>\n\n<blockquote>\n  <p>up\n  [uhp] <em>adverb, preposition, adjective, noun, verb,</em> upped, up·ping.\n  adverb\n  1.\n  to, toward, or in a more elevated position: to climb up to the top of a ladder.\n  2.\n  to or in an erect position: to stand up.\n  3.\n  out of bed: to get up.\n  4.\n  above the horizon: The moon came up.\n  5.\n  to or at any point that is considered higher.\n  6.\n  to or at a source, origin, center, or the like: to follow a stream up to its source.\n  7.\n  to or at a higher point or degree, as of rank, size, value, pitch, loudness, brightness, maturity, or speed: to move up in a firm; to pump up a tire; to turn a lantern up; Prices are going up. Speak up! Hurry up!\n  8.\n  ahead; in a leading position in a competition: He managed to get up on his opponent by three points.\n  9.\n  in continuing contact, especially as reflecting continuing awareness, knowledge, etc.: to keep up with the latest developments in mathematics.\n  10.\n  into or in activity, operation, etc.: to set up vibrations.\n  11.\n  into a state of emotional agitation or distress: His insults left her all roiled up.\n  12.\n  into existence, visible form, etc.: His sample was worked up in the studio.\n  13.\n  into view, prominence, or consideration: The lost papers have turned up.\n  14.\n  into or in a place of safekeeping, storage, retirement, etc.: to lay up riches; to put up preserves.\n  15.\n  into or in a state of union, contraction, etc.: to add up a column of figures; to fold up.\n  16.\n  to the required or final point: to pay up one's debts; burned up.\n  17.\n  to a state of completion; to an end: She finished it all up.\n  18.\n  to a halt: The riders reined up and dismounted.\n  19.\n  Baseball. being the player or team batting; at bat.\n  20.\n  (used as a function word for additional emphasis, sometimes preceded by it  ): Go wake your father up. What plugged it up? We laughed it up.\n  21.\n  ahead of an opponent or opponents in points, games, etc.: The golfer was two strokes up on his nearest competitor.\n  22.\n  each; apiece: The score was seven up in the final quarter.\n  23.\n  (of machines or equipment, as computers) working; in working order or in operation.\n  24.\n  Informal. without the addition of ice; straight up: Bring me a martini, up.\n  25.\n  Nautical . toward the wind: Put the helm up.\n  preposition\n  26.\n  to, toward, or at an elevated place on or in: They went up the stairs. The cat is up the tree.\n  27.\n  to, toward, or at a high or higher station, condition, or rank on or in: He is well up the social ladder.\n  28.\n  at or to a farther point or higher place on or in: She is up the street. I'm going up the street.\n  29.\n  toward the source, origin, etc., of: up the stream.\n  30.\n  toward a particular direction or in the interior of, as a region or territory: The explorers were up north.\n  31.\n  in a course or direction that is contrary to that of: to row up the current.\n  adjective\n  32.\n  moving in or related to a direction that is up or is regarded as up: the up elevator; the up train traveling north; the up platform of a railroad station.\n  33.\n  informed; familiar; aware (usually followed by on  or in  ): She is always up on current events.\n  34.\n  concluded; ended; finished; terminated: The game is up. Your hour is up.\n  35.\n  going on or happening; taking place; occurring: What's up over there?\n  36.\n  having a high position or station: He is up in society.\n  37.\n  in an erect, vertical, or raised position: The gate at the railroad crossing is up. The tent is up.\n  38.\n  above the earth or ground: The corn is up and ready to be harvested.\n  39.\n  in the air; aloft: The meteorological balloons are up. The airplanes are up for their reconnaissance flights.\n  40.\n  (of heavenly bodies) risen above the horizon: The sun is up.\n  41.\n  awake or out of bed: to be up with insomnia.\n  42.\n  mounted on horseback: He knows which jockeys are up in every race.\n  43.\n  (of water in natural bodies) high with relation to the banks or shore: The tide is up.\n  44.\n  built; constructed: The new museum is up and open to the public.\n  45.\n  facing upward: He is resting and his face is up.\n  46.\n  sunnyside up.\n  47.\n  (of roads, highways, etc.) having the surface broken or removed (usually used in combination): a torn-up road.\n  48.\n  in revolt, mutiny, or rebellious agitation: Many territories were up and preparing to send troops against the government.\n  49.\n  in a state of agitation: Beware of him when his temper is up.\n  50.\n  Informal. cheerful or optimistic; high-spirited; happy; exuberant; upbeat.\n  51.\n  Informal. productive, favorable, or profitable: a string of up months for the company.\n  52.\n  afoot or amiss: Her nervous manner told me that something was up.\n  53.\n  in a state of enthusiastic or confident readiness (usually followed by for  ): The team was definitely up for the game.\n  54.\n  bound; on the way: She was on a ship up for Australia.\n  55.\n  resolved in an unfavorable or undesired way: They knew that their game was up.\n  56.\n  higher than formerly in cost, amount, degree, etc.: The price of meat was up.\n  57.\n  (of age) advanced (usually followed by in  ): He is rather spry for a man so up in years.\n  58.\n  active: The captain wished to set sail as soon as the wind was up.\n  59.\n  in a legal proceeding as defendant: He is up for murder.\n  60.\n  in operation or ready for use: The theater's lights are up.\n  61.\n  (of points or other standards used to determine the winner in a competition) ahead; in advance: He won the game with two points up over his opponent.\n  62.\n  considered or under consideration: a candidate up for reelection; a bill that is up before Congress.\n  63.\n  wagered; bet: He won all the money up in the game.\n  64.\n  living or located inland or on elevated ground: They live in a village two miles up from the coast.\n  65.\n  (used with a preceding numeral to indicate that a score is tied in a competition): It was 10 up at the end of the first half.\n  66.\n  ahead of an opponent or opponents: They scored three times in a row to go two up.\n  noun\n  67.\n  an upward movement; ascent.\n  68.\n  a rise of fortune, mood, etc.\n  69.\n  a time of good fortune, prosperity, or happiness: He has had more ups than downs in his career.\n  70.\n  an upbound means of public transportation, as a train or bus.\n  71.\n  Informal. a feeling or state of happiness, exuberance, or elation.\n  72.\n  Slang. upper (  def 10 ) .\n  73.\n  a person or thing that is in a favorable position of wealth, fortune, etc.: People who were ups in the business world suffered losses in the economic depression.\n  74.\n  an upward slope; elevation.\n  75.\n  an upward course or rise, as in price or value: The landlord promised his tenants there would be no further ups in the rent this year.\n  76.\n  Slang. upper2 .\n  verb (used with object)\n  77.\n  to put or take up.\n  78.\n  to make larger; step up: to up output.\n  79.\n  to raise; go better than (a preceding wager): to up the ante.\n  verb (used without object)\n  80.\n  Informal. to start up; begin something abruptly (usually followed by and  and another verb): Then he upped and ran away from home.\n  81.\n  (often used imperatively or hortatively) to rise up: Up, men, and fight until all the enemy are defeated!</p>\n</blockquote>\n", "Id":"4859", "ParentId":"4858", "CreationDate":"2013-11-06T12:45:23.433", "Score":"5", "PostTypeId":"2", "OwnerUserId":"82", "LastActivityDate":"2013-11-06T12:45:23.433", "CommentCount":"6"}