{"Body":"<p>I don't think it's a regional question.  Mandarin b,d,g may often be realized with voicing, but the key distinction is aspirated vs. unaspirated.  Here is a lab study of the voicing profiles of Mandarin and German. This comparison with German stops sums it up:</p>\n\n<p>“Phonologically, all Mandarin stop consonants are voiceless; /p,t,k/ are aspirated, /b,d,g/ are unaspirated. In German, stops are usually classified by voicing: /p,t,k/ are voiceless, /b,d,g/ are voiced; aspiration is an optional feature of the voiceless stops. The results of our study show that, despite this typological difference between the consonantal systems of the two languages, Mandarin /b,d,g/, phonologically voiceless and unaspirated, and German /b,d,g/, phonologically voiced and unaspirated, show very similar patterns in their voicing profiles.”  [p.2]</p>\n\n<p>Specifically for Mandarin, they found that “83% of realizations of the voiceless unaspirated alveolar stop /d/ in Mandarin are voiced at the beginning of the closure, and 50% are still voiced at the end of the closure.”  While the unaspirated stops are more likely to be voiced than the aspirated ones, this is not really surprising.  In practical terms, pronounce /b,d,g/ as you might in English, but make sure to aspirate /p,t,k/.  It’s not difficult, really, since they are initial sounds, just like English aspirated stops.  I don’t think this poses problems for native speakers of English, unlike the tripartite stop distinction found in many languages of mainland Southeast Asia.  (Taiwanese also has a 3-way distinction, by the way.)</p>\n\n<p>Here's the link:  Chilin Shih, Bernd Moebius, ‘Contextual Effects on Voicing Profiles of German and Mandarin Consonants’   <a href=\"http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.4.3423&amp;rep=rep1&amp;type=pdf\" rel=\"nofollow\">http://citeseerx.ist.psu.edu/viewdoc/download?doi=10.1.1.4.3423&amp;rep=rep1&amp;type=pdf</a>   </p>\n", "Id":"4862", "ParentId":"4860", "LastEditorUserId":"2619", "CreationDate":"2013-11-07T06:24:37.110", "OwnerUserId":"2619", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-11-14T02:02:21.157", "LastEditedUser":{"UpVotes":"42", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/WDpU9.jpg", "Id":"2619", "AccountId":"3471110", "Views":"9", "Reputation":"176", "CreationDate":"2013-10-22T02:54:37.193", "DisplayName":"user2619", "LastAccessDate":"2014-01-16T18:07:58.383"}, "LastActivityDate":"2013-11-14T02:02:21.157", "Score":"4", "CommentCount":"2", "OwnerUser":{"UpVotes":"42", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/WDpU9.jpg", "Id":"2619", "AccountId":"3471110", "Views":"9", "Reputation":"176", "CreationDate":"2013-10-22T02:54:37.193", "DisplayName":"user2619", "LastAccessDate":"2014-01-16T18:07:58.383"}}