{"OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://yourcodeisshowing.wordpress.com", "Id":"289", "AccountId":"73191", "CreationDate":"2011-09-25T04:03:46.513", "AboutMe":"<p>Developer with 8 years experience. I work with J, C, C++, C#, SQLite, MySQL, VBA, and a bunch of other odds and ends.<p></p>\n\n<p>On Twitter: <a href=\"http://twitter.com/MPProg\" rel=\"nofollow\">@MPProg</a></p></p>\n", "Age":"37", "Location":"Quebec City, Canada", "DownVotes":"0", "Views":"4", "Reputation":"151", "DisplayName":"MPelletier", "LastAccessDate":"2011-09-26T11:10:19.500"}, "comments":[], "Body":"<p>There are some phenomenons at play here.</p>\n\n<p>First, yourself. As others have mentioned, there are some markers that will undeniably identify a person as a foreign speaker, such as pronunciation. As children, we have the possibility of learning how to pronounce most consonants and vowels from most languages. Some sounds (the English th for example) are only mastered later. As we grow older, we lose that ability and remain \"stuck\" with a limited range of sounds we can reproduce, even when we learn a new language.</p>\n\n<p>Secondly, your interlocutors. While all the words you use can be English, and your structure can be the correct grammar, there are levels of formality in every language which second language speakers do not always master. This is where sociolinguistics step in. There is a \"known social norm\" for speech in certain situations, and native speakers are keen to those, albeit unconsciously. It is not bound by fixed lexical or grammatical rules, it's hardly quantifiable, but it exists, native speakers have a \"culture of speech\" that is part of language and yet cannot be taught directly.</p>\n\n<p>I get it too. I'm a foreign speaker myself, and people tell me I talk too formally. Even when I try and play it down it's still there.</p>\n", "Id":"511", "ParentId":"486", "CreationDate":"2011-09-25T04:15:05.943", "Score":"5", "PostTypeId":"2", "OwnerUserId":"289", "LastActivityDate":"2011-09-25T04:15:05.943", "CommentCount":"4"}