{"comments":[], "Body":"<p>I think it all depends on how you define \"near\" future. To make things concrete, we have a very large corpus of spoken English from Philadelphia, where dates-of-birth of our speakers range from 1888 to 1991. Looking at the historical trends across 100 years, I'd feel comfortable making predictions about how the language will look in 3 to 4 years from now, but I think what things will look like 10 to 15 years from now is totally up in the air.</p>\n\n<p>For instance, in the 1970s, it was reported that the vowel /aw/ (as in <em>house</em> and <em>down</em>) was fronting and raising. This fronting and raising pattern looks pretty robust in data collected all the way through the 1980s, into the early 1990s. If you had asked me in 1995 what /aw/ would sound like in 2020, the best guess I could have made based on the available data would be that it would continue shooting up to be something like [iw]. </p>\n\n<p>However, starting in the mid 1990s, the data starts to turn around, and it looks like /aw/ is taking a nosedive towards a lower, backer pronunciation. As such, I'd guess that in 2015, /aw/ is going to be a little lower and backer than it is now, but I don't want to bet any money on what'll be going on in 2030.</p>\n\n<hr>\n\n<p>In more general terms, there are very few language changes which are guaranteed to happen. As @Aaron said, English has been ripe for wide-spread negative concord for centuries, but it hasn't happened yet. All languages which allow voiced, word-final consonants are ripe for developing word-final devoicing, but it's only going to happen in a small subset of them. </p>\n\n<p>The issue is that at any given point in time, there are a lot of language changes which are likely, and for all language changes, it seems obvious why they occurred, post-hoc. However, which language changes are <em>actually</em> going to occur next is up to a lot of historical and social chance.</p>\n\n<p>The whole thing is very comparable to trying to figure out what kind of genetic evolution is going to occur next. As always, some are more likely than others, but non are guaranteed to occur.</p>\n", "Id":"516", "ParentId":"463", "CreationDate":"2011-09-25T17:30:44.320", "Score":"6", "PostTypeId":"2", "OwnerUserId":"28", "LastActivityDate":"2011-09-25T17:30:44.320", "OwnerUser":{"UpVotes":"15", "DownVotes":"2", "Id":"28", "AccountId":"53332", "Views":"31", "Reputation":"1410", "CreationDate":"2011-09-13T20:55:31.697", "DisplayName":"JoFrhwld", "LastAccessDate":"2013-10-22T11:47:47.293"}}