{"OwnerUser":{"UpVotes":"47", "WebsiteUrl":"", "DownVotes":"1", "Id":"153", "AccountId":"871764", "Views":"33", "Reputation":"1445", "CreationDate":"2011-09-18T03:14:58.320", "DisplayName":"Floating Tone", "LastAccessDate":"2012-05-27T05:07:04.410", "AboutMe":"<p>I'm a PhD candidate in linguistics, with diverse interests including phonetics, phonology, morphology, language documentation, historical linguistics and sociolinguistics. I am particularly interested in the languages of Africa, Papua New Guinea and Australia. I'm also very interested in methods of making linguistic knowledge and materials more accessible and available to linguists and non-linguists alike.</p>\n"}, "comments":[], "Body":"<p>In a way, yes.</p>\n\n<p>The thing about mass nouns is that the things they refer to are usually inherently plural/collective/inseparable, like <em>flour</em>, <em>milk</em>, <em>dust</em>, and <em>grass</em>. Those things are most commonly encountered or discussed as, well, masses of a given substance, rather than individual pieces of said substance.</p>\n\n<p>So, it would be somewhat unusual for a language to explicitly mark the 'mass' form of a mass noun, because that would suggest that 'a drop of milk' is the run-of-the mill, everyday way of talking about milk, while 'many drops of milk as one mass' needs to be explicitly indicated because your audience couldn't assume that's what you meant. In effect, you would end up with a similar system to the singular vs. plural marking that happens for count nouns, and it would erode an existing distinction between mass nouns and count nouns.</p>\n\n<p>So instead, what some languages do is mark the <strong>singulative</strong> form of a mass noun, which means basically that there is a marked form of the noun to indicate when it is a piece/part of the unmarked mass noun. In English, we can only do this in a roundabout way: <em>a grain of rice</em> vs. <em>rice</em>, but if we had a singulative marker, say *<em>-op</em>, we could just say *<em>ricop</em> and <em>rice</em>, in the same way as in Bari, you have <em>lɛ-tat</em> 'a drop of milk' and <em>lɛ</em> 'milk'.</p>\n\n<p>A system like this means that, although the mass form of the mass noun is unmarked, mass nouns have their own specific morphology as opposed to count nouns, so are easily distinguished from count nouns (unlike in English, where mass nouns don't take any special morphemes).</p>\n\n<p>Singulative marking is encountered as part of the <strong>tripartite number marking</strong> patterns found in many Nilo-Saharan and Niger-Congo languages. A tripartite number system exhibits three principles of number indication, namely <strong>pluralisation</strong>, <strong>singulativisation</strong>, and <strong>substitution of number morphemes</strong>, as discussed in <a href=\"http://www.lingref.com/cpp/acal/37/paper1591.pdf\">this paper on Western Nilotic noun morphology by Storch (2007).</a></p>\n\n<p>Here is an example from Anywa (Anuak) from Reh 1996 but reproduced by Storch:</p>\n\n<pre><code>              SINGULAR     PLURAL \n\n ‘bell’       okoot        okóód-í     (plural formation)\n\n              COLLECTIVE   SINGULATIVE \n\n ‘butter’     búóp         búób-ò      (singulative formation)\n\n              SINGULAR     PLURAL  \n\n ‘loincloth’  kèèl-ʌ́       kèèl-é      (replacement pattern)\n</code></pre>\n\n<p>And you can see that in this, the mass/collective noun 'butter' is unmarked for the collective form but marked for the singulative formation, with distinct morphology from the plural formation and the 'replacement pattern'.</p>\n\n<p>In the example given above, and others typical of the tripartite system, for a noun like 'bell' the underlying form is a singular, with a morphologically complex plural, while the morphologically unmarked and thus underlying form of ‘butter’ is plural/collective/mass both grammatically and semantically. <strong>A singulative noun is typically a word that denotes an item that is singled out from a mass or group of similar items. Items that normally occur in pairs or larger numbers are expressed by nouns that are semantically and grammatically plural or collective and morphologically not overtly marked.</strong> For a noun like 'loincloth', with the 'replacement pattern', both forms a morphologically complex, and neither may be underlying.</p>\n\n<p>Of course, the semantic distinctions made by speakers of a particular language are crucial to determining how a noun is treated for number marking. This is discussed quite a bit in <a href=\"http://www.jstor.org/pss/30028548\">this paper by Dimmendaal on number marking and noun classification in Nilo-Saharan (2000)</a> (access via an institution). He argues that that there is a continuum between 'object' and 'substance', with the end points of this continuum being universally distinguished (i.e. the most 'county' count nouns and the most 'massy' mass nouns), but with intermediate cases being \"linguistically malleable\" across languages. This is not just true for, say, Nilo-Saharan languages compared to Indo-European languages - it can be true for even very closely related languages, because there is an enormous amount of variation in how these systems work (particularly in the parts of Africa relevant to the Niger-Congo and Nilo-Saharan language groupings, where there are large amounts of linguistic transfer between languages which are geographically close but genetically distant).</p>\n\n<p>Dimmendaal also gives examples from some other languages which show structural similarities to the the singulative marking patterns in the tripartite systems of Nilo-Saharan, such as Russian <em>gorox</em> 'peas', <em>gorošina</em> 'pea'. In the Native American language Kiowa, nouns which are inherently singular or dual take a number suffix to mark plural, while other nouns which are inherently dual or plural ('bone', 'rib', 'wing') take a singulative marker.</p>\n\n<p>So, basically, mass nouns are 'marked', or indicated, by virtue of being morphologically unmarked but having a clear singulative counterpart, and unique noun morphology.</p>\n\n<p>The above points do not take into account the complex interactions between noun classifier systems and number marking in Nilo-Saharan languages, nor external ways of indicating the 'mass-ness' of a noun (the classificatory verbs discussed by @Daniel Briggs) - there are also many other ways to indicate this beyond the noun morphology.</p>\n", "Id":"523", "ParentId":"519", "CreationDate":"2011-09-26T09:53:59.453", "Score":"15", "PostTypeId":"2", "OwnerUserId":"153", "LastActivityDate":"2011-09-26T09:53:59.453", "CommentCount":"1"}