{"Body":"<p>Assume more than one origin.</p>\n\n<p>According to the book \"Women, fire and dangerous things\" (that's a noun-class/gender in an Australian language IIRC) by George Lakoff, it arises due to association. It is not \"invented\"! In the case of the book title, \"women\" had natural gender feminine. Since women tends the fire, \"fire\" received feminine gender. Fire is dangerous, ergo \"dangerous things\" received feminine gender.</p>\n\n<p>Another route, which might be more likely for Indo-European languages, is sound shifts. The markings for two genders become similar for all/some words and the two genders merge. Or, some words of gender X start to sound like words of gender Y due to sound shifts, and change genders so that the system of markings will still make sense. Instead of sorting into genders according to what the words mean you can now just sort them by what they sound like. Note that different dialects may consider the same word to be of different genders...</p>\n\n<p>See the book \"Gender\" by Greville G. Corbett if you really want to dive into the subject.</p>\n", "Id":"527", "ParentId":"525", "LastEditorUserId":"51", "CreationDate":"2011-09-26T14:17:37.587", "OwnerUserId":"119", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-26T16:48:20.200", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2011-09-26T16:48:20.200", "Score":"8", "OwnerUser":{"UpVotes":"302", "DownVotes":"1", "Id":"119", "AccountId":"14652", "Views":"52", "Reputation":"3065", "CreationDate":"2011-09-14T14:24:24.227", "DisplayName":"kaleissin", "LastAccessDate":"2014-01-18T22:21:33.313", "AboutMe":"<p>Sysadmin/programmer by day, linguist by night.</p>\n"}}