{"OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "comments":[], "Body":"<p>Coming from English, ejectives are hard!  I'm studying a Mayan language that's chock full of them, and it took me a solid two years of speaking it before the ejectives stopped feeling like a huge effort to produce.  But it's fairly easy to get to a point where you can produce them <em>with</em> effort.  Here are some tips based on my own experience.</p>\n\n<ul>\n<li>The ejectives further back in the mouth tend to be easier to produce: [q'] and [k'] take less effort than [p'].  Since your native language doesn't have uvular sounds in it, [k'] might be the easiest one to start with.  (FWIW, this isn't just personal bias.  There are a lot more languages with phonemic /k'/ then there are languages with phonemic /p'/ -- which suggests that the [k']-sound really is easier or more natural.)</li>\n<li>The ejectives are <em>glottalized</em> sounds, which means that you shut your glottis while producing them.  It helps to get in the habit of noticing what your glottis is up to.  One way to practice this is to pronounce a sequence of glottal stops (that's the hamza sound in Arabic) and really pay attention to the feeling in the back of your throat and the muscles you're using.  Try to do it <em>without</em> inserting vowels in between the glottal stops.  Vibrating your glottis, like you do to produce a normal vowel, can distract you from the glottis-open/glottis-closed feelings that you're trying to notice.</li>\n<li>Some English speakers (though apparently not all) will use ejectives as <em>emphatic</em> pronunciations for word-final voiceless stops.  Try pronouncing the sentence \"I didn't say <em>sit</em>, I said <em>sick</em>,\" putting as much emphasis as you can on the <em>t</em> in <em>sit</em> and the <em>k</em> in <em>sick.</em>  You may find yourself pronouncing them as [t'] and [k'].  Use kaleissin's puff-of-air test to check.  If, as an English-speaker, you produce a sharp and loudly audible <em>k</em>-sound at the end of a word, and there isn't a big soft puff of air along with it, it was quite likely a [k']. </li>\n<li>Another place you'll hear ejectives in the English-speaking world: beatboxing!  You'll hear [k'] used as a snare drum or rim-shot-type sound, and you'll sometimes hear [p'] used as a bass drum and [ts'] as a sharp closed-hi-hat sound.  If you happen to have put any time into learning to beatbox, or listening to classic hip-hop with prominent beat-boxing, the connection might help.</li>\n<li>My experience is that production is the key to perception.  The better you get at pronouncing the ejectives, the easier it is to recognize them.</li>\n</ul>\n\n<p>Also, FWIW, the Georgian <em>q</em> sound isn't at the same point of articulation as 'ayin.  It's actually at the same point of articulation as <em>qāf</em> &mdash; though, like you say, qāf isn't glottalized and Georgian <em>q</em> is.</p>\n", "Id":"530", "ParentId":"381", "CreationDate":"2011-09-26T14:51:15.610", "Score":"7", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2011-09-26T14:51:15.610", "CommentCount":"3"}