{"Body":"<p>If you're talking about why there is such thing as a neuter gender at all, I mentioned in my answer to <a href=\"http://linguistics.stackexchange.com/q/379/42\">this question</a> that many believe the masculine/feminine/neuter paradigm of so many IE languages is derived from PIE first distinguishing between animate/inanimate nouns, then the animate noun category began to distinguish between masculine/feminine (<a href=\"http://homer.members.pgv.at/INDOEURO/gender.htm\">link</a>).</p>\n\n<p>If you're talking about why certain nouns are part of specific genders, I too would second the recommendation of Lakoff's <em>Women, Fire and Dangerous Things</em> (<a href=\"http://rads.stackoverflow.com/amzn/click/0226468046\">link</a>). It's a really interesting exploration of hierarchical cognitive models using some case studies as a guide. </p>\n\n<p>EDIT: Here's is Foundalis's closing to his paper <a href=\"http://www.foundalis.com/res/EvolutionOfGender.pdf\">Evolution of Gender in Indo-European Languages</a>.</p>\n\n<blockquote>\n  <p>An alternative hypothesis is that masculine and feminine assignments\n  to inanimate objects existed even in the original Indo-European\n  ancestor. Although such assignments seem nonsensical today, they might\n  have “made sense” in the remote past, at least among the few speakers\n  of the ancestor language, based on animistic conceptions of the world.\n  It could have appeared natural to a particular culture that, for\n  example, a stone is of female sex. However, as the original language\n  evolved, ideas about the stone’s sex changed, too. Since there is no\n  objective way to agree on something like the sex of a stone, the\n  “opinions” among descendant languages evolved differently. What we\n  observe today appears as a purely formal and arbitrary assignment,\n  since the original “reasons” have been lost. One prediction of this\n  hypothesis is that gender evolution in such languages should be\n  traceable through a weak agreement between phylogenetically proximal\n  languages. I believe the present work supports this implication,\n  although further investigation of the hypothesis is clearly needed.</p>\n</blockquote>\n\n<p>This doesn't answer how it occurred, but offers a why: my two cents is that gender is useful since it can help free up word order, ease reference to antecedent words -- basically make communication more efficient. </p>\n", "Id":"533", "ParentId":"525", "LastEditorUserId":"42", "CreationDate":"2011-09-26T16:26:44.753", "OwnerUserId":"42", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-26T18:32:21.850", "LastEditedUser":{"UpVotes":"108", "WebsiteUrl":"http://twitter.com/mollyocr", "Id":"42", "AccountId":"896571", "CreationDate":"2011-09-13T21:04:13.347", "AboutMe":"<p>BA in Linguistics. Currently working as a localization &amp; QA specialist at a translation company in Minneapolis. Studied: Latin, Spanish, French, Arabic, Polish, Mandarin. Conlanger. Sci fi &amp; fantasy nerd, experimental cook, songwriter, artist and craftist. Also, I have a dog.</p>\n", "Age":"28", "Location":"Minneapolis, MN", "DownVotes":"8", "Views":"24", "Reputation":"933", "DisplayName":"mollyocr", "LastAccessDate":"2012-09-13T19:49:49.973"}, "LastActivityDate":"2011-09-26T18:32:21.850", "Score":"9", "CommentCount":"3", "OwnerUser":{"UpVotes":"108", "WebsiteUrl":"http://twitter.com/mollyocr", "Id":"42", "AccountId":"896571", "CreationDate":"2011-09-13T21:04:13.347", "AboutMe":"<p>BA in Linguistics. Currently working as a localization &amp; QA specialist at a translation company in Minneapolis. Studied: Latin, Spanish, French, Arabic, Polish, Mandarin. Conlanger. Sci fi &amp; fantasy nerd, experimental cook, songwriter, artist and craftist. Also, I have a dog.</p>\n", "Age":"28", "Location":"Minneapolis, MN", "DownVotes":"8", "Views":"24", "Reputation":"933", "DisplayName":"mollyocr", "LastAccessDate":"2012-09-13T19:49:49.973"}}