{"OwnerUser":{"UpVotes":"219", "WebsiteUrl":"http://sourceforge.net/projects/jarsearch/", "Id":"112", "AccountId":"282385", "CreationDate":"2011-09-14T09:38:41.260", "AboutMe":"<p>Born a Frenchman, addicted to the BBC (wherever I live bloom satellite dishes), I have spent several years in the UK (specifically Richmond (I said \"UK\" )) as well as in Italy (Naples (I said \"Italy\")). Currently based in Dubai (UAE).</p>\n\n<p>An electronic Engineer by formation and an IT/Telecom professional by occupation, I've had the opportunity to work in many countries (Saudi Arabia, China mainland and Taiwan, Romania, Spain, Ghana, the Netherlands, Brazil, United States, Panama, Dominican Rep., Tunisia, Turkey, Syria and a few others).</p>\n\n<p>Raised by a German au pair at 5, having done my military duty in Germany, I've always been fascinated by languages in general and etymology in particular and my occupation has provided me with several opportunities to indulge in this hobby. I started to learn several languages and still can understand a few of them: including English, Italian and Spanish. The latter allowing me to communicate with my son (see avatar), my wife and my in-laws.</p>\n\n<p>Other accounts I have in the stackexchange family include <a href=\"http://english.stackexchange.com/users/5432/alain-pannetier\">English Language &amp; Usage</a>, <a href=\"http://stackoverflow.com/users/579240/alain-pannetier\">stackoverflow</a>,  <a href=\"http://programmers.stackexchange.com/users/18217/alain-pannetier\">programmers</a>, <a href=\"http://french.stackexchange.com/users/131/alain-pannetier\">French Language &amp; Usage</a>, <a href=\"http://german.stackexchange.com/users/205/alain-pannetier\">German Language and Usage</a> and <a href=\"http://stackexchange.com/users/282385?tab=accounts\">a few others</a>.</p>\n\n<p>If you wish to contact me, please feel free to do so using my email/chat account which is alain dot pannetier at gmail dot com.</p>\n", "Age":"53", "Location":"Paris, France", "DownVotes":"4", "Views":"14", "Reputation":"560", "DisplayName":"Alain Pannetier", "LastAccessDate":"2014-01-17T17:52:53.833"}, "comments":[], "Body":"<p>Albanian has arguably only the past participle. </p>\n\n<p>It is often formed by adding an \"-ur\" postfix at the end of the stem if the stem ends with a consonant and \"-r\" otherwise (although there are of course many special cases).  In Tosk there is only one form but Teg instead has two forms depending on whether the past participle is used as an adjective or in verbal phrase.</p>\n\n<p>This apparent paucity is compensated by a large number of uses.</p>\n\n<ul>\n<li>The Gerund is formed by the juxtaposition of <em>dúke/tue</em> with the past participle [Tosk/Geg]. Which is why I claim that there is no specific \"present participle\". See the use of \"po\" however as another way to form progressive forms.</li>\n<li>The Infinitive itself is composed of <em>për te</em> + past participle [Tosk] or <em>me</em> + past articiple [Geg].</li>\n<li>Many past tenses use the past participle combined with a variety of auxiliaries.</li>\n</ul>\n\n<p>For more, you can refer to <a href=\"http://www.verbix.com/languages/\" rel=\"nofollow\">verbix</a> a great resource for many present and past languages.</p>\n", "Id":"541", "ParentId":"524", "CreationDate":"2011-09-26T20:58:20.960", "Score":"3", "PostTypeId":"2", "OwnerUserId":"112", "LastActivityDate":"2011-09-26T20:58:20.960", "CommentCount":"1"}