{"OwnerUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}, "comments":[], "Body":"<p>This is a failed example of what you are looking for, but perhaps it will be interesting for you nonetheless.  </p>\n\n<p>At a certain point (in the late 70s, if my memory serves – but I could be off by a bit), linguists working in the generative tradition started describing certain languages as \"non-configurational,\" meaning that they belonged to a class of languages which lack word order (by contrast with most languages familiar to linguists, which were of course acknowledged to have word order).*  Various explanations were pursued as to how non-configurational languages could have a grammar (making sure that morphological agreement happens, that verbs have the right number of arguments, etc.) without traditional syntactic notions that are often dependent on order.  The paragon example of such a language was held to be Warlpiri (Pama-Nyungan, Australia), but it has now been shown to be analyzable in terms of familiar syntactic theories.</p>\n\n<p><a href=\"http://www.jstor.org/stable/4047512\">This 1983 article</a> by Hale in NLLT is an example of a non-configurationality analysis of Warlpiri.  <a href=\"http://dspace.mit.edu/handle/1721.1/8152\">This 2002 MIT dissertation</a> by Legate** argues for an analysis of the language in line with standard syntactic theories, and by extension that \"non-configurational languages\" do not form a separate class.</p>\n\n<hr>\n\n<p>*This is of course soemething of a simplification of the literature on non-configurationality.</p>\n\n<p>**Full disclosure: a professor of mine.</p>\n", "Id":"542", "ParentId":"538", "CreationDate":"2011-09-26T21:30:03.857", "Score":"9", "PostTypeId":"2", "OwnerUserId":"46", "LastActivityDate":"2011-09-26T21:30:03.857", "CommentCount":"2"}