{"OwnerUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}, "comments":[], "Body":"<p>I just read about a study on this which used a fascinating methodology.  Here's a description of it from Arends et al. (1994) <em>Pidgins and creoles, An introduction</em> Johns Benjamins ch. 9 (p. 108):</p>\n\n<blockquote>\n  <p>Twenty Ndjuka [English-based creole, Surinam/Fr. Guyana – AE] morphemes were selected for which the 'area of meaning' [...] differs from the corresponding English morpheme, such as the word <em>mófu</em>, meaning both \"mouth\" and \"pointed end of a pointed object.\"  For each sense of each morpheme, an English sentence was constructed illustrating that particular sense.  Correspondents for 43 languages [...] were asked to give the equivalent for each sense of each selected morpheme.  Finally, by scoring the extent to which in each particular language one and the same morpheme was used to express different senses of each of the twenty morphemes, these languages could be arranged according to the degree to which their lexical semantic structure resembled that of Ndjuka.</p>\n</blockquote>\n\n<p>The original study is Huttar (1975) \"<a href=\"http://www.jstor.org/stable/412893\" rel=\"nofollow\">Sources of creole semantic structures</a>\" <em>Language</em> vol. 51 (link to JSTOR).  The quantitative methodology is a little dated, but the basic approach to collecting the data is very interesting (and, so far as I know, not being practiced systematically these days).</p>\n", "Id":"546", "ParentId":"430", "CreationDate":"2011-09-27T01:16:53.550", "Score":"3", "PostTypeId":"2", "OwnerUserId":"46", "LastActivityDate":"2011-09-27T01:16:53.550", "CommentCount":"1"}