{"Body":"<p>I'm not quite sure what you mean by a \"direct n-language creole.\"  Creoles can and do draw their lexicon from many different sources; I would argue looking at aspects of syntax often doesn't let us identify any clear parents at all.  (Berbice Dutch, a SVO language, developed from Ijo and Dutch, both SOV).  So it seems that creoles from exactly two parents are not the norm, and furthermore considering different aspects of a creole's grammar/lexicon can give different answers as to what language(s) are the parents.  Nonetheless, here's an attempt at answering your question from a couple points of view.</p>\n\n<p>Whinnom proposed a principle of \"tertiary hybridization\" which states that three language groups must be in contact for a creole to form.  This is perhaps best illustrated by an example: in Papua New Guinea, Motu speakers were responsible for much coastal trade; they spoke pidgin Motu with their trading partners.  The <a href=\"https://secure.wikimedia.org/wikipedia/en/wiki/Hiri_Motu\">Hiri Motu</a> (\"Hiri\" means trade) language arose when various of the trading partners began using their common pidgin Motu as a communication device among themselves.  Motu could not form the basis of a creole (so the theory goes) when actual L1 speakers of Motu were in abundance, because they would perpetuate Motu grammatical norms as opposed to allowing a novel creole grammar to flourish.</p>\n\n<p>But I suspect that you are asking about creoles with a significant lexical contribution from many languages.  Smith (1987, <em>The genesis of the creole languages of Surinam</em>, a Univ. of Amsterdam dissertation) speaks of a core of lexical material found in English-based Atlantic creoles which comes from various African languages.  It was probably first amalgamated in a pidgin English spoken in African ports, then carried to the New World by slaves.</p>\n\n<p>There is also <a href=\"https://secure.wikimedia.org/wikipedia/en/wiki/Saramaccan\">Saramaccan</a>, which is among the most \"mixed\" creoles known, having drawn large portions of its core vocabulary from both English and Portugese.  However, it also has other European and African influences.  </p>\n", "Id":"554", "ParentId":"551", "LastEditorUserId":"46", "CreationDate":"2011-09-27T07:53:24.287", "OwnerUserId":"46", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-27T08:04:09.090", "LastEditedUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}, "LastActivityDate":"2011-09-27T08:04:09.090", "Score":"11", "CommentCount":"3", "OwnerUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}}