{"Body":"<p>If you refer mostly to word order, then yes, some languages are syntactically stricter than others. It is often (as in: there is a correlation) related to the amount of morphological markers of function in the sentence. In other words, languages with a \"rich\" morphology (i.e. with expansive case systems, agreement of nouns with adjectives, rich verbal systems with person marking for all main participants, etc.) will tend to have a freer word order than languages that lack such markings. In those languages, word order will often take over the role of indicating grammatical roles in the sentence, and for this reason will tend to become fixed, as changing the word order in such languages would likely cause misunderstandings.</p>\n\n<p>Of course, the correlation is not perfect, but as a rule of thumb it works very well.</p>\n\n<p><strong>Examples of languages with a strict syntax are simple to find</strong>: <strong>English</strong> is one of those. English is quite strictly SVO (alternative word orders are restricted to formal written prose and poetry), subjects are mandatory (even for verbs that logically don't take a subject, like \"to rain\"), adjectives must be put in front of the noun they complete (only heavy constituents can be put after a noun they complete), etc. About the only free constituents are adverbs and adverbial phrases, and even those are somewhat restricted in their movements in the sentence: fronting them, for instance, will sometimes result in a different meaning altogether.  Contrast the following two sentences</p>\n\n<pre>\n(1) I only want to see her\n(2) Only, I want to see her\n</pre>\n\n<p>I believe <strong>Mandarin Chinese</strong> is also quite strict in its syntax, but I don't know enough of the language to give examples.</p>\n\n<p><strong>German</strong> is also a language with some very strict syntactic rules, despite having declensions. For instance, it is strictly V2 in independent clauses (i.e. the finite verb must always be the second constituent of an independent clause), so when fronting another element of the sentence, the subject that normally comes in front of the verb <em>must</em> be put right after it (without anything in between). Word order is allowed some freedom, but the rules behind it are extremely strict. In the same way, the infinite verb part of a periphrastic conjugation must be placed at the end of the independent clause, and no other part of that clause can come after it.</p>\n\n<p><strong>Dutch</strong>, on the other hand, can be said to be somewhat less strict than German: it has the same ordering rules (V2, infinite verb at the end of the clause), but is somewhat less strict with the last one, allowing one to add some noun phrases after the infinite verb of a periphrastic conjugation. This is, AFAIK, allowed in some German dialects as well, but is still less common than in Dutch.</p>\n\n<p><strong>On the freer side of things</strong>, take for instance <strong>Modern Greek</strong>. Although the language is nominally SVO, any word order is allowed, depending on the kind of focus the speaker wants to give and the elements used. And like <strong>Spanish</strong> and <strong>Italian</strong>, it is pro-drop, and allows one not to show an overt subject, as it is already indicated in the verb. Word order in the noun phrase is slightly stricter, but even there it's freer than in English. For instance, as in English the article has to be put in front of the noun, but demonstratives can freely appear before or after the noun (\"αυτό το αυτοκίνητο\" and \"το αυτοκίνητο αυτό\" both mean \"this car\" and are completely interchangeable). Possessors normally appear after the noun, but they can be put in front of it, although this is considered somewhat formal.  For example, both the following sentences can mean \"the dog's toy\", although the second one is rather marked and formal.</p>\n\n<pre>\n(3) το   παιχνίδι του      σκύλου\n    the  toy      the-GEN  dog-GEN\n\n(4) το   του      σκύλου  παιχνίδι\n    the  the-GEN  dog-GEN toy\n</pre>\n\n<p>Another language with a relatively free syntax is <strong>Basque</strong>. Although it is typologically SOV, all word orders are allowed (even verb-initial clauses are allowed, although only if the verb has some particle in front of it, like the negative <em>ez</em> or the affirmative <em>ba-</em>), although which word order can be used in which situation is often pragmatically defined, especially by the rule of <em>galdegaia</em>, i.e. focus.</p>\n\n<p>I believe there are even freer languages, even going as far as allowing the noun phrase to be separated and its constituents put in various places in the clause, but I don't have enough experience to comment much on them. I know <strong>Classical Latin</strong> allowed some quite outlandish things (having suffered through 5 years of Latin classes :) ), but it is unclear whether those things (found nearly exclusively in poetry) could be called grammatical at all. Poetic license was strong in Classical Latin.</p>\n\n<hr>\n\n<p>For more info, you might want to take a look at <a href=\"http://wals.info/\">WALS</a>. Feature 81 \"Order of Subject, Object and Verb\" already lists 189 languages lacking a dominant word order. WALS lists quite a few other features related to \"freedom\" of syntax.</p>\n\n<p>Note however that \"free\" syntax does not necessarily mean that all word orders can be equally used or are equivalent in meaning. Even in languages that allow re-orderings freely, word order often has a pragmatic meaning, indicating topic and/or focus.</p>\n", "Id":"559", "ParentId":"557", "LastEditorUserId":"45", "CreationDate":"2011-09-27T11:18:55.210", "OwnerUserId":"45", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-28T09:07:29.590", "LastEditedUser":{"UpVotes":"4", "WebsiteUrl":"http://christophoronomicon.blogspot.com/", "Id":"45", "AccountId":"402526", "CreationDate":"2011-09-13T21:05:16.063", "AboutMe":"", "Age":"38", "Location":"Netherlands", "DownVotes":"0", "Views":"12", "Reputation":"533", "DisplayName":"Tsela", "LastAccessDate":"2012-10-11T15:15:46.777"}, "LastActivityDate":"2011-09-28T09:07:29.590", "Score":"16", "CommentCount":"3", "OwnerUser":{"UpVotes":"4", "WebsiteUrl":"http://christophoronomicon.blogspot.com/", "Id":"45", "AccountId":"402526", "CreationDate":"2011-09-13T21:05:16.063", "AboutMe":"", "Age":"38", "Location":"Netherlands", "DownVotes":"0", "Views":"12", "Reputation":"533", "DisplayName":"Tsela", "LastAccessDate":"2012-10-11T15:15:46.777"}}