{"OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "comments":[], "Body":"<p>The Mandarin apical vowels are examples of <em>syllabic fricatives</em> &mdash; that is, fricative sounds that form the nucleus of a syllable, as a vowel generally would.  (Sometimes syllabic fricatives are also called \"fricative vowels,\" though that's rarer.)</p>\n\n<p><a href=\"http://books.google.com/books?id=h1byJz_rWUcC&amp;lpg=PA314&amp;ots=3KQ0WrBD1a&amp;dq=syllabic%20fricative&amp;pg=PA314#v=onepage&amp;q=syllabic%20fricative&amp;f=false\">Here's a discussion from one of Ladefoged's books</a> on \"fricative vowels\" a.k.a. syllabic fricatives in other parts of the world.  He mentions examples from Czech and Bantu.  Berber is also often described as having syllabic fricatives.  <a href=\"http://www.ece.ubc.ca/~donaldd/publications/handout_algonquian38_donald_derrick.pdf\">Blackfoot has recently been claimed to have syllabic /s/</a>.  </p>\n\n<p>(It's maybe worth mentioning too that you'll hear syllabic fricatives in English, if only as a fast speech phenomenon.  So for instance, in my dialect, the word <em>horses</em> is [hɔɹsɨz] if I'm speaking carefully and [hɔɹsz̩], with a syllabic [z̩], in fast speech.  If I'm in a hurry, the last syllable of <em>horses</em> sounds an awful lot like Pinyin <em>si</em>.)</p>\n", "Id":"566", "ParentId":"552", "CreationDate":"2011-09-27T17:07:30.317", "Score":"11", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2011-09-27T17:07:30.317", "CommentCount":"4"}