{"comments":[], "Body":"<p>I think you've misunderstood the claim that \"clitics don't trigger suppletion.\"  It's perfectly consistent to have an unanalyzable clitic like <em>-ak</em> which spells out more than one feature.  The usual claim is that clitics don't trigger suppletion <em>of the lexical word that they attach to.</em>  So for instance, if the definite article <em>-a</em> is a clitic, then you shouldn't be able to have a word <em>foo</em> that unexpectedly becomes <em>bar-a</em> rather than <em>foo-a</em> when the definite article is attached.  </p>\n\n<p>I also don't think your epenthesis and elision data call for <em>-a</em> to be analyzed as an affix. There are two alternate possibilities here.  First, you could posit a whole paradigm of clitics: <em>-a</em> for definite absolutive singular nouns, <em>-ak</em> for definite absolutive plural nouns, <em>-ari</em> for definite dative singular nouns, <em>-ei</em> for definite dative plural nouns, and so on.  Essentially, these would be like the German determiners (which mark case, number and definiteness), except that they'd be clitics instead of independent words.  </p>\n\n<p>The second possibility would be to treat the case markers as separate morphemes (so that e.g. the dative clitics would be underlyingly <em>-a-i</em> and <em>-e-i</em>) and come up with some sort of phonological epenthesis and elision rules that generate the forms you actually see.  Note that it's entirely possible to have a conditional epenthesis rule that, for instance, would insert an <em>r</em> between <em>a</em> and <em>i</em> but not between <em>e</em> and <em>i</em>.</p>\n\n<p>I don't know enough about Basque to say which approach would work better.  I'm really just commenting on the data you've presented in your post.  But based on this data, I'd say the definite article was pretty clearly a clitic (or a whole paradigm of clitics), and your arguments for calling it an affix seem unconvincing.</p>\n\n<p>[Gee, I hope I didn't just do your Syntax homework for you.]</p>\n", "Id":"570", "ParentId":"562", "CreationDate":"2011-09-27T17:55:16.907", "Score":"4", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2011-09-27T17:55:16.907", "OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}}