{"OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "comments":[], "Body":"<p>There's a broader phenomenon here: we name things based on what they're <em>used for</em>, and not always just on what they're <em>made from</em>.  Some examples off the top of my head:</p>\n\n<ul>\n<li><p>The same square of plain cotton cloth could be a \"rag,\" a \"bandana,\" a \"handkerchief,\" a \"placemat\" or a \"wrapper\" depending on the use you intend to put it to.  Similarly, a big rectangle of terrycloth could be a \"bathmat\" or a \"towel,\" depending on what you're using it for.</p></li>\n<li><p>\"Seed corn\" is just ordinary corn that someone intends to plant in the future.  It's physically indistinguishable from other kinds of corn.  In some languages, there are separate, unrelated words for \"corn kernels used as food\" and \"corn kernels set aside as seeds.\"</p></li>\n<li><p>Where I grew up, a \"chock\" is a triangular wedge of wood that you put behind the wheels of a truck to keep it from rolling downhill.  An identical wedge of wood that was, say, being used as part of a little kid's set of toy blocks wouldn't be called a \"chock.\"</p></li>\n<li><p>A stoat that's being raised for fur is called an \"ermine,\" as is the fur it produces.  </p></li>\n</ul>\n\n<p>So you could ask the same question for all of these: \"Why aren't rags just called <em>wiping cloths?</em>  Why aren't handkerchiefs just called <em>nose cloths?</em>  Why did we coin the word <em>chock</em> instead of calling them <em>wheel wedges?</em>  Why isn't an ermine just a <em>fur stoat?</em>\"  </p>\n\n<p>I'm not sure I have a positive answer to those questions.  But it's good to keep in mind that language is rarely as logical or as efficient as it could be.  So I'd look at this as a general feature of human language rather than a specific weirdness about livestock terminology.  Sometimes we coin new words for things that we use for a special purpose &mdash; even when it's redundant to do so.  </p>\n", "Id":"571", "ParentId":"553", "CreationDate":"2011-09-27T18:27:35.333", "Score":"13", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2011-09-27T18:27:35.333", "CommentCount":"3"}