{"comments":[], "Body":"<p>It's not easy to find examples that do not involve temporal/aspectual matters, since circumstantial modality is usually forward looking (what certain facts lead to or leave open) while epistemic modality is usually backward looking (reasoning backward from the available evidence). But here's a try:</p>\n\n<blockquote>\n  <p>John has to be in his office.</p>\n</blockquote>\n\n<p>Under the epistemic reading, this reasons from clues and deduces that John is in his office. Under the circumstantial reading, this claims that certain facts leave John no choice but to be in his office. Admittedly, this easily acquires a deontic tint. My favorite circumstantial example is:</p>\n\n<blockquote>\n  <p>I have to sneeze.</p>\n</blockquote>\n\n<p>The speaker is not saying that her evidence leads her to conclude that she is going to sneeze. She is saying that the state of her body leaves her no choice but to sneeze.</p>\n", "Id":"587", "ParentId":"362", "CreationDate":"2011-09-28T18:15:37.887", "Score":"10", "PostTypeId":"2", "OwnerUserId":"340", "LastActivityDate":"2011-09-28T18:15:37.887", "OwnerUser":{"UpVotes":"1", "WebsiteUrl":"http://kaivonfintel.org", "Id":"340", "AccountId":"896253", "CreationDate":"2011-09-28T17:56:13.917", "AboutMe":"<p>I'm a professor of <a href=\"http://mit.edu/linguistics\" rel=\"nofollow\">linguistics</a> at <a href=\"http://mit.edu/\" rel=\"nofollow\">MIT</a>. I work on meaning. I am also Associate Dean of MIT's <a href=\"http://shass.mit.edu/\" rel=\"nofollow\">School of Humanities, Arts, and Social Sciences</a>. I have a wife, two kids, two cats, and a dog. I live in an intentional community (<a href=\"http://mosaic-commons.org/\" rel=\"nofollow\">Mosaic Commons Cohousing</a>) in Berlin, Massachusetts. I am a runner. I like soccer, a lot. I was born on a cold winter’s night in a small village on the Lüneburg Heath in Northern Germany.</p>\n", "Age":"53", "Location":"Berlin, MA", "DownVotes":"1", "Views":"18", "Reputation":"490", "DisplayName":"Kai von Fintel", "LastAccessDate":"2013-08-20T18:20:48.830"}}