{"comments":[], "Body":"<p>There are two things going on here.</p>\n\n<p>As it is correctly stated in the question, the primary use case of the -(y)En suffix is to modify the head noun when it's the <em>subject</em> of the embedded clause. Let's call it the use case A.</p>\n\n<pre><code>    Çocuğu uyandırma.\n    Don't wake up the child.\n\n    Çocuk odada uyuyor.\n    The child is sleeping in the room.\n\n    Evde uyuyan çocuğu uyandırma.\n    Don't wake up the child who's sleeping in the room.\n</code></pre>\n\n<p>The first thing that is going on is that -(y)En is also used when the head noun is the the modifier of a possessive construction functioning as the subject of the embedded clause. Since it's an extension of the use case A, let's call it the use case A'.</p>\n\n<pre><code>    Çocuğun odası yeni boyandı.\n    The child's room was recently painted.\n\n    Odası yeni boyanan çocuğu uyandırma.\n    Don't wake up the child whose room was recently painted.\n</code></pre>\n\n<p>The second thing that is going on is that sometimes -(y)En can also be used when the subject of the embedded clause has low definiteness and animacy and the head noun is in dative -(y)E, locative -DE or ablative -DEN with a directional or locative function (not when they function as indirect objects). In rare cases, it can also be used when the head noun is the direct object in accusative case -(y)İ. Let's label all these use cases the use case B.</p>\n\n<pre><code>    Odaya güneş giriyor -&gt; Güneş giren oda\n    Çekmecede para duruyor -&gt; Para duran çekmece\n    Caddeden tramvay geçiyor -&gt; Tramvay geçen cadde\n    Kızı arı soktu -&gt; Arı sokan kız\n</code></pre>\n\n<p>The example in the original question is what we can label as the use case B'. It happens when the head noun modifies an argument that would be eligible for the use case B in a possessive construction.</p>\n", "Id":"5884", "ParentId":"4838", "CreationDate":"2013-11-11T16:27:23.163", "Score":"0", "PostTypeId":"2", "OwnerUserId":"805", "LastActivityDate":"2013-11-11T16:27:23.163", "OwnerUser":{"UpVotes":"20", "Location":"Istanbul, Turkey", "DownVotes":"1", "Id":"805", "AccountId":"538434", "Views":"5", "Reputation":"347", "CreationDate":"2012-02-29T19:39:29.067", "DisplayName":"cyco130", "LastAccessDate":"2014-01-09T03:11:01.960", "AboutMe":"<p>Musician, amateur programmer and amateur linguist. Small projects in sourceforge as <a href=\"http://sourceforge.net/users/cyco130/\" rel=\"nofollow\">TrayGun Software</a>.</p>\n\n<p>Grew up with Atari-8 bit, then Borland Pascal, then Delphi. Nowadays mostly using Qt and C++. Reasonably fluent in 6502 and x86 assembler, Pascal, C, C++, Eiffel and knows his way around many other languages.</p>\n", "Age":"35"}}