{"comments":[], "Body":"<p>I'm sorry that I can't upvote your comment yet, but I did just join the site in order to reply.  While you might not find it in any formal prescriptive English grammar book as yet, there's plenty of evidence that emoticons are functioning in exactly the same way that canonical, traditional punctuation does: namely, they're pragmatic or discourse marks.</p>\n\n<p>There's quite a bit of literature supporting the assertion that punctuation functions in this way (beyond simply indicating pauses found in regular speech which set clauses apart, or carrying information which is ambiguous in vocal speech, such as the apostrophes in possessives or commas to delimit items in lists).  For instance, \"scare quotes\" may not be indicated in the phonetic form of an utterance, but are still articulated by a change in stress (or as \"air quotes\").</p>\n\n<p>Further, to the commenter who suggested that emoticons only provide a discourse- or paragraph-wide context, it's been shown that emoticons actually do segment clauses (occurring regularly at the end of a sentence to which they attach illocutionary force), thereby punctuating.</p>\n\n<p>Markman and Oshima write: </p>\n\n<blockquote>\n  <p>Although the emoticon has been most frequently associated with adding\n  emotion to CMD [Computer Mediated Discourse], at a pragmatic level, emoticons > appear to clearly serve a specific purpose within thestructure of the \n  message. Specifically,we would like to propose that emoticons serve as \n  punctuating devices in CMD. In these data, emoticons are most typically \n  deployed at the\n  end of sentences or clauses (when part of a parenthetical remark), or\n  turns at chat, either with or in placeof standard sentence-final\n  punctuation marks. In this usage, the emoticon functions to close off\n  the sentence or thought by confirming the action performed by the\n  text. In this sense, the emoticon can be seen to complement,\n  strengthen, or clarify the illocutionary force of the utterance, while\n  at the same time providing a cue to interpreting the structure of the\n  message.\n             <a href=\"http://www.academia.edu/attachments/30664074/download_file\">(Markman, Oshima 2007)</a></p>\n</blockquote>\n\n<p>Ultimately, remember that this is a Linguistics, not a traditional English Grammar &amp; Composition, forum.  The objective here is not to dismiss real linguistic phenomena on stylistic grounds, but to recognize and describe them as part of the living, changing thing that language is, and not as one feels it \"ought\" to be.</p>\n", "Id":"5901", "ParentId":"3359", "CreationDate":"2013-11-13T18:31:26.680", "Score":"7", "PostTypeId":"2", "OwnerUserId":"2717", "LastActivityDate":"2013-11-13T18:31:26.680", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "ProfileImageUrl":"https://www.gravatar.com/avatar/?s=128&d=identicon&r=PG&f=1", "Id":"2717", "AccountId":"3580237", "Views":"0", "Reputation":"71", "CreationDate":"2013-11-13T16:25:51.833", "DisplayName":"user2717", "LastAccessDate":"2013-11-13T18:53:06.607"}}