{"Body":"<p>Contra @JoFrhwld, it's not really that controversial to say that the rate of cognate replacement differs in different languages, or in different parts of the vocabulary. Glottochronology has a bad name in linguistics for exactly this reason: the assumption of constant rates of change made by glottochronology is clearly shown to be wrong when the methods are tried out on languages with known histories. Icelandic is a classic example: glottochronology calculates many fewer years separation between modern Icelandic and Old Norse than we know to be the case from the historical record. </p>\n\n<p>I would recommend you actually read the article referred to in JoFrhwld's answer if you're interested in this: <a href=\"http://www.nature.com/nature/journal/v449/n7163/full/nature06176.html\">Frequency of word-use predicts rates of lexical evolution throughout Indo-European history</a> (<em>Nature</em>) and also try <a href=\"http://www.sciencemag.org/content/319/5863/588.abstract\">Languages Evolve in Punctuational Bursts</a> (<em>Science</em>). It's pretty lame to criticize a paper on the basis of your evaluation of the reputation of the journal or the disciplinary affiliation of the authors when you haven't even read the paper! These papers give a clear quantitative demonstration of a couple of the factors that influence the rates of language change, things which were only described qualitatively before.</p>\n\n<p>As to societal differences, Lupyan and Dale give at least some hard data that language structure is partly determined by social structure <a href=\"http://www.plosone.org/article/info%3adoi/10.1371/journal.pone.0008559\">Language Structure Is Partly Determined by Social Structure</a> (<em>PLoS ONE</em>). There's good evidence that language change occurs faster in smaller populations, because it's easier for an innovation to diffuse across the entire population, exactly the same way that genetic innovations are more likely to fixate in small populations than big ones.</p>\n", "Id":"592", "ParentId":"412", "LastEditorUserId":"46", "CreationDate":"2011-09-28T21:08:19.577", "OwnerUserId":"342", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-29T00:13:46.073", "LastEditedUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}, "LastActivityDate":"2011-09-29T00:13:46.073", "Score":"12", "CommentCount":"6", "OwnerUser":{"UpVotes":"4", "WebsiteUrl":"http://www.mpi.nl/people/dunn-michael", "Location":"Nymegen, Netherlands", "Id":"342", "DownVotes":"0", "AccountId":"63771", "Views":"9", "Reputation":"223", "CreationDate":"2011-09-28T20:30:42.757", "DisplayName":"Michael Dunn", "LastAccessDate":"2013-12-06T17:04:13.370", "AboutMe":""}}