{"Body":"<p>I tend to agree with @Cerberus that <em>help</em> in your sentence takes a direct object and a bare-infinitival clause as complements. <em>You</em> really feels like an argument of <em>help</em>, and therefore should be its direct object. There might also be some syntactic tests we can use to try to establish that. If <em>you</em> is a direct object, then it should be possible to move it up the sentence by using the cleft construction:</p>\n\n<pre><code>(1) It is you that networking helps grow your business (not me).\n</code></pre>\n\n<p>The problem with this test and others like it is that we can’t really find sentences where the main verb is followed by a noun phrase and a bare-infinitival clause and yet behaves differently with respect to the test. So we don’t have a contrast showing that in one such sentence the relevant noun phrase is a direct object and in another it is the subject of the embedded bare-infinitival.</p>\n\n<p>In ch. 14 of <em>The Cambridge Grammar of the English Language</em> (eds. Huddleston &amp; Pullum), the same distinction is discussed regarding sentences where the main verb is followed by a noun phrase and a gerund-participial clause. It is established there that in (2), <em>Kim</em> is the direct object of the main verb, whereas in (3)  it is the subject of the embedded clause:</p>\n\n<pre><code>(2) He caught Kim drinking his beer.\n(3) He resented Kim drinking his beer.\n</code></pre>\n\n<p>Does the clefting test distinguish between these two sentences? I’m not sure.</p>\n\n<pre><code>(4) It was Kim that he caught drinking his beer.\n(5) It was Kim that he resented drinking his beer.\n</code></pre>\n\n<p>(4) is grammatical, as expected, but I’m not sure about (5) (I’m not a native speaker of English). If (5) is grammatical, this means that subjects of embedded non-finite clauses can be clefted.</p>\n\n<p>The same holds for the relativization test (with an embedded bare-infinitival clause). Is (6) grammatical?</p>\n\n<pre><code>(6) You are the person whom networking helps make new connections.\n</code></pre>\n\n<p>To summarize, It would be nice to find syntactic tests clearly showing that <em>You</em> in <em>Networking helps you grow your business</em> is the direct object of the main verb. </p>\n\n<p>In the meantime, here is a syntactic tree generated by <a href=\"http://contextors.com/\" rel=\"nofollow\">Contextors</a> where <em>you</em> is the direct object (we follow the syntactic framework in <em>The Cambridge Grammar of the English Language</em>, where non-finite complements have the functional category <em>catenative complement</em>; also, we analyze <em>networking</em> as a gerund-participial clause).       </p>\n\n<p><img src=\"http://i.stack.imgur.com/KTN3y.png\" alt=\"enter image description here\">\n<a href=\"http://contextors.com/examples/networking_helps_you_grow_your_business.html\" rel=\"nofollow\">enlarge image</a></p>\n", "Id":"5932", "ParentId":"4685", "LastEditorUserId":"2715", "CreationDate":"2013-11-19T15:20:35.257", "OwnerUserId":"2715", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-11-19T15:36:54.657", "LastEditedUser":{"UpVotes":"5", "WebsiteUrl":"http://contextors.com/", "DownVotes":"0", "Id":"2715", "ProfileImageUrl":"https://www.gravatar.com/avatar/?s=128&d=identicon&r=PG&f=1", "AccountId":"3579016", "Views":"2", "Reputation":"61", "CreationDate":"2013-11-13T12:19:31.067", "DisplayName":"Shai Cohen", "LastAccessDate":"2014-01-15T12:13:40.477", "AboutMe":"<p>A linguist at Contextors.</p>\n"}, "LastActivityDate":"2013-11-19T15:36:54.657", "Score":"0", "CommentCount":"3", "OwnerUser":{"UpVotes":"5", "WebsiteUrl":"http://contextors.com/", "DownVotes":"0", "Id":"2715", "ProfileImageUrl":"https://www.gravatar.com/avatar/?s=128&d=identicon&r=PG&f=1", "AccountId":"3579016", "Views":"2", "Reputation":"61", "CreationDate":"2013-11-13T12:19:31.067", "DisplayName":"Shai Cohen", "LastAccessDate":"2014-01-15T12:13:40.477", "AboutMe":"<p>A linguist at Contextors.</p>\n"}}