{"comments":[], "Body":"<p>One part to an answer:</p>\n\n<p><em><strong>Semasiology</em></strong> is said to be <a href=\"http://area51.stackexchange.com/proposals/36772/hebrew-language-usage?referrer=vYF-uD8pJWlpaSf89lZ05w2\">\"the study of the meaning of words regardless of their phonetic expression\"</a></p>\n\n<p>Compare with <em><a href=\"http://en.wiktionary.org/wiki/semasiography\" rel=\"nofollow\">semasiography</a></em>, where words and characters are investigated for their origin — sometime sin natural phenomena themselves.</p>\n\n<p><a href=\"https://en.wikipedia.org/wiki/Syncretism_%28linguistics%29\" rel=\"nofollow\">Linguistic Syncretism</a> also deals with this (common origins).</p>\n", "Id":"5959", "ParentId":"5916", "CreationDate":"2013-11-21T19:16:57.237", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2653", "LastActivityDate":"2013-11-21T19:16:57.237", "OwnerUser":{"UpVotes":"17", "WebsiteUrl":"http://www.NewAlexandria.org", "DownVotes":"0", "Id":"2653", "ProfileImageUrl":"http://i.stack.imgur.com/WInp6.jpg", "AccountId":"97237", "Views":"0", "Reputation":"113", "CreationDate":"2013-10-30T13:49:59.163", "DisplayName":"NewAlexandria", "LastAccessDate":"2014-01-17T14:25:03.370", "AboutMe":"<p>I've worked for more than 13 years, designing products for web ventures, from 3-person initiatives to medium-large industry. Strong Presentation and Negotiation Skills have been key to this work (in addition to the full monte; infrastructure, database design, core algorithms, scaling, backed and frontend frameworks, test-ability, compliance, and UI/UX + SEO). </p>\n\n<p>I also design technology &amp; products by drawing from a history of fabrication, prototyping, sourcing, and scientific research (applied physics).  I am a practicing sculptor, and establish new product aesthetics via my own approach to engineering fluid-mechanical processes.  From this work in water, I have built a broad &amp; deep knowledge-base on the application of fluid phenomenon to industry needs.</p>\n\n<p>I have lead successful small-capitalization stages, wrote grants &amp; engaged program officers, developed teams and timelines, design of experiments, measurement, and business development.</p>\n"}}