{"comments":[], "Body":"<p>Stevens (1999) (as well as his article with Helen Hanson) discusses the relationship between cross-sectional area of the constriction and the size of the active articulator. However, this is provided as an explanation for why more retracted consonants have longer BURSTS, not longer VOT. (VOT duration is a characteristic of the glottis, not the oral articulators.) The idea here is that since the tongue dorsum is a bigger and slower muscle, it moves more slowly away from the point of constriction than the tongue apex or the lips.</p>\n\n<p>If one includes the burst duration in calculating \"VOT\", then sure, one will tend to have longer VOT duration for more posterior stops. However, if burst duration is distinguished from VOT, the pattern you observe still holds. With relation to voicing, the aerodynamic constraint holds. Yet, you are curious about a general pattern independent of voicing. So, the explanation must lie elsewhere.</p>\n\n<p>Maddieson (1997) provides one explanation that I have found compelling in my own work: </p>\n\n<p>\"There is an abduction-adduction cycle of the vocal cords for voiceless stops which is longer in duration than the closure and has a constant time course, anchored to the onset of closure (p. 621). In other words, the duration of the vocal fold opening is considered to be fixed, and when the closure duration is relatively longer, the following VOT becomes relatively shorter (and vice versa).\" (from Cho &amp; Ladefoged, 1999)</p>\n\n<p>This particular explanation accounts for the differences in VOT and for observed differences in trading relations in stop closure. In many languages, velar stop closure is shorter than alveolar stop closure. Stevens &amp; Hajek (2004) found preaspiration in Sienese Italian geminates to arise from closure lenition. When there was less closure, preaspiration arose. However, the duration of voicelessness in the geminate remained more or less constant. Their finding seems to agree with Maddieson's proposal.</p>\n", "Id":"597", "ParentId":"1", "CreationDate":"2011-09-28T22:54:14.357", "Score":"3", "PostTypeId":"2", "OwnerUserId":"323", "LastActivityDate":"2011-09-28T22:54:14.357", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"323", "AccountId":"939711", "Views":"4", "Reputation":"81", "CreationDate":"2011-09-27T22:12:04.687", "DisplayName":"Christian DiCanio", "LastAccessDate":"2011-09-29T12:26:53.287"}}