{"comments":[], "Body":"<p>For the parts of Asia where many tonal languages are spoken (China and mainland Southeast Asia), it’s very hard to find examples of languages just losing tone.  Thomason and Kaufman, in their book ‘Language Contact, Creolization and Genetic Linguistics’, mention a language called Wutun, which belongs to the Chinese language family, but has borrowed many grammatical features and much vocabulary from Tibetan, and has also lost phonemic tone.  “According to the Wutun speakers’ own oral history, they are descendants of Chinese immigrants to the region who were forced to assimilate to the surrounding Tibetan culture.  Few now speak another Chinese language, but many/most speak Tibetan as their second language.”  So in this kind of special contact situation, it’s possible for tones to disappear and a “tonal isolate” to arise.  Otherwise it doesn’t seem to happen.  </p>\n\n<p>I only know about Asia though, not about other world regions where many languages have tone.  It’s quite possible that you could come up with some “tonal isolates” elsewhere.  Swahili?</p>\n\n<p>There’s a lot to say about Mon-Khmer languages.  There are small MK languages all around mainland SEA, and the diversity within the family is much greater than for Tai.\nThe linguist ML Shorto produced a dictionary of proto-Mon-Khmer, and it’s possible that he reconstructed a breathy/modal phonation distinction for the protolanguage.  While Khmer doesn’t have either contour tones or phonation distinctions, it does have what’s called ‘register’, basically a vowel split.  Khmer consonants belong to one of two series, which determine how the vowels are pronounced.  Khmu (spoken mainly in northern Laos) is another MK language that has undergone tonogenesis, but only in some dialects (I think the wiki page on Khmu explains this in detail.)  I was taught a few words in Khmu while trekking around Luang Namtha – I think what I heard there was breathy phonation rather than tone.</p>\n", "Id":"5986", "ParentId":"5974", "CreationDate":"2013-11-24T07:11:35.607", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2619", "LastActivityDate":"2013-11-24T07:11:35.607", "OwnerUser":{"UpVotes":"42", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/WDpU9.jpg", "Id":"2619", "AccountId":"3471110", "Views":"9", "Reputation":"176", "CreationDate":"2013-10-22T02:54:37.193", "DisplayName":"user2619", "LastAccessDate":"2014-01-16T18:07:58.383"}}