{"Body":"<p>It really depends on how you want to establish the semantic similarity, but there are a variety of theoretical frameworks that you can apply – they all excel at teasing out different things. One is Componential analysis, which is just teasing out binary features – which was borrowed over from phonetics. As an example <em>girl</em> would be '+young +female' while <em>boy</em> would be '+young -female.' This analysis is really good for kin and pronoun terms that generally fit into matrices.</p>\n\n<p>A second is Natural Semantic Metalanguage. This theory aims to simmer all languages down to a set of equatable \"prime words\" which can be built up into longer more complex explications. Aside from any theoretical issues you may have with this it can be a useful tool for teasing apart meaning, especially for complex and abstract things like emotion terms. </p>\n\n<p>A final one I'll mention (although there are more) is Cognitive Semantics. George Lakoff who wrote the book \"Women, Fire and Dangerous Things\" is a major figure in this area. Those working in this type of cognitive semantics attempt to use abstracted diagrams. This is useful for teasing out spatial things – for example English uses \"on\" for things that are \"on top of\" and \"on the side of\" while other languages have other prepositions for each of these jobs. </p>\n\n<p>There are other theories as well, with their own tools. The most important thing is to be aware of exactly what need you have, and to be aware of any short comings a theory might have. </p>\n", "Id":"600", "ParentId":"430", "LastEditorUserId":"46", "CreationDate":"2011-09-28T23:23:42.527", "OwnerUserId":"64", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-28T23:58:29.687", "LastEditedUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}, "LastActivityDate":"2011-09-28T23:58:29.687", "Score":"5", "OwnerUser":{"UpVotes":"126", "WebsiteUrl":"http://www.superlinguo.com", "Id":"64", "AccountId":"900445", "CreationDate":"2011-09-13T21:45:12.903", "AboutMe":"<p>I have a PhD in linguistics. My areas of interest include language documentation, Tibeto-Burman linguistics, gesture, language play, LOLspeak, evidentiality and making bad puns. I blog about language and linguistics at www.superlinguo.com</p>\n", "Age":"29", "Location":"Australia", "DownVotes":"6", "Views":"40", "Reputation":"2016", "DisplayName":"LaurenG", "LastAccessDate":"2013-10-26T00:28:12.653"}}