{"OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}, "comments":[], "Body":"<p>It's much harder to show that it's not relevant to any branch of linguistics than to show that there is at least one application of the P-NP problem in linguistics. But I haven't heard of any.</p>\n\n<p>It's probably obvious why it is not relevant to branches of linguistics that don't have any computational component, such as historical linguistics. But other, rather more computational branches, of linguistics also seem to have a lot of other problems to care about. In corpus linguistics, important questions are</p>\n\n<ul>\n<li>How can I speed up the process of compiling a corpus, for example transcription of spoken material?</li>\n<li>How can I ensure my corpus is a representative sample of the language at hand?</li>\n</ul>\n\n<p>In computational linguistics, interesting questions might concern how parsers or taggers can be improved. If we compare their performance to that of humans, automatic parsers and taggers still have quite some way to go. But the way to improve them is probably not to reduce computational complexity because what computers currently lack and humans have is not more computational power, but real world knowledge.</p>\n\n<p>Take for example:</p>\n\n<blockquote>\n  <p>Yesterday I shot an elephant in my pajamas. How he got into my pajamas I don't know.</p>\n</blockquote>\n\n<p>You probably parsed this initially with the prepositional phrase \"in my pajamas\" attached to the verb phrase, as an adverbial. And that's the only sensible reading of this sentence. Initially, you would not even consider (consciously) that \"in my pajamas\" could attach to \"an elephant\" because this does not agree with your knowledge of what elephants do. Only the second sentence makes that plausible.</p>\n\n<p>An automatic parser doesn't have real world knowledge at its disposal, and can't exclude the reading \"elephant wearing pajamas\" right away as non-sensical. Technically, there is not a single correct parse of this sentence, but multiple. Only ranking the different parses and their meanings by likelihood solves the problem. </p>\n\n<p>The challenge is to get this knowledge into parsers. But then we would actually need a computer program that understands human language.</p>\n\n<p>So, in essence I believe the P-NP problem is quite irrelvant to linguistics. But I'm looking forward to any examples showing the opposite :)</p>\n", "Id":"6005", "ParentId":"6003", "CreationDate":"2013-11-25T21:06:20.627", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2278", "LastActivityDate":"2013-11-25T21:06:20.627", "CommentCount":"1"}