{"comments":[], "Body":"<p>Yes, there is. I am referring to the Stanford project \" QUANTITATIVE FORMALISM: AN EXPERIMENT\": </p>\n\n<p>\"This paper is the report of a study conducted by five people – four at Stanford, and one at the University of Wisconsin – which tried to establish whether computer-generated algorithms could “recognize” literary genres.\"</p>\n\n<p>Here is the link:</p>\n\n<p><a href=\"http://litlab.stanford.edu/?page_id=255\" rel=\"nofollow\">http://litlab.stanford.edu/?page_id=255</a></p>\n\n<p>I am given to understand that most people familiar with the conjecture conjecture that it is false, that is, creating a work of art is orders of magnitude more difficult than appreciating/recognizing a work of art, and I certainly concur in conjecturing that the conjecture is false. This Stanford project would certainly support this position. If a computer, under present-day technology, can distinguish between genres, I think we would all agree that we are still ages away from the day that a computer can CREATE a worthy work in any genre.</p>\n\n<p>In the news recently it has been reported that baboons can distinguish words from non-words.</p>\n\n<p>Here is the link to the news story:</p>\n\n<p><a href=\"http://en-maktoob.news.yahoo.com/dan-dan-baboon-read-dan-read-181901087.html\" rel=\"nofollow\">http://en-maktoob.news.yahoo.com/dan-dan-baboon-read-dan-read-181901087.html</a></p>\n\n<p>Your question, then, can be considered as a special case of the more general question that can be catchily-phrased as, \"Can baboons do linguistics?\"</p>\n\n<p>This conjures up the image of the proverbial room full of monkeys (/baboons) randomly pecking away at typewriters. Will they every produce, say, Hamlet? Of, course, given enough time. But that is consistent with conjecturing that the conjecture is false, because although they (or, an algorithm) may be able to recognize literary phenomena in polynomial time, it would, presumably, take much more than polynomial time to CREATE a literary phenomenon.</p>\n\n<p>\"I am at one with my duality.\"\n--Woody Allen</p>\n", "Id":"6012", "ParentId":"6003", "CreationDate":"2013-11-26T02:04:37.393", "Score":"0", "PostTypeId":"2", "OwnerUserId":"2780", "LastActivityDate":"2013-11-26T02:04:37.393", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2780", "AccountId":"1340792", "Views":"9", "Reputation":"21", "CreationDate":"2013-11-25T17:18:50.223", "DisplayName":"EsperantoSpeaker1", "LastAccessDate":"2013-11-26T02:01:09.153", "AboutMe":"<p>I speak Esperanto.</p>\n\n<p>I am particularly interested in proof theory.</p>\n"}}