{"Body":"<p>You might want to check a paper by Nicolas Tournadre called ‘The dynamics of Tibetan-Chinese bilingualism:  current situation and future prospects’ (2003).  There is a section of the paper on ‘the sociolinguistic context and Tibetan-Chinese mixed speech’.  This mixed speech is an urban phenomenon, and Tournadre claims that ‘many young people in the urban areas are incapable of forming a sentence in Tibetan without using Chinese words.’  He goes through some categories of words that frequently appear in Chinese.  Numbers are one of the main ones, which is interesting.  since numbers are part of the core vocabulary and thus ought to be (we might assume) more resistant to change.  Tournadre doesn’t mention any borrowing of grammar or syntax, but there are some examples of code-switching and overall he seems to cover the sociolinguistic side of the issue well.</p>\n\n<p>You can find a pdf of the paper on Tournadre’s website, <a href=\"http://tournadre.nicolas.free.fr/index.php/publications/articles\" rel=\"nofollow\">http://tournadre.nicolas.free.fr/index.php/publications/articles</a>.  His ‘Manual of Standard Tibetan’ is an excellent textbook (co-written with Sangda Dorje).</p>\n\n<p>Addressing the question, I’ll add that he also mentions that there are equivalent terms in Tibetan for all of the vocabulary that appears in Chinese in these code-switching situations.  Most speakers know these terms, but choose not to use them for sociolinguistic reasons.  It’s not that the Tibetan language is changing and acquiring new words or structures from Chinese, as your question seems to imply.</p>\n", "Id":"6036", "ParentId":"4668", "LastEditorUserId":"2619", "CreationDate":"2013-11-30T07:57:06.643", "OwnerUserId":"2619", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-11-30T08:08:45.227", "LastEditedUser":{"UpVotes":"42", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/WDpU9.jpg", "Id":"2619", "AccountId":"3471110", "Views":"9", "Reputation":"176", "CreationDate":"2013-10-22T02:54:37.193", "DisplayName":"user2619", "LastAccessDate":"2014-01-16T18:07:58.383"}, "LastActivityDate":"2013-11-30T08:08:45.227", "Score":"3", "OwnerUser":{"UpVotes":"42", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/WDpU9.jpg", "Id":"2619", "AccountId":"3471110", "Views":"9", "Reputation":"176", "CreationDate":"2013-10-22T02:54:37.193", "DisplayName":"user2619", "LastAccessDate":"2014-01-16T18:07:58.383"}}