{"comments":[], "Body":"<p>I guess many mathematical formalizations of linguistic issues can lead\nto complexity analysis, and possibly to NP-hard problem. Usually it\ndoes not matter too much because we are dealing with small\nproblem. Even if a sentence is long, the complex parts of its\nstructure are likely to be local to a smaller identifiable subpart.\nComplexity is often mathematically interesting, but linguistically\nirrelevant.  Furthermore, there are often ways to encode cheaply with\nproper structures situation that would lead to combinatorial explosion\n(simple example: long prepositional attachment). Shared forests can do\nthat in parsing.</p>\n\n<p>To take an example from computer science. The typing algorithm for the\nlanguage ML has a double exponential complexity. Pretty bad, except for\nthe fact that the pathological situations are never encountered in\npractice, and the language has been in use for more than 30 years.\nNote that even in this bad case, structure sharing techniques can do\naway with one of the two exponentials (as long as you do not try to\nprint results). There are other examples of the non relevance of complexity analysis.</p>\n\n<p>Now, does this mean that computational linguistics should not worry\nabout complexity and NP-hardeness. I would think these are more likely\nto crop up when doing complex corpus processing to extract linguistic\ninformation about a language. Corpora are usually large, so that\nanything exponential will be a real problem. My experience there is\nlimited, and the techniques I used did not raise that kind of issue,\nas I recall, but this is definitely the area of computational\nlinguistics where I would worry about such issues.</p>\n\n<p>I personnally do not think the topic is very relevant to psycho-linguistics,\nbecause our brain is swamped by complexity much before we reach\nexponential complexity. High polynomial complexity is often beyond our\nability. But then, I am not a psycho-linguist and I read few papers\nabout it. They were concerned with sructural complexity of small\nexamples, not with asymptotic complexity of large example, which is\nwhat P=NP is about.</p>\n", "Id":"6038", "ParentId":"6003", "CreationDate":"2013-11-30T17:26:57.680", "Score":"0", "PostTypeId":"2", "OwnerUserId":"2129", "LastActivityDate":"2013-11-30T17:26:57.680", "OwnerUser":{"UpVotes":"15", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/zegup.png", "Id":"2129", "AccountId":"2350982", "Views":"3", "Reputation":"246", "CreationDate":"2013-06-03T21:52:14.630", "DisplayName":"babou", "LastAccessDate":"2014-01-11T10:17:24.477", "AboutMe":"<p>The name Babou was given to me by my grandson (two years old at the time). It actually means grandpa in Armenian and Swahili.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>babou AT inbox.com</p>\n"}}