{"OwnerUser":{"UpVotes":"16", "WebsiteUrl":"http://www.math.u-psud.fr/~fouquet/", "DownVotes":"0", "Id":"1707", "AccountId":"1575488", "Views":"8", "Reputation":"461", "CreationDate":"2013-01-28T10:33:35.847", "DisplayName":"Olivier", "LastAccessDate":"2014-01-18T22:01:23.260"}, "comments":[], "Body":"<p>I write this as an answer because the comment thread is too long already for (what I take to be) the spirit of SE sites. The language used by the author of the question (parameter, wh-movement and the two references to Chomsky) strongly suggests that he wants (or at least is comfortable with) an answer within minimalist linguistic theory. Within this framework, the answer given by P Elliott in comments seems to me to be quite perfect. The main points, as I see them, are the following.</p>\n\n<ul>\n<li><p>As P Elliott said, prepositions stranding is a rare phenomenon cross-linguistically, with just a handful of examples outside the Germanic family. </p></li>\n<li><p>Answering <em>it is just a parameter</em> would be theoretically very unsatisfactory. At the very least, one would want to this parameter to impact different parts of syntax, so that one could make experimental predictions of the form <em>If a language tolerates preposition stranding, then...</em>. Ideally, one would also want these correlations to be built on theoretical grounds which are independently motivated.</p></li>\n<li><p>K.Abels' thesis <a href=\"http://ling.auf.net/lingbuzz/000049\" rel=\"nofollow\">1</a> does just that. As P Elliott said, the core of the thesis is the isolation of a condition on movement (the anti-locality condition) which is certainly independently motivated in the derivation by phases conception of minimalist syntax. This condition entails that preposition stranding is possible only when PP is not a phase, something that can be investigated experimentally independently. For instance, though it might not be explicitly stated in his work, it follows from E.Reuland's analysis of binding theory that there should be a correlation between languages allowing preposition stranding and languages allowing binding of a reflexive in a PP, and this is indeed not a trivially false prediction, as is shown by the comparison below. In (297) of <a href=\"http://ling.auf.net/lingbuzz/000049\" rel=\"nofollow\">1</a>, another (highly non-trivial) prediction is also offered and argued to follow from the antilocality condition: a language allows clitic pronouns as complement of a preposition if and only if it has clitic pronouns and allows preposition stranding. </p></li>\n<li><p>Another well-known experimental prediction relating preposition stranding to other syntactic phenomena is the so-called Merchant's generalization: a language allows preposition stranding if and only if it allows preposition stranding in elliptical wh-construction (so called sluicing constructions) <a href=\"http://home.uchicago.edu/~merchant/publications.html\" rel=\"nofollow\">2</a></p></li>\n</ul>\n\n<p>Jacob often thinks about him (him≠Jacob). </p>\n\n<p>Nathan pense souvent à lui (lui=Nathan or lui≠Nathan).   </p>\n\n<p>Sources:</p>\n\n<p><a href=\"http://ling.auf.net/lingbuzz/000049\" rel=\"nofollow\">Successive Cyclicity, Anti-Locality, and Adposition Stranding</a></p>\n\n<p><a href=\"http://home.uchicago.edu/~merchant/publications.html\" rel=\"nofollow\">The Syntax of Silence: Sluicing, Islands, and the Theory of Ellipsis</a></p>\n", "Id":"6055", "ParentId":"6042", "CreationDate":"2013-12-02T14:51:10.150", "Score":"2", "PostTypeId":"2", "OwnerUserId":"1707", "LastActivityDate":"2013-12-02T14:51:10.150", "CommentCount":"2"}