{"Body":"<p>It has been noted by Nancy Levin in her 1980 paper ‘Main Verb Ellipsis in Spoken English’ that copula <em>be</em> cannot be elided under pseudogapping ((2); an example of pseudogapping is given in (1)).</p>\n\n<blockquote>\n  <p>(1) She will enjoy your book more than she will <s>enjoy</s> mine<br>\n  (2) *She had been happy more often than she had <s>been</s> miserable</p>\n</blockquote>\n\n<p>We can check now whether <em>be</em> of the progressive behaves differently than what is called “copula be” in terms of pseudogapping, i.e. whether the first can be elided under pseudogapping.</p>\n\n<blockquote>\n  <p>(3) She has been enjoying your book more than she has <s>been enjoying</s> my book</p>\n</blockquote>\n\n<p>It seems to me that (3) is grammatical, but not being a native speaker of English I can’t be sure. If (3) is indeed grammatical, then the contrast with (2) might show that we should distinguish between a copula <em>be</em> and a progressive <em>be</em> based on the syntactic behavior of the two verbs.</p>\n\n<p>It might be argued that the difference between (2) and (3) is the result not of two different types of <em>be</em> but of the different elements left behind: an adjective in (2) (<em>miserable</em>) and a noun phrase in (3) (<em>my book</em>). But Ed Zoerner and Brian Agbayani argue in their 2002 paper ‘A Pseudogapping Asymmetry’ (<a href=\"http://www.ledonline.it/snippets/allegati/snippets5007.pdf\" rel=\"nofollow\">http://www.ledonline.it/snippets/allegati/snippets5007.pdf</a>) that adjectives can be the remnant of pseudogapping. Also, it seems to me that pseudogapping of copula <em>be</em> is impossible even when the remnant is a noun phrase (but NP-remnants are possible when progressive <em>be</em> is pseudogapped).</p>\n\n<blockquote>\n  <p>(4) a. *It has been John’s house for longer than it has <s>been</s> my house<br>\n  &nbsp;&nbsp;&nbsp;&nbsp; b. They have been living in my house for longer than they have <s>been living</s> in your house. </p>\n</blockquote>\n\n<p>In addition, adjectives can be remnants when they are not complements of copula <em>be</em>:</p>\n\n<blockquote>\n  <p>(5) She is wearing blue and I am <s>wearing</s> red</p>\n</blockquote>\n\n<p>Finally, apart from this possible syntactic argument, it has been assumed in the literature that the meaning of the <em>be</em> in (6a) is different than the meaning of the one in (6b).</p>\n\n<blockquote>\n  <p>(6) a. She is a surgeon<br>\n  &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;b. She is drinking tea</p>\n</blockquote>\n\n<p>It has been assumed in the literature (e.g. Barbara Partee’s 1986 paper ‘Ambiguous pseudoclefts with unambiguous be’) that the <em>be</em> in (6a) is a function taking as arguments a predicate-type argument and an individual-type argument. This has never been suggested for the <em>be</em> in (6b). If there are indeed two different meanings, then there should be two different lexical items. (See also P Elliott’s answer here: <a href=\"http://linguistics.stackexchange.com/questions/4760/interchangeable-arguments-with-english-copula\">Interchangeable arguments with English copula</a>)</p>\n\n<p>When developing our syntactic parser for English, we at <a href=\"http://contextors.com/?ref=1035\" rel=\"nofollow\">Contextors</a> chose to distinguish between several kinds of <em>be</em>: copular <em>be</em>, progressive <em>be</em>, passive <em>be</em>, among others. Our motivation was mainly practical: we found that making these distinctions helped us manage our rule system more efficiently. In addition, it helped in developing further applications based on our parser, for example a tense recognizer. </p>\n", "Id":"6056", "ParentId":"5979", "LastEditorUserId":"2715", "CreationDate":"2013-12-02T15:28:20.883", "OwnerUserId":"2715", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-12-02T15:37:28.100", "LastEditedUser":{"UpVotes":"5", "WebsiteUrl":"http://contextors.com/", "DownVotes":"0", "Id":"2715", "ProfileImageUrl":"https://www.gravatar.com/avatar/?s=128&d=identicon&r=PG&f=1", "AccountId":"3579016", "Views":"2", "Reputation":"61", "CreationDate":"2013-11-13T12:19:31.067", "DisplayName":"Shai Cohen", "LastAccessDate":"2014-01-15T12:13:40.477", "AboutMe":"<p>A linguist at Contextors.</p>\n"}, "LastActivityDate":"2013-12-02T15:37:28.100", "Score":"3", "CommentCount":"6", "OwnerUser":{"UpVotes":"5", "WebsiteUrl":"http://contextors.com/", "DownVotes":"0", "Id":"2715", "ProfileImageUrl":"https://www.gravatar.com/avatar/?s=128&d=identicon&r=PG&f=1", "AccountId":"3579016", "Views":"2", "Reputation":"61", "CreationDate":"2013-11-13T12:19:31.067", "DisplayName":"Shai Cohen", "LastAccessDate":"2014-01-15T12:13:40.477", "AboutMe":"<p>A linguist at Contextors.</p>\n"}}