{"OwnerUser":{"UpVotes":"5", "DownVotes":"1", "Id":"2247", "AccountId":"3045491", "Views":"34", "Reputation":"565", "CreationDate":"2013-07-14T16:52:54.170", "DisplayName":"Tim Osborne", "LastAccessDate":"2014-01-01T04:26:20.267"}, "comments":[], "Body":"<p>The best term to denote <em>headstrong</em> when it functions like a noun is <em>nominal</em>. The term <em>nominal</em> is broader than the the term <em>noun</em>. Any word that functions as the head of a noun phrase is a nominal. Thus if the head of a noun phrase looks like an adjective (e.g. <em>the good</em>, <em>the helpful</em>, <em>the first</em>, <em>the best</em>, etc.), then one can use the term \"nominal\" to denote it.</p>\n\n<p>The terminology in this area is of course not used consistently. There is confusion about the distinction between <em>nouns</em>, <em>nominals</em>, and <em>substantives</em>. For most of us, the noun concept is relatively clear. The term <em>nominal</em> is less clear, but my understanding of it is that it is a broader concept, encompassing nouns, pronouns, and any other word that functions as the head of a noun phrase. The term <em>substantive</em> is older and has fallen out of use. It seems to have been more prominent in the grammars of European languages. It denoted a noun in the narrow sense (not including pronouns and adjectives used as nouns).   </p>\n\n<p>The class of adjectives that can be nominals if they are plural and introduced by <em>the</em> is large, e.g. <em>the old</em>, <em>the fat</em>, <em>the skinny</em>, <em>the friendly</em>, <em>the robust</em>, etc. But there may be an animacy requirement on the adjectives that are used in this way. It doesn't seem to work for adjectives that modify inanimate objects, e.g. *<em>the wide</em>, *<em>the red</em>, *<em>the rough</em>, *<em>the smooth</em>, etc. </p>\n", "Id":"6062", "ParentId":"6058", "CreationDate":"2013-12-03T21:26:31.053", "Score":"3", "PostTypeId":"2", "OwnerUserId":"2247", "LastActivityDate":"2013-12-03T21:26:31.053", "CommentCount":"4"}