{"OwnerUser":{"UpVotes":"126", "WebsiteUrl":"http://www.superlinguo.com", "Id":"64", "AccountId":"900445", "CreationDate":"2011-09-13T21:45:12.903", "AboutMe":"<p>I have a PhD in linguistics. My areas of interest include language documentation, Tibeto-Burman linguistics, gesture, language play, LOLspeak, evidentiality and making bad puns. I blog about language and linguistics at www.superlinguo.com</p>\n", "Age":"29", "Location":"Australia", "DownVotes":"6", "Views":"40", "Reputation":"2016", "DisplayName":"LaurenG", "LastAccessDate":"2013-10-26T00:28:12.653"}, "comments":[], "Body":"<p>I'm sure you've found enough information on Wikipedia and other places that make it clear that Albanian isn't closely related to any other living language, but for those who haven't the most concise summary I've found is at Krysstal's Language Families (\n<a href=\"http://www.krysstal.com/langfams_indoeuro.html\">http://www.krysstal.com/langfams_indoeuro.html</a>):</p>\n\n<p>\"The Illyric Branch [of Indo European]. Only Albanian (called Shqip by its speakers) belongs to this branch. It has been written in the Latin script since 1909; this replaced a number of writing systems including Greek and Arabic scripts.\"</p>\n\n<p>\"There are two dialects that have been diverging for 1000 years. They are mostly mutually intelligible. Geg is spoken in the north of Albania and Kosovo (Kosova). Tosk is spoken in southern Albania and north west Greece.\"</p>\n\n<p>\"The ancient Illyric and Mesapian languages, spoken in parts of Italy, are considered by some to be an extinct member of this branch.\"</p>\n\n<p>So we have to go back to this Illyric branch, which it is argued is part of the Paleo-Balkan group. The only other surviving member of this group is Modern Greek (http://en.wikipedia.org/wiki/Paleo-Balkans_languages). Given how completely dissimilar Modern Greek and Albanian are this answer appears rather unsatisfying - until you realise how amazing it is that Albanian managed to survive this long when any closely related languages died out so long ago!</p>\n", "Id":"608", "ParentId":"368", "CreationDate":"2011-09-29T10:49:44.307", "Score":"7", "PostTypeId":"2", "OwnerUserId":"64", "LastActivityDate":"2011-09-29T10:49:44.307", "CommentCount":"3"}