{"Body":"<p>I guess most signed languages are known to too few speaking people for\nsuch an occurrence to be likely. It is not so much a matter of prestige as a matter of population size and communication.</p>\n\n<p>However, there are also very limited\nsigned languages used by speaking people when they have to communicate\nsilently or from a distance. It would have a better chance for \"word\nborrowing\" from the signed to the spoken language.</p>\n\n<p>Thinking of that, I did think of one expression in English that seems\nto answer the question: \"<em>to give the finger</em>\" (sorry if that example\nmay break some rules - this is linguistics here).  There are probably\nsome others examples. Maybe, \"<em>to wave someone goodbye</em>\" would qualify too.</p>\n\n<p>The interesting point about \"<em>to give the finger</em>\" is that it can be used in contexts where it is not actually describing a physical movement, but can be interpreted directly as meaning strong refusal.</p>\n\n<p>A similar analysis applies to \"<em>waving goodbye</em>\", meaning \"aknowledging\ndeparture or loss\". It can sometimes refer a description of the\nactual signed gesture, like \"<em>giving the finger</em>\". But it clearly only have the abstract acknowledgement\nmeaning when applied to something other than a person. For example, in\nthe sentence \"if you trust bankers, you can wave your savings\ngoodbye\".</p>\n\n<p>There are also counter-examples.</p>\n\n<p>The expression \"<em>Back-scratching</em>\" refers to exchange of favor, not to\nactual physical scratching. However, it is irrelevant here because\nscratching someone's back is not considered a mean of communication.</p>\n\n<p>The expression \"<em>to nod approval</em>\" does refer to the signed gesture of\napproval, but (afaik) is only used to actually describe the signed\ngesture. One would not say \"<em>the man nodded</em>\" to mean that he expressed\nagreement by any mean, but only to mean that he expressed agreement by\nactually nodding. So the verb \"<em>to nod</em>\" cannot be considered as\nborrowed from the signed language, but only as a reference to it.</p>\n", "Id":"6090", "ParentId":"4837", "LastEditorUserId":"2129", "CreationDate":"2013-12-07T21:51:28.383", "OwnerUserId":"2129", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-12-10T12:24:44.430", "LastEditedUser":{"UpVotes":"15", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/zegup.png", "Id":"2129", "AccountId":"2350982", "Views":"3", "Reputation":"246", "CreationDate":"2013-06-03T21:52:14.630", "DisplayName":"babou", "LastAccessDate":"2014-01-11T10:17:24.477", "AboutMe":"<p>The name Babou was given to me by my grandson (two years old at the time). It actually means grandpa in Armenian and Swahili.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>babou AT inbox.com</p>\n"}, "LastActivityDate":"2013-12-10T12:24:44.430", "Score":"5", "OwnerUser":{"UpVotes":"15", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/zegup.png", "Id":"2129", "AccountId":"2350982", "Views":"3", "Reputation":"246", "CreationDate":"2013-06-03T21:52:14.630", "DisplayName":"babou", "LastAccessDate":"2014-01-11T10:17:24.477", "AboutMe":"<p>The name Babou was given to me by my grandson (two years old at the time). It actually means grandpa in Armenian and Swahili.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>babou AT inbox.com</p>\n"}}