{"comments":[], "Body":"<p>This kind of phonological ambiguity is\nfrequent enough, also because sound may be distorted. Actually, it has\nbeen considered important enough in speech processing that a specific\nrepresentational device was created for it. It is the so called \"<strong>word\nlattice</strong>\" used to represent in a compressed way the various sequences\nof words that could correspond to the phonological sequence, each word\ncorresponding to a subpart of that sequence. Note that the different\nsequences of word may imply different way of cutting of the string into parts\ncorresponding to words as for example (<a href=\"http://en.wikipedia.org/wiki/Holorime\" rel=\"nofollow\">taken from wikipedia</a>) \"a\ncruise, eh, lass?\" and \"accrues, hélas!\".</p>\n\n<p>Some parsing techniques can directly accomodate word lattices, as they\nwould a word sequence, and either eliminate some variants of the\nphonological ambiguity because they cannot be made syntactically\ncorrect, or treat them as a syntactic ambiguity problem, using\nwhatever means at their disposal for this purpose.</p>\n\n<p>Exercise in phonological ambiguity have been pushed to an extreme with\nholorime verses. A well known one in French is</p>\n\n<blockquote>\n  <p>Gall, amant de la Reine, alla, tour magnanime!<br>\n     Galamment de l'Arène à la Tour Magne, à Nîmes. </p>\n</blockquote>\n\n<p>You can fin several more at <a href=\"http://fr.wikipedia.org/wiki/Vers_holorimes\" rel=\"nofollow\">http://fr.wikipedia.org/wiki/Vers_holorimes</a>.</p>\n", "Id":"6118", "ParentId":"3514", "CreationDate":"2013-12-11T21:44:18.387", "Score":"2", "PostTypeId":"2", "OwnerUserId":"2129", "LastActivityDate":"2013-12-11T21:44:18.387", "OwnerUser":{"UpVotes":"15", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/zegup.png", "Id":"2129", "AccountId":"2350982", "Views":"3", "Reputation":"246", "CreationDate":"2013-06-03T21:52:14.630", "DisplayName":"babou", "LastAccessDate":"2014-01-11T10:17:24.477", "AboutMe":"<p>The name Babou was given to me by my grandson (two years old at the time). It actually means grandpa in Armenian and Swahili.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>babou AT inbox.com</p>\n"}}