{"Body":"<p>Your question is a good question. However, the sentence you emphasize\nin boldface is, in my opinion, the wrong way to worry about\nrepresenting ambiguity, even though it is the usual way to state it.</p>\n\n<p>When you ask for a data structure, you are asking for a device to do\nprocessing, but you forget to worry about the intrinsic nature of that\ndevice, about the meaning it may have in your model of language\nprocessing. In some sense you emphasize the doing over the understanding.</p>\n\n<p>There is actually an abstract answer that applies to numerous cases,\nnumerous formalisms, independently of the parsing algorithm used, such\nas the CKY algorithm, Earley's algorithm, and many others.</p>\n\n<p>The relevant concept is that of a <strong>shared forest</strong>. It is a condensed\nform of all the correct parse trees for the sentence, However, though\nthe concept of shared forest was widely used in the parsing\nliterature, it did take some time to understand what it was, other than a convenient data structure. The understanding opened it to generalizations.</p>\n\n<p>Here I am skipping several fine points, see my <a href=\"http://cstheory.stackexchange.com/questions/7374/#18006\">answer</a> to another <a href=\"http://cstheory.stackexchange.com/questions/7374/\">question</a>, for more details.</p>\n\n<p>The basic idea relies on the fact that context-free languages, and\nmany other syntactic formalisms are closed under intersection with\n<a href=\"http://en.wikipedia.org/wiki/Regular_language\" rel=\"nofollow\">regular languages</a> (Type-3 grammars in Chomsky hierarchy). Furthermore, this closure property is constructive,\nwhich means that given a grammar G (in some syntactic formalism, such\nas CF grammar, or tree adjoining grammar, or many others) generating all syntactically\ncorrect sentences of the language, and a formal specification R of the regular\nlanguage, it is possible to exhibit another grammar F, that generates\nonly the syntactically correct sentences that belong to the regular\nset, with exactly the same ambiguities as with the original grammar G. This\ngrammar F is the shared forest.</p>\n\n<p>A set of one sentence is a regular set, and the construction\napplies. Then, the shared forest F can be used a a generative grammar\nthat generates only a single sentence, but with differents parse-trees\ncorresponding to all the parses with the original grammar G. So, for example, it can be used to enumerate all the correct parse-trees for the sentence.</p>\n\n<p>This can generalize to many situations. For example, when there is\nphonological ambiguity, as in the question\n<a href=\"http://linguistics.stackexchange.com/questions/3514/\">Phonological ambiguity that changes the syntactic structure</a>, this ambiguity\nregarding the words actually uttered can be represented by a word\nlattice, which actually defines formally a regular set of (not\nnecessarily syntactically correct) sentences.\nThe same construction intersecting the regular set with the grammar G\ncan be used, accounting at the same time for lexical/phonological\nambiguity and for syntactic ambiguity.</p>\n\n<p>Now, what about this construction of the intersection. For CF\ngrammars, there is an old construction that was published some 50\nyears ago (Bar-Hillel, Perles, Shamir). All later algorithms, such as CKY, Earley, chart parsing,\netc, that produce a shared forest are actually only variants of that\nconstruction that may optimize some step so as to avoid some useless\nconstruction steps while producing the shared forest F. Similar\nconstructions exist for many other classes of grammar than the CF\ngrammars.</p>\n\n<p>The next issue is to develop techniques to choose the right tree in\nthe forest. This can be achieved in various ways but remains a very\nopen topic. For example it is possible to associate features or data\nwith specific algebraic characteristics (semi-ring) to the lexicon and\nparts of speech, together with composition rules associated to the\ngrammar rules, to identify the \"better\" parse-tree. The Viterbi\ntechniques to chose a most-likely parse-tree according to some\nprobabilities fall in this category. Alternatively, the choice of\ncorrect parse-trees may be postponed to later stages of analysis.</p>\n\n<p>This is (the skeleton of) the whole story, afaik, regarding shared\nforest. Much is still being developped on that basis.</p>\n\n<p>It may seem too abstract, but it gives a good and actually simple\nmathematical understanding for organizing the technology. But that\ndoes not mean that all is simple when you get into actual details, for\nexample with sophisticated feature structures.</p>\n\n<p>Another advantage of the approach is that it gives a cleaner view of\nissues by separating the operational from the denotational. What this\nmeans is that the relevant entities you may be interested in, such as\ntrees or forests, are specified by abstract mathematical definitions,\non the basis of desirable properties, without specifying any actual\nmethod to effectively compute them. The operational algorithms that\nwill compute them (the parsing algorithms) are elaborated separately,\nand have to be proved correct with respect to the denotational\ndefinition. This separates the issues of conceptual perspicuity and\ncomputational correctness and effectiveness.</p>\n\n<p>Another point is that the complexity of the relevant structures can be analyzed from the mathematical definitions, independently of the algorithms that computes them.</p>\n\n<p>Finally, to come back to your question, shared forest have gained wide acceptance among NLP practitioners. The abstract view of it as the grammar of an intersection is less well known by those who are not mathematically oriented, though it is nearly 20 years old. This ignorance/rejection of mathematics is unfortunately the source of much waste of time and energy.</p>\n\n<p><strong>Bibliography</strong>: search the web with the keywords: <em>parsing intersection forest</em> - many papers are open access somewhere.</p>\n", "Id":"6120", "ParentId":"4619", "LastEditorUserId":"51", "CreationDate":"2013-12-12T01:07:20.427", "OwnerUserId":"2129", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-12-12T06:59:25.293", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2013-12-12T06:59:25.293", "Score":"1", "OwnerUser":{"UpVotes":"15", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/zegup.png", "Id":"2129", "AccountId":"2350982", "Views":"3", "Reputation":"246", "CreationDate":"2013-06-03T21:52:14.630", "DisplayName":"babou", "LastAccessDate":"2014-01-11T10:17:24.477", "AboutMe":"<p>The name Babou was given to me by my grandson (two years old at the time). It actually means grandpa in Armenian and Swahili.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>.</p>\n\n<p>babou AT inbox.com</p>\n"}}