{"Body":"<p>English spelling <em>is</em> phonetic, to a certain extent. It's just it was meant to (more or less) write down the language as it was about 700 years ago, and there's not been a consistent or generalized effort to update the spelling to reflect the newer developments in pronunciation.</p>\n\n<p>English is far from alone in this department. Japanese was still written (when written in kana) as it was pronounced in the Heian era even though nobody had spoken like that in centuries (i.e. writing \"kehou\" but pronouncing \"kyô\" for \"today\"), it underwent a minor reform during the Meiji era, but didn't really have a phonetic writing until after WW2. Likewise, written Tibetan still reflects the then-current pronunciation of when Buddhism was massively (re)introduced in the 6th century, so if you see Dbu-Rgya-Tso (Tibetan alphabet can be considered a simplified, regularized version of Devanagari) it must be pronounced \"U-gya-tsho\".</p>\n\n<p>All languages change over time and across distances. Standardized spelling is always a compromise between a purely phonemic approach (to make learning to read as easy as possible), maximizing the readableness (so to say) of old books and hiding dialectal variation in the language (to allow a book to be understood by the greatest possible audience). This is not something to be ever done lightly, and in the case of English it would become doubly difficult after so much time has elapsed without a much needed reform...</p>\n", "Id":"6125", "ParentId":"4180", "LastEditorUserId":"51", "CreationDate":"2013-12-12T17:01:38.377", "OwnerUserId":"2785", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-12-12T18:04:40.103", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2013-12-12T18:04:40.103", "Score":"3", "CommentCount":"1", "OwnerUser":{"UpVotes":"79", "WebsiteUrl":"http://stackoverflow.com/users/21258/joe-pineda", "ProfileImageUrl":"https://www.gravatar.com/avatar/3829797d6709334d9a07fe18dfcb553f?s=128&d=identicon&r=PG", "Id":"2785", "AccountId":"11104", "CreationDate":"2013-11-26T03:56:44.347", "AboutMe":"<p>Developing professionally since 11 years ago. VB6 and SQL Server, mostly.\nUse Linux, C++ and Perl at home.</p>\n", "Age":"35", "Location":"Mexico City, Mexico", "DownVotes":"5", "Views":"3", "Reputation":"395", "DisplayName":"Joe Pineda", "LastAccessDate":"2014-01-19T02:51:24.697"}}