{"Body":"<p>The scope of logical elements (including modal verbs and adverbs) is, in my view, one of the least understood areas of the syntax and semantics of natural language. As TKR points out in his comment, word order is not necessarily decisive for determining scope relations.</p>\n\n<p>Perhaps the most widely discussed type of examples where one can see that word order is not determining scope possibilities occurs with quantifiers, e.g. <em>Every boy has a crush on some girl</em>. Sentences like this one are ambiguous despite the fact that the one quantified expression precedes (and c-commands) the other. The universal quantifier <em>every</em> can take wide scope, which means we are talking about numerous girls, or the existential quantifier <em>some</em> can take wide scope, which means we're talking about just one girl (she must be very desirable indeed).</p>\n\n<p>At other times, it seems that word order is in fact decisive. For instance, one can make a strong case that simple precedence is the/a main factor that is determining the scope of negation and thus impacting where negative polarity items (NPIs) can appear, e.g.</p>\n\n<pre><code> I did not see anybody, and\n     a. *anybody did not see me. \n     b.  nobody saw me.\n</code></pre>\n\n<p>The simplest (and in my view the best) explanation for the deviance of the a-clause is the fact that the NPI <em>anybody</em> precedes the negation <em>not</em> and is therefore not in the scope of <em>not</em>. But this explanation conflicts with the data from quantifier interaction, where it seems that linear order has little impact on the scope of quantifiers.</p>\n\n<p>Concerning the example sentences in the question, linear order is apparently not impacting the scope of the modal elements in relation to each other in a clear way. What is impacting the relative positions of the modal adverb and modal verb is intonational prominence. Modal adverbs prefer to immediately follow an intonationally weak auxiliary verb rather than immediately precede it. Thus the order in the first sentence in the question is fine because <em>have to</em> is not an auxiliary:</p>\n\n<pre><code> I probably have to wash the car.\n</code></pre>\n\n<p>We know that <em>have to</em> is not an auxiliary because it does not license subject-auxiliary inversion (<em>??Have I to wash the car?</em>), nor does it take <em>not</em> as a postdependent. What this means is that the modal adverb can easily immediately precede <em>have to</em> just like it can immediately precede other non-auxiliary verbs, e.g.</p>\n\n<pre><code> He probably washed the car. \n</code></pre>\n\n<p>If a true auxiliary is present, though, then there is a clear preference for the modal adverb to immediately follow the auxiliary verb. This is the case in the second example sentence in the question:</p>\n\n<pre><code> I should probably wash the car. \n              vs.\n?I probably should wash the car. \n</code></pre>\n\n<p>The first sentence, in which the modal adverb <em>probably</em> immediately follows the intonationally weak auxiliary verb <em>should</em>, is clearly preferred over the second sentence, in which the order of the two words is reversed. That intonational considerations are indeed the relevant factor is evident in the fact that acceptability judgements are not robust. The second sentence is marginal, but not impossible. </p>\n\n<p>The same phenomenon is observable with floating quantifiers, e.g. </p>\n\n<pre><code> ?The boys all have left.\n The boys have all left.\n\n The boys all left. \n The boys all have to leave.\n</code></pre>\n\n<p>The floating quantifier prefers to immediately follow, rather than immediately precede, the intonationally weak auxiliary verb <em>have</em>.  It can, in contrast, easily immediately precede the intonationally more prominent non-auxiliaries <em>left</em> and <em>have to</em>. </p>\n\n<p>Why the intonation pattern prefers to be the one way as opposed to the other is mysterious. What is clear, however, is that linear order is not really impacting the scope of epistemic and deontic modal verbs and adverbs in relation to each other.  </p>\n", "Id":"6132", "ParentId":"6115", "LastEditorUserId":"2247", "CreationDate":"2013-12-13T22:05:28.697", "OwnerUserId":"2247", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-12-13T22:12:21.020", "LastEditedUser":{"UpVotes":"5", "DownVotes":"1", "Id":"2247", "AccountId":"3045491", "Views":"34", "Reputation":"565", "CreationDate":"2013-07-14T16:52:54.170", "DisplayName":"Tim Osborne", "LastAccessDate":"2014-01-01T04:26:20.267"}, "LastActivityDate":"2013-12-13T22:12:21.020", "Score":"4", "CommentCount":"1", "OwnerUser":{"UpVotes":"5", "DownVotes":"1", "Id":"2247", "AccountId":"3045491", "Views":"34", "Reputation":"565", "CreationDate":"2013-07-14T16:52:54.170", "DisplayName":"Tim Osborne", "LastAccessDate":"2014-01-01T04:26:20.267"}}