{"Body":"<p>I think there is a widespread conception that if a person wants something very much, he will think of it every time, and as such, will see it while sleeping. As such the word for seeing during the sleep also often used to designate a desire for future. </p>\n\n<p>For example even though Russian has separate words for the both, still the word for sleep vision can be used figuratively for a desire. \"Поступить туда на работу - это его сладкий сон\" \"Getting that job is his sweet dream\". In this case the word for sleep vision is used to mean the desire. Note that to mean the desire one has to add the adjective \"sweet\" because otherwise the word also can mean an unpleasant sleep vision, for example \"страшный сон\" means nightmare. One can also say \"Он видит эту должность во сне\" \"He sees this position when sleeping\". </p>\n\n<p>As such I would conclude that using the sleep visions metaphorically for desires remains highly productive and not necessary inherited from any proto-languages.</p>\n\n<p>I want also to point out that English language has different words for visualized desires not connected with sleep, for example \"reverie\", \"vision\", \"aspiration\", \"imagining\", \"desire\", \"infatuation\", \"idealization\" etc.</p>\n\n<p>The word for unpleasant sleep vision, \"nightmare\" can be also used in English and Russian to mean an outcome of which the person is very afraid of, even if not sleeping. \"The loosing of this competition is his nightmare\".</p>\n", "Id":"6139", "ParentId":"2700", "LastEditorUserId":"624", "CreationDate":"2013-12-14T10:53:39.230", "OwnerUserId":"624", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-12-18T09:20:33.920", "LastEditedUser":{"UpVotes":"81", "DownVotes":"60", "Id":"624", "AccountId":"407237", "Views":"34", "Reputation":"1743", "CreationDate":"2011-12-28T07:24:31.420", "DisplayName":"Anixx", "LastAccessDate":"2014-01-18T10:33:34.597"}, "LastActivityDate":"2013-12-18T09:20:33.920", "Score":"2", "OwnerUser":{"UpVotes":"81", "DownVotes":"60", "Id":"624", "AccountId":"407237", "Views":"34", "Reputation":"1743", "CreationDate":"2011-12-28T07:24:31.420", "DisplayName":"Anixx", "LastAccessDate":"2014-01-18T10:33:34.597"}}