{"OwnerUser":{"UpVotes":"41", "Location":"Ukraine", "DownVotes":"12", "Id":"2689", "AccountId":"2118122", "Views":"8", "Reputation":"828", "CreationDate":"2013-11-06T08:33:33.413", "DisplayName":"Yellow Sky", "LastAccessDate":"2014-01-19T01:45:10.363", "AboutMe":"<p>I've been working as a teacher of English and German for more than 10 years already. Linguistics is my life-long passion, I can speak and read no less than 12 languages well, I am studying Malay and Manju at the moment. My native languages are Ukrainian and Russian.</p>\n", "Age":"37"}, "comments":[], "Body":"<p>There are two Khalkha Mongolian words, <code>хан</code> and <code>хаан</code> (according to the \"Big Modern Russian-Mongolian and Mongolian-Russian Dictionary\", by Yury Kruchkin, 2006, 115,000 entries, <code>хан</code> and <code>хаан</code> are mentioned on page 563, the dictionary is downloadable <a href=\"http://dfiles.ru/files/v4fhyonbt\" rel=\"nofollow\">here</a>, 77 MB).</p>\n\n<p>The vowel length in Mongolian and other Altaic languages is the result of disappearance of the velar <code>q</code> and <code>ɣ</code> between vowels, the vowels then are assimilated to result in a long vowel. That is why, the Modern Khalkha Mongolian word <code>хан</code> comes from the Classical Mongolian <code>qan</code>, and <code>хаан</code> from <code>qaɣan</code> after the intervocal <code>ɣ</code> ceased to be pronounced (that is the traditional transliteration of the Classical Mongolian, in the following quotation from Ferdinand Lessing he transliterates the <code>q</code> as <code>x</code>). Note, that the word <code>qaɣan</code> has also an English rendering, it's \"<a href=\"http://en.wikipedia.org/wiki/Khagan\" rel=\"nofollow\">Khagan</a>\".</p>\n\n<p>In his \"Mongolian-English Dictionary\", 1960, page 906, Ferdinand Lessing wtites a commentary about the two words, \"Both of these two forms occur in Mongolian literature more or less interchangeably, and are rendered into English as Khan. However in modern usage <code>xaɣan</code> is used only for the Great Khan or for a foreign sovereign while <code>xan</code> is applied to lesser Khans.\" The dictionary is superb, it is, actually, Classical Mongolian - Khalkha Mongolian - English, it is <a href=\"http://altaica.ru/LIBRARY/mong/Lessing.pdf\" rel=\"nofollow\">available online</a> (a scan, 137 MB).</p>\n\n<p>To sum it up, it is not only Mongolian that has two words to mean \"khan\", English also has both of them, \"Khan\" and \"Khagan\".</p>\n", "Id":"6145", "ParentId":"6141", "CreationDate":"2013-12-14T16:06:57.083", "Score":"3", "PostTypeId":"2", "OwnerUserId":"2689", "LastActivityDate":"2013-12-14T16:06:57.083", "CommentCount":"9"}