{"Body":"<p>The number of the symbols a written language uses is inversely proportional to the length of the text in that language, the more symbols a language has, the shorter texts are. This is true for any notation system, not only human languages. For example, our decimal numeral system uses 10 different symbols (0 to 9), and the binary numeral system uses 5 times less symbols, only two (0 and 1), so we have number \"9\" (one symbol) which in binary system is \"1001\" (four symbols).</p>\n\n<p>What follows from this is that the language with the biggest number of symbols will have the shortest texts. Chinese, with its 50,000+ symbols of which up to 3,000 is required to read a newspaper and 8,000 needed for an educated person, is the first candidate for the Most Succinct Written Language Award.</p>\n\n<p>UPDATE: There are constructed languages that are designed specially for the purpose to compress so much information into a single word that it would take a whole sentence in any natural language. The most famous among such languages is <a href=\"http://en.wikipedia.org/wiki/Ithkuil\" rel=\"nofollow\">Ithkuil</a>. It has a very complicated <a href=\"http://ithkuil.net/11_script.htm\" rel=\"nofollow\">script</a>, an Ithkuil sentence written in that script contains much fewer \"characters\" than there are words in the English translation of the sentence. So, if you consider constructed languages too, than Ithkuil is also a good candidate.</p>\n", "Id":"6168", "ParentId":"6167", "LastEditorUserId":"2689", "CreationDate":"2013-12-16T22:23:05.393", "OwnerUserId":"2689", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-12-17T00:47:13.580", "LastEditedUser":{"UpVotes":"41", "Location":"Ukraine", "DownVotes":"12", "Id":"2689", "AccountId":"2118122", "Views":"8", "Reputation":"828", "CreationDate":"2013-11-06T08:33:33.413", "DisplayName":"Yellow Sky", "LastAccessDate":"2014-01-19T01:45:10.363", "AboutMe":"<p>I've been working as a teacher of English and German for more than 10 years already. Linguistics is my life-long passion, I can speak and read no less than 12 languages well, I am studying Malay and Manju at the moment. My native languages are Ukrainian and Russian.</p>\n", "Age":"37"}, "LastActivityDate":"2013-12-17T00:47:13.580", "Score":"2", "CommentCount":"15", "OwnerUser":{"UpVotes":"41", "Location":"Ukraine", "DownVotes":"12", "Id":"2689", "AccountId":"2118122", "Views":"8", "Reputation":"828", "CreationDate":"2013-11-06T08:33:33.413", "DisplayName":"Yellow Sky", "LastAccessDate":"2014-01-19T01:45:10.363", "AboutMe":"<p>I've been working as a teacher of English and German for more than 10 years already. Linguistics is my life-long passion, I can speak and read no less than 12 languages well, I am studying Malay and Manju at the moment. My native languages are Ukrainian and Russian.</p>\n", "Age":"37"}}