{"comments":[], "Body":"<p>To generalize Arne's and Evpok's answers, a simple way to look at cases like these is to recognize two distinct mechanisms going on in all sentences:</p>\n\n<ul>\n<li>Thematic role assignment</li>\n<li>Case assignment (along with word order)</li>\n</ul>\n\n<p>Under the conventional analysis, the relationship between the two is prescribed by the verb and the resulting pattern is what we store in our lexicon.</p>\n\n<p>To take your example in the semantic \"like\" relationship, there is a liker and a likee (there are more general semantic terms for themes if you care to look them up). The lexicon entry for like may look like this:</p>\n\n<p><strong>like:</strong> assigns a liker role, giving it subject marking, and a likee role, giving it object marking. Describes a state in which the liker likes the likee.</p>\n\n<p>While the Spanish one looks like this:</p>\n\n<p><strong>gusta:</strong> assigns a liker role, giving it object marking, and a likee role, giving it subject marking. Describes a state in which the liker likes the likee.</p>\n\n<p>Then, the language's own grammar applies things like word order on top of this (SVO for English; a similar model for Spanish with pronominalization/movement).</p>\n\n<p>Wikipedia's starter reading on the topic: <a href=\"http://en.wikipedia.org/wiki/Theta_role\" rel=\"nofollow\">http://en.wikipedia.org/wiki/Theta_role</a></p>\n", "Id":"62", "ParentId":"20", "CreationDate":"2011-09-14T03:15:52.260", "Score":"11", "PostTypeId":"2", "OwnerUserId":"9", "LastActivityDate":"2011-09-14T03:15:52.260", "OwnerUser":{"UpVotes":"13", "WebsiteUrl":"http://stevenxu.ca", "Id":"9", "AccountId":"69900", "CreationDate":"2011-09-13T20:51:36.750", "AboutMe":"<p>Hi friends! I'm <a href=\"http://stevenxu.ca\" rel=\"nofollow\">Steven Xu</a>. I'm an enthusiastic San Francisco software engineer focused on the Web. </p>\n\n<p>In my spare time, I like to play and coach volleyball and dabble in linguistics, especially phonetics.</p>\n", "Age":"24", "Location":"Canada", "DownVotes":"0", "Views":"74", "Reputation":"1326", "DisplayName":"Steven Xu", "LastAccessDate":"2013-09-27T23:39:20.960"}}