{"comments":[], "Body":"<p>Just some quick notes about Spanish in particular, in light of Nathan's answer.</p>\n\n<p>Spanish has largely retained the number of syllables in a word since Latin (as has Italian). Latin expressed quite a bit of meaning through case assignment and verb conjugation. Spanish has retained some of the verb conjugation and none of the case assignment. Thus we have to rely more on prepositions <em>de, para, encima de, dentro de</em> etc. in phrases which in Latin may have had prepositions of the same length but more likely had shorter ones or none at all.</p>\n\n<p>Since most often case assignment was possible within the last syllable of the word, and Spanish has usually retained a form ending in <em>-o</em> or <em>-a</em> (which I've heard comes from the ablative, but I'm skeptical), rather than chopping off the ending entirely as, say, in French, this automatically ups the number of syllables.</p>\n\n<p>Certain initial consonant clusters from Latin are not allowed in Spanish, and this is often dealt with by adding an <em>e-</em> to native words and loanwords beginning in them, rather than (as Finnish does with loanwords beginning in disallowed clusters) by deleting letters. E.g. <em>escribo &lt; scri:bo:</em>. (These new rules of consonant clusters may have been due to a phonetic influence of Iberian and Basque speakers. Basque has not very many phonemes and usually comes off as fast, too.)</p>\n\n<p>And a point that brings up something not yet mentioned: Spanish does not have vowel length distinction or consonant length distinction (beyond <em>rr</em> vs. <em>r,</em> which isn't really just a length distinction). Languages (like Latin and Italian) with these distinctions are able to encode more data using it, and maybe even <em>sound like they're going slower</em> since there's less change over time in the acoustics. Spanish also changed <em>e</em> to <em>ie</em> and <em>o</em> to <em>ue</em> in stressed position in many words; I wager a diphthong is likely to make you sound like you're \"going faster\" than a pure vowel would.</p>\n", "Id":"621", "ParentId":"612", "CreationDate":"2011-09-30T01:13:24.137", "Score":"11", "PostTypeId":"2", "OwnerUserId":"84", "LastActivityDate":"2011-09-30T01:13:24.137", "OwnerUser":{"UpVotes":"167", "WebsiteUrl":"http://web.mit.edu/~dbriggs/www", "Id":"84", "AccountId":"511555", "CreationDate":"2011-09-14T00:18:36.197", "AboutMe":"<p>At UMass Amherst in the Ph.D. program in math.<br>\n</p>\n\n<p>\nCurrently taking:<br>\nAnalysis (Measure theory & integration)<br>\nGeometry (Theory of manifolds)<br>\nModular Forms</p>\n", "Age":"29", "Location":"Cambridge, MA", "DownVotes":"0", "Views":"23", "Reputation":"1163", "DisplayName":"Daniel Briggs", "LastAccessDate":"2013-08-10T16:57:15.060"}}