{"Body":"<p>I recommend a great book (PDF): <a href=\"http://www.mediafire.com/download/8p7k6x52l2bshpp/JapaneseTheoreticalPhonetics.pdf\" rel=\"nofollow\">\"Грамматика японского языка. Введение. Фонология. Супрафонология. Морфонология\"</a> by В. М. Алпатов, И. Ф. Вардуль, С. А. Старостин. I scanned that book myself, that's the best piece I ever read on theoretical phonetics of Japanese. </p>\n\n<p>The annotation:</p>\n\n<blockquote>\n  <p>Данная книга представляет собой общее теоретическое введение к грамматике современного японского языка. Во вводной части определяются общие принципы построения грамматики, рассматривается строение языковой системы, в том числе фонологический, супрафонологический и морфонологический ярусы. В разделе «Фонология» описываются звуки современного японского языка, которые затем объединяются в фонемы; рассматривается фонемная структура слога. В разделе «Супрафонология» описана акцентуация современного японского языка. В разделе «Морфонология» рассматривается звуковая структура морфем и глоссем (слов) японского языка, неодинаковая в исконной и заимствованных подсистемах; описаны разные типы чередований.</p>\n</blockquote>\n", "Id":"6223", "ParentId":"3451", "LastEditorUserId":"175", "CreationDate":"2013-12-22T16:50:56.890", "OwnerUserId":"2689", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-12-29T20:27:59.110", "LastEditedUser":{"UpVotes":"14", "WebsiteUrl":"http://lego.cuusoo.com/ideas/view/39075", "Id":"175", "AccountId":"23448", "CreationDate":"2011-09-19T13:48:54.423", "AboutMe":"<p>Web developer since 1997. Other interests include embedded systems, static program analysis, and software visualization.</p>\n\n<p>Oh, and you can vote for my <a href=\"http://lego.cuusoo.com/ideas/view/39075\" rel=\"nofollow\">LEGO CUUSOO project!</a> My hats will soon be gone, but my gravatar could then be yours to keep!</p>\n", "Age":"35", "Location":"Europe, GMT+1", "DownVotes":"0", "Views":"3", "Reputation":"113", "DisplayName":"RegDwight", "LastAccessDate":"2014-01-01T22:57:44.440"}, "CommunityOwnedDate":"2013-12-22T16:50:56.890", "LastActivityDate":"2013-12-29T20:27:59.110", "Score":"0", "OwnerUser":{"UpVotes":"41", "Location":"Ukraine", "DownVotes":"12", "Id":"2689", "AccountId":"2118122", "Views":"8", "Reputation":"828", "CreationDate":"2013-11-06T08:33:33.413", "DisplayName":"Yellow Sky", "LastAccessDate":"2014-01-19T01:45:10.363", "AboutMe":"<p>I've been working as a teacher of English and German for more than 10 years already. Linguistics is my life-long passion, I can speak and read no less than 12 languages well, I am studying Malay and Manju at the moment. My native languages are Ukrainian and Russian.</p>\n", "Age":"37"}}