{"comments":[], "Body":"<blockquote>\n  <p>Is it thought that there is universal (the universe being humans) structure of mathematics that is the result of the structure of the human brain?</p>\n</blockquote>\n\n<p>Yes, if we are speaking about basic mathematical concepts, like integers and basic spatial relations. It is now well established, for instance, that infants already possess a concept of number. A good place to start reading about this is the work of Stanislas Dehaene.</p>\n\n<blockquote>\n  <p>If so, is this the reason that math works so well at predicting observations? </p>\n</blockquote>\n\n<p>Why yes, for basic reasons of natural selections, we would expect our basic sense of number to provide a description of the external world which is congruent with our other senses.</p>\n\n<blockquote>\n  <p>If so, is this the reason that math works so well at predicting observations? </p>\n</blockquote>\n\n<p>It seems to me that with this question, you envision a much stronger thesis, one which is usually attributed to Kant, as user fdb correctly pointed out. The reason is that the current consensus view that basic mathematical concepts are hard-wired in our brains applies only to very basic mathematical concepts. In fact, I seem to remember reading studies suggesting that not only subtraction with large numbers was not hard-wired, the truth was that our brains are hard-wired to make mistakes while subtracting large numbers (at least when numbers are represented in the usual way). So beyond elementary concepts, the mathematical language developed through the patient working of mathematicians, sometimes (or even often) struggling <em>against</em> their intuitions. Such a struggle will inevitably be extremely sensitive to cultural norms and preconceptions. </p>\n\n<p>A famous example is the case of negative number, which were truly accepted in the West only 1500 years after the beginning of mathematics as a science, a clear indication (to me, at least) that there are not (in any self-evident way) a reflexive property of the way our brains are organized. </p>\n\n<blockquote>\n  <p>Might an alien mind not observe such a good correlation between human mathematics and the results of human experiments?</p>\n</blockquote>\n\n<p>It is of course hard to imagine a truly alien mind, but if you have some background in mathematics, you can envision a historical and conceptual development of mathematics truly different from what happened in any human civilization that we know of while remaining meaningful and intelligible to us. Consider for instance how an alien brain perceiving the world mostly though echolocation might envision geometry (my intuition, very feeble of course, would be that such a mind could consider blurring of periodic signals, and hence convolution and Fourier's theory, as much more intuitive than euclidean geometry). For a simpler example, consider an alien mind whose hardwired concept of number would lend itself more naturally to a modular interpretation than to a natural number interpretation (they would be counting in Z/nZ for some n, in effect, rather than in N), and if this seems too strange a thing to you, consider that this is essentially how computers count. </p>\n\n<p>On the other hand, the idea that even a strikingly different conceptualization of mathematics may lead to a re-evaluation of the correlation between mathematical formalization and experiment is too kantian for my taste: after all, our predictions tend to be quite accurate, and I don't see how perceiving the world in an alternate way could change that. In my opinion, the reason mathematics model the physical world so efficiently is that the physical world is by and large simple: a large number of phenomena can be correctly described using a handful of principles (minimize something) and (in fact equivalently, by Noether's theorem) a couple of symmetries. So descriptions of the physical world will involve simple rules, and the abstract study of simple rules is (almost by definition) what we call mathematics. A good way to discriminate the (mostly pragmatic) position I here defended and the kantian position is to notice that the record of mathematics is actually quite mixed: it is great for celestial mechanics (the historical impulse for the kantian position) and physics more generally, but mostly abysmal for biology. This could be quite mysterious from a kantian position, but is crystal clear from a pragmatic one: celestial mechanics is the by-product of essentially a single law, biology is the by-product of billions of years natural selection sieving trough random changes and so is very unlikely to admit a formalization through simple rules.  </p>\n\n<p>Finally, because I would feel it inappropriate to clog linguistics.stackexchange with speculation on the cognitive and philosophical content of mathematics, let me mention that one of the core principle of current minimalist linguistic theory is that syntax is the by-product of the necessity of the structures constructed by a single operation (Merge) operating recursively to be legible by the so-called interfaces (for instance, the phonological interface). N.Chomsky, to which this belief about syntax is due, has contemplated in several publications the possibility that some higher arithmetical capabilities of the human brain (those going further that the elementary ones discussed above) might stem from a recycling of this merge operation in other cognitive context: informally, he suggests that perhaps human beings are so talented at manipulating recursive abstract structures (natural numbers, algorithms...) because our linguistic ability is based on a recursive operation.   </p>\n\n<p><a href=\"http://www.college-de-france.fr/site/stanislas-dehaene/\" rel=\"nofollow\">http://www.college-de-france.fr/site/stanislas-dehaene/</a> </p>\n\n<p><a href=\"http://www.fosssil.in/Chomsky_Phases.pdf\" rel=\"nofollow\">http://www.fosssil.in/Chomsky_Phases.pdf</a></p>\n", "Id":"6252", "ParentId":"6228", "CreationDate":"2013-12-25T15:42:24.977", "Score":"3", "PostTypeId":"2", "OwnerUserId":"1707", "LastActivityDate":"2013-12-25T15:42:24.977", "OwnerUser":{"UpVotes":"16", "WebsiteUrl":"http://www.math.u-psud.fr/~fouquet/", "DownVotes":"0", "Id":"1707", "AccountId":"1575488", "Views":"8", "Reputation":"461", "CreationDate":"2013-01-28T10:33:35.847", "DisplayName":"Olivier", "LastAccessDate":"2014-01-18T22:01:23.260"}}