{"Body":"<p>I cannot answer this as a linguist. However, being a native Thai speaker, and being someone who educated himself about linguistics much enough to have some idea on stress-timed vs. syllable-timed (acoustic phonetics is one of my particular interests), I believe that I can provide some good information on Thai's prosody (specifically stress and rhythm).</p>\n\n<p>To summarize, in my opinion, Thai language is neither syllable-timed nor stressed-timed. A good metaphor for understanding this is a \"rounded rectangle\". A rounded rectangle is neither a rectangle nor a circle. Having said that, I do believe that Thai language is more syllable-timed than stressed-timed.</p>\n\n<hr>\n\n<p>As someone has already pointed out in the comments above, Thais pronounce every word in syllables, because that is what we were taught since the primary school (equivalent to Grade 1 in the US). This is also strengthened by our poems. There are many sub-types of classical Thai poems. Each and every one of these sub-types will have a set of specific rules for the rhymes and number of syllables in each verse. This can explain why no one would label someone who speak Thai in a very syllable-oriented manner as incorrect. He will be perfectly understandable; he just might sound a little too stiff and might sound unnatural. But that's all. This is quite similar to when a native English speaker speaks in monotone. No one would accuse him for speaking sub-standard English; he just sounds uninteresting.</p>\n\n<p>However, Thai natural speech (informal speech) can sound quite close to a stress-timed language, to the point that it might be mistaken as a true stress-timed language. It is also true that if you observe native Thai speakers carefully in their natural speech, they will group words into two or three or four or five or even more syllables, and each group will have one or more quasi-stressed syllables. (I use the term quasi-stressed because those stressed syllables are generally not very dominant.) And, having all that said is still a very simplification at best. There are no exact rules for stressing in Thai. However, without any explicit rules, Thai people can nonetheless speak approximately the same way somehow.</p>\n\n<p>One way to understand Thai's stressing system is to compare it to English's intonation system. It can vary very widely from one person to another, or one region to another. And, except for those obvious rules (such as, in English's intonation: end questions with rising tone, or end declarative sentences with low tone--which are not particularly true in real English speech), you can confidently say that there is no definite rule at all.</p>\n\n<hr>\n\n<p>Another interesting point about Thai prosody is that it keeps changing. A highly respectful person once said that he had noticed that Thai people today speak differently from Thai people yesterday. I researched into old video clips, and I've reached the same conclusion. One of my observation is that the more you go back in time, the more obvious the syllable-timed aspect of Thai language is. (For example, you can try watching this old commercial Thai ad: <a href=\"http://www.youtube.com/watch?v=XMvJhe9VX-M\" rel=\"nofollow\">ถ่านไฟฉายตรากบ</a>.)</p>\n\n<p>It is my belief that Thai become lesser syllable-timed (in other words, more stress-timed) through our exposure to Western cultures, especially through education, technologies, music, and movies. And through my own observation, most younger Thais could sound quite stress-timed like in their natural speech without being aware of it themselves.</p>\n\n<hr>\n\n<p>To provide a partial answer to your first question (<em>\"What should we tell our native Thai speaking students\"</em>), I believe that you should treat Thai as a syllable-timed language, because that will align with their prior education better. If your students have minimal exposure to English prosody, the concept of stress-timing will be invaluable for them and will help them to be on the right track.</p>\n\n<p>As for your second question (about using Praat to verify this phenomenon yourself), I personally found that another software, WaveSurfer, which is a small program and has a straightforward user-interface, is a perfect fit for my personal needs. You can find WaveSurfer at <a href=\"http://www.speech.kth.se/wavesurfer/\" rel=\"nofollow\">TMH KTH</a> or at <a href=\"http://sourceforge.net/projects/wavesurfer/\" rel=\"nofollow\">SourceForge</a>.</p>\n", "Id":"6264", "ParentId":"6257", "LastEditorUserId":"1482", "CreationDate":"2013-12-28T17:49:40.250", "OwnerUserId":"1482", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-12-29T13:14:24.397", "LastEditedUser":{"UpVotes":"2", "DownVotes":"0", "Id":"1482", "AccountId":"850963", "Views":"2", "Reputation":"191", "CreationDate":"2012-11-10T13:37:06.807", "DisplayName":"Damkerng T.", "LastAccessDate":"2014-01-15T17:53:11.193"}, "LastActivityDate":"2013-12-29T13:14:24.397", "Score":"4", "CommentCount":"9", "OwnerUser":{"UpVotes":"2", "DownVotes":"0", "Id":"1482", "AccountId":"850963", "Views":"2", "Reputation":"191", "CreationDate":"2012-11-10T13:37:06.807", "DisplayName":"Damkerng T.", "LastAccessDate":"2014-01-15T17:53:11.193"}}