{"OwnerUser":{"UpVotes":"302", "DownVotes":"1", "Id":"119", "AccountId":"14652", "Views":"52", "Reputation":"3065", "CreationDate":"2011-09-14T14:24:24.227", "DisplayName":"kaleissin", "LastAccessDate":"2014-01-18T22:21:33.313", "AboutMe":"<p>Sysadmin/programmer by day, linguist by night.</p>\n"}, "comments":[], "Body":"<p>You've already checked out wikipedia right? <a href=\"http://en.wikipedia.org/wiki/Compound_%28linguistics%29\" rel=\"nofollow\">\"Compound (linguistics)\"</a> Have you googled it on Google Scholar at all?</p>\n\n<p><strong>Noun compounds:</strong> This is common in Germanic languages. For instance, Norwegian \"jernbanestasjonsmesterbolig\" (jernbane stasjon mester bolig). Not a word you'll find in a dictionary but easily made when needed. The only thing that limits length is practicality. There are plenty of noun-noun compounds in English too but because the newly minted ones are in general spelled with spaces they don't stand out as much. For English you might want to start with Paula Downing (1977): \"On the creation and use of English compound nouns\", Language, issue 4.</p>\n\n<p>For a smorgasboard of compounds, read up on Sanskrit.</p>\n\n<p>Romance languages tend to compounds of the type verb+noun, like \"tocadiscos\" (toca discos) IIRC, \"plays records\" = record player.</p>\n\n<p><strong>Verb compounds:</strong> You've read <a href=\"http://en.wikipedia.org/wiki/Compound_verb\" rel=\"nofollow\">\"Compound verbs\" on Wikipedia</a>?</p>\n\n<p><strong>Analysis:</strong> The interesting, less homework-y question here is whether there are open-source morpohological analyzers out there <em>now</em>. Maybe one based on for instance Johannesen and Hauglin (1996) \"An Automatic analysis of compounds\"? You've alrady checked the <a href=\"http://nltk.org/\" rel=\"nofollow\">NLTK</a> I assume?</p>\n\n<p>It's easy enough to make one yourself, for Germanic languages at least. You need a wordlist, potentially with declined forms, and if the word you have is not on the list, you try to match the words that are, as prefixes or suffixes, to the word you have. Go for longest match. (You'll also need some info on epenthetic sounds, like -e- and -s- in many Norwegian compounds. Throw away these, at least at first). The trick is that if there's more than <em>two</em> nouns you'll end up with potentially more than one tree-structure for the same word. Take \"jernbanestasjonsmester\", it can split at least two ways: \"jernbane\" + \"stasjonsmester\" and \"jernbanestasjon\" + \"mester\" (the -s- is epenthetic). Sometimes that doesn't change the meaning, sometimes it <em>can</em> change the meaning, sometimes it is used by comedians for comedic effect, setting up a joke that uses one split at the start and another later on in the same joke. And then there's the puns it makes possible...</p>\n", "Id":"6265", "ParentId":"3950", "CreationDate":"2013-12-28T22:54:34.240", "Score":"4", "PostTypeId":"2", "OwnerUserId":"119", "LastActivityDate":"2013-12-28T22:54:34.240", "CommentCount":"2"}