{"comments":[], "Body":"<p><em>A caveat: I'm experiencing the tail end of a three day migraine. This answer may not be as clear as I'd like.</em> </p>\n\n<p>The nature of the cognitive structures that make up linguistic knowledge is still a very open question. In fact, the nature of cognitive structures in general is still hotly contested (and rightly so).</p>\n\n<p>Before I answer your questions, I think a little clarification is in order. Models of mental processes (at least from my perspective) are not likely to be accurate representations of the actual, real world functioning of the brain. Like any scientific theory, they're only as good as the predictions they make. So just because a model has support does not mean that it captures the nature of cognitive structures. Rather, it means that it accurately predicts behaviour. What I'm getting at is that different processes can produce the same behaviour, and just because a model makes accurate predictions, does not mean that it necessarily is an accurate model of the cognitive processes involved. </p>\n\n<p>With regards to your first question. It's important to consider what type of language phenomena you're interested in. Different models attempt to capture the functioning of different processes, and each model has its own set of assumptions about the associated mental functions. Judging by the task you set yourself (which, by the way, is referred to as a verbal fluency test), you're interested in speech production, so we'll look at that. There's two influential theories of speech production, Dell's (1986) spreading activation model and Levelt et al's (1999) WEAVER++ model*. This <a href=\"http://www.columbia.edu/~rmk7/HC/HC_Readings/Levelt.pdf\" rel=\"nofollow\">article</a>, by Levelt, is a great primer on the different types of speech production models. Both models assume that lexical knowledge is instantiated in a network, but make different assumptions about how processing proceeds through the network, and the different steps involved. I won't spend any time describing them since the Levelt article does a much better job of that.</p>\n\n<p>Returning to my first point, this isn't to say that these models are accurate descriptions of the mental lexicon. Rather, they're influential models that do a good job of predicting linguistic behaviour. </p>\n\n<p>On to your second question...</p>\n\n<p>At a the level of experimental design, psycholinguistics experiments differ from what you describe in that they usually:</p>\n\n<ul>\n<li>Involve random allocation of participants to condition</li>\n<li>Have a large number of participants</li>\n<li>Have control conditions</li>\n</ul>\n\n<p>That is, what you describe is not an experiment at all. </p>\n\n<p>Some sources of information used to evaluate models of speech production are:</p>\n\n<ul>\n<li>Observational (non-experimental) studies of speech errors where the rate and type of error are recorded (Dell uses data from these as a basis for his model).</li>\n<li>Experimentally induced instances of the tip of the tongue (TOT) effect (e.g. Harley &amp; Bown, 1998)</li>\n<li>Naming tasks in which participants are simultaneously presented with two pictures and the relationship between the pictures is manipulated (semantic, phonological etc). Participants have to name a target object in one of the pictures. Reaction times are recorded. (Meyer &amp; Damian, 2007)</li>\n</ul>\n\n<p>These data are usually used to support or weaken the argument in favour of a particular model. In the case of the models discussed, they are designed to address predictions stemming from assumptions about the stages of speech production, and the order (if any) in which these stages are processed. For instance, WEAVER++ assumes that syntactic and semantic information is accessed prior to phonological information. Thus the TOT effect occurs when phonological information is difficult to access. Harely and Bown (1998), showed that words with an unusual phonological form are more susceptible to TOT, evidence that supports WEAVER++.</p>\n\n<p>As an aside, the 'priming' studies that Nathan refers to are in fact uses of the masked prime paradigm with a lexical decision task. These are used to investigate the processes involved in visual word recognition (i.e. reading), and are a great way to investigate the information we can access very quickly from written language. For instance, that we compute phonological information from brief (50ms) presentations of non-words (Kinoshita &amp; Norris, 2012). What such information tells us about the mental lexicon is unclear. </p>\n\n<p>This isn't meant to be an exhaustive account of speech production. I've undoubtably presented some contentious information, and excluded some important information. Regardless, hopefully I've given you enough resources to make a start on your own research. Most of the articles I've mentioned are accessible through google, at the very least, Dell (1986) and Levelt et al (1999) definitely are.  </p>\n\n<p>*Don't be put off by the length of Levelt et al (1999). Behavioural and Brain Sciences articles often include commentary by researchers in the same field, so the article itself is only about 35 pages long. The commentary is a great way to a get a feel for how a theory fits in with the rest of the field. Personally, I think it's a great idea.</p>\n\n<p>Dell, G. S. (1986). A spreading-activation theory of retrieval in sentence production. Psychological Review, 93(3), 283-321. doi:10.1037/0033-295X.93.3.283</p>\n\n<p>Harley, T. A. &amp; Bown, H. E. (1998). What causes a tip-of-the-tongue state? evidence for lexical neighbourhood effects in speech production. British Journal of Psychology, 89, 151.</p>\n\n<p>Kinoshita, S., &amp; Norris, D. (2012). Pseudohomophone priming in lexical decision is not fragile in sparse lexical neighborhood. Journal of Experimental Psychology: Learning, Memory and Cognition, 38, 764-775.</p>\n\n<p>Levelt, W. J. M., Roelofs, A., &amp; Meyer, A. S. (1999). A theory of lexical access in speech production. Behavioral and Brain Sciences, 22(1), 1-38. doi:10.1017/S0140525X99001776</p>\n\n<p>Meyer, A. S., &amp; Damian, M. F. (2007). Activation of distractor names in the picture-picture interference paradigm. Memory &amp; Cognition, 35(3), 494-503. doi:10.3758/BF03193289</p>\n", "Id":"6279", "ParentId":"756", "CreationDate":"2013-12-30T01:15:51.127", "Score":"3", "PostTypeId":"2", "OwnerUserId":"2929", "LastActivityDate":"2013-12-30T01:15:51.127", "OwnerUser":{"UpVotes":"6", "WebsiteUrl":"", "DownVotes":"0", "Id":"2929", "ProfileImageUrl":"http://graph.facebook.com/730926011/picture?type=large", "AccountId":"3734868", "Views":"4", "Reputation":"36", "CreationDate":"2013-12-25T05:16:39.900", "DisplayName":"Cludowici", "LastAccessDate":"2014-01-16T00:51:30.443", "AboutMe":""}}