{"comments":[], "Body":"<p>I recall that in ancient Egyptian some hieroglyphs were used \"markers\" to resolve ambiguity or indicate a noun was a member of a special group, even though not meant to be pronounced. E.g. a beetle sign was placed after a group of signs denoting a bird's name to indicate such noun was meant to be read as a \"flying entity\" (i.e. really a bird's name) and not as a person's name. There were other characters used to emphasize a noun was a person's name, and names of gods and royalty were inscribed within special cartridges.</p>\n\n<p>Are these signs a kind of punctuation, or mere typographical conventions? Do they have a formal name? They do transmit information, furthermore, information that's not a merely a verbatim transcription of what the actual speech said but actually expands it. Similar to when some printed media add a small cross after a person's name to indicate they're dead.</p>\n\n<p>Emoticons play a similar role in modern electronic communications - they expand the written message, though in this way to compensate the loss of emotional information that in face-to-face communication is transmitted mostly via physical gestures, and to a lesser extent in verbal channels that are not written down: intonation, volume and pauses in the speech.</p>\n", "Id":"6285", "ParentId":"3359", "CreationDate":"2013-12-31T16:05:19.557", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2785", "LastActivityDate":"2013-12-31T16:05:19.557", "OwnerUser":{"UpVotes":"79", "WebsiteUrl":"http://stackoverflow.com/users/21258/joe-pineda", "ProfileImageUrl":"https://www.gravatar.com/avatar/3829797d6709334d9a07fe18dfcb553f?s=128&d=identicon&r=PG", "Id":"2785", "AccountId":"11104", "CreationDate":"2013-11-26T03:56:44.347", "AboutMe":"<p>Developing professionally since 11 years ago. VB6 and SQL Server, mostly.\nUse Linux, C++ and Perl at home.</p>\n", "Age":"35", "Location":"Mexico City, Mexico", "DownVotes":"5", "Views":"3", "Reputation":"395", "DisplayName":"Joe Pineda", "LastAccessDate":"2014-01-19T02:51:24.697"}}