{"comments":[], "Body":"<p>If i had to recommend just a couple of textbooks for syntax, semantics/pragmatics and phonology respectively, they'd be the following:</p>\n\n<p><strong>Syntax</strong></p>\n\n<ul>\n<li><em>Syntactic Argumentation and the Structure of English</em> (Perlmutter &amp; Soames, 1979).<br>\nNot easy to get a hold of, and a lot of the theoretical machinery is quite dated, but for the purpose of learning how to actually <em>do</em> syntax, as opposed to just learning a bunch of `facts', this can't be beaten. One of the best textbooks i've used, full stop. There are <a href=\"http://www.amazon.co.uk/Syntactic-Argumentation-Structure-English-Perlmutter/dp/0520038282/ref=wl_it_dp_o_pC_nS_nC?ie=UTF8&amp;colid=3UTTOGLB30ARI&amp;coliid=I1FOK8SC3NJCKO\" rel=\"nofollow\">a few used copies on amazon</a>.</li>\n<li><em>Thinking Syntactically</em> (Haegeman, 2005).<br>\nAnother textbook more focused on how one actually <em>does</em> syntax, focusing on developing a tool-kit for doing syntactic analysis, as opposed to just learning a bunch of theory-dependent facts. More up-to-date than Perlmutter &amp; Soames. </li>\n</ul>\n\n<p><strong>Semantics &amp; Pragmatics</strong></p>\n\n<ul>\n<li><p><em>Everything that linguists have always wanted to know about logic (but were ashamed to ask</em> (McCawley, 1993)<br>\nGiven your background in maths, you'll find a lot of this very easy, but i can't think of a better introduction to how logical tools can be used to illuminate aspects of meaning in natural language. I'm also guessing that more formally rigorous approaches to meaning will appeal to you, given your background. If you can handle this no problem, there's also the following...</p></li>\n<li><p><em>An introduction to meaning in natural language</em> (Cann et al, 2009)\nThis provides an introduction to Montague grammar amongst other things, an approach which currently dominates the literature on linguistic semantics. This is bang up-to-date, and provides you with pretty much everything you need to dive straight into the literature.</p></li>\n</ul>\n\n<p><strong>Phonology</strong></p>\n\n<ul>\n<li><em>Understanding phonology</em> (Gussenhoven &amp; Jacobs, 2011)<br>\nI'm by no means an expert, but i found this to be a concise and reasonably comprehensive introduction to phonology, complete with problem sets and solutions - by far the most important part.</li>\n</ul>\n\n<p>Just to declare myself, i was taught linguistics in a formalist department, which has no doubt coloured my suggestions. For suggestions focused more on functionalist linguistics, see @Taneko's answer.</p>\n", "Id":"6293", "ParentId":"3344", "CommunityOwnedDate":"2014-01-01T17:00:35.903", "CreationDate":"2014-01-01T17:00:35.903", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2328", "LastActivityDate":"2014-01-01T17:00:35.903", "OwnerUser":{"UpVotes":"123", "WebsiteUrl":"https://sites.google.com/site/patrickdelliott/", "ProfileImageUrl":"http://i.stack.imgur.com/HGYBE.jpg", "Id":"2328", "AccountId":"3146009", "CreationDate":"2013-08-07T11:16:59.797", "AboutMe":"<p>I'm a PhD student in Linguistics at University College London. My primary area of interest is generative linguistics, and specifically syntactic and semantic theory. More narrowly still, i'm interested in ellipsis, comparatives, and binding theory. <a href=\"https://twitter.com/patrickdelliott\" rel=\"nofollow\">Follow me on twitter!</a></p>\n", "Location":"London, United Kingdom", "DownVotes":"43", "Views":"43", "Reputation":"970", "DisplayName":"P Elliott", "LastAccessDate":"2014-01-19T02:32:31.120"}}