{"comments":[], "Body":"<p>This is slightly modified re-posting of my comment on the original post, so we can get this classed as answered and out of the way:</p>\n\n<ol>\n<li><p>It's common practice to summarise the key results within the main body of the paper (graphs are always good), and then give the actual raw data in an appendix so that interested specialists can follow up any specific queries. </p></li>\n<li><p>If you can avoid sending a hard copy, APA and double spaced is the way to go. Single spaced would probably be OK, but not ideal. Weigh up the costs/benefits.</p></li>\n<li><p>I personally like to use numbered sections and sub-sections so that the logical structure of my argument is as clear as possible. We're writing scientific papers, not essays. I imagine that certain journals don't approve of this, but since you're not submitting to a journal it shouldn't be an issue.</p></li>\n<li><p>It's important to acknowledge your professor, and anyone else who's contributed to the paper. One convention i've seen is using an initial footnote on the title of the paper as an acknowledgements section. </p></li>\n</ol>\n", "Id":"6295", "ParentId":"6292", "CreationDate":"2014-01-01T22:38:53.557", "Score":"0", "PostTypeId":"2", "OwnerUserId":"2328", "LastActivityDate":"2014-01-01T22:38:53.557", "OwnerUser":{"UpVotes":"123", "WebsiteUrl":"https://sites.google.com/site/patrickdelliott/", "ProfileImageUrl":"http://i.stack.imgur.com/HGYBE.jpg", "Id":"2328", "AccountId":"3146009", "CreationDate":"2013-08-07T11:16:59.797", "AboutMe":"<p>I'm a PhD student in Linguistics at University College London. My primary area of interest is generative linguistics, and specifically syntactic and semantic theory. More narrowly still, i'm interested in ellipsis, comparatives, and binding theory. <a href=\"https://twitter.com/patrickdelliott\" rel=\"nofollow\">Follow me on twitter!</a></p>\n", "Location":"London, United Kingdom", "DownVotes":"43", "Views":"43", "Reputation":"970", "DisplayName":"P Elliott", "LastAccessDate":"2014-01-19T02:32:31.120"}}