{"OwnerUser":{"UpVotes":"123", "WebsiteUrl":"https://sites.google.com/site/patrickdelliott/", "ProfileImageUrl":"http://i.stack.imgur.com/HGYBE.jpg", "Id":"2328", "AccountId":"3146009", "CreationDate":"2013-08-07T11:16:59.797", "AboutMe":"<p>I'm a PhD student in Linguistics at University College London. My primary area of interest is generative linguistics, and specifically syntactic and semantic theory. More narrowly still, i'm interested in ellipsis, comparatives, and binding theory. <a href=\"https://twitter.com/patrickdelliott\" rel=\"nofollow\">Follow me on twitter!</a></p>\n", "Location":"London, United Kingdom", "DownVotes":"43", "Views":"43", "Reputation":"970", "DisplayName":"P Elliott", "LastAccessDate":"2014-01-19T02:32:31.120"}, "comments":[], "Body":"<p>Here's the basic X'-theoretic tree structure. The usual provisos apply - you'll get different answers depending on who you ask, but i think most would agree with the basic constituent structure i give here. Note that the inflection on the lexical verb is meant to originate on the <em>I</em> head, but i'm agnostic about the operation by which it ends up being spelled out as an affix on the verb. I'm also glossing over the fine structure of the DPs, because getting into that would raise some pretty complex issues.</p>\n\n<p><img src=\"http://i.stack.imgur.com/Yv1eX.png\" alt=\"enter image description here\"></p>\n\n<p>Note that the sentence is ambiguous - the most salient reading is the one where the adverbial <em>very much</em> scopes over the most deeply embedded VP <em>surprised her teachers</em>. This is the reading i've represented above by adjoining the adverbial to the most deeply embedded VP. Other readings could be captured by adjoining <em>very much</em> to higher level VPs.</p>\n\n<p>Note: The tree diagram was built using <a href=\"http://ironcreek.net/phpsyntaxtree/\" rel=\"nofollow\">phpSyntaxTree</a>.</p>\n", "Id":"6309", "ParentId":"6308", "CreationDate":"2014-01-04T20:28:54.053", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2328", "LastActivityDate":"2014-01-04T20:28:54.053", "CommentCount":"1"}