{"Body":"<p>Nathan and Daniel already gave very insightful answers. But I want to point out another detail, something I observe sometimes. I'm not a linguist, I'm rather poor at languages (you may notice it).</p>\n\n<p>My mother tongue is German, but I moved to Spain at the age of six. So I know both - very different - languages. Beside their (mostly) different grammar and vocabulary, there is another difference: Germans make small pauses between words, Spaniards do not. They rather concatenate words. There are two consequences I know: Some words change vowels if they are pronounced in combination with others (e.g. <code>y</code> (Spanish <code>and</code>) followed by a word starting with <code>i</code> or <code>y</code> changes to <code>e</code>), other words that are feminine because of their ending sometimes are pronounced with a male article ('el aguila', 'un agua') to avoid two following <code>a</code>s.</p>\n\n<p>The other consequence: You sometimes can't separate words if you don't know them. Or, you have to concentrate more on the speaker to get everything correctly. I rarely notice that on Spanish speakers, but I do on US English speakers - some of them do it as well! They pronounce everything in one flow, without separating words. But there are others I understand perfectly, even if they speak fast. Those I don't understand don't necessarily speak really fast, but I have to concentrate and I get the <em>impression</em>, they speak fast.</p>\n\n<p>Languages are based on words, not syllables or letters. It makes a great difference if you get a hint where words start or not.</p>\n\n<p>So, my point is: Maybe some people from some countries speak faster than others, but maybe they just seem to speak faster, as it takes a greater effort to understand them. </p>\n\n<p>Of course, if you don't know a language and don't understand anything said, this argument is invalid.</p>\n", "Id":"631", "ParentId":"612", "LastEditorUserId":"51", "CreationDate":"2011-09-30T14:20:09.357", "OwnerUserId":"357", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-09-30T14:31:32.433", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2011-09-30T14:31:32.433", "Score":"4", "CommentCount":"1", "OwnerUser":{"UpVotes":"3", "WebsiteUrl":"http://sacherkhoudari.de", "Location":"Heidelberg, Germany", "Id":"357", "DownVotes":"0", "AccountId":"26777", "Views":"5", "Reputation":"229", "CreationDate":"2011-09-30T13:46:59.273", "DisplayName":"craesh", "LastAccessDate":"2012-01-04T15:26:46.740"}}