{"comments":[], "Body":"<p>I haven't personally observed this phenomenon with clicks, but there are well-known cases of consonant epenthesis that are explained in articulatory terms. For example, it is common to observe an epenthetic [t] between [n] and [s], as in the word <em>chance</em>, since the early closure of the nasal passage turns the nasal stop into an oral one before the air gets released for the fricative.</p>\n\n<p>To address the second part of the question, this isn't the sort of situation in which we'd expect contrastive clicks to arise. </p>\n\n<p>It is common to name phonemes according to the form in which they most often surface, out of convenience and convention. So, if phoneme X most often surfaces as [ɭ] but optionally as [ɭ!] in a certain environment--say before non-high vowels, we name that phoneme /ɭ/. We might formulate a rule that says /ɭ/ is optionally realized as [ɭ!] before non-high vowels (or optionally insert [!] between /ɭ/ and non-high vowels). If the next-generation language learner analyzed the [ɭ!] as being the <em>required</em> realization before non-high vowels, we might consider [ɭ!] to be the more common realization of phoneme X and therefore call the phoneme /ɭ!/ and reformulate our rule to say /ɭ!/ is realized as [ɭ] before high vowels (and as [ɭ!] elsewhere). Over successive generations, the [ɭ] part of [ɭ!] might even be lost, so the rule would become /!/ is realized as [ɭ] before high vowels (and as [!] elsewhere). In this situation, we could reasonably say that [!] contrasts with \"null\" (i.e. the lack of [!]) in as much as the hypothetical words [!ʌm] and [ʌm] would mean two different things. And it would contrast with other (non-ɭ) consonants.</p>\n\n<p>But notice that in all of these different cases, the phoneme inventory itself hasn't really changed. Just the allophones of phoneme X and what we choose to call its underlying form have changed, since [ɭ] and [!] or [ɭ] and [ɭ!] would not be contrastive.</p>\n\n<p>As you probably know, for [ɭ] and [ɭ!] to be considered respective realizations of contrastive phonemes, we'd need to see evidence of minimal pairs--for example a lexicon in which [kʊ˞ɭʌm] means one thing and [kʊ˞ɭ!ʌm] means something else. This situation is unlikely to arise spontaneously under the circumstances you're describing.</p>\n", "Id":"6337", "ParentId":"6335", "CreationDate":"2014-01-07T22:17:11.930", "Score":"2", "PostTypeId":"2", "OwnerUserId":"385", "LastActivityDate":"2014-01-07T22:17:11.930", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}