{"OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "comments":[], "Body":"<p>The <a href=\"https://en.wiktionary.org\" rel=\"nofollow\">English Wiktionary</a> has lots of <a href=\"https://en.wiktionary.org/wiki/Index%3aLatin\" rel=\"nofollow\">Latin entries</a>, and of those many have etymologies.</p>\n\n<p>If you find one that lacks an etymology and you'd really like to see it added, it's a little-known fact that you can request it. Click the edit link on the page, if it's a page with entries for several words in various langauge that happen to share a spelling, then click on the edit link next to the \"Latin\" heading.</p>\n\n<p>Sometimes there will already be one or more \"Etymology\" headings with no details in them. This is mainly where two or more unrelated words in the same language are known to have different origins but coincidentally ended up with the same spelling. In this case the \"Etymology\" headings will be numbered.</p>\n\n<p>Otherwise the Etymology sections are not numbered.</p>\n\n<p>Etymology sections come after the language heading and before any \"part of speech\" heading. I'm never certain whether they should go before or after a \"Pronunciation\" section if there is one. You'll be forgiven if you get it wrong though.</p>\n\n<p>Below the Etymology heading you then use <a href=\"https://en.wiktionary.org/wiki/Template%3arfe\" rel=\"nofollow\">the <code>rfe</code> template</a>, this stands for \"Request For Etymology\". The result will look something like this:</p>\n\n<pre><code>==Latin==\n\n===Etymology===\n{{rfe|lang=la}}\n\n===Noun===\n... stuff ...\n</code></pre>\n\n<p>Or this:</p>\n\n<pre><code>==Latin==\n\n===Etymology 1===\n{{rfe|lang=la|Possibly related to Greek \"foo\"?}}\n\n====Noun====\n... some stuff ...\n...\n...\n\n===Etymology 2===\n{{rfe|lang=la|Could this be cognate with Sanskrit \"phu\"?}}\n\n====Verb====\n... some other stuff ...\n...\n</code></pre>\n\n<p>The <code>la</code> is the <a href=\"http://www.loc.gov/standards/iso639-2/php/code_list.php\" rel=\"nofollow\">ISO 639 language code</a> for Latin. The comment after the <code>|</code> is optional and will appear in the entry to give other Wiktionary contributors a place to start looking.</p>\n\n<p>To know when there's a response, click the star in the menu and check your watchlist. People may well then discuss it in the talk page before, or they may just add an etymology.</p>\n\n<p>Other langauge Wiktionaries probably have similar systems, but they'd be a bit different so I can't comment on them here.</p>\n", "Id":"6360", "ParentId":"6351", "CreationDate":"2014-01-09T17:32:07.547", "Score":"2", "PostTypeId":"2", "OwnerUserId":"51", "LastActivityDate":"2014-01-09T17:32:07.547", "CommentCount":"2"}