{"Body":"<p>Apart from the 3 languages you named, I know of at least 3 other major languages that used the Chinese script, those are Thai, Zhuang, and Mongolian. Several minor ones that also used it include Miao, Yao, Bouyei, Kam, Bai, and Hani.</p>\n\n<p>Thai <a href=\"http://en.wikipedia.org/wiki/Thai_language#Vocabulary\" rel=\"nofollow\">used the Chinese script</a> until the 13th century, when it was abandoned in favor of an Indian Brahmi-family script. Aparently, it used the Chinese characters to mean what they meant in Chinese, but they were pronounced in Thai, in a similar way like Vietnamese did.</p>\n\n<p>Zhuang used the Chinese-based characters in the same way, this way of writing Zhuanh is called <a href=\"http://en.wikipedia.org/wiki/Sawndip\" rel=\"nofollow\"><em>Sawndip</em></a> which means \"immature characters\" in Zhuang. Just like Vietnamese, Zhuang uses many characters which were created specially for Zhuang, according to the models that the rest of the Chinese characters are built after. The characters which are the same in Chinese and Zhuang mean the same, but in Zhuang they are read using the Zuang words. <em>Sawndip</em> is still used to write Zhuang, along with the official pinyin-style Latin alphabet.</p>\n\n<p>As for Mongolian, there was a bit different story. Mongolian is, perhaps, the most probable winner of the title of the language that used the greatest number of different writing systems during the course of its history. The most significant book in Mongolian is <a href=\"http://en.wikipedia.org/wiki/The_Secret_History_of_the_Mongols\" rel=\"nofollow\">\"The Secret History of the Mongols\"</a>, written in the 14th century in Chinese characters used solely in their phonetic reading for transcribing the Mongol text, irrespective of their meaning.</p>\n\n<p>Apart from Mongolian which used the Chinese script to read and write their native languages phonetically, the rest of the languages that used it used each character of that script to mean roughly the same it means in Chinese, only they pronounced it the way the concept was named in their language.</p>\n\n<p>There is a rather good Wiki article, <a href=\"http://en.wikipedia.org/wiki/Chinese_family_of_scripts\" rel=\"nofollow\">\"Chinese family of scripts\"</a> that can serve as an introduction into this area.</p>\n", "Id":"6376", "ParentId":"6375", "LastEditorUserId":"2689", "CreationDate":"2014-01-11T19:40:07.687", "OwnerUserId":"2689", "PostTypeId":"2", "comments":[], "LastEditDate":"2014-01-12T01:39:13.837", "LastEditedUser":{"UpVotes":"41", "Location":"Ukraine", "DownVotes":"12", "Id":"2689", "AccountId":"2118122", "Views":"8", "Reputation":"828", "CreationDate":"2013-11-06T08:33:33.413", "DisplayName":"Yellow Sky", "LastAccessDate":"2014-01-19T01:45:10.363", "AboutMe":"<p>I've been working as a teacher of English and German for more than 10 years already. Linguistics is my life-long passion, I can speak and read no less than 12 languages well, I am studying Malay and Manju at the moment. My native languages are Ukrainian and Russian.</p>\n", "Age":"37"}, "LastActivityDate":"2014-01-12T01:39:13.837", "Score":"7", "OwnerUser":{"UpVotes":"41", "Location":"Ukraine", "DownVotes":"12", "Id":"2689", "AccountId":"2118122", "Views":"8", "Reputation":"828", "CreationDate":"2013-11-06T08:33:33.413", "DisplayName":"Yellow Sky", "LastAccessDate":"2014-01-19T01:45:10.363", "AboutMe":"<p>I've been working as a teacher of English and German for more than 10 years already. Linguistics is my life-long passion, I can speak and read no less than 12 languages well, I am studying Malay and Manju at the moment. My native languages are Ukrainian and Russian.</p>\n", "Age":"37"}}