{"OwnerUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}, "comments":[], "Body":"<p>Spoken creoles are developed in environments where many languages are mixed (for example, in the Caribbean region, there were several major colonial languages and many African languages spoken by slaves).  For deaf children learning sign languages, there is the opposite problem – they may have no input that is \"linguistic,\" but only some non-linguistic gestures or non-native sign.  There are two sign languages that have been \"created\" (i.e. arisen by some means other than descent from an extant language) in recent years and have been the subject of research by language-acquisition researchers: <a href=\"https://secure.wikimedia.org/wikipedia/en/wiki/Nicaraguan_Sign_Language\">Nicaraguan Sign Language</a> and <a href=\"https://secure.wikimedia.org/wikipedia/en/wiki/Al-Sayyid_Bedouin_Sign_Language\">al-Sayyid Bedouin Sign Language</a>.  So I'd say that these are the closest thing to a sign language \"creole\" (although not much is known about the historical genesis of older sign languages, and it's quite possible that all of them arose spontaneously in deaf communities without influence from aural languages).</p>\n\n<p>For the concept of \"pidgin,\" there are so-called <a href=\"https://secure.wikimedia.org/wikipedia/en/wiki/Home_sign\">home sign systems</a>, which develop when deaf children and hearing caregivers do not have access to instruction in an established sign language.  These generally lack some of the traits than linguists ascribe to natural languages (as do pidgins).</p>\n\n<p>If you're interested in the families of sign languages and the phylogenetic relationships between them, you might want to check out <a href=\"https://secure.wikimedia.org/wikipedia/en/wiki/Sign_language#Classification_of_sign_languages\">this section of Wikipedia</a>, which lists the currently accepted groupings.</p>\n", "Id":"638", "ParentId":"634", "CreationDate":"2011-10-02T01:12:40.797", "Score":"4", "PostTypeId":"2", "OwnerUserId":"46", "LastActivityDate":"2011-10-02T01:12:40.797", "CommentCount":"1"}