{"comments":[], "Body":"<p>Seems more a programming problem than a linguistis problem to me.</p>\n\n<p>I'd use a fuzzy parser (probably done in Perl) that attempts to divide such variable names into smaller chunks using either underscores or changes in capitalization, then checks all resulting chunks (including original) vs. a dictionary of words in the target language - taking into account either the <a href=\"https://en.wikipedia.org/wiki/Levenshtein_distance\" rel=\"nofollow\">Levenshtein distance</a> or the <a href=\"https://en.wikipedia.org/wiki/Longest_common_subsequence_problem\" rel=\"nofollow\">longest common substring</a>.</p>\n\n<p>You'd get a number of potential matches, assign a score to each (based on less changes required) and, voilá! If a score is high enough, you could be certain it's a match, and thus a word in such language.</p>\n\n<p>I don't think there's such a thing as a universal discriminator to check if a word exists in a language or not - some languages (both natural and created) have very weird capitalization patterns, even within a word (e.g. Irish or Klingon) or can have long sequences of just consonants which nonetheless are valid words (Serbian and Bereber). Worse yet, someone could be typing Chinese characters using the <a href=\"https://en.wikipedia.org/wiki/Cangjie_input_method\" rel=\"nofollow\">Tsang-chieh method</a>: a seemingly random \"JWJ\" actually encodes the character 車 \"car, vehicle\"! Ditto for the \"4 corners\" method: an initial letter plus a series of numbers <em>could be</em> a valid word. </p>\n", "Id":"6386", "ParentId":"6385", "CreationDate":"2014-01-13T13:36:04.370", "Score":"0", "PostTypeId":"2", "OwnerUserId":"2785", "LastActivityDate":"2014-01-13T13:36:04.370", "OwnerUser":{"UpVotes":"79", "WebsiteUrl":"http://stackoverflow.com/users/21258/joe-pineda", "ProfileImageUrl":"https://www.gravatar.com/avatar/3829797d6709334d9a07fe18dfcb553f?s=128&d=identicon&r=PG", "Id":"2785", "AccountId":"11104", "CreationDate":"2013-11-26T03:56:44.347", "AboutMe":"<p>Developing professionally since 11 years ago. VB6 and SQL Server, mostly.\nUse Linux, C++ and Perl at home.</p>\n", "Age":"35", "Location":"Mexico City, Mexico", "DownVotes":"5", "Views":"3", "Reputation":"395", "DisplayName":"Joe Pineda", "LastAccessDate":"2014-01-19T02:51:24.697"}}