{"Body":"<p>This pattern does show up a lot, and there seem to be multiple factors driving it. Rural areas (though not only such areas) tend contain small, immobile, tight-knit populations, in which local identity is socially important and outside communication is (historically) limited. </p>\n\n<p>On one level, simple isolation means there's less exposure to the mainstream forms, and to the 'leveling' effect of contact between speech communities. Such conditions instead seem to favor the maintenance of non-standard language features, and resistance to incoming changes from the mainstream; in the face of incoming changes, such conditions may even promote a reaction of 'exaggeration' of non-standard, local-identity features. Socioeconomic class may often play a role, and rural areas tend to be poorer.</p>\n\n<p>Note, though, that the conditions described have often applied equally well to dense, urban enclaves. In addition, as a general rule, isolation of regions has trended down over time (due to growth of transportation and communications technology). This breakdown of isolation seems to be the major factor in the loss of the distinctive local variety of e.g. Martha's Vineyard, or North Carolina's Outer Banks communities.</p>\n", "Id":"6417", "ParentId":"6416", "LastEditorUserId":"657", "CreationDate":"2014-01-15T17:38:46.333", "OwnerUserId":"657", "PostTypeId":"2", "comments":[], "LastEditDate":"2014-01-17T15:19:07.167", "LastEditedUser":{"UpVotes":"5", "WebsiteUrl":"", "DownVotes":"1", "Id":"657", "AccountId":"1160318", "Views":"3", "Reputation":"526", "CreationDate":"2012-01-10T02:11:47.230", "DisplayName":"Jeremy Needle", "LastAccessDate":"2014-01-18T15:40:44.497", "AboutMe":"<p>Sociolinguist.</p>\n"}, "LastActivityDate":"2014-01-17T15:19:07.167", "Score":"6", "OwnerUser":{"UpVotes":"5", "WebsiteUrl":"", "DownVotes":"1", "Id":"657", "AccountId":"1160318", "Views":"3", "Reputation":"526", "CreationDate":"2012-01-10T02:11:47.230", "DisplayName":"Jeremy Needle", "LastAccessDate":"2014-01-18T15:40:44.497", "AboutMe":"<p>Sociolinguist.</p>\n"}}