{"comments":[], "Body":"<p>Less intelligible to whom? I think what you are trying to mean with <a href=\"http://en.wikipedia.org/wiki/Accent_%28sociolinguistics%29\" rel=\"nofollow\">\"accent\"</a> here is the form of \"accent\" that can mean either of three things: 1) a form of speech that differs from some standard, prescriptively more correct form of speech of the same language 2) a form of speech that differs from your own, but is still the same language 3) a foreign accent, where the speaker has learned the language as an adult and cannot pass for a native. Let's ignore 3). The first generally only holds for modern countries with a strong capital city, a high degree of centralization and/or mass media. Preferably all three. The second definition first occurred the moment the very first group of speech-using humans became <em>two</em> groups of speech-using humans, + about a generation of passed time.</p>\n\n<p>Accent sorts under sociolinguistics for a reason. The intelligibility is, among other things, dependent on the status difference between speaker and listener - if, say, the listener considers him/herself to be of higher status, there is less of a penalty if the listener cannot understand the speaker. A low status person on the other hand might depend on being able to understand a high status speaker. Rural people are often considered lower status by people living in cities, ergo, rural people are unintelligible. Power games.</p>\n\n<p>Moving away from the sociolinguistic side, read up on <a href=\"http://en.wikipedia.org/wiki/Dialect\" rel=\"nofollow\">dialects</a> as to <em>why</em> area-dependent accents differ. (There are also solely status-based accents, aka. sociolects, for instance those acquired through being stuck in a boarding school.) Dialects are accents turned up to 11, and is why one language can split into two or more languages given enough time.</p>\n", "Id":"6419", "ParentId":"6416", "CreationDate":"2014-01-15T19:42:04.280", "Score":"3", "PostTypeId":"2", "OwnerUserId":"119", "LastActivityDate":"2014-01-15T19:42:04.280", "OwnerUser":{"UpVotes":"302", "DownVotes":"1", "Id":"119", "AccountId":"14652", "Views":"52", "Reputation":"3065", "CreationDate":"2011-09-14T14:24:24.227", "DisplayName":"kaleissin", "LastAccessDate":"2014-01-18T22:21:33.313", "AboutMe":"<p>Sysadmin/programmer by day, linguist by night.</p>\n"}}