{"OwnerUser":{"UpVotes":"13", "WebsiteUrl":"", "DownVotes":"1", "Id":"2132", "AccountId":"2572199", "Views":"6", "Reputation":"701", "CreationDate":"2013-06-04T23:59:57.060", "DisplayName":"Sjiveru", "LastAccessDate":"2014-01-18T21:42:32.287", "AboutMe":"<p>Still in training, but hopefully somewhat knowledgeable. Historical linguistics is awesome.</p>\n"}, "comments":[], "Body":"<p>It's purely based on the fact that the standard variety is based off the speech of a region these speakers don't come from. If theirs was the standard and yours wasn't, they'd say the same thing about your 'accent'. Every form of speech is intelligible to those that speak it - and if parts ever become problematically unintelligible, there are natural mechanisms for fixing that problem (e.g. the rampant compounding in North Chinese making up for a drastic reduction in the number of available syllables, making distinctive bisyllabic words out of problematically less distinct monosyllabic ones).</p>\n\n<p>Indeed, areas farther away from sociopolitical centres tend to change slower, due to less pressure to keep up with prestigious norms; though this is at times counteracted by a tendency for areas that are largely isolated from most other speakers to change faster, as they have less of a need to remain intelligible to passers-through. So regional variation can involve varieties that are both closer to and farther from their common ancestor. In Appalachia, Shakespeare remained intelligible with little effort as recently as the last century; and the same remains true of the sagas in Iceland (indeed, I knew a guy who spoke Faroese and took Old Norse as a blow-off class) - yet for me, who speaks enough Norwegian to get by, they are largely nonsense. On the other hand, the languages in the Ryuukyuu Islands south of Japan are -spectacularly- more innovative than mainland Japanese - to me they look like they ought to be spoken by time-travellers from the future.</p>\n\n<p>There's also a tendency for similar-enough varieties of speech to become more intelligible simply through exposure. In the early days of sound films, British films had to be subtitled for American audiences and vice-versa, but once people had heard enough of each others' varieties, the need for subtitling vanished.</p>\n\n<p>So it's just an effect of the fact that many people speak versions of a language that isn't the version of a language the majority of people are most familiar with, and their unfamiliarity creates a general perception that non-standard dialects are somehow more universally hard to understand.</p>\n", "Id":"6439", "ParentId":"6416", "CreationDate":"2014-01-17T03:58:17.777", "Score":"1", "PostTypeId":"2", "OwnerUserId":"2132", "LastActivityDate":"2014-01-17T03:58:17.777", "CommentCount":"2"}