{"Body":"<p>I have not heard of a language that lacks numbers entirely, and doubt one exists (happy to see proof though). It is true that many Australian Aboriginal languages have words for only a few numbers, typically 1, 2 and 3: for discussion of this see Dixon 1981. Some languages are documented to have more numbers (e.g. Anindilyakwa). Many Australian Aboriginal languages don't have any articles (definite or indefinite), but commonly use other words (e.g. determiners) in this function. Have a look at the <a href=\"http://wals.info/feature/37A\" rel=\"nofollow\">World Atlas of Linguistic Structures</a> (check  out the map).</p>\n\n<p>So I guess the answer is that there are no languages that have an indefinite article but lack numbers, because no languages lack numbers (although Piraha is said to lack true numerals, but I think it needs more investigation).</p>\n\n<p>ADDITIONAL: \nFrom Evans (1995) I see that numerals in Kayardild (Tangkic family, spoken on the Bentinck Islands in the Gulf of Carpentaria) extend to four, but it has an indefinite determiner (p. 237; it is formally identical to the numeral one). So this may be an example of a language that lacks a full number system but nevertheless has an indefinite article (though it depends on how these terms are defined).</p>\n", "Id":"645", "ParentId":"640", "LastEditorUserId":"363", "CreationDate":"2011-10-02T11:57:45.187", "OwnerUserId":"363", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-06T05:11:39.950", "LastEditedUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}, "LastActivityDate":"2011-10-06T05:11:39.950", "Score":"2", "CommentCount":"1", "OwnerUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}}