{"OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "comments":[], "Body":"<p>Let's assume what's sometimes called the \"proto-World\" hypothesis: language arose only once, in once community of speakers, and spread from there.  If that's true, then &mdash; like Alek Storm says &mdash; <em>every</em> human language has proto-World as a direct ancestor.  So the Khoisan languages wouldn't be unique in that regard.</p>\n\n<p>When linguists talk about a connection between Khoisan and the hypothetical proto-World, what they're suggesting is that the Khoisan languages must be especially <em>conservative</em> &mdash; that they've preserved some features of proto-World more or less unchanged.  One feature that usually comes up is the one you mention: the presence of clicks.  </p>\n\n<p>The implicit argument here is roughly: \"Well, Khoisan languages are spoken in the birthplace of the human species.  So it stands to reason that they would be the most conservative languages in the world.\"</p>\n\n<p>But there's a problem with that argument. There is no clear connection between migration and language change.  Sitting still won't prevent language change, and moving around won't make your language change any faster than normal.  (For instance: British English is more conservative than American English in some ways, and less conservative in others.  If migration and language change were connected, we'd expect British English to be much more conservative across the board.) </p>\n\n<p>So in fact there's no particular reason to expect the Khoisan languages to be the most conservative, just because its speakers have stayed in one place.  For all we know the most conservative language in the world is one spoken in South America, or Australia, or ... well, <em>wherever.</em>  We just can't tell.  </p>\n", "Id":"668", "ParentId":"663", "CreationDate":"2011-10-03T03:08:42.120", "Score":"24", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2011-10-03T03:08:42.120", "CommentCount":"3"}