{"Body":"<p>I'm not sure there really even is a \"current state of the debate.\" Most linguists seem to view it as a question that we don't have appropriate models or analyses to address. To start, I would like to bring up some finer points:</p>\n\n<ol>\n<li><p>\"Genetic relatedness\" of language isn't even really well-defined. It is entirely possible that throughout the past many millennia, languages had a tendency to borrow very differently than today.</p>\n\n<ul>\n<li><p>For instance, suppose you were one of a group of a dozen young women from tribe B who married into tribe C, which has about a hundred people, all at the same time. If tribe B had pronouns, and tribe C did not, but inflected verbs for person, say, only in perfective aspect, you all might start using the pronouns from tribe B; if the people in tribe C like the idea enough, they might start using them. Meanwhile, if tribe A had recently imported grammatical number from tribes elsewhere and lent it to tribe B, you might carry that with you through to tribe C.</p></li>\n<li><p>What we have, in sum, is a mess. Linguists working on pidgins, creoles, and creolization may be our best bet to provide breakthroughs in this.</p></li>\n<li><p>This often brings me to the analogy of genetics in a biological sense: when we look at DNA within the nucleus of a eukaryotic cell, we're definitely able to determine relatedness; however, in a colony of bacteria/organisms that may not exist anymore, the fact that one organism can \"eat\" a plasmid from another and maybe even splice it into its own principal DNA ring screws up the notion.</p></li>\n</ul></li>\n<li><p>\"Human language\" isn't really well-defined. It's easy enough to separate what is human language from what isn't, in most cases, in the present day, but the tools we've developed for that from our present-day experience probably aren't adequate to evaluate the situation, say, 300 000—40 000 years ago, or even describe it well. The burden then falls to the inquirer, <em>what</em> is it precisely are you wondering originated once or multiple times?</p></li>\n<li><p>What if there really was polygenesis of language, but those of the present day all come from a single source (assuming we could even define what we meant by that, and it wasn't silly)? If the last language not from the same source was, say, some North American language isolate that went extinct in the 18th century, after being sparsely documented? This leads to more interesting questions, such as what if, grammatically, it wasn't all that out-of-the-ordinary?</p></li>\n</ol>\n\n<p>But as long as we're speculating, my <em>bet</em> is that the real answer is a mixture of mono- and polygenesis: there were many periods when tribes maintained close contact with each other, borrowing heavily across the grammatical spectrum throughout a dialect continuum for centuries, and then underwent periods of individuation, due to geographical or cultural effects; during one of these periods, perhaps you would say one of these speech patterns would finally qualify for whatever formal definition you have of \"language,\" and during the next period of mixture, maybe it was borrowed from more than it borrowed. But then, say, a thousand years later, a dialect half a continent away, to which only a small portion of those innovations filtered, innovated enough on its own to where you could call <em>it</em> a \"language.\" This whole scenario is to bear out the point that what we really have is a mess.</p>\n\n<p>(I know I've employed a nonstandard usage of \"dialect\"; I just didn't want to use the word \"language\" above, for obvious reasons.)</p>\n\n<p>Some references:</p>\n\n<p><a href=\"http://books.google.com/books?id=UAFVgdGljl4C&amp;pg=PA24&amp;lpg=PA24&amp;dq=linguistic+monogenesis+vs+polygenesis&amp;source=bl&amp;ots=lKzOdi-gJ0&amp;sig=dwN_Lw6P0yfqwkm7CHyfq4Udfps&amp;hl=en&amp;ei=UneKTr7RCabz0gH1nLm8BA&amp;sa=X&amp;oi=book_result&amp;ct=result&amp;resnum=10&amp;ved=0CFwQ6AEwCQ#v=onepage&amp;q&amp;f=false\">Polygenesis, convergence, and entropy</a> (1996), by Lutz Edzard, takes a comparable view</p>\n\n<p>In <a href=\"http://www.isrl.illinois.edu/~amag/langev/paper/freedman96languagePolygenesis.html\">Language Polygenesis: A probabilistic model</a> (1995), David Freedman and William Wang point out the flaws in the usual probabilistic argument for monogenesis</p>\n\n<h2>Addendum:</h2>\n\n<p>(let me know if I should create another question or something):</p>\n\n<p>An article in the New York Times, <a href=\"http://www.nytimes.com/2003/05/06/science/world-s-farmers-sowed-languages-as-well-as-seeds.html?pagewanted=all&amp;src=pm\">World's Farmers Sowed Languages as Well as Seeds</a> (2003), bears out the relationship between the success of the comparative method and the presence of agriculture in the cultures being studied. (This relates to my point about dialect continua/grammatical innovation/\"membranes\" and leads into a response to MatthewMartin's answer.)</p>\n\n<p>+1 to MatthewMartin for mentioning a vital element of the \"debate\" Otavio Macedo was referring to. Greenberg conducted some of the most groundbreaking and notable research in linguistic taxonomy of the past hundred years, including but by no means limited to the establishment of Niger-Kordofanian and Afro-Asiatic. There always seems to be a lot of unhelpful, not-so-under-the-surface vitriol in many reactions to the Greenberg/Ruhlen research. On the other hand, when in the Amazon review of Ruhlen's book, Larry Trask says</p>\n\n<blockquote>\n  <p><strong>of the 13 Basque items presented on page 65 (as 'language B'), four are wrong, and two \n  more are not even native Basque words,</strong> but are words borrowed from Latin or Spanish.\n  And there are also some profound problems concerning the origins and earlier forms of \n  several of the others,</p>\n</blockquote>\n\n<p>this is a <em>factual</em> objection, which can easily be verified. Similarly, in <a href=\"http://www.nostratic.ru/books/%28211%29vajda-2008.pdf\">A Siberian link with Na-Dene languages</a> (which I feel is the most notable finding in linguistic taxonomy of the twenty-first century so far, but that's beside the point), we read</p>\n\n<blockquote>\n  <p>The first person to claim a genetic link specifically between Yeniseic and\n  Athabaskan-Tlingit (Eyak was then unrecognized as a Na-Dene language) was the Italian\n  linguist Alfredo Trombetti (1923). Since that time, many other linguists,\n  notably Merritt Ruhlen (1998) have repeated the same suggestion, though typically \n  including Haida in Na-Dene</p>\n</blockquote>\n\n<p>and </p>\n\n<blockquote>\n  <p>Merritt Ruhlen's (1998) proposed cognate sets contain several genuine cognates, among \n  over <strong>75% coincidental look-alikes.</strong> These are Ruhlen's comparisons for: head, stone, \n  foot, breast, shoulder/arm, birch/birchbark, old, and burn/cook, and possibly a few \n  others. The correct identification of cognate words for \"birch/birchbark\" is \n  particularly noteworthy, as this basic vocabulary item is specific to families of the \n  northern latitudes. The finding of these cognates, though it was impossible to confirm \n  them as such in the absence of much more investigation, represents an important \n  contribution,</p>\n</blockquote>\n\n<p>in other words, (1) Greenberg and Ruhlen are correct that Na-Dené and Yeniseian are relatives, (2) Ruhlen's wordlist is partially correct and helpful, but (3) Haida is not part of their linguistic unit, and (4) 75% of Ruhlen's correspondences turned out to be invalid.</p>\n\n<p>This is getting a little long, so I'll summarize the rest. After his Africa research, Greenberg traveled to Papua New Guinea and to South America (IIRC; if anyone can source this I'd be grateful) and collected <a href=\"http://en.wikipedia.org/wiki/Swadesh_list\">Swadesh-type word lists</a> from hundreds of tribes. This, too, is <strong>incredibly important</strong> research, of a nature not many have had the constitution to undertake. The results of it are, too, very important.</p>\n\n<p>What's the conclusion? More research of this sort needs to be done, to get a lower error rate on the words in the lists. Sound changes need to be added back into the equation with gusto, so that we can find more correct correspondences and throw out more of the ones that don't actually hold.</p>\n\n<p>And on those pronouns: they certainly do hint at the <em>possibility</em> of Eurasiatic (for instance) as a linguistic unit. But what if, again, there were an era where pronouns were the new hot item? Then they could all reduce to loanwords. Again, the conclusion is more research needs to be done.</p>\n", "Id":"684", "ParentId":"682", "LastEditorUserId":"84", "CreationDate":"2011-10-04T03:50:16.597", "OwnerUserId":"84", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-04T21:23:48.513", "LastEditedUser":{"UpVotes":"167", "WebsiteUrl":"http://web.mit.edu/~dbriggs/www", "Id":"84", "AccountId":"511555", "CreationDate":"2011-09-14T00:18:36.197", "AboutMe":"<p>At UMass Amherst in the Ph.D. program in math.<br>\n</p>\n\n<p>\nCurrently taking:<br>\nAnalysis (Measure theory & integration)<br>\nGeometry (Theory of manifolds)<br>\nModular Forms</p>\n", "Age":"29", "Location":"Cambridge, MA", "DownVotes":"0", "Views":"23", "Reputation":"1163", "DisplayName":"Daniel Briggs", "LastAccessDate":"2013-08-10T16:57:15.060"}, "LastActivityDate":"2011-10-04T21:23:48.513", "Score":"15", "CommentCount":"1", "OwnerUser":{"UpVotes":"167", "WebsiteUrl":"http://web.mit.edu/~dbriggs/www", "Id":"84", "AccountId":"511555", "CreationDate":"2011-09-14T00:18:36.197", "AboutMe":"<p>At UMass Amherst in the Ph.D. program in math.<br>\n</p>\n\n<p>\nCurrently taking:<br>\nAnalysis (Measure theory & integration)<br>\nGeometry (Theory of manifolds)<br>\nModular Forms</p>\n", "Age":"29", "Location":"Cambridge, MA", "DownVotes":"0", "Views":"23", "Reputation":"1163", "DisplayName":"Daniel Briggs", "LastAccessDate":"2013-08-10T16:57:15.060"}}