{"Body":"<p>I thought I'd follow up Daniel's excellent comment by giving an example of the problems faced by language reconstruction.</p>\n\n<p>One of the best tools we have for establishing a relationship between two languages is the comparative method. This was developed in the 17th century after people started noticing some deep similarities between Sanskrit, Greek, and some other languages. They hypothesized that they all shared a common ancestor, which they called \"Proto-Indo-European\". By comparing the way one concept is expressed in different languages, you can come up with correspondences. If you can generalize this correspondence, you can establish a relationship between the two languages.</p>\n\n<p>Let's say you discover a new island, Ba and on this island are two distinct cultures with there own distinct language, Tamo and Danu. We suspect that they share a common linguistic ancestor; the island is so isolated that we don't expect multiple migrations. Still, we can't rule it out. </p>\n\n<p>We proceed by constructing a lexicon of the two languages using basic words, something called a swadesh list, which contains all the words we expect a language to have. So we've done this and developed a reliable list along with their pronunciations. It might look something like this:</p>\n\n<pre><code> Word     Tamo     Danu \n—————————————————————————\n'Man'     /tam/    /dan/\n'Woman'   /tami/   /dani/\n'Dog'     /kɔd/    /god/\n...       ...       ... \n</code></pre>\n\n<p>So on and so forth. </p>\n\n<p>We immediately notice that these words look similar. 'man' is very similar in both languages: an alveolar stop, /a/, nasal, and rounded back vowel. But, there are some variations. It's a voiced stop in Danu and an unvoiced stop in Tamo. But look: we get the same pattern with 'dog', a voiced alveolar stop in Danu and an unvoiced one in Tamo. If this holds up across a lot of words, then that is strong evidence these languages share a common ancestor, which we might call 'proto-ba'.</p>\n\n<p>There are lots of things that can go wrong with this. Word-borrowings, crib words, and convergent happenstance can all contrive to make two languages appear related when they are not. You can get over excited about your discovery, and start noticing similarities that aren't there. You'll want to do a lot of heavy research about the language and the people that spoke it. Who have they had contact with? Where did they come from? Have there been any major migrations that might have affected the language?</p>\n\n<p>Another problem is that after a certain point, this method stops being useful. Language changes can build up over time, complicated each other or wipe each other out. Our knowledge about the language becomes less and less reliable, and we start losing important pieces to the puzzle. There is a lot of controversy about how Japanese is related to Chinese, for instance, and no one knows where Basque came from. </p>\n\n<p>We'd be fighting through 50,000 years of language change, most of it without any written records and a bare sketch of population movements, and that's a conservative estimate for the age of language. It's really easy to under appreciate just how long a time that is. Proto-Indo-European, for instance, started to split up around 6000 years ago. The invention of writing is around the same age.</p>\n\n<p>There are some linguists that have tried to come up with a sketch of 'proto-world', but they have been met with intense skepticism. Just google \"proto-world\" and click around on a few of the links.</p>\n", "Id":"686", "ParentId":"682", "LastEditorUserId":"111", "CreationDate":"2011-10-04T06:21:53.560", "OwnerUserId":"350", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-03-29T13:56:47.617", "LastEditedUser":{"UpVotes":"308", "DownVotes":"10", "Id":"111", "AccountId":"514008", "Views":"172", "Reputation":"5430", "CreationDate":"2011-09-14T09:33:29.710", "DisplayName":"Alenanno", "LastAccessDate":"2014-01-19T00:38:35.883", "AboutMe":"<p>I'm a student majoring in Languages (branch: Linguistics), currently working as a freelance translator. I've recently discovered <a href=\"http://db.tt/WpiKeReH\" rel=\"nofollow\">Dropbox</a> and I'm going to use it for my needs! :)</p>\n\n<p><em><strong>I love</em></strong><br>\nLanguages, Movies (Fantasy, Sci-Fi, Tarantino, etc.), Music, 3D Graphics, books and so on. </p>\n\n<p>Appointed ♦ Moderator Pro Tempore on <a href=\"http://area51.stackexchange.com/proposals/6673/linguistics?referrer=GlDGLdkDYNxMg1X13CJ1vg2\">Linguistics SE</a>, <a href=\"http://area51.stackexchange.com/proposals/6388/chinese-language-usage?referrer=XzTG1Nz01tc01sJEhak_6g2\">Chinese SE</a> and the <a href=\"http://area51.stackexchange.com/proposals/10848/russian-language-usage?referrer=J7IYS3ZUomUDvVVb-6SmDQ2\">Russian SE</a> site. If you're interested in other Stack Exchanges, try the <a href=\"http://area51.stackexchange.com/proposals/42949/italian-language-usage?referrer=ALVtGpK0tjLp1Lw15QCaUA2\">Italian SE</a> site.</p>\n\n<p>I like to lurk on other sites' Metas. <em>Meta is fun!</em> </p>\n\n<p><strong>My feature requests</strong>:</p>\n\n<ol>\n<li><a href=\"http://meta.stackoverflow.com/q/135786/176533\">Alert a moderator when an answer is improved after a post notice</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/138273/176533\">Automatically add chat event to the community bulletin (or make it easier)</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/121363/176533\">Give 10k users the ability to see the total count of flags they've handled</a></li>\n</ol>\n\n<p><strong>Moderator issues</strong>: If you have concerns or want to contact me about my moderation, you can find/ping me either in the <a href=\"http://chat.stackexchange.com/rooms/1336/linguistics\">Linguistics SE chat room</a> or <a href=\"http://chat.stackexchange.com/rooms/1984/chinese-language-and-usage\">CL&amp;U chat room</a>; if I'm not there or I'm \"idle\", just ping me! Please <em>avoid</em> using my personal email for such things. Use the chat rooms.</p>\n\n<hr>\n\n<p><strong>Languages List</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <sup>Languages with  * = learning on my own</sup></p>\n\n<p><strong>Mother Tongue:</strong> Italian, Sardinian;<br>\n<strong>Fluent:</strong> English, Spanish;<br>\n<strong>Less Fluent:</strong> French, German, Russian;<br>\n<strong>Learning:</strong> Japanese*, Chinese*, Swedish*, Greek*, Finnish*;<br>\n<strong>Willing to learn:</strong> Welsh, Korean, Dutch, Arabic, Hebrew, Hindi [to be continued]</p>\n\n<p>Me gusta el Español.<br>\nJ'aime le Français.<br>\nDeutsch gefällt mir.<br>\nМне нравится Русский язык.<br>\n私は日本語が好きです。<br>\n我爱中文。<br>\nJag älskar Svenska.</p>\n"}, "LastActivityDate":"2012-03-29T13:56:47.617", "Score":"9", "OwnerUser":{"UpVotes":"15", "Location":"United States", "DownVotes":"0", "Id":"350", "AccountId":"920001", "Views":"12", "Reputation":"872", "CreationDate":"2011-09-29T14:58:17.387", "DisplayName":"Nathan", "LastAccessDate":"2013-11-11T17:54:15.000", "Age":"26"}}