{"OwnerUser":{"UpVotes":"72", "WebsiteUrl":"http://suburbandestiny.com/conlang", "Id":"20", "AccountId":"15651", "CreationDate":"2011-09-13T20:53:42.550", "AboutMe":"<p>I'm a programmer by day and an amateur linguist by night.</p>\n\n<p>I organize the Arlington Linguistics Book Club, where we read a wide variety of books that make the science of linguistic accessible to a popular audience.</p>\n", "Age":"41", "Location":"United States", "DownVotes":"6", "Views":"39", "Reputation":"1657", "DisplayName":"MatthewMartin", "LastAccessDate":"2014-01-08T19:46:09.130"}, "comments":[], "Body":"<p>Merritt Ruhlen is has a good <a href=\"http://rads.stackoverflow.com/amzn/click/0471159638\" rel=\"nofollow\">popularly accessible book on the issue</a> and my answer is based on my reading of his book. </p>\n\n<p>The anti-monogensis stance is by and large based on the proto-indo-european research agenda and their methods. It is not controversial that those techniques fall apart at about 5000 maybe even 10000 years worth of inferences.  A pretty good accessible book about this research agenda and how it agrees with the archeological record for IE, \"<a href=\"http://rads.stackoverflow.com/amzn/click/0691058873\" rel=\"nofollow\">The horse, the wheel and language</a>.\"  The story for PIE is pretty convincing and the reconstructions almost look like a ghost of the original speakers might be able to understand it, albeit this is hardly the level of proof you get in physics or math.</p>\n\n<p>Ruhlen makes the case that</p>\n\n<ul>\n<li>going further back uses different techniques, e.g. focus on the evolution of pronoun systems, ignore step by step transformations, and these techniques are different than used for reconstructing PIE</li>\n<li>has more modest goals, classification is a much more modest goal (i.e. will not result in a PIE type reconstruction of protoworld) </li>\n<li>has turned into exercise of academics flinging feces at each other (my words, and darn if it isn't appropriate) </li>\n<li>this isn't the first time the academic community reacted violently against a superfamily and then more or less accepted it, using Greenbergs research on the Bantu languages as an example.</li>\n</ul>\n\n<p>And now for my personal opinion-- some of the most vociferous opponents are American Indian language researchers. In that community, so many competing crackpot ideas have been advanced in the past (e.g. the Indians are the lost tribe of Israel and that Amerind languages are some type of Hebrew) that the whole field has irrationally turned against the idea that Amerind languages can be rationally classified into superfamilies.</p>\n\n<p>Now in other fields, genetics, archaeology and anthropology-- the researchers are coming to the same conclusions or coming to conclusions supported by the other fields. The classification of superfamilies is matching the migrations of ancient humans.</p>\n\n<p>I think someone in the world of Economics (Keynes maybe?) said progress in academia is made when there are funerals. I guess that makes sense because no one wants to retract a research paper that they wrote a long while back to take into account a major shift in the understanding of the world.</p>\n", "Id":"696", "ParentId":"682", "CreationDate":"2011-10-04T17:38:36.017", "Score":"4", "PostTypeId":"2", "OwnerUserId":"20", "LastActivityDate":"2011-10-04T17:38:36.017", "CommentCount":"4"}