{"Body":"<p>@Joe has covered words for \"pineapple\", so here's some info on words for \"banana\".</p>\n\n<p>There is a fairly straightforward explanation for why Spanish has the word <em>plátano</em> instead of a variant of <em>banana</em>, compared to the other languages in the above list.</p>\n\n<p><em>Plátano</em> already existed in Spanish to refer to another sort of plant, namely the <a href=\"http://en.wikipedia.org/wiki/Platanus\" rel=\"nofollow\">'plane tree'</a>, or trees of the genus <em>Platanus</em>, whose name can be traced back via Latin through Greek to a Proto-Indo-European root *plat- \"to spread\". The name is thought to refer to either the largish leaves some of these trees have, or their broad, flat expanses of bark.\nVarious cognates also carry the meaning of 'broad', 'spreading', and so on - in English,  plants of the genus <em>Plantago</em>, commonly called <em><a href=\"http://en.wikipedia.org/wiki/Plantago\" rel=\"nofollow\">plantains</a></em>, are similarly named for their broad, round leaves, via a borrowing from French. <em>(Edit: to clarify, the plantains just mentioned are a small, herbaceous, bog-loving plant, completely unrelated to any sort of banana).</em></p>\n\n<p>So, once the Spanish-speaking world had access to bananas, <em>plátano</em> was usefully extended to refer to (some) banana plants; given that banana trees have quite enormous leaves, the name is quite appropriate.</p>\n\n<p>There is an alternative hypothesis that Spanish got <em>plátano</em> from the Carib word <em>platana</em> (from Arawakan <em>pratane</em>) and that this was altered to make it more similar to Spanish <em>plátano</em> 'plane tree', but there is not much evidence to support this, and either way <em>plátano</em> 'plane tree' is somewhat responsible. </p>\n\n<p>But, the list above is a bit disingenuous, because Spanish <strong>does</strong> have the word <em>banana</em>, and this is the word that Spanish initially borrowed from Wolof, a Niger-Congo language, to refer to the fruit. Depending on what sort of Spanish you speak, <em>banana</em> can refer to to smaller, sweeter fruits we are most familiar with, while <em>plátano</em> might refer to the larger, starchier, less sweet fruits that are generally used in cooking rather than eaten raw. In English, the latter are referred to as <em><a href=\"http://en.wikipedia.org/wiki/Plantain\" rel=\"nofollow\">plantains</a></em> or <em>plantain bananas</em> (probably on analogy with Spanish <em>Edit: because although English already had the word 'plantain', it wasn't used to refer to bananas</em>). Both sorts are of the genus <em>Musa</em>. But at least in Mexico, <em>plátano</em> refers to the sweet variety, and plantains are <em>plátano macho</em>.</p>\n\n<p>Most modern languages that use a variant of the word <em>banana</em> got the word via either Spanish or Portuguese, and those languages initially borrowed it from Wolof. So, to reiterate Joe's point, \"whichever name is used by the introducers gets adopted in many other languages\".</p>\n\n<p>But in fact, the history of 'words for banana' started long before the Spanish and Portuguese borrowed the modern word from Wolof, and if you look at languages across the world, the word <em>banana</em> hardly comes into play.</p>\n\n<p>A recent study by a team of geneticists, archeologists, agricultural scientists and linguists investigated the history of different banana varieties based on the evidence for human cultivation and dispersal of bananas. The evidence suggests that bananas likely originated in New Guinea, and the linguistic information associated with this is pretty interesting. Mark Donohue  put together a list of over 1,100 words for 'banana' in languages from Melanesia and South East Asia, the regions in which the banana was first dispersed. The paper can be accessed <a href=\"http://www.pnas.org/content/108/28/11311\" rel=\"nofollow\">here</a> (sorry, abstract only unless you have access), but the supplementary materials are available publicly, so <strong>if you want to see over 1,100 words for 'banana'</strong>, <a href=\"http://www.pnas.org/content/108/28/11311/suppl/DCSupplemental\" rel=\"nofollow\">go to this page and click the link for Table_S04</a>. </p>\n\n<p>Using comparative methods, the researchers reconstructed root forms for different words for 'banana', and found four major cognate sets with distinct, but overlapping, geographical distributions. The root forms were *muku, *punti, *qaRutay, and *baRat. <a href=\"http://www.pnas.org/content/suppl/2011/06/28/1102001108.DCSupplemental/sfig05.pdf\" rel=\"nofollow\">You can see some maps of the distribution of these variants here (pdf).</a> There were other minor groupings and a lot of 'miscellaneous' lexical items that had no clear group of cognates. <em>Banana</em> is labelled as such, and only shows up twice in this whole list (granted, the list doesn't include many African or continental European languages).</p>\n\n<p>In sum, while <em>plátano</em> is an oddity in the short list presented above, Spanish actually did use the word <em>banana</em> first, and some varieties of Spanish still do use it for sweet bananas, where <em>plátano</em> specifically refers to plantain bananas. Furthermore, crosslinguistically, <em>banana</em> is actually an oddity in itself.</p>\n", "Id":"701", "ParentId":"690", "LastEditorUserId":"153", "CreationDate":"2011-10-05T06:29:57.617", "OwnerUserId":"153", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-05T08:08:48.993", "LastEditedUser":{"UpVotes":"47", "WebsiteUrl":"", "DownVotes":"1", "Id":"153", "AccountId":"871764", "Views":"33", "Reputation":"1445", "CreationDate":"2011-09-18T03:14:58.320", "DisplayName":"Floating Tone", "LastAccessDate":"2012-05-27T05:07:04.410", "AboutMe":"<p>I'm a PhD candidate in linguistics, with diverse interests including phonetics, phonology, morphology, language documentation, historical linguistics and sociolinguistics. I am particularly interested in the languages of Africa, Papua New Guinea and Australia. I'm also very interested in methods of making linguistic knowledge and materials more accessible and available to linguists and non-linguists alike.</p>\n"}, "LastActivityDate":"2011-10-05T08:08:48.993", "Score":"10", "CommentCount":"8", "OwnerUser":{"UpVotes":"47", "WebsiteUrl":"", "DownVotes":"1", "Id":"153", "AccountId":"871764", "Views":"33", "Reputation":"1445", "CreationDate":"2011-09-18T03:14:58.320", "DisplayName":"Floating Tone", "LastAccessDate":"2012-05-27T05:07:04.410", "AboutMe":"<p>I'm a PhD candidate in linguistics, with diverse interests including phonetics, phonology, morphology, language documentation, historical linguistics and sociolinguistics. I am particularly interested in the languages of Africa, Papua New Guinea and Australia. I'm also very interested in methods of making linguistic knowledge and materials more accessible and available to linguists and non-linguists alike.</p>\n"}}