{"OwnerUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}, "comments":[], "Body":"<p>I think that Zhen Lin's historical explanation is essentially correct: in order for tone to arise in a non-tonal language, some other phonological contrast is reanalyzed as tone.  Tone languages can both lose tone and regain a complex syllable structure over time, but in general tone languages are likely to be closer to their \"starting point\".  (Another way to think of this is that tone is <strong>part</strong> of syllable/phonological structure.  Under the communicative requirements of human language, which seem to be fairly universal, individual languages can allocate their complexity to tone and other aspects of phonology in different ways.)</p>\n\n<p>As for the typological claims, it is simply not true that there are no/appreciably fewer agglutinating tonal languages.  The WALS (World Atlas of Linguistic Structures) allows you to cross-tabulate different linguistic features.  Here's <a href=\"http://wals.info/feature/combined/13A/20A\">tone and a measure of morphological isolationism</a>.  There are 8 languages with a \"complex tone system\" and \"concatenative [=agglutinating or synthetic] morphology\"; only 5 have complex tone and isolating morphology.  The tabulation of <a href=\"http://wals.info/feature/combined/13A/12A\">tone and syllable structure</a> illustrates the generalization that more tonality correlates with less syllable structure, but the intersection of \"complex tone\" and \"complex syllable structure\" is not empty.</p>\n", "Id":"704", "ParentId":"702", "CreationDate":"2011-10-05T07:45:59.857", "Score":"14", "PostTypeId":"2", "OwnerUserId":"46", "LastActivityDate":"2011-10-05T07:45:59.857", "CommentCount":"3"}