{"Body":"<p>I'm not aware of any claims about <em>universals</em> when it comes to intonation and emotion. There are many studies (production and perception) out there that have tried to isolate the acoustic correlates of different emotions in speech in a single language. An example of one such perceptual study is \"Verification of Acoustical Correlates of Emotional Speech using Formant-Synthesis\" (Burkhardt and Sendlmeier 2000) for German--the researchers controlled various parameters like mean pitch, pitch range, vowel precision, and phonation type in synthesized speech and asked listeners to categorize the stimuli into a finite set of predefined emotions. As you might expect there were no absolute correlations--just tendencies (for example, a lowered mean pitch and a narrow pitch range as well as breathy or creaky voice was frequently judged to signal boredom). </p>\n\n<p>I also read about one study from <em>Emotion</em>, \"The minor third communicates sadness in speech, mirroring its use in music.\" (Curtis and Bharucha 2010) that recorded actors saying lines with various emotional affects and claimed that the descending minor third was a reliable cue to sadness. You can read about their study on the <a href=\"http://blogs.scientificamerican.com/observations/2010/06/17/music-and-speech-share-a-code-for-c-2010-06-17/\" rel=\"nofollow\">Scientific American website</a> as well as hear audio samples from the study. I am dubious of their methodology and their interpretations of the results, however. Aside from their questionable methods of assessing the melodic intervals of the tokens, when I downloaded their samples and manipulated their pitch to expand and contract the pitch ranges of the utterances, my perception of the emotion being conveyed did not change.</p>\n", "Id":"705", "ParentId":"240", "LastEditorUserId":"385", "CreationDate":"2011-10-05T14:30:46.320", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-07T18:56:47.027", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2011-10-07T18:56:47.027", "Score":"4", "CommentCount":"3", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}