{"Body":"<p>When you write down the semantic representation of a sentence (lambda calculus) you see that the determiner \"consumes\" the noun. Hence, it is the semantic head of a noun phrase. <a href=\"http://plato.stanford.edu/entries/generalized-quantifiers/\" rel=\"nofollow\">SEOP</a> has a comprehensive overview of the phenomena that led to this, but <a href=\"http://en.wikipedia.org/wiki/Generalized_quantifier\" rel=\"nofollow\">Wikipedia</a> is not bad either.</p>\n\n<p>In syntax, the noun is considered the head of the noun phrase because it is the more \"contentful\" part, in the way people understand sentences.</p>\n\n<p>In HPSG, the CAT derivation is somewhat like the regular phrase-structure derivation, with heads having a correspondence to phrase-structure (PS) heads. (Though, AFAIK, there is no <em>need</em> for the concept of \"head\" in PS.*) The CONT derivation is somewhat like the derivation in Montague semantics.</p>\n\n<p>These are not two different types of parsing in HPSG (or anywhere else, AFAIK), but two (of the many) aspects of parsing with a rich grammar like HPSG.</p>\n\n<p>Benefits: I don't think you can compare one with the other for benefits... if you go through the references I gave for quantifiers, you'll see that the mathematics would become very cumbersome and ugly (or maybe even impossible... I don't know) if you try to make the semantic heads correspond with PS heads.</p>\n\n<p>* Though some parsing techniques find it useful to have heads of a PS marked.</p>\n", "Id":"706", "ParentId":"685", "LastEditorUserId":"126", "CreationDate":"2011-10-05T15:08:46.720", "OwnerUserId":"126", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-06T02:00:52.623", "LastEditedUser":{"UpVotes":"94", "DownVotes":"21", "Id":"126", "AccountId":"154977", "Views":"23", "Reputation":"1354", "CreationDate":"2011-09-14T15:07:55.557", "DisplayName":"prash", "LastAccessDate":"2014-01-18T18:45:53.780"}, "LastActivityDate":"2011-10-06T02:00:52.623", "Score":"2", "OwnerUser":{"UpVotes":"94", "DownVotes":"21", "Id":"126", "AccountId":"154977", "Views":"23", "Reputation":"1354", "CreationDate":"2011-09-14T15:07:55.557", "DisplayName":"prash", "LastAccessDate":"2014-01-18T18:45:53.780"}}