{"Body":"<p>For a few exceptions to the tone/syllable-structure correlation, look at the Chatino languages &mdash; members of the Zapotecan branch of the Otomanguean family.  Several of them have complicated tone systems <em>and</em> a syllable structure that allows some seriously gnarly consonant clusters.  </p>\n\n<p><a href=\"http://sites.google.com/site/lenguachatino/recursos-academicos/CruzE-MastersReport.pdf\">Here is a paper on San Juan Quiahije (SJQ) Chatino</a> that goes into some detail on the consonant clusters.  In this particular variety, the maximal syllable is NCCVN or NCCV7.  In other words, you can have a nasal and up to two other consonants in a cluster at the start of a syllable, and a nasal or a glottal stop at the end of the syllable.  So this allows syllables like <em>nskwan</em> or <em>ngya7</em>.  Also, both consonants in the initial cluster can have various sorts of secondary articulation. (For example, <em>jwjya7</em> is a single CCV7 syllable, with <em>jw</em> and <em>jy</em> corresponding to IPA /xʷ/ and /xʲ/.)  </p>\n\n<p>I'm afraid I can't find a good English paper on tones in SJQ Chatino that's available online.  If you can read Spanish, try <a href=\"http://scholar.google.com/scholar?start=30&amp;q=chatino+phonology&amp;hl=en&amp;as_sdt=0,44\">this one</a>, which goes into a good bit of detail.  Anyway, SJQ Chatino has ten distinct tones, and also some fairly complicated interactions between tones in adjacent syllables.</p>\n\n<p>(Disclaimer: The author of the linked paper is a classmate of mine.  I'm not an expert on Chatino, I just work down the hallway from a few people who are.)</p>\n\n<p><b>Edit</b>: Aaron says above that \"in order for tone to arise in a non-tonal language, some other phonological contrast is reanalyzed as tone,\" and that this tends to lead to phonological simplification.  This is probably true.  But in the Chatino languages, tone <em>didn't</em> arise out of some other feature.  As far as we can tell, they've always been tonal.  <a href=\"http://en.wikipedia.org/wiki/Oto-Manguean_languages#Phonemes_of_Proto-Oto-Manguean\">The proto-language of the entire family is reconstructed with tone,</a> and so there was no need for it to <em>arise</em> out of <em>anything.</em></p>\n\n<p>The current theory is that the Chatino languages are descended from a <em>polysyllabic</em> language with a complex tone system &mdash; but that some of them (like SJQ Chatino) lost all their unstressed vowels.  Those ended up as <em>monosyllabic</em> languages; they still have the same complex tone system they always had, but they also have those big gnarly consonant clusters where the intervening vowels have disappeared. </p>\n\n<p>This isn't meant as a criticism of Aaron's answer.  I just wanted to elaborate a bit on the historical difference between Chatino and (for example) Mandarin, since I think it sort of clarifies the typological picture.</p>\n", "Id":"708", "ParentId":"702", "LastEditorUserId":"306", "CreationDate":"2011-10-05T23:16:00.880", "OwnerUserId":"306", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-05T23:43:12.837", "LastEditedUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "LastActivityDate":"2011-10-05T23:43:12.837", "Score":"8", "CommentCount":"4", "OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}}