{"OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "comments":[], "Body":"<p>Would you count a language that has <em>lost</em> most of its (original) number system?</p>\n\n<p>The Mayan languages used to have words for numbers going very high up into the thousands.  Most have now lost these words due to encroachment from Spanish.  In K'iche', the Mayan language I study, speakers will use the original number words up to maybe three or four at most; above that, they'll switch to Spanish.  Some speakers now count <em>entirely</em> in Spanish.  </p>\n\n<p>Nevertheless, K'iche' has an indefinite article &mdash; which apparently developed before Spanish contact, but which has remained part of the language even as the Spanish number system has taken over.  (And since I see you're also interested in the connection between numbers and articles: yes, it's derived from the old K'iche' word for \"one.\"  The number one is <em>jun</em>, the indefinite singular article is <em>jun</em>, and the indefinite plural article is <em>jujun</em>.)</p>\n", "Id":"710", "ParentId":"640", "CreationDate":"2011-10-05T23:54:48.100", "Score":"5", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2011-10-05T23:54:48.100", "CommentCount":"3"}