{"OwnerUser":{"UpVotes":"15", "Location":"United States", "DownVotes":"0", "Id":"350", "AccountId":"920001", "Views":"12", "Reputation":"872", "CreationDate":"2011-09-29T14:58:17.387", "DisplayName":"Nathan", "LastAccessDate":"2013-11-11T17:54:15.000", "Age":"26"}, "comments":[], "Body":"<p>We have to be careful what theory we are discussing here.</p>\n\n<p>Strong Determinism is the classic Sapir-Worf hypothesis. If you don't have the words, you don't have the thoughts; or, the words force our thoughts. This has never been taken seriously in the linguistic community. For one thing, proponents of this formulation usually embarrass themselves when talking about a particular language. The classic story is the Eskimos have 300 words for snow, but that simply isn't true. While it is true they have a lot of words to differentiate snow, so does English: slush, ice-pack, snow, snow-banks, snow-flakes, snow-drifts... You may protest and say that \"snow drift\" isn't a word, but you end up shooting yourself in the foot with regards to a lot of the words you counted up for the Eskimos. I'll leave it to someone who is familiar with the Hopi language to address the assertion that they can't talk about time.</p>\n\n<p>You can weaken the hypothesis in a number of ways, and this is what people end up having to do. The problem becomes articulating how language shapes thought, and there are a lot of possibilities. Some people thought that speakers of gendered languages would be better at keeping track of gender, or speakers of languages which incorporated distance or social status or whatever into the verb would be better at tracking those things. That has turned out to be not the case. A recent twist on this is  asks speakers of gendered languages to describe objects in terms stereotypical of that objects grammatical gender. Look up Lera Boroditsky.</p>\n\n<p>Finally, I'd like to add that there is an intriguing alternative to the Sapir-Worf hypothesis. The general idea behind linguistic determinism is that we think in language. This idea has been around for a long time; Plato described thought as speaking to oneself. The thought goes, if you think in language, then the language can shape the thoughts. Kinda like the structural imperfections of marble playing a part in the sculpting of a statue. The  general problem with this is that there are tons of cognitive processes that don't involve \"thinking\" in the way we usually use that term. </p>\n\n<p>The alternative is that instead of using language to think, language users use language as a <em>tool to aid in thinking</em>, especially in communicative contexts. Look up Dan Slobin, who introduced this idea.</p>\n", "Id":"732", "ParentId":"714", "CreationDate":"2011-10-07T04:30:05.583", "Score":"5", "PostTypeId":"2", "OwnerUserId":"350", "LastActivityDate":"2011-10-07T04:30:05.583", "CommentCount":"1"}