{"Body":"<p>I would rephrase your question as, \"If CCVC is able to be articulated, why do we have CV languages like Japanese?\" Or, \"since CCVC is able to be articulated by humans, why don't we have languages which exclusively use CCVC syllables?\"</p>\n\n<p>I'll talk about the CC part: Because complex clusters are dispreferred.</p>\n\n<p>Some evidence on how the <em>capacity</em> for articulation isn't so relevant and that complex clusters are dispreferred:</p>\n\n<ol>\n<li><p>\"Not natural for Japanese speakers\" is partly a separate issue having to do with a perceptual bias. It's \"not natural for Japanese speakers\" because they didn't learn words with complex onsets. The perceptual consequence of what sounds can occur where in a language is quite powerful, as <a href=\"http://www.lscp.net/persons/dupoux/papers/Dupoux_KHPM_1999_Epenthetic_vowels_a_perceptual_illusion_JEPHPP.pdf\">Dupoux et al (1999)</a> demonstrate: Japanese speakers perceive there's a [u] in the middle of [ebzo] because they don't have consonant sequences like [bz] (more specifically, syllable-final non-[n] consonants like the [b]), while French speakers, whose languages do have it, don't perceive this illusory vowel. On the other hand, since French doesn't have a vowel length contrast while Japanese does, French speakers fared worse in distinguishing between [ebuzo] and [ebuuzo] than the Japanese speakers did.</p></li>\n<li><p>Timing the gestures for a sequence of sounds entails speech-motor control involving the brain, the vocal folds, the tongue, the jaw muscles, etc., which isn't trivial. Consonants require more gestures than vowels. With regards to clusters, note that infants produce simple syllables first (\"spaghetti\" -> \"pagetti\", \"please\" -> \"piz\"). </p></li>\n<li><p>The combination of consonants which form a cluster are restricted even in \"CCVC languages.\" \"tlank\" can't be a word of English.</p></li>\n<li><p>Regarding your historical question, of \"languages developing different complexity:\" there are widely attested changes which disprefer consonant clusters, once again despite the capability of humans to make that sound. Italian often uses geminates instead of clusters with different segments (octo -> otto). You mention English, but the reason why English has weird spellings like \"knife\" is that \"kn\" used to be pronounced as a cluster (<a href=\"http://en.wikipedia.org/wiki/English_consonant_cluster_reductions\">Wikipedia: English consonant cluster reductions</a>).</p></li>\n<li><p>Again to do with perception: In a stop consonant + vowel sequence like [pa] or [ta], there are cues to whether the consonant is a [p] or a [t] showing up in the vowel sound (this is called the formant transitions). Listeners rely on such cues. So if you have a sequence like [pta], it's harder for the listener to distinguish between it and [ta] because vowel cues aren't available for that initial consonant. (Wilson (2001) has argued that this explains the generalization that in V[stop][stop]V sequences, it is always the first consonant that is deleted.)</p></li>\n</ol>\n", "Id":"742", "ParentId":"736", "LastEditorUserId":"397", "CreationDate":"2011-10-07T21:29:12.567", "OwnerUserId":"397", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-07T23:11:16.907", "LastEditedUser":{"UpVotes":"50", "DownVotes":"86", "Id":"397", "AccountId":"959564", "Views":"7", "Reputation":"680", "CreationDate":"2011-10-07T14:54:31.260", "DisplayName":"Aerlinthe", "LastAccessDate":"2013-12-10T17:42:44.790"}, "LastActivityDate":"2011-10-07T23:11:16.907", "Score":"8", "OwnerUser":{"UpVotes":"50", "DownVotes":"86", "Id":"397", "AccountId":"959564", "Views":"7", "Reputation":"680", "CreationDate":"2011-10-07T14:54:31.260", "DisplayName":"Aerlinthe", "LastAccessDate":"2013-12-10T17:42:44.790"}}