{"Body":"<p>Re AllNoun: as this is a conlang, and an artificial 'language', I'd suggest that it can't be considered a true language until it has native speakers, and that if it did have native speakers they would expand the language to suit the full range of requirements of human beings, such that it would have at least two POS categories, one that includes 'verb'-type words and one with 'noun'-type words. (Schachter 1985). This is what happens when speakers turn a pidgin into a creole.</p>\n\n<p>Yes, some languages have a small, closed verb category. But in these languages the verbs are highly generic and combine with other elements (which may include coverbs, adjectives, nouns, other verbs, etc) to create verb complexes (or complex predicates) that have more specific meanings. In this way they are able to express everything that a human being needs to. (Schultze-Berndt 2000)</p>\n\n<p>I doubt there are any languages without nouns. The smallest number of POS categories that I have heard about in any language is two, a 'verbs' category and a 'nouns' category. But each of these categories will contain numerous words that can be used to fill the functions that in other languages will fall into different POS categories; ie, the full range of functions is there it's just that, morphosyntactically, they are compressed into two POS categories. Thus Australian languages are usually analysed as having no distinct category of adjective. Instead, words that have adjectival meanings will be members of the same category that includes nouns, in a category often called 'nominal' in grammars of Australian languages. (Goddard 1985)</p>\n\n<p>Finally, many languages will lack some part of speech that's present in some other languages, eg English doesn't have relators or coverbs. It's impossible to give a brief answer to how languages deal with this and in fact, this is what linguistic analysis is largely about, finding out how each language uses its particular set of grammatical and lexical elements to achieve the full range of functions that humans need. I've already described how languages with a small, closed verb class are able to express the full range of meanings required by speakers. Another example could be the question, how does English get along without politeness markers? It does so by using special vocabulary and morphosyntactic constructions, and I doubt many native speakers feel a lack. (Schachter 1985)</p>\n", "Id":"768", "ParentId":"280", "LastEditorUserId":"363", "CreationDate":"2011-10-11T12:31:24.247", "OwnerUserId":"363", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-11T23:02:08.960", "LastEditedUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}, "LastActivityDate":"2011-10-11T23:02:08.960", "Score":"2", "OwnerUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}}