{"Body":"<p>It seems that the answer lies in the <a href=\"http://www.world-news-research.com/languagewar.html\" rel=\"nofollow\">source</a> you cite in your own comment. Cuneiform at this stage was not purely logographic but rather a mixture of logographic signs and phonemic (or what the article refers to as \"phonetic\") signs, and the inventory of phonemic signs that existed was tailored to Sumerian, which had a very different morphology, phonology and phonetics from Akkadian. Note that the writer says that Sumerian \"lived on as an imposed constraint on the <strong>expression</strong> (emphasis mine) of Akkadian...\". By \"expression\" the author almost certainly is referring to the <em>written</em> expression of the language. </p>\n\n<p>Are you familiar with the <a href=\"http://en.wikipedia.org/wiki/Japanese_writing_system\" rel=\"nofollow\">Japanese writing system</a> at all? It's like if in a parallel universe you had grown up speaking German but no one ever taught you how to write it, but then someone handed you an instructional manual for Japanese writing--Kanji, hiragana, and katakana--and you had to try to adapt it for use as an orthography for German. For some words and morphemes you could use already-existing kanji and just re-establish their pronunciations. But how would you deal with the inflectional morphology that German has and Japanese lacks? You'd be forced to choose among letting it be implied, coming up with a kluge for expressing it using kana, or re-appropriating certain kanji to represent inflections. And if kanji didn't exist for certain words, how would you adapt kana to \"spell them out\"? There obviously isn't a one-to-one correspondence between phonemes in German and kana in Japanese, so you'd sometimes have to go without expressing certain contrasts that exist in German, like /l/ vs. /r/ (or, again, invent a novel way of marking these contrasts) and you'd also sometimes be forced to express certain phonemic sequences in a roundabout way--consonant clusters, for example. Of course none of this would hamper your ability to express yourself <em>orally</em> in German, though.</p>\n", "Id":"771", "ParentId":"769", "LastEditorUserId":"385", "CreationDate":"2011-10-11T19:07:02.900", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-12T01:25:19.127", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2011-10-12T01:25:19.127", "Score":"8", "CommentCount":"9", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}