{"comments":[], "Body":"<p>For affixes in particular, you can talk about how <em>productive</em> they are.  So for instance, <em>-er</em> is highly productive &mdash; you can add it to just about any verb &mdash; and <em>-ship</em> is much less productive.  </p>\n\n<p>Some affixes have become entirely <i>un</i>productive: for instance, we've got a few leftover plurals in <em>-en</em>, like <em>oxen</em> and <em>children,</em> but you can't coin new ones (except as a joke).</p>\n\n<p>With syntactic constructions, it turns out that most are pretty productive. (Though I guess you could argue that old frozen phrases &mdash; like \"hallowed be thy name\" or \"o'er the ramparts we watched\" &mdash; represent unproductive constructions.) The restrictions you do see on syntactic constructions tend to be mostly about semantics and not grammar.  For instance, you can <i>persuade a person</i> of something, but you can't <i>persuade a rock</i> of anything.  Still, the sentence \"I persuaded that rock to get out of my way\" is perfectly grammatical &mdash; it's just that if you take it literally, it doesn't make any sense.</p>\n", "Id":"779", "ParentId":"777", "CreationDate":"2011-10-12T04:27:19.187", "Score":"7", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2011-10-12T04:27:19.187", "OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}}