{"Body":"<p>Some distinctions that are important for conceptualization/communication are simply not marked in some languages. Your question seems to be: if a language provides no resources for definite marker, how does a speaker communicate that a given description is intended as <em>definite</em> as opposed to <em>indefinite</em>? Answer: discourse context steps in to help. For example, in English, the discourse function of an indefinite article is typically to signal that a new referent is being introduced. So, if I've already been talking about John, it would be extremely weird to refer back to him by saying <em>Then, a guy called Mary to invite her to the dance</em>, as it would seem now I am definitely <em>not</em> talking about John, rather talking about some new male individual. However, if John is salient in the discourse, it is perfectly natural to refer back to him using the definite, <em>Then, the guy called Mary to invite her to the dance</em>. In a language with no definite article/clitic/affix/word order difference, but yet with an indefinite article for example, at a minimum discourse demands would lead such speakers to only use the indefinite when introducing new discourse referents, and avoiding using it to refer to establish referents. In the absence, too, of the indefinite article, languages could resort to word order differences (e.g., apply focus and topicalization rules), or additional words like <em>same</em>, <em>different</em>, or use demonstratives and pronouns to indicate (non-)contrast of referents.</p>\n", "Id":"787", "ParentId":"739", "LastEditorUserId":"178", "CreationDate":"2011-10-13T01:48:14.090", "OwnerUserId":"178", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-13T09:55:10.840", "LastEditedUser":{"UpVotes":"56", "WebsiteUrl":"http://ling.umd.edu/~wellwood", "Location":"College Park, MD", "Id":"178", "DownVotes":"11", "AccountId":"922214", "Views":"88", "Reputation":"1112", "CreationDate":"2011-09-19T23:20:44.103", "DisplayName":"Alexis Wellwood", "LastAccessDate":"2013-08-12T15:15:17.400", "AboutMe":"<p>Other relevant links for me are the University of Maryland <a href=\"http://phling.umd.edu/\" rel=\"nofollow\">PHLING</a> and the <a href=\"http://languagescience.umd.edu/\" rel=\"nofollow\">Language Science community</a>.</p>\n"}, "LastActivityDate":"2011-10-13T09:55:10.840", "Score":"7", "CommentCount":"3", "OwnerUser":{"UpVotes":"56", "WebsiteUrl":"http://ling.umd.edu/~wellwood", "Location":"College Park, MD", "Id":"178", "DownVotes":"11", "AccountId":"922214", "Views":"88", "Reputation":"1112", "CreationDate":"2011-09-19T23:20:44.103", "DisplayName":"Alexis Wellwood", "LastAccessDate":"2013-08-12T15:15:17.400", "AboutMe":"<p>Other relevant links for me are the University of Maryland <a href=\"http://phling.umd.edu/\" rel=\"nofollow\">PHLING</a> and the <a href=\"http://languagescience.umd.edu/\" rel=\"nofollow\">Language Science community</a>.</p>\n"}}