{"OwnerUser":{"UpVotes":"15", "Location":"United States", "DownVotes":"0", "Id":"350", "AccountId":"920001", "Views":"12", "Reputation":"872", "CreationDate":"2011-09-29T14:58:17.387", "DisplayName":"Nathan", "LastAccessDate":"2013-11-11T17:54:15.000", "Age":"26"}, "comments":[], "Body":"<p>Your question is ambiguous, so I'll just cast my net wide.</p>\n\n<p>There is a lot of research into different aspects of language that don't necessarily involve speaking. Psycho- and neurolinguistics, both thriving subdisciplines, focus their efforts on understanding the psychological and neurological components of language production and processing. Morphology, phonology and syntax focus on the rules that govern the production of language, not necessarily the particular modality of production. A lot of language acquisition research, such as that focusing on how babies process pointing gestures or gazes, or on the strategies that children use to learn a language, has very little to do with spoken language.</p>\n\n<p>A lot of disciplines that <em>prima facia</em> deal with spoken language, such as phonetics or phonology, can and have been successfully adapted to sign languages. For example: research has shown that their are sign language analogues for place and manner of articulation, and that sign language has units of production that can be rightfully refereed to as phonemes. </p>\n\n<p>Written language is a reflection of spoken, so most of what we know about spoken language can be transfered to written. The converse is not true. Still, there is a great deal of research focusing on how written language is processed.</p>\n\n<p>Spoken language is a part of what makes us human. Every child will become fluent in their native language unless they suffer from massive cognitive or social deficits. Even mentally retarded children, or others with low IQ's, still achieve a great deal of fluency. If someone is deaf or mute, they will either acquire or invent a signed language. Acquiring literacy, on the other hand, is laborious process. Most languages do not have a written form, and even in those that do, not everyone achieves literacy. Spoken language is more widespread and universal, and therefore more interesting than the mostly cultural invention we call 'writing'.</p>\n\n<p>Finally, a lot of linguistics <em>has</em> to be done with spoken language. A lot of phonetics, for instance, is about sound production, transmission, and perception. Children learn spoken language far earlier than written language, so most interesting research on language acquisition is about spoken or signed language. As I pointed out above, most languages do not have a written form, so any linguistic research concerning them has to focus on their spoken forms.</p>\n", "Id":"789", "ParentId":"788", "CreationDate":"2011-10-13T05:02:16.603", "Score":"8", "PostTypeId":"2", "OwnerUserId":"350", "LastActivityDate":"2011-10-13T05:02:16.603", "CommentCount":"5"}