{"OwnerUser":{"UpVotes":"133", "WebsiteUrl":"http://lumenaris.com", "Id":"314", "AccountId":"906180", "CreationDate":"2011-09-27T02:55:28.507", "AboutMe":"<p>I play lots of games, develop a few.  Check out my publisher's page at <a href=\"http://lumenaris.com/games.html\" rel=\"nofollow\">lumenaris.com</a>.</p>\n\n<p>New games published in 2013:</p>\n\n<ul>\n<li><em><a href=\"http://lumenaris.com/goldenwilderness.html\" rel=\"nofollow\">The Golden Wilderness</a>:</em> A game of early California, from the Spanish explorers to the Gold Rush.</li>\n<li><em><a href=\"http://lumenaris.com/actionworks.html\" rel=\"nofollow\">Actionworks</a>:</em> A fast-paced, industrial-themed card game.</li>\n</ul>\n\n<p>Games published in 2012:</p>\n\n<ul>\n<li><em><a href=\"http://lumenaris.com/games_caravans.html\" rel=\"nofollow\">Caravans of Asia</a>:</em> Trading on the Silk Road in the days of Marco Polo.</li>\n<li><em><a href=\"http://boardgamegeek.com/boardgameexpansion/130895/caravans-of-asia-arabian-sails\" rel=\"nofollow\">Arabian Sails</a>:</em> An expansion for <em>Caravans</em>; sailing ships on the monsoon winds of the Indian Ocean.</li>\n</ul>\n", "Age":"33", "Location":"California", "DownVotes":"4", "Views":"17", "Reputation":"1012", "DisplayName":"Joe", "LastAccessDate":"2014-01-07T14:27:49.863"}, "comments":[], "Body":"<p>There are two parts to your question:</p>\n\n<ol>\n<li>Proving a newly-discovered language is in fact a language.</li>\n<li>Proving a newly-discovered language is in fact newly-discovered.</li>\n</ol>\n\n<p>Let's look at each of these in turn.</p>\n\n<h3>It's Actually a Language</h3>\n\n<p>Proving that what you've discovered is actually a <em>language</em> isn't something that comes up often.  Generally, when you've found that people somewhere are using some method of communicating, you can assume it's actually language.  If you're not sure whether this method you've found is a full language or not, see if it can communicate any arbitrary meaning.</p>\n\n<p>If what you've found isn't a full language, you'll discover that it can't communicate any arbitrary meaning, just those few meanings that it's already equipped for.</p>\n\n<p>For example, if you're dealing with the beginnings of a trade pigin, you might find that it only has words for concepts related to trade, and that there's no way to say something like \"My mother's foot is hurting.\".  Or if you're looking at a form of proto-writing, you might find that it only has a limited set of symbols that can't encode the whole spoken language of the community.</p>\n\n<p>But if what you're dealing with is a full language (in any medium), it will be able to communicate any concept.  Some concepts might have to be explained at length, but the language will have the tools to be able to communicate them.</p>\n\n<h3>It's Newly Discovered</h3>\n\n<p>Proving that a language is newly-discovered is essentially the same as proving that no one else has ever documented it.  All it takes is one example of someone else documenting it previously, and then you're not the discoverer.</p>\n\n<p>The easiest way to do this is to publish your findings on this new language, saying that you're unaware of any previous work on the subject.  If others deserve credit for documenting this language before you, I imagine they'll speak up.</p>\n\n<p>But there's no sure way to <em>prove</em> that no one has documented the language before.  There's no one worldwide repository of language documentation.  You could be writing on some language in the Himalayas, only to find many years later some forgotten Russian journal from the 1800s with documentation of the same language.</p>\n\n<p>The best you can say is that as far as you know, you're the first person to actually document this language.</p>\n", "Id":"819", "ParentId":"817", "CreationDate":"2011-10-15T19:27:32.910", "Score":"9", "PostTypeId":"2", "OwnerUserId":"314", "LastActivityDate":"2011-10-15T19:27:32.910", "CommentCount":"2"}