{"Body":"<p>I agree with @Nathan that you need to look at studies involving babies to find out at what age children can tell that a language they hear is not their native language. </p>\n\n<p>In particular, there are many interesting studies by Ann Cutler and others, and they have found good evidence that children are attuned to the distinctive intonation and stress patterns of their own language while still in the womb. Right from birth, babies will prefer to listen to those familiar patterns of their mother's language, rather than an unfamiliar language, which indicates that they can perceive the differences.</p>\n\n<p>The interesting thing with these findings, though, is that if the young infants hear a language which has virtually the same intonation/stress patterns as those found in their native language to-be, as Dutch has to English, their behaviour indicates that they perceive it as being the same language. It takes a few months for them to sort out that Dutch is a different language to English, presumably once they start to pick up finer details of the sound systems beyond intonation and stress. Here is a link to <a href=\"http://marcs.uws.edu.au/?q=people/professor-anne-cutler\">Anne Cutler's website</a> including many recent articles.</p>\n", "Id":"823", "ParentId":"820", "LastEditorUserId":"64", "CreationDate":"2011-10-16T04:55:20.680", "OwnerUserId":"153", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-11-03T12:42:24.383", "LastEditedUser":{"UpVotes":"126", "WebsiteUrl":"http://www.superlinguo.com", "Id":"64", "AccountId":"900445", "CreationDate":"2011-09-13T21:45:12.903", "AboutMe":"<p>I have a PhD in linguistics. My areas of interest include language documentation, Tibeto-Burman linguistics, gesture, language play, LOLspeak, evidentiality and making bad puns. I blog about language and linguistics at www.superlinguo.com</p>\n", "Age":"29", "Location":"Australia", "DownVotes":"6", "Views":"40", "Reputation":"2016", "DisplayName":"LaurenG", "LastAccessDate":"2013-10-26T00:28:12.653"}, "LastActivityDate":"2011-11-03T12:42:24.383", "Score":"12", "OwnerUser":{"UpVotes":"47", "WebsiteUrl":"", "DownVotes":"1", "Id":"153", "AccountId":"871764", "Views":"33", "Reputation":"1445", "CreationDate":"2011-09-18T03:14:58.320", "DisplayName":"Floating Tone", "LastAccessDate":"2012-05-27T05:07:04.410", "AboutMe":"<p>I'm a PhD candidate in linguistics, with diverse interests including phonetics, phonology, morphology, language documentation, historical linguistics and sociolinguistics. I am particularly interested in the languages of Africa, Papua New Guinea and Australia. I'm also very interested in methods of making linguistic knowledge and materials more accessible and available to linguists and non-linguists alike.</p>\n"}}