{"Body":"<p>Yes! What you are describing is often referred to as <strong>the <em>calling contour</em> or the <em>vocative chant</em></strong>, and it is <strong>very common, especially among European languages.</strong> Bob Ladd talks about it in his book, <em>Intonational Phonology</em> (first edition 1996, second edition 2008). The tune is characterized by a sequence of one or more syllables on a relatively high level pitch followed by one or more syllables on a somewhat lower medium level pitch. <strong>Ladd notes that the interval between the two notes is often, but not necessarily, three semitones, i.e. a minor third</strong> (p.117 in the first edition, p.136 in the second edition). Some other languages that have been noted to make use of this tune are (not an exhaustive list): English (North America and UK), French, and Hungarian. <strong>French is a language that is analyzed as having final stress; nevertheless, the tune goes down at the end, not up.</strong> Stress does play a role in some languages in determining when the note changes. In German and English, the higher pitch starts on the stressed syllable of the name (examples adapted from Ladd 2008):</p>\n\n<pre><code> H      M    L  H     M      L  H M\nJo-na-than!  E-li-za-beth!  Lou-i-ise!\n</code></pre>\n\n<p>But in French the high note is placed on the penultimate syllable, no matter what:</p>\n\n<pre><code> H  M      L     H  M     H  M\nMo-nique!  Anne-Ma-rie!  Lou-ise!\n</code></pre>\n\n<p>Here I am using Ls, Hs, and Ms to signify what phonologists think of as the phonologically important pitch events in these tunes (the symbols used in Ladd 2008 are couched within a more technical kind of notation used in autosegmental-metrical theory). As such, they should be thought of as residing in some level of phonological abstraction, and their acoustic realization may vary depending on the context. It is well established, for example, that the overall \"tonal space\" shifts downward over time during the course of an utterance, and so even if two syllables are specified for the same \"tone\" the later one will be realized as a slightly lower pitch*. In the above examples from English, some syllables are unmarked for tone, and the idea is that the tone level from the most recently specified syllable carries over (though the actual acoustic output may decline a bit in pitch). The approximate pitch level indicated by M above is very often about a minor third below that indicated by H.</p>\n\n<p>Indeed, the behavior of this contour (specifically, where the higher part of the tune and the later slightly lower part of the tune anchor themselves segmentally) in different languages has given us some insights into the typological differences among those languages when it comes to stress and intonation. If you Google Ladd's book, you can read some of his discussion on the calling contour via Google Books; just search the book for the term \"calling contour\".</p>\n\n<p>On a lighter note, if you listen to <a href=\"http://www.youtube.com/watch?v=vZNO-yhsfeI\" rel=\"nofollow\">\"Voicemail #4\"</a> from the Broadway musical RENT, you can hear the calling contour/vocative chant in action in English! Unfortunately the lyrics don't contain any words/phrases with antepenultimate (i.e. third-to-last) stress like the name <em>Jonathan</em>, but there are words/phrases with penultimate stress (like <em>Anna</em>) and those with final stress (like <em>Louise</em>), and you can hear that when the descending minor third happens indeed depends on the location of the lexical stress!</p>\n\n<p>*This also happens with lexical tones in tone languages. I have recordings of Cantonese speakers producing utterances composed solely of syllables with Tone 6 (the low level tone) on them, and the actual pitch gradually descends over the duration of the utterance in all cases.</p>\n\n<hr>\n\n<p><strong>UPDATE:</strong> I stumbled upon this great website, the <a href=\"http://prosodia.upf.edu/iari/index.html\" rel=\"nofollow\">Interactive Atlas of Romance Intonation</a>, that includes <a href=\"http://prosodia.upf.edu/iari/mapa.html\" rel=\"nofollow\">clickable maps</a> with audio and video data collected from an intonational survey. The vocative tune was included among the elicited utterance types. The survey made a distinction between \"vocative\" and \"insistent vocative\", and these category names were functional rather than descriptive. That is, the survey provided a scenario for the speaker to imagine while calling out a person's name. As a result, not all speakers chose to utilize the descending third tune that is the subject of this post. But many did!</p>\n", "Id":"829", "ParentId":"824", "LastEditorUserId":"385", "CreationDate":"2011-10-16T17:48:58.567", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-07-23T16:52:28.087", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2013-07-23T16:52:28.087", "Score":"23", "CommentCount":"15", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}