{"comments":[], "Body":"<p>There is <a href=\"http://www.ims.uni-stuttgart.de/projekte/verbmobil/Dialogs/vmcd/query.html\" rel=\"nofollow\">a web interface for the Verbmobil corpus</a> that may give a rough approximation of what you need.  Try the query <code>[lemma=\"kommen\"] []{0,10} auf</code> for forms of the word <em>aufkommen</em> in which the <em>auf</em> is separated by up to ten words.  </p>\n\n<p>This is of course suboptimal; you really want to find examples in which <em>kommen</em> and <em>auf</em> are in a <em>specific syntactic relationship</em>.  But to find examples like that, you'd need (a) a parsed corpus, and (b) a search language that can describe syntactic patterns and not just surface word order.  If you wanted to go down that rabbit hole, I'd suggest the <a href=\"http://www.ims.uni-stuttgart.de/projekte/TIGER/TIGERCorpus/\" rel=\"nofollow\">TIGER corpus</a>, but it's not web accessible and not really usable by people who don't understand a bit about linguistics.</p>\n\n<p>As Mitch points out in his comment, the separable prefixes are an unusually tough case.  So comparing counts for <em>kommen</em> and <em>aufkommen</em> will actually be much more difficult than doing other sorts of comparisons.  If you wanted to know something like \"Is <em>kommen</em> (with or without a prefix) more common than <em>gehen</em> (with or without a prefix),\" you could get a pretty good answer from Verbmobil.  You need to use the <a href=\"http://www.ims.uni-stuttgart.de/projekte/verbmobil/Dialogs/vmcd/aquery.html\" rel=\"nofollow\">advanced search</a> so you can set the number of returned matches above 100, but if you do that, <code>[lemma=\"kommen\"]</code> gives 1176 matches and <code>[lemma=\"gehen\"]</code> gives 4545.</p>\n\n<p>(Those counts also highlight another disadvantage of the Verbmobil corpus: it's <i>much smaller</i> than Google's.  This is generally true in corpus linguistics: it's easy to get enormous corpora of raw text, but corpora with any sort of grammatical information attached are really labor-intensive and tend to be much smaller.)</p>\n", "Id":"837", "ParentId":"831", "CreationDate":"2011-10-17T18:49:55.197", "Score":"4", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2011-10-17T18:49:55.197", "OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}}