{"OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"432", "AccountId":"980159", "Views":"0", "Reputation":"41", "CreationDate":"2011-10-17T22:33:36.657", "DisplayName":"user432", "LastAccessDate":"2011-10-17T22:48:45.363"}, "comments":[], "Body":"<p>To say that it takes longer for a healthy child to acquire naturally one language over another would implicate many more things than just sheer \"complexity\" of a particular language.  </p>\n\n<p>Let us make the assumption that for all natural languages, the expression rate of information is roughly equal; that is to say no human language exceeds another in how fast and efficiently information may be communicated via the language.  If that were not the case, then speakers of languages with a much higher rate of information output (this is keeping in mind the economy needing in both coding and decoding a spoken utterance carrying some kind of meaning) would have an inherent advantage over language speakers with a lower output.  All languages then would strive for the same strategies of communicating.  But, as we see by looking at over the 5,000 uniqe languages of the world, that is not the case at all!  There exist many many strategies to communicate over roughly the same meaning, each one with their own benefits and strengths which in the end should equal out to the same rate of information flow for every language.  </p>\n\n<p>So, if one accepts that language speakers communicate at the same rate regardless of which language they may be using, then why should one language take longer to gain fluency in than another?  As said previously, different areas of language may be acquired sooner than others, but any difference should be minimal.  The linguistic idea behind this is that all languages are equal and equally complex.  We are only biased by our own native toungue(s) and the languages which we have learned as L2s, so yes indeed one might think a child would take longer to acquire say Latin than English but it is more of a subjective fallacy.  </p>\n\n<p>It does seem to be true however that there has been a general trend in language to \"simplify\" itself by removing case inflections, verb-subject agreements, etc., but this may just a  subpart of the cycle of language change itself.  Nonetheless, that would be a related topic to research which might shed light.  </p>\n", "Id":"838", "ParentId":"778", "CreationDate":"2011-10-17T22:52:02.267", "Score":"4", "PostTypeId":"2", "OwnerUserId":"432", "LastActivityDate":"2011-10-17T22:52:02.267", "CommentCount":"1"}