{"Body":"<p>The Oxford Concise Dictionary of Linguistics defines morphology as 'The study of the grammatical structures of words and the categories realised by them', and syntax as 'The study of grammatical relations between words and other units within the sentence'.</p>\n\n<p>As you point out in your question these (pretty standard) definitions depend on the notion 'word' to delimit the domains of each subject. The notion of 'word' is problematic as there's no good definition that applies across all languages. It seems that it's best (or easiest) to define 'word' on a language by language basis, although even then there are problems as different kinds of 'word' can often be distinguished depending on the sets of criteria used: often there is a 'prosodic word' (defined on phonological bases) which differs from the 'grammatical word' (defined in terms of morphosyntax).</p>\n\n<p>If 'word' can be precisely defined in a given language then the domains of morphology and syntax can be fairly clearly distinguished, but if not then there is not a clear boundary.</p>\n\n<p>So cross-linguistically the notion of 'word' is fuzzy, as are the terms 'morphology' and 'syntax'. But for most languages, and in most cases, it's still pretty clear what's meant by these terms; and of course there's the term 'morphosyntax' for boundary cases. So while these two terms are not precise they are still useful as a general way of referring to certain domains within a language.</p>\n", "Id":"847", "ParentId":"836", "LastEditorUserId":"51", "CreationDate":"2011-10-19T04:16:49.457", "OwnerUserId":"363", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-19T04:59:57.213", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "LastActivityDate":"2011-10-19T04:59:57.213", "Score":"11", "OwnerUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}}