{"Body":"<p>I'd like to add a few of the underlying reasons why the Greek half of the Empire never took to Latin as much as the western half.</p>\n\n<p>During Antiquity and the early Middle Ages, the population and the economic power of the eastern half of the Mediterranean was greater than that of the western half. Its culture had a longer history, and Greek literature and philosophy were a revered cornerstone of the Roman Empire. That is why the Greek world (the elites in most eastern cities had been using Greek for centuries) was not as open to adopting Latin. When the court moved to Constantinople in the 4th century AD, Latin was used by the government for a century or two, but even that was not enough.</p>\n\n<p>In the west, however, the Romans had encountered many Celtic cultures, which did not have a tradition of literature and philosophy as ancient and respectable as that of the Greeks. The Romans were seen as bringers of culture in great parts of Gaul and Spain. Moreover, several different languages were spoken in the cities: Celtic languages/dialects, Greek, and probably Punic in the various Carthaginian cities.</p>\n\n<p>In addition, before the Romans came, urban life in the west was not nearly as developed as in the east; except perhaps in the south of Italy and the south of Gaul—but that was surpassed by the cities of Asia Minor or Greece or Egypt or Mesopotamia. Consequently, the comparative economic power of Rome was far stronger in the west than in the east. By the time the German tribes arrived, from the 4th century AD onwards, Gaul and Spain had become fairly Romanized. The influx of Germanic people was not enough to disturb this in the more urbanized regions. Nevertheless, it is said that French contains a great many elements from both the Celtic substrate and the Germanic superstrate languages. I don't know much about Spanish, but there is probably some influence there too from substrate and superstrate languages, notably Arabic, which was spoken in most of Spain for six centuries (roughly between the 8th and the 15th century AD).</p>\n\n<p>In Italy and Sicily, Roman influence was strongest, because they were closest to Rome, and because they comprised the first provinces the Romans conquered, in the 3rd century BC. Etruria was conquered centuries before that, so that little is left of Etruscan that we know of, except a few loan words like <em>persona</em>, I believe. In addition, Sicily was divided between Carthage and Greece, so that it was probably not uniformly Greek.</p>\n\n<p>In southern Italy and eastern Sicily, there were many very large and powerful Greek cities—notably Syracuse on Sicily—together called <em>Magna Graecia</em>, \"Great Greece\". Syracuse had about 300,000 inhabitants in its days of glory, rivalling even with Athens. This may have been enough for large parts of (former) Magna Graecia to withstand cultural pressure from nearby Rome: they probably never fully adopted Latin in the Roman era. After Justinian had reconquered most of Italy in the 6th century AD, the south remained under Greek Byzantine rule for several centuries more. In fact, about 30,000 speakers of Griko still exist in southern Italy today (Wikipedia).</p>\n", "Id":"856", "ParentId":"734", "LastEditorUserId":"82", "CreationDate":"2011-10-20T05:22:37.100", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2013-10-09T20:11:43.533", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2013-10-09T20:11:43.533", "Score":"19", "CommentCount":"5", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}