{"OwnerUser":{"UpVotes":"5", "WebsiteUrl":"http://ohhai.mn", "Id":"438", "AccountId":"985599", "CreationDate":"2011-10-19T23:00:39.300", "AboutMe":"<p>I am a 2nd year PhD student at the University of Maryland, studying Linguistics. I work in (morpho)syntax, and dabble in semantics and psycholinguistics. My research interests are in the structure and interpretation of the noun phrase from a crosslinguistic perspective, the structure of Bengali and Indo-Aryan, the representation of argument and event structure, and constraints on variation in grammar and parsing.</p>\n\n<p>Outside of Linguistics I'm interested in religion and atheism, issues related to social justice (particularly for religious and ethnic minorities and people with disabilities), new(-ish) media (internet culture, comic books, video games, various electronics), and various aspects of nerd culture. I have a cat.</p>\n", "Age":"27", "Location":"Adelphi, MD", "DownVotes":"0", "Views":"11", "Reputation":"509", "DisplayName":"dustinalfonso", "LastAccessDate":"2013-06-10T14:38:09.880"}, "comments":[], "Body":"<p>Let me fail to answer your question by asking another question -- what do we GAIN by drawing the distinction? By \"ironing out\" the distinctions, we can avoid having to postulate quite different grammatical architectures for polysynthetic vs. analytic languages, and we can capture the fact that there are generalizations across these languages. If we have distinct notions of morphology and syntax, the fact that subjects and objects agree with the verb in certain ways regardless of whether there's a word boundary between them or not is completely accidental. Put differently, why should we have phonological atoms be the same as syntactic/semantic atoms at the cost of generality across typologically distinct languages? Remember, although it gets debated a lot in various circles in Linguistics, the standard analyses of verbal morphology in English has pretty much always been syntactic at its core in the Chomskyan generative enterprise since LSLT!</p>\n", "Id":"860", "ParentId":"836", "CreationDate":"2011-10-20T14:39:15.530", "Score":"6", "PostTypeId":"2", "OwnerUserId":"438", "LastActivityDate":"2011-10-20T14:39:15.530", "CommentCount":"1"}