{"Body":"<p>Yes, it is possible to analyse Maori grammar without finding a straightforward contrast between 'noun' and 'verb', at least at the highest level of categorisation. Many Maori words may occur in a variety of syntactic environments, somewhat like English zero-derivation (eg, 'fish' can be noun or verb-or perhaps there's two words 'fish', one verb and one noun, but they have identical form?) but much more pervasive. As a result, there have been serious analyses that don't employ the usual noun-verb categtorisation. Bruce Biggs (1996) analysed Maori as having two major categories, 'bases' and 'particles', with five subcategories of 'base'. According to Biggs, Particles are words that occur on the peripheries of phrases and perform functions such as case marking, TAM, directionality, deixis, etc. Bases are those words that can occur as phrasal head and provide the lexical content. He divides 'base' into these five subcategories:</p>\n\n<p>Noun: can take definite article but can't occur as head of verb phrase.\nUniversal: a word that may be passivised.\nStative: a base that can be head of a verb phrase, but not passivised.\nLocative: a base that can be directly preceded by the locative preposition.\nPersonal: a base that takes the personal article.</p>\n\n<p>So while 'nouns' and 'verbs' are grouped together at the highest level of categorisation, they are distinguished as subcategories (with verbs broken into two subcategories).</p>\n\n<p>A more recent attempt to classify Maori word classes is that of Winifred Bauer, in <em>The Reed Reference Grammar of Maori</em>. She takes a very different approach to Biggs, although starting from the same issue that 'Maori, like other Polynesian languages, uses the same form of a word in many different syntactic environments' (p. 65). Her analysis identifies classes of noun and verb (along with others) but she argues that morphosyntactic distributional criteria are not enough to identify all and only the members of each category and that the way forms contribute to the organisation of syntactic structure in the clause is also relevant.</p>\n", "Id":"862", "ParentId":"536", "LastEditorUserId":"363", "CreationDate":"2011-10-20T23:45:15.367", "OwnerUserId":"363", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-21T02:20:31.407", "LastEditedUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}, "LastActivityDate":"2011-10-21T02:20:31.407", "Score":"5", "CommentCount":"3", "OwnerUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}}