{"OwnerUser":{"UpVotes":"47", "WebsiteUrl":"", "DownVotes":"1", "Id":"153", "AccountId":"871764", "Views":"33", "Reputation":"1445", "CreationDate":"2011-09-18T03:14:58.320", "DisplayName":"Floating Tone", "LastAccessDate":"2012-05-27T05:07:04.410", "AboutMe":"<p>I'm a PhD candidate in linguistics, with diverse interests including phonetics, phonology, morphology, language documentation, historical linguistics and sociolinguistics. I am particularly interested in the languages of Africa, Papua New Guinea and Australia. I'm also very interested in methods of making linguistic knowledge and materials more accessible and available to linguists and non-linguists alike.</p>\n"}, "comments":[], "Body":"<p>No, there is no terminology for the level of closeness a 'phonetic expression' takes to its 'meaning', quite simply because this is not something that is researched or discussed in linguistic circles, as there is no real reason to engage in this sort of enquiry.\nHere are some reasons why:</p>\n\n<p>1) As addressed in the comments, and as widely believed throughout linguistics, <strong>most words are arbitrary with regards to their meaning</strong>, with no real connection between the types and combinations of sounds in the word to the referent.</p>\n\n<p>2) When onomatopoeia does occur (and it is rare, in that most languages have a tiny number of onomatopoeic words compared to arbitrary words), it is essentially formalised mimicry. As has been pointed out, you can't get very far comparing human vocalisations to non-human sounds, whether they are sounds of animal calls, falling rocks, rushing water, or whatever. All of these real-world sounds will be produced by very different means, and humans can, at best, come up with an approximation of them that works with the constraints of the human vocal tract. More importantly, <strong>an onomatopoeic word can't just try to imitate a referent sound as precisely as possible - it also has to abide by the phoneme inventory, phonotactics and phonological processes specific to the language, at least to a certain extent</strong>. This is the main reason why onomatopoeic sounds vary cross-linguistically, plus the fact that different speakers may have different perceptions of the same referent sound, and may therefore be mimicking different aspects of it.</p>\n\n<p>Furthermore, an onomatopoeic word is, by virtue of being formalised, a word like any other, and <strong>subject to the same processes of language change</strong>, in particular sound change. This will also account for a lot of variation in onomatopoeic words for the same referent, and something which may have originally been a close approximation of a referent sound is likely to become further and further removed from it.</p>\n\n<p>3) There is an active area of research into <strong>sound symbolism</strong>, but the findings are in general tenuous, and are certainly not based on direct correspondences between a word and a particular sound or thing it references. Rather, <strong>research on sound symbolism investigates the more subtle connections between certain types of sounds and certain types of very broad, non-concrete meanings</strong>. E.g. sonorants as opposed to obstruents, or voiced sounds as opposed to voiceless sounds, or back vowels as opposed to high front vowels, and the connotations they seem to have of qualities such as 'spikiness' or 'roundness', or 'sweetness' or 'sourness', or 'tiny-ness' or 'big-ness', and so on. <a href=\"http://www.newscientist.com/article/mg21128211.600-kiki-or-bouba-in-search-of-languages-missing-link.html?full=true\" rel=\"nofollow\">There is an accessible overview of such research in this New Scientist article.</a> Phonestheme research falls under this category, too.</p>\n\n<p>Sound symbolism research has found some very interesting patterns based on human interpretations of nonsense words (and this has produced a wealth of knowledge for advertisers coming up with new brand names and slogans), but this is not so straightforward as an easily observable connection between the sound of the word and the referent, and of course there is still no terminology to describe the degree of similarity between the two, because <strong>the referent doesn't generally <em>have</em> a sound in many examples of sound symbolism</strong>. (What is the sound of 'sour'?)</p>\n", "Id":"863", "ParentId":"839", "CreationDate":"2011-10-21T11:56:09.790", "Score":"5", "PostTypeId":"2", "OwnerUserId":"153", "LastActivityDate":"2011-10-21T11:56:09.790", "CommentCount":"1"}