{"OwnerDisplayName":"user325", "LastEditDate":"2011-10-23T17:49:00.520", "Body":"<p><strong>Link between clusive pronouns and first person singular</strong></p>\n\n<p>The Wikipedia article for clusivity does include a somewhat incomplete table of the inclusive/exclusive pronouns in various languages, including a column listing what form is closest to / related to the first person singular. As far as I can tell, the data seems fairly mixed, and there are no individual citations for these forms.</p>\n\n<p>For a more theoretical perspective, which might shed light the relationship between clusive pronouns and other pronouns, the one JSTOR article that I could find which might be relevant was:</p>\n\n<blockquote>\n  <p>On Markedness Asymmetries in Person and Number\n  Martha McGinnis\n  <em>Language</em> Vol. 81, No. 3 (Sep., 2005), pp. 699-718\n  Published by: Linguistic Society of America\n  Article Stable URL: <a href=\"http://www.jstor.org/stable/4489970\" rel=\"nofollow\">http://www.jstor.org/stable/4489970</a></p>\n</blockquote>\n\n<p>I perused this article. It discusses a revision of a feature representation of pronouns proposed by Harley and Ritter, and some markedness asymmetries. I.e. if dual number is represented as [+group] and [+minimum], or some sort of combination of the singular and plural, why do languages with no distinct dual category always conflate the dual with the plural, and never the singular? Similarly, in languages without an inclusive category, the inclusive is always conflated with the first person, not the second. </p>\n\n<p>I am not sure if this will be of any value to you; it does not answer your empirical questions directly, but does discuss cross linguistic evidence.</p>\n\n<p><strong>Development of Clusive Pronouns</strong></p>\n\n<p>Another paper by Osada Toshiki on historical development of clusive pronouns in South Asian languages can be found at: <a href=\"http://www.sealang.net/archives/mks/pdf/34:79-96.pdf\" rel=\"nofollow\">http://www.sealang.net/archives/mks/pdf/34:79-96.pdf</a>. It discusses several different possibilities for how languages could develop this distinction, including areal diffusion and internal development. Areal diffusion seems to be far more common.</p>\n\n<p>However there are plausibly cases for internal developments of clusive pronouns. For example, Japanese has a special exclusive pronoun <em>temae-domo</em> (<em>watashi-tachi</em> or <em>watakushi-tachi</em> being the general first person plural). This is analyzed as <em>temae</em> 'I' (further decomposed as <em>te</em> 'hand' and <em>mae</em> 'front') and <em>domo</em> (plural suffix). It's only used by sales persons, presumably motivated by the semantic need to differentiate a group including the sales people and customers and a group only of sales people. The article rejects an analysis of the feature being introduced by contact with Ainu because that would not explain its limited use (only by sales people). Also <em>temae</em> is not attested before the 16th century, too late for Ainu influence.</p>\n\n<p>Another case of internal development is possibly attested in Indo-Aryan languages, in which a reflexive pronoun became a second singular honorific pronoun which in turn became a first person inclusive pronoun.  </p>\n\n<p>Best of luck.</p>\n", "Id":"873", "ParentId":"729", "comments":[], "CreationDate":"2011-10-22T22:59:14.533", "Score":"2", "PostTypeId":"2", "LastEditorDisplayName":"user325", "LastActivityDate":"2011-10-23T17:49:00.520", "CommentCount":"2"}