{"Body":"<p>A native speaker may or may not be able to understand you; it depends on the phonemes, the language, the accent, the skill of the native speaker, and more. A few things to consider:</p>\n\n<ol>\n<li><p>One should keep in mind that phonemes which sound very similar to a foreigner may sound very different to native speakers. For example, I once pronounced Navarra as Navara in Spanish, and my Spanish friend had no idea at all what I was talking about. After my third try (it was admittedly in a noisy bar), he said, \"ohh, you mean <em>Navarra!</em> Then why didn't you say so?\" To me, r and rr sound like the same phoneme—but certainly not to Spaniards.</p></li>\n<li><p>It depends on how many relevant minimal pairs there are in the target language. If there are many words, or a few very frequent words, in which only [e] and [ɛ] are different, it will be more difficult to understand for the native speaker if one is used for the other.</p></li>\n<li><p>It also depends on whether the native speaker is aware of the fact that  the foreigner is apt to confuse these two phonemes. For example, since the Romance accents in English are fairly well known, an Englishman will not be misled as easily if a Frenchman keeps confusing <em>this</em> (/ðɪs/) and <em>these</em> (unaccented before consonant: something like /ðis/). And there are probably more factors to consider.</p></li>\n</ol>\n", "Id":"883", "ParentId":"882", "LastEditorUserId":"82", "CreationDate":"2011-10-24T07:23:49.473", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-05-22T02:15:11.393", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2012-05-22T02:15:11.393", "Score":"10", "CommentCount":"4", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}