{"Body":"<p>To decide if a language is related to another language requires showing that they descend from a common ancestor. To show that Lusitanian is a Celtic language would require demonstrating that it is descended from <a href=\"http://en.wikipedia.org/wiki/Proto-Celtic\">Proto-Celtic</a>, the postulated ancestor of all known Celtic languages.</p>\n\n<p>The kind of evidence usually used to support a claim of relatedness is based on the <a href=\"http://en.wikipedia.org/wiki/Comparative_method\">comparative</a> method. The comparative method involves comparing wordlists to determine regular correspondences; these are then the basis for a hypothesis as to the sequence of regular sound changes that shows how the newer language descended from the older. Another method commonly used is <a href=\"http://en.wikipedia.org/wiki/Internal_reconstruction\">internal reconstruction</a>, which uses only internal evidence from the language to hypothesise about its history, but this method is more limited than the comparative.</p>\n\n<p>To determine the place of Lusitanian within the IE tree would involve looking for shared innovations (these are what define subgroups) to work out what languages fall into the same subgroup. It is necessary to be careful that what appear to be shared innovations are not actually just shared retentions (distantly related languages can appear to belong in the same subgroup because they both have preserved some ancient feature that other descendants have lost). Shared innovations can be in any part of the grammar: phonology, morphology, syntax.</p>\n\n<p>To do this with Lusitanian it would necessary to collate everything available and compare it to the innovations diagnostic of the various IE subgroups to determine where it fits. If the Lusitanian data is too scanty or doesn't happen to contain the necessary evidence then it may not be possible to subgroup it.</p>\n\n<p>According to the WP article, Lusitanian was classified as Celtic on the basis of personal, deity and place names. This is indicative but not proof. The proto-IE initial *p-, could be an innovation, while loss of [w] before vowels is not uncommon, so the evidence is pretty weak either way. Given the amount of data available it seems unlikely there could be anything more than educated guesses.</p>\n\n<p>Addition: A good book for a fairly detailed but accessible introduction to historical linguistics is this one by <a href=\"http://books.google.com/books/about/An_Introduction_to_Historical_Linguistic.html?id=_N8v-s6fyt0C\">Terry Crowley</a>.</p>\n\n<p>ADDITION: Proto-Celtic seems to have been an early branching from proto-IE as it doesn't show some of the innovations found in later branches. One of these innovations is the change *k -> s before a front vowel, which gave rise to <em>*satem</em> 'hundred' where other groups such as Germanic, Italic and Celtic (which all seem to have split off early) retain <em>*centum</em>. (see Anthony, David. 2007. The Horse, the wheel, and language: how Bronze-Age riders from the Eurasian steppes shaped the modern world. Princeton University Press.)</p>\n\n<p><a href=\"http://en.wikipedia.org/wiki/Proto-Celtic_language\">WP</a> lists some postulated shared phonological changes from proto-IE to proto-Celtic, such as: palatovelars merging with plain velars, loss of aspiration as a contrastive feature. There are various other phonological changes involving the proto-IE laryngeals and vowel system. One interesting change is that velar consonants in proto-Celtic weakened to a fricative before *s, so *rig 'king' + *s 'nom. sg' > *rixs.</p>\n\n<p>The usual diagnostic for membership of the Celtic branch is loss of proto-IE prevocalic /p/ (via *p > *ɸ > *h > ø). <a href=\"http://linguistics.berkeley.edu/~garrett/BLS1999.pdf\">Garrett</a> revisits the usual classification scheme and suggests that this is not a satisfactory diagnostic.</p>\n\n<p>If a Lusitanian inscription were found to show one or more of these features it would be evidence of membership of the Celtic branch, but to make a definite classification it's necessary that several features occur to rule out coincidence. The fact that the inscriptions show the presence of prevocalic *p may be evidence that it is not a Celtic language.</p>\n", "Id":"890", "ParentId":"889", "LastEditorUserId":"363", "CreationDate":"2011-10-26T03:06:27.917", "OwnerUserId":"363", "PostTypeId":"2", "comments":[], "LastEditDate":"2012-03-24T06:53:07.767", "LastEditedUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}, "LastActivityDate":"2012-03-24T06:53:07.767", "Score":"12", "CommentCount":"4", "OwnerUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}}