{"Body":"<p>Linguistics is all about patterns.</p>\n\n<p>An ergative pattern is one that treats subjects of transitive verbs differently than subjects of intransitives and objects of transitives, the latter of which pattern together. In the example below, assuming subjects come first, the pattern is ergative because the subject of the transitive verb has a different form than the other two argument positions. In this situation, people tend to call the subject of transitive verb the \"ergative\" argument.</p>\n\n<p>A TRANS B</p>\n\n<p>B INTRANS </p>\n\n<p>While the relevant pattern is usually case-marking or agreement, any pattern that treats subjects of transitive verbs differently than objects of transitive and subjects of intransitives could be called an ergative pattern. Langauges are called ergative as they exhibit more and more ergative patterns, though case/agreement are the canonical patterns people care about here.</p>\n\n<p>In contrast, accusative patterns treat objects of transitive verbs differently than subjects of transitive verbs and subjects of intransitive verbs, like below.</p>\n\n<p>A TRANS B</p>\n\n<p>A INTRANS</p>\n\n<p>What is unergative and unaccusative then? Well, mostly it's bad terminology. Notice that when we talk about ergative and accusative patterns, we're talking about a contrast between transitive and intransitive verbs. When we talk about unaccusative and unergative patterns, we're talking about patterns that treat subjects of one class of intransitive predicates differently than the subjects of another class of intransitives predicates. The pattern is like below:</p>\n\n<p>A INTRANS</p>\n\n<p>B INTRANS</p>\n\n<p>For example, some languages use special auxiliary verbs with the subjects of one class of intransitives and a different set of auxiliary verbs with another. Usually when people dig deeper they find that the difference hinges on whether the subject of the relevant intransitive is canonically more \"agentive\" or more like a \"patient\". This is a very complex question in itself, but the important point is that subjects of transitive verbs tend to be more agentive, so folks have decided to call patterns that treat \"agentive\" intransitive subjects special \"unergative\" because ergative patterns treat subjects of transitive verbs special. A similar line of reasoning gives the source of the term unaccusative.</p>\n\n<p>Getting to your question, it is possible for languages to exhibit mixes of these patterns. Things get hairy here, but basically, we reserve special terminology for when a language's case-marking/agreement system exhibits multiple patterns. For example, if a language sometimes has an ergative case marking system and sometimes an accusative case marking system, then it is called split-ergative. A fourth type of case system is found in languages that ignore the accusative/ergative opposition and mark the case of intransitives along a unergative/unaccusative line (this is a gross simplification). This pattern is often called a Split-S. Back to your question, though, it very often the case that languages exhibit different mixes of these patterns in different domains, in which case, there is usually not a name for it and people just say things like: Phenomenon X targets unergatives/unaccusatives, in which case they mean: Phenomenon X treats different intransitive verbs differently, in particular, it treats intransitive subjects that seem more like transitive subjects/objects in a special way.</p>\n", "Id":"894", "ParentId":"872", "LastEditorUserId":"390", "CreationDate":"2011-10-28T03:28:01.740", "OwnerUserId":"390", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-28T22:42:40.853", "LastEditedUser":{"UpVotes":"0", "WebsiteUrl":"http://rhenderson.org", "DownVotes":"0", "Id":"390", "AccountId":"174943", "Views":"6", "Reputation":"361", "CreationDate":"2011-10-06T12:43:57.560", "DisplayName":"rmh", "LastAccessDate":"2013-01-08T16:29:04.403", "AboutMe":""}, "LastActivityDate":"2011-10-28T22:42:40.853", "Score":"6", "CommentCount":"4", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://rhenderson.org", "DownVotes":"0", "Id":"390", "AccountId":"174943", "Views":"6", "Reputation":"361", "CreationDate":"2011-10-06T12:43:57.560", "DisplayName":"rmh", "LastAccessDate":"2013-01-08T16:29:04.403", "AboutMe":""}}