{"Body":"<p>Yes.</p>\n\n<p>McWhorter's quote isn't inconsistent with the possibility that alternative explanations have been advanced by historical linguists regarding do-support. The fact that the Celtic hypothesis is \"actively dismissed\" indicates that linguists have most definitely \"seen this\" <em>possible</em> \"causal relation\" and have argued against it.</p>\n\n<p>Going by your question title, I think you're misinterpreting McWhorter's claim when you say that scholars have \"failed to explain why certain features have appeared in the language.\" McWhorter is responding to the dismissal of a particular explanation that he favors, not to the general absence of explanation in historical linguistics. I haven't read his book, but I've looked at his article (<a href=\"http://iserp-6.webservices.lamptest.columbia.edu/files/iserp/mcwhorter_0.pdf\" rel=\"nofollow\">McWhorter 2009</a>) and it's clear that there's been many explanations for do-support, but he happens to have objections to them -- just like how other scholars have objected to the Celtic hypothesis. </p>\n\n<p>It bears mentioning that the journal issue that McWhorter's article above is published in -- <a href=\"http://journals.cambridge.org/action/displayIssue?decade=2000&amp;jid=ELL&amp;volumeId=13&amp;issueId=02&amp;iid=5881636\" rel=\"nofollow\">a 2009 issue of English Language and Linguistics</a> -- is a special issue entitled \"Re-evaluating the Celtic hypothesis.\" So there are certainly linguists interested in this.</p>\n\n<p>That said, there are some muddling factors when it comes to this particular language group. <a href=\"http://journals.cambridge.org/abstract_S1360674302000242\" rel=\"nofollow\">Van der Auwera and Genee 2002</a> surveys the field and identifies some meta issues:</p>\n\n<blockquote>\n  <p>Fourth, many an Anglicist would feel that the study of Celtic is not his/her\n  business but rather that of the Celticist (cf. Dal, 1952: 107) or of the Indo-\n  Europeanist (cf. Meid, 1990: 1000). Or Anglicists may feel that at least some of them\n  should have a competence in Celtic languages, but the fact is that most of them\n  simply do not.</p>\n  \n  <p>Fifth, what further obstructs taking a Celtic hypothesis seriously is the myth of\n  Anglo-Saxonism (see esp. German, 2000 and Tristram, 1999 but also Hickey, 1995:\n  103–5). This ideology starts from the unexamined premise that the English are of\n  unmixed Germanic origin, that their history starts with the arrival of leaders like\n  Hengest and Horsa and that the Celtic population they encountered was completely\n  exterminated or driven away; from this it must follow that there was no contact\n  between Early Celtic and Early English and there cannot therefore be any influence\n  of Celtic on English. A related myth leads to the same denial of the importance of\n  Celtic language and culture in Britain. It has recently been identified under the term\n  Celtoscepticism, and may be seen as the other side of the coin called Anglosaxonism;\n  it consists of the idea that the Celts as a people never really existed or formed a\n  cultural unity, and could therefore of course never as a group have had any influence\n  over other groups (Koch, 2001).</p>\n</blockquote>\n\n<p>The authors also mention a more generic issue with research:</p>\n\n<blockquote>\n  <p>Finally, there is the ever-present trap of mono-causalism. This means that\n  researchers who have already convinced themselves of the plausibility of one cause\n  or explanation may find it hard to accept that there could be more than one cause or\n  explanation. With respect to the specifics of do periphrasis, if one believes that\n  periphrastic do goes back to causative do, this still should not stop one from\n  investigating a Celtic hypothesis seriously as well (cf. Stein, 1990: 19).</p>\n</blockquote>\n", "Id":"895", "ParentId":"893", "LastEditorUserId":"397", "CreationDate":"2011-10-28T06:02:37.403", "OwnerUserId":"397", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-28T06:15:31.903", "LastEditedUser":{"UpVotes":"50", "DownVotes":"86", "Id":"397", "AccountId":"959564", "Views":"7", "Reputation":"680", "CreationDate":"2011-10-07T14:54:31.260", "DisplayName":"Aerlinthe", "LastAccessDate":"2013-12-10T17:42:44.790"}, "LastActivityDate":"2011-10-28T06:15:31.903", "Score":"3", "CommentCount":"2", "OwnerUser":{"UpVotes":"50", "DownVotes":"86", "Id":"397", "AccountId":"959564", "Views":"7", "Reputation":"680", "CreationDate":"2011-10-07T14:54:31.260", "DisplayName":"Aerlinthe", "LastAccessDate":"2013-12-10T17:42:44.790"}}