{"Body":"<p>Firstly, the writing system has little relevance to this question but I'll point out that while Old English was originally written in runes, from the 9th Century on the Latin Alphabet was used although with a few characters no longer included (eg thorn, eth and wynn).</p>\n\n<p>Old English refers to the language ancestral to Modern English that was spoken in much of England from the 5th C. until the 12th C. We know it was ancestral because we have detailed knowledge of the course of development from Old English, through Middle English up to Modern English. This knowledge includes huge numbers of etymologies as well as a detailed understanding of changes in the grammar. The sequences of changes that led from Old English grammatical structure to that of Modern English is well understood, and is exemplified at many points in time by numerous pieces of writing (scribal, ecclesiastical and personal). It is that substantial evidence of Old English as the ancestor to Modern English that allows us to identify Old English as 'English'. In fact, it was King Alfred the Great who, in the 9th Century, referred to Old English by the name <a href=\"http://oxforddictionaries.com/page/thehistoryofenglish_us/the-history-of-english;jsessionid=CE098069118CB093A3475BF581581427\" rel=\"nofollow\">'English'</a>. So Old English is identifiable as English both because it was the first variety given this name, and because it is demonstrably the ancestor of Modern English.</p>\n\n<p>Historical linguistics is 'diachronic', meaning it examines changes in a language over time. The divisions into 'languages' and 'dialects' is usually applied synchronically (ie at a given point in time). The usual definition is that spoken varieties are different languages if they are <em>not</em> mutually intelligible, and are dialects of the one language if they <em>are</em>. By this definition Old English and Modern English are different languages. Linguists have tried to work out how long it takes for a language to change so much that it would no longer be intelligible to the earlier speakers, but it's highly speculative. To answer your second question then, a language is separated from other languages by sufficient differences in lexicon and grammar such that the two languages are not mutually intelligible.</p>\n", "Id":"910", "ParentId":"909", "LastEditorUserId":"363", "CreationDate":"2011-10-30T07:22:48.727", "OwnerUserId":"363", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-10-30T12:00:47.710", "LastEditedUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}, "LastActivityDate":"2011-10-30T12:00:47.710", "Score":"5", "CommentCount":"6", "OwnerUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}}