{"OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "comments":[], "Body":"<p>It doesn't make much sense to ask whether the concept is <em>valid</em>.  You've gotta ask, \"valid for <em>what</em>?\"  In other words, it makes more sense to ask whether it leads to decent performance <em>on a specific task.</em>  </p>\n\n<p>Look at it this way: if you give me a writing sample and ask me \"Which of the five hundred million worldwide speakers of English did this come from,\" there's absolutely no way I can answer with any degree of confidence.  If you give me a writing sample and ask \"Is this by Winston Churchill or Charles Bukowski,\" I'll bet you any sum of money you like that I can get the answer right.  This suggests that \"linguistic fingerprinting\" is suitable for the Winston Churchill Detection Task, and not so suitable for the task of picking a single author out of a pool of five hundred million.  For tasks in between those two extremes, its degree of suitability is likely to vary. :)</p>\n\n<p>You might be interested in <a href=\"http://ai.arizona.edu/intranet/papers/Abbasi%20Writeprints%20TOIS%202008.pdf\" rel=\"nofollow\">this head-to-head comparison</a> of two authorship attribution systems.  Depending on the task, the winning system gets accuracies as high as 96% or as low as 31%.  The paper also goes into some detail on how the winning system works.  The feature set includes </p>\n\n<ul>\n<li>presence or absence of specific words, characters or character combinations</li>\n<li>presence or absence of specific typos/misspellings</li>\n<li>frequency of different parts of speech or part-of-speech combinations </li>\n<li>frequency of specific function words (e.g. \"of,\" \"for\")</li>\n<li>number of paragraphs, words or characters in the message</li>\n<li>length of each paragraph or word</li>\n<li>vocabulary size and distribution</li>\n<li>use of numerals</li>\n</ul>\n\n<p>So yeah, it's not just specific words or phrases, though popular articles on this stuff tend to focus on that aspect of it &mdash; probably because \"women use more pronouns\" or whatever makes for a catchy headline.</p>\n", "Id":"922", "ParentId":"914", "CreationDate":"2011-10-31T22:32:34.557", "Score":"9", "PostTypeId":"2", "OwnerUserId":"306", "LastActivityDate":"2011-10-31T22:32:34.557", "CommentCount":"3"}