{"Body":"<p>According to this <a href=\"http://wals.info/chapter/107\">WALS page \"Passive Constructions\"</a>, there are five necessary properties of a passive construction.</p>\n\n<ol>\n<li>it contrasts with another constuction, the active;</li>\n<li>the subject of the active corresponds to a non-obligatory oblique phrase of the passive or is not overtly expressed;</li>\n<li>the subject of the passive, if there is one, corresponds to the direct object of the active;</li>\n<li>the construction is pragmatically restricted relative to the active;</li>\n<li>the construction displays some special morphological marking of the verb.</li>\n</ol>\n\n<p>Using these tests, there are only those two ways to mark the passive: synthetic (some kind of marking on the verb which is different from the active, like Latin) and periphrastic or analytical (using some form of auxiliary and the participal form of the verb, like English).</p>\n\n<p>The linked pages also listed several ways that languages which do not have passive can have constructions which manifest some (but not all) of the five properties, for example</p>\n\n<ul>\n<li>Agent demotion by simply omitting the agent </li>\n<li>Agent demotion by replacing the agent with an impersonal subject (like \"on\" in French)</li>\n<li>One of the closest I found is the use of the inverse construction in Plains Cree (Algonquian; Canada). The inverse construction is similar to the passive because the patient is more topical than the agent. However, in the inverse the agent retains some topicality, is still obligatory and still controls the verbal agreement (meaning the agent is somewhat still the subject, hence the construction isn't really passive). </li>\n</ul>\n\n<blockquote>\n<pre><code>sēkih-ēw   nāpēw    atim-wa\nscare-dir  man.prox dog-obv\n‘The man scares the dog.’ \n</code></pre>\n  \n  <p>Direct construction, 'man' is the proximate (the more topical participant), and 'dog' is the obviate (the less topical participant).</p>\n\n<pre><code>sēkih-ik   nāpēw-a  atim\nscare-inv  man-obv  dog.prox\n‘The man scares the dog.’\n</code></pre>\n  \n  <p>Inverse construction, 'man' (agent) is the obviate and 'dog' (patient) is the proximate</p>\n</blockquote>\n\n<p>If you are into it, there are other examples in the linked page.</p>\n", "Id":"936", "ParentId":"934", "LastEditorUserId":"92", "CreationDate":"2011-11-03T10:38:57.380", "OwnerUserId":"92", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-11-03T17:17:01.917", "LastEditedUser":{"UpVotes":"488", "WebsiteUrl":"http://claimid.com/louisr", "Id":"92", "AccountId":"163323", "CreationDate":"2011-09-14T02:07:23.613", "AboutMe":"<p>trying to learn and help others learn :)</p>\n", "Age":"34", "Location":"Your computer", "DownVotes":"39", "Views":"97", "Reputation":"3271", "DisplayName":"Louis Rhys", "LastAccessDate":"2014-01-18T16:45:57.423"}, "LastActivityDate":"2011-11-03T17:17:01.917", "Score":"10", "OwnerUser":{"UpVotes":"488", "WebsiteUrl":"http://claimid.com/louisr", "Id":"92", "AccountId":"163323", "CreationDate":"2011-09-14T02:07:23.613", "AboutMe":"<p>trying to learn and help others learn :)</p>\n", "Age":"34", "Location":"Your computer", "DownVotes":"39", "Views":"97", "Reputation":"3271", "DisplayName":"Louis Rhys", "LastAccessDate":"2014-01-18T16:45:57.423"}}