{"Body":"<p>Many opponents of a rule-based approach to language-learning support an <em>exemplar</em>-based approach instead. In these models, the language learner does not form an internal grammar by learning abstract rules that manipulate segments; rather, she stores vast \"clouds\" of tokens that are committed to long-term memory on a word-by-word basis. Every time we encounter a new token, we compare it with every similar token we've heard before and adjust our mental representation of that token accordingly. It is important to point out that Port et al do not deny the existence of segment-sized units as a cultural construct, or even as part of individual impressions of speech:</p>\n\n<blockquote>\n  <p>So I certainly would <em>not</em> say that our impression that speech has segment-sized units is due solely to alphabet training. Languages do have some segment-sized units, along with many other sized units as well. What is true, however, is that alphabet skills do tend to highlight the segment-like (i.e., letter-like) properties of phonologies for us. (Port, Languages and Sciences 32, p61-62) </p>\n</blockquote>\n\n<p>That being said, they contend that what we phonologists have been doing for decades is codifying sets of cultural conventions shared among communities of speakers rather than any kind of internal grammars.</p>\n\n<p>I am familiar with three main types of argument against the extreme exemplar view (i.e. the complete abandonment of rule-based approaches to grammar):</p>\n\n<ol>\n<li>The demands on long-term memory that the pure exemplar view entails are quite extreme.</li>\n<li>The fact that language learners overgeneralize when attempting to produce new forms is evidence that those learners are applying abstract rules.</li>\n<li>The existence of Neogrammarian (i.e. across-the-board) sound changes are very difficult to capture in a model that doesn't allow for abstract units and categories.</li>\n</ol>\n\n<p>Meanwhile, exemplarists cite experimentally confirmed frequency effects and \"neighborhood density\" (i.e. degree of proximity to similar sounds) effects on production as evidence for exemplars and claim that purely abstractionist approaches cannot explain such effects. Recently, some researchers have supported a middle-ground approach in which insights from both camps are integrated into a model that allows for both the storage of phonetic detail and the manipulation and categorization of abstract units in the internal grammar.</p>\n", "Id":"966", "ParentId":"960", "LastEditorUserId":"385", "CreationDate":"2011-11-06T15:09:02.093", "OwnerUserId":"385", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-11-06T15:27:40.027", "LastEditedUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}, "LastActivityDate":"2011-11-06T15:27:40.027", "Score":"7", "CommentCount":"2", "OwnerUser":{"UpVotes":"91", "WebsiteUrl":"", "Location":"Ithaca, NY", "Id":"385", "DownVotes":"2", "AccountId":"954986", "Views":"39", "Reputation":"2684", "CreationDate":"2011-10-05T13:37:26.247", "DisplayName":"musicallinguist", "LastAccessDate":"2014-01-18T13:36:50.613", "AboutMe":"<p>I am a researcher at a company that specializes in speech synthesis research. I have a Ph.D. in linguistics from Cornell University, and my areas of specialty are phonology and phonetics. I also have a bachelor's degree in music.</p>\n"}}