{"OwnerUser":{"UpVotes":"184", "WebsiteUrl":"", "Location":"Australia", "Id":"363", "DownVotes":"11", "AccountId":"948668", "Views":"67", "Reputation":"3682", "CreationDate":"2011-10-02T11:34:38.250", "DisplayName":"Gaston Ümlaut", "LastAccessDate":"2014-01-18T22:46:37.857", "AboutMe":"<p>I am a rock climber &amp; a linguist.</p>\n"}, "comments":[], "Body":"<p>While a relatively rare phenomenon, there are numerous examples of languages where the selection of a pronoun depends on the TAM of the clause (I say 'clause' as it is not always the case that it is also marked on the verb).</p>\n\n<p>In Pitta-Pitta (Australian family) all core case-marking is split according to whether it marks future or non-future and this also applies to pronouns. (1a) and (1b) show non-future and future examples respectively:</p>\n\n<pre>\n(1a)  WaiRa -nha      ngathu       thari -nya  nhana        -yi    \n     heart  -nfut.acc 1sg.nfut.erg spear -past 3sg.nfut.acc -prox\n\n     wakira   -nha\n     kangaroo -nfut.acc \n     \"I speared the kangaroo in the heart.\"\n</pre>\n\n<pre>\n(1b)  Tyira     -maru -ngu     nganyu      karnta -ø   \n      boomerang -prop -fut.erg 1sg.fut.erg go     -fut\n     \"I'll be going with the boomerang.\"\n</pre>\n\n<p>(Bowern, C. 2004. 'The origins of tense-based case marking in Pitta-Pitta and Wangkajutjuru'. Australian Journal of Linguistics, 24:2)</p>\n\n<p>There are a number of other Australian languages with similar behaviour. Another example is Gurnu:</p>\n\n<pre>\n(2) bulga -nguna -ngadhu         bulga -ngaw -adhu\n    hit   -pres  -1sg.pres       hit   -past -1sg.past\n     \"I hit (present).\"     vs.  \"I hit (past).\"\n</pre>\n\n<p>Blevins (2004) suggests that this is probably due to a combination of factors, including a fixed verb-pronoun word order and the phonological form of verbs causing sandhi changes on following pronouns. (Blevins, J. 2004. 'Evolutionary Phonology'. CUP.)</p>\n\n<p>Iai (Austronesian family, New Caledonia) also has tensed pronouns, but this is reported to be similar to the English pronouns with (what has been called) propositional marking of tense: \"I'll, I'd, I'm, I\".</p>\n\n<p>Scottish Gaelic has two forms of the 2sg pronoun, /tu/ and /thu/, the former occurring only with future/present habitual verbs. Similar to the situation with Gurnu, these have arisen through phonological change caused by the adjacent verb, Gaelic having VSO order in the clause.</p>\n\n<p>Hausa (Afro-Asiatic family) and Wolof (Niger-Congo family) also have distinct sets of pronouns for indicating different tense/mood. These are sometimes known as 'temporal pronouns'.</p>\n\n<p>Upriver Halkomelem (Salishan family) has tense marking on nouns and pronouns.</p>\n\n<p>On a slightly different tack, it has been shown that two tense-marking auxiliaries in Panare (Cariban family) derive etymologically from demonstrative pronouns.\n(Gildea, S. 1993. 'The development of tense markers from demonstrative pronouns in Panare (Cariban)'. Studies in Language, 17:1)</p>\n", "Id":"980", "ParentId":"977", "CreationDate":"2011-11-08T08:06:34.523", "Score":"5", "PostTypeId":"2", "OwnerUserId":"363", "LastActivityDate":"2011-11-08T08:06:34.523", "CommentCount":"1"}