{"Body":"<p>From <a href=\"http://en.wikipedia.org/wiki/Language_family\">Wikipedia</a>:</p>\n\n<blockquote>\n  <p>The evidence of linguistic relationship is observable shared characteristics that are not attributed to borrowing.</p>\n</blockquote>\n\n<p>From this it follows that your two languages will never become part of the same language family, because all borrowed features should be ignored when determining membership of a linguistic family. If an Indo-European language has adopted so many features from a Semitic language that both its vocabulary and its grammatical constructions are 99 % borrowed from the Semitic language, leaving only a barely recognizable 1 % Indo-European features, it should by this definition still be considered an Indo-European language. Even if this becomes 100 %, it follows that the old language should in principle <em>still</em> be said to be Indo-European!</p>\n\n<p>This the absurd but necessary consequence of the definition shows the limits of its usefulness. It is the only way to classify a language with absolute certainty.</p>\n\n<p>So a language is treated here as something entirely separate from its speakers: the essential factor to consider is its past. This poses the following problem: how do we determine which language has borrowed from which? In the above case, it could be said that the speakers have simply gradually adopted the Semitic language and stopped speaking their previous, Indo-European language. It just depends on whether you treat the pair as one \"original\" Indo-European language influenced by a Semitic superstrate, or an \"original\" Semitic superstrate that has moved to a new community of speakers and made the old Indo-European languages extinct as to its having any living speakers. The choice seems rather arbitrary.</p>\n\n<hr>\n\n<p>Another possible definition could be this (my own version):</p>\n\n<blockquote>\n  <p>A language belongs to a language family if the features typical of this family comprise the greatest part of its own features.</p>\n</blockquote>\n\n<p>So a language whose vocabulary and grammar is 40 % inherited or borrowed from Indo-European languages, 30 % Semitic, and 20 % from other languages would be said to be Indo-European. However, this results in serious difficulties. How does one measure these percentages? Count words in its dictionary? Count words actually used in recorded conversations? And what if it has more words from family A but more grammatical features from family B? Which is more important? What to do with pragmatic and narrative features? How much weight do we attach to all these features and categories of features? What if one group of its speakers use more features from A, but another group uses more from B?</p>\n\n<p>As an alternative, we could simply say each language can belong to several families at once. In most languages, a main component can probably be reasonably identified, but some should perhaps be said to belong to several families to an equal or comparatively undeterminable degree. If you take this interpretation, your question more or less becomes moot: languages can belong to the same family to various degrees, according as they contain more or fewer features from the same family.</p>\n", "Id":"992", "ParentId":"989", "LastEditorUserId":"82", "CreationDate":"2011-11-09T01:30:54.137", "OwnerUserId":"82", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-11-09T01:53:36.433", "LastEditedUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}, "LastActivityDate":"2011-11-09T01:53:36.433", "Score":"6", "CommentCount":"4", "OwnerUser":{"UpVotes":"459", "WebsiteUrl":"http://www.paleografie.tk", "Location":"Amsterdam, The Netherlands", "Id":"82", "DownVotes":"34", "AccountId":"288086", "Views":"69", "Reputation":"5113", "CreationDate":"2011-09-14T00:14:12.070", "DisplayName":"Cerberus", "LastAccessDate":"2014-01-18T06:33:05.893", "AboutMe":"<p>I'm your dog for Dutch, Latin, and Greek.</p>\n"}}