{"Body":"<p>I think there would be an epistemic block (i.e. a part of our methodology which prevents us from discovering something, regardless of what the data may say) against ever discovering such a thing. Let's imagine two languages, X and Y, which do not have a common ancestor. If, by traditional criteria of assessing relatedness (apparent shared innovations), we determine that X and Y have a common ancestor, then we will say that X and Y are related, even though they are not related. However, we have no way of discovering our mistake, since so far there is no method for assessing relatedness which has overtaken the comparative method in reliability. </p>\n\n<p>But since not all language families are equally well substantiated, and none is 100% certain to be a genetic unit, it is highly probable that at least one such case exists: a language family which is called a language family but is really a case of convergence by contact. \"Khoisan\" is such a case. Once proposed as a family by Greenberg and then accepted as one by scholars, it has subsequently been discredited (see work by Tom Gueldemann on this topic) and is no longer held by specialists to constitute a valid genetic grouping. Since non-specialists may not be uniformly aware of the non-validity of Khoisan as a genetic unit, there are those who will still refer to the Khoisan family, even though it is not a family, but a group of families that resemble each other partly due to contact. But it would be hard to call it a family of convergence, since you would have to simultaneously believe that it's a family and that it's not really a family.</p>\n\n<p>Putting this issue aside, there are many cases of languages which are unrelated but are strikingly similar. Compare Cantonese and Vietnamese: they both have lexical tone, a division between checked and non-checked tones, mostly monosyllabic morphemes, verb serialization, roughly the same segmental phonotactics, similar word order patterns, a variety of sentence-final emphatic particles, share a large proportion of their vocabulary, etc. But they are known to be unrelated, and have a good enough written record to not have ever been confused by serious researchers.</p>\n", "Id":"994", "ParentId":"989", "LastEditorUserId":"483", "CreationDate":"2011-11-09T02:57:30.533", "OwnerUserId":"483", "PostTypeId":"2", "comments":[], "LastEditDate":"2011-11-16T02:21:44.453", "LastEditedUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "LastActivityDate":"2011-11-16T02:21:44.453", "Score":"7", "OwnerUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}}