{"UpVotes":"1", "WebsiteUrl":"http://www.fanfiction.net/~ainekoyokai", "Id":"1327", "AccountId":"1579369", "CreationDate":"2012-09-12T10:56:41.383", "AboutMe":"<p>I tend to ask extremely stupid questions. Yes, they're stupid because the answer is usually right in front of me 99.9% of the time! (Even if I insist, at first, that it isn't!)</p>\n\n<p>One really big peeve I've realized, I dislike it when someone says something is wrong based off of the usage being <em>uncommon</em>. Think outside the box, and a new world of <em>usage</em> may surprise you! (<em>I still haven't the faintest clue if I'm being sarcastic or not with that last bit</em>...? Ah, yes, slightly sarcastic.) I also dislike when people suggest diminishing a nice set of vocabulary just because the words are not used often in today's time. It sickens me when I see this. </p>\n\n<ul>\n<li>I love to read</li>\n<li>I love to write</li>\n<li>I love music</li>\n<li>I love making [pointless] hobby sites</li>\n<li>And nothing gets between me and raspberries ;) </li>\n</ul>\n\n<p>I've been stuck on writing three different books since I was 17. Keeping that in mind... I know, realistically, I'm probably never going to be an amazing author and will have to die with the dream of being a best-seller still in my head. Thankfully, I have this great interest in web 'design'. I hate using that word, because most people who say 'Oh yeah, I'm totally into web design', are the same people using Dreamweaver or some other WYSIWYG program instead of opening up a trusty notepad-like blank document and getting down and dirty with coding.\n<br /> <em>(Loved-ones say I'm spectacular with assumptions...)</em></p>\n\n<p>Along with making pointless hobby sites, <a href=\"http://www.fictionpress.com/~br0k3n\" rel=\"nofollow\">writing <em>amateur</em> poetry</a> (out of a collection, I have only maybe about 5 that I am particularly proud of), and being sick with writers' block, I'm a huge sucker for reading and writing fanfiction. (<em>Go figure, no writers' block there--for the most part</em>.)</p>\n\n<p>I tend to make really bad/stupid/careless jokes. (Bad having a multitude of meanings, hence dash word dash... XD)</p>\n\n<p>There is more about me that I'd like to share, but I think I've blabbered long enough. You all have a great one!</p>\n", "Age":"23", "Location":"United States", "DownVotes":"0", "Views":"0", "Reputation":"101", "DisplayName":"Souta", "LastAccessDate":"2012-11-03T22:46:43.637"}