{"UpVotes":"0", "Location":"United States", "DownVotes":"0", "Id":"1571", "AccountId":"1257562", "Views":"0", "Reputation":"101", "CreationDate":"2012-12-11T18:41:28.683", "DisplayName":"J.R.", "LastAccessDate":"2012-12-11T18:41:28.683", "AboutMe":"<p>\"<em>My life is spent in one long effort to escape from the commonplaces of existence.  These little problems help me to do so</em>.\" (Sherlock Holmes)</p>\n\n<p>I enjoy embedding puns and subtle self-references into many of my answers and comments.</p>\n\n<p><a href=\"http://english.stackexchange.com/questions/1482/what-are-your-favorite-english-language-tools\">This question</a> inspired me to create <a href=\"http://tiny.cc/wsmithy\" rel=\"nofollow\">this web page</a>.</p>\n\n<p>Remember, <strong>context is everything</strong>.  </p>\n\n<hr>\n\n<p>Ready to ask an EL&amp;U question? Don't want to get downvoted? I'd like to offer three nuggets of advice<sup>1</sup>:</p>\n\n<p>(a) Want to ask what something means? Don't ask in a vacuum. (In other words, don't pull a phrase out of a sentence, and ask what that phrase means – instead, <em>give the whole sentence</em>, or, better yet, the whole <em>paragraph</em>.) </p>\n\n<p>(b) Giving us a sentence to evaluate? Tell us where you got it from!  (Is it from a book? A blog? A respected journal? An instruction sheet? A contemporary source, or something that is centuries old? <em>Such information is often vital to interpreting language and deciphering meaning</em>. Provide a link to the source if you can.)  </p>\n\n<p>(c) Do some of your own research first, and then share those findings in your question. Don't ask a question that creates the illusion that you don't know how to use a dictionary.</p>\n\n<p>P.S. Never make the mistake of thinking that a <a href=\"http://www.onelook.com/?w=in&amp;ls=a\" rel=\"nofollow\">tiny</a> <a href=\"http://www.onelook.com/?w=to&amp;ls=a\" rel=\"nofollow\">preposition</a> has <a href=\"http://www.onelook.com/?w=on&amp;ls=a\" rel=\"nofollow\">only</a> <a href=\"http://www.onelook.com/?w=from&amp;ls=a\" rel=\"nofollow\">one</a> <a href=\"http://www.onelook.com/?w=by&amp;ls=a\" rel=\"nofollow\">meaning</a>.</p>\n\n<hr>\n\n<p><sup>1</sup>I like to point out that <a href=\"http://english.stackexchange.com/users/3119/yoichi-oishi\">one user</a> – a non-native speaker, even! – has amassed over 12,000 points simply by following these three basic guidelines.  Elaboration can be a beautiful thing.</p>\n"}