{"Body":"<p>From the (albeit <em>citation needed</em>) section of the <a href=\"http://en.wikipedia.org/wiki/Aspirated_consonant\" rel=\"nofollow\">Wikipedia article</a> on aspiration:</p>\n\n<blockquote>\n  <p>Spanish /p t k/, for example, have voice onset times (VOTs) of about 5, 10, and 30 milliseconds, whereas English /p t k/ have VOTs of about 60, 70, and 80 ms. Korean has been measured at 20, 25, and 50 ms for /p t k/ and 90, 95, and 125 for /pʰ tʰ kʰ/.</p>\n</blockquote>\n\n<p>This is also confirmed from my anecdotal explorations in the topic.</p>\n\n<p>The question I have is what causes the different stop consonants to have different VOTs. I couldn't find any good linguistic descriptions through some preliminary googling.</p>\n\n<p>The two hypotheses I had were both based on the (my own) idea that voicing begins once air pressure subsides from high stop-like levels to some trigger point.</p>\n\n<p>The first hypothesis was that air from a far back pressure release has to travel farther and through more obstructed corridors to reach the open air. Whereas air from a /p/ release can immediately and quickly reach the open, air from a /k/ release has to go all the way through the mouth to get outside. The latter trek is slow and results in a slower decrease of air pressure resulting in a later trigger for voicing.</p>\n\n<p>The second hypothesis was that somehow, the backer points of articulation resulted in higher pressure buildups. This would be plausible if stop bursts required some given mass of extra air to release, and this mass, distributed over the oral cavity in /p/ would be spread over a larger volume and consequently have a lower pressure than in /k/. Thereafter, even if air pressure subsided at the same rate, the higher original pressure in /k/ would take longer to hit the trigger point.</p>\n\n<p>Are there any good readings on the subject or anybody who can provide a more confident explanation?</p>\n", "Id":"1", "LastEditorUserId":"51", "FavoriteCount":"1", "AcceptedAnswerId":"394", "Title":"Why does stop VOT duration vary depending on place of articulation?", "CreationDate":"2011-09-13T20:54:16.650", "OwnerUserId":"9", "PostTypeId":"1", "Tags":"<phonetics><cross-linguistic><production><articulation><stops>", "AnswerCount":"3", "comments":[], "LastEditDate":"2012-04-21T07:50:58.293", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"684", "LastActivityDate":"2012-04-21T07:50:58.293", "Score":"16", "CommentCount":"2", "OwnerUser":{"UpVotes":"13", "WebsiteUrl":"http://stevenxu.ca", "Id":"9", "AccountId":"69900", "CreationDate":"2011-09-13T20:51:36.750", "AboutMe":"<p>Hi friends! I'm <a href=\"http://stevenxu.ca\" rel=\"nofollow\">Steven Xu</a>. I'm an enthusiastic San Francisco software engineer focused on the Web. </p>\n\n<p>In my spare time, I like to play and coach volleyball and dabble in linguistics, especially phonetics.</p>\n", "Age":"24", "Location":"Canada", "DownVotes":"0", "Views":"74", "Reputation":"1326", "DisplayName":"Steven Xu", "LastAccessDate":"2013-09-27T23:39:20.960"}}