{"Body":"<p>How do archaeologists, cryptoanalysts and linguists decipher extinct languages? Has there been a case in history where this was successfully accomplished, without the means of something like the Rosetta stone or people that still speak a similar variant of the language in question?</p>\n\n<p>Obviously you start out by collecting statistics. How often do characters appear, how often do certain characters appear together, etc. \nBut what do you then do with those statistics? How does it help knowing that A E I O U are vowels, or that u almost always follows q and that h frequently follows t in English?</p>\n\n<p>If you were to discover English, without knowing anything about it (except for maybe that it is an alphabetical language), or any related languages, how would you go about deciphering it? To simplify things let's assume a fairly simplified version of English with only abstract concepts like squares or triangles.\nIf you had books full of sentences like \"A square consists of two triangles\", \"A triangle consists of three lines intersecting with each other\", etc. how could one extract the meaning of those sentences without prior knowledge of the language?</p>\n", "Id":"1001", "LastEditorUserId":"92", "FavoriteCount":"0", "AcceptedAnswerId":"1004", "Title":"How are languages deciphered?", "CreationDate":"2011-11-09T23:26:56.540", "OwnerUserId":"503", "PostTypeId":"1", "Tags":"<lexical-semantics><dead-languages><methodology>", "AnswerCount":"2", "comments":[], "LastEditDate":"2012-03-14T02:50:40.587", "LastEditedUser":{"UpVotes":"488", "WebsiteUrl":"http://claimid.com/louisr", "Id":"92", "AccountId":"163323", "CreationDate":"2011-09-14T02:07:23.613", "AboutMe":"<p>trying to learn and help others learn :)</p>\n", "Age":"34", "Location":"Your computer", "DownVotes":"39", "Views":"97", "Reputation":"3271", "DisplayName":"Louis Rhys", "LastAccessDate":"2014-01-18T16:45:57.423"}, "ViewCount":"587", "LastActivityDate":"2012-03-14T02:50:40.587", "Score":"13", "CommentCount":"3", "OwnerUser":{"UpVotes":"2", "DownVotes":"0", "Id":"503", "AccountId":"139599", "Views":"1", "Reputation":"168", "CreationDate":"2011-11-09T23:08:53.517", "DisplayName":"Dexter", "LastAccessDate":"2011-11-13T12:26:37.607"}}