{"Body":"<p>In Modern Standard Arabic, phonemic /lˤ/ (a.k.a. \"emphatic l\") <a href=\"http://en.wikipedia.org/wiki/Arabic_phonology#ref_6\">only occurs in one native word: <em>Allah</em> /ʔalˤˈlˤaːh/.</a>  (According to the linked article, it also occurs in a few loanwords.)</p>\n\n<p>This seems like a profoundly weird situation.  If a phoneme exists at all, you'd expect it to show up more than once.  Imagine a time before the loanwords with /lˤ/ were borrowed.  Would <i>allah</i> then have been the only instance of /lˤ/ in the entire lexicon of the language?  I know that's logically possible, but intuitively it strikes me as completely bizarre.</p>\n\n<p>So what happened?  How did this weird situation come about?  (Or is it less of a weird situation than I think?  I'd be happy to hear about other languages that have similar \"one-off\" phonemes.)</p>\n", "Id":"1032", "FavoriteCount":"1", "Title":"How did the Arabic word \"allah\" come to have an /lˤ/ (\"emphatic l\")?", "CreationDate":"2011-11-16T18:44:26.343", "AnswerCount":"3", "PostTypeId":"1", "OwnerUserId":"306", "Tags":"<phonology><historical-linguistics><arabic>", "comments":[], "ViewCount":"394", "LastActivityDate":"2013-10-18T03:33:01.703", "Score":"13", "CommentCount":"2", "OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}}