{"Body":"<p>Looking at modern French in light of vulgar Latin, or Chinese compared with Proto-Sino-Tibetan (if that can even be reconstructed), there seems to be quite a few contexts in which phonemes are subsumed, vowels are nasalized to indicate the loss of a nasal, or tones are introduced to retain distinctions formerly maintained by distinct consonant clusters. Modern Celtic languages certainly seem to have done a lot of this too, and I have heard that a similar thing happened in Sumerian.</p>\n\n<p>I was wondering if anyone has any theories or reference to theories about</p>\n\n<p>(1) What makes a language \"prepared\" for such a phenomenon to occur (e.g., are there some languages that this would be much less likely to happen to?)</p>\n\n<p>(2) Whether there are any aspects of a culture speaking a language that make people more likely to gravitate towards doing something like this across whatever number of generations.</p>\n\n<p>(I would also be interested in hearing whether anyone believes there was the strong presence of a Celtic substratum in French that influenced it in this way, but that's kind of tangential.)</p>\n", "Id":"1225", "FavoriteCount":"2", "AcceptedAnswerId":"1226", "Title":"Vanishing phonemes, nasalization of vowels, tones", "CreationDate":"2012-01-04T01:30:57.647", "AnswerCount":"1", "Tags":"<language-change><evolution><sociolinguistics><sound-change>", "PostTypeId":"1", "OwnerUserId":"84", "comments":[], "ViewCount":"254", "LastActivityDate":"2012-01-04T02:10:14.063", "Score":"4", "CommentCount":"2", "OwnerUser":{"UpVotes":"167", "WebsiteUrl":"http://web.mit.edu/~dbriggs/www", "Id":"84", "AccountId":"511555", "CreationDate":"2011-09-14T00:18:36.197", "AboutMe":"<p>At UMass Amherst in the Ph.D. program in math.<br>\n</p>\n\n<p>\nCurrently taking:<br>\nAnalysis (Measure theory & integration)<br>\nGeometry (Theory of manifolds)<br>\nModular Forms</p>\n", "Age":"29", "Location":"Cambridge, MA", "DownVotes":"0", "Views":"23", "Reputation":"1163", "DisplayName":"Daniel Briggs", "LastAccessDate":"2013-08-10T16:57:15.060"}}