{"Body":"<p>The laryngeal theory proposes that Proto-Indo-European contained a number of consonants that are absent in (almost) all daughter languages. Their existence was proposed (by Saussure, under the term <em>coefficients sonantiques</em>) because  certain vowel patterns in Indo-European languages seemed irregular, but could be accounted for by assuming the previous existence of certain consonants. Möller proposed these consonants were laryngeals, which is now generally accepted, although there is still no agreement on the number of consonants to be reconstructed, or their actual phonetic value.</p>\n\n<p>The Wikipedia article on <a href=\"http://en.wikipedia.org/wiki/Laryngeal_theory\" rel=\"nofollow\">laryngeal theory</a> is quite informative (and contains a bibliography), but what text would give the best introduction of the subject up to the current state of research? I'm looking for a comprehensive overview, e.g. including a discussion of Saussure's <em>coefficients sonantiques</em> and covering all the mainstream further developments.</p>\n\n<p>Edit: if there are no treatments that cover the developments of the theory, I'll settle for a volume with an up-to-date account of it.</p>\n", "Id":"1239", "LastEditorUserId":"444", "FavoriteCount":"0", "AcceptedAnswerId":"1267", "Title":"Is there a comprehensive account of the development of laryngeal theory?", "CreationDate":"2012-01-08T13:44:35.673", "OwnerUserId":"444", "PostTypeId":"1", "Tags":"<phonology><historical-linguistics><indo-european>", "AnswerCount":"2", "comments":[], "LastEditDate":"2012-01-11T23:35:33.087", "LastEditedUser":{"UpVotes":"127", "WebsiteUrl":"", "Location":"Netherlands", "Id":"444", "DownVotes":"2", "AccountId":"902812", "Views":"19", "Reputation":"934", "CreationDate":"2011-10-23T14:14:27.380", "DisplayName":"arjan", "LastAccessDate":"2014-01-14T14:07:55.473", "AboutMe":""}, "ViewCount":"227", "LastActivityDate":"2012-01-12T23:01:28.817", "Score":"7", "CommentCount":"3", "OwnerUser":{"UpVotes":"127", "WebsiteUrl":"", "Location":"Netherlands", "Id":"444", "DownVotes":"2", "AccountId":"902812", "Views":"19", "Reputation":"934", "CreationDate":"2011-10-23T14:14:27.380", "DisplayName":"arjan", "LastAccessDate":"2014-01-14T14:07:55.473", "AboutMe":""}}