{"Body":"<p>There are plenty of software programs facilitating interlinear transcription (e.g. <a href=\"http://www.sil.org/computing/toolbox/\" rel=\"nofollow\">Toolbox</a>, <a href=\"http://fieldworks.sil.org\" rel=\"nofollow\">Fieldworks Language Explorer</a>). There's also a number of tools that allow you to work on aligning parallel texts (mostly bitexts, but also some allowing multiple parallel texts) but it seems the options for small projects are much more limited and less user-friendly than is the case with tools for interlinear transcription. (Below I've included a short list of corpus/alignment tools that seem to be the most used / well-known). However, so far I have not found a program that allows an integrated approach, i.e. working on morphological analysis of a text that is already sentence-aligned. I'll first explain my use-case.</p>\n\n<p>I am working on a collection of parallel texts in multiple languages, which are part of a religious document. Some of these languages are better documented than the one I'm focussing on, so while working on the morphological analysis of my target language, I would like to compare the equivalents of two of the other languages. Being able to do this simultaneously would also allow to fine-tune sentence-alignments. Having a fully annotated and sentence-aligned version is also a final goal.</p>\n\n<p>From what I've seen so far, however, sentence alignment / corpus tools take already annotated texts as input; you then carry out paragraph, sentence (and may also word) alignments. When this work is done you can start investigating your texts: concordances, looking at collocations, etc. In my case, however, I want to use the aligned texts precisely to create the annotated version of my target language text.</p>\n\n<p>Ideally there would be a single program to support both tasks, although I don't expect this to be the case (I've read in several places that there's a lack of good tools to support individual linguists in corpus work). Still, parallel text alignment is often used, especially in large projects (likely with technical support?!), so there must be ways of dealing with this sort of problem. I would like to hear about workflows/setups/formats that would make this possible. I'm thinking along one of these lines:</p>\n\n<ol>\n<li>A single program that supports both alignment and adding morphological annotation (one can always hope, right?)</li>\n<li>A workflow which allows adding layers of annotation to an already sentence-aligned parallel text. I suspect this to be possible, but: which combination of tools would make this possible? What formats can be used for import/export and how do you make sure the analysis layers match with the aligned sentences?</li>\n<li>As a last resort I could make a sentence alignment using any alignment tool and then use two programs simultaneously (check the translation equivalents in the alignment while working on the interlinear version in one of the usual tools - Toolbox etc.). But before I take this route, though, I'd want to know that none of the other options are feasible.</li>\n</ol>\n\n<p>How have you dealt with such a task? (or how would you?) (I'd also welcome references to articles dealing with this from a practical angle. For example, <a href=\"http://llc.oxfordjournals.org/content/24/3/307.abstract\" rel=\"nofollow\">this article</a> presents a very accessible look on how one can work on preparing a digital version of an old manuscript (but it's concerned with a TEI-encoded manuscript edition, not with alignment).</p>\n\n<p>P.S. It seems there's not yet a truly standard / recommended format for parallel texts. The most recent general corpus standard is <a href=\"http://www.xces.org\" rel=\"nofollow\">XCES</a>; TEI appears not not to be the most useful for this <a href=\"http://www.balisage.net/Proceedings/vol5/html/Banski01/BalisageVol5-Banski01.html\" rel=\"nofollow\">at this time</a>. I'll use anything that is supported by the tool I choose ;)</p>\n\n<p>Some common alignment/corpus tools:</p>\n\n<ul>\n<li><a href=\"http://sourceforge.net/projects/uplug/\" rel=\"nofollow\">Uplug</a></li>\n<li><a href=\"http://gate.ac.uk/\" rel=\"nofollow\">Gate</a></li>\n<li><a href=\"http://www.paraconc.com/\" rel=\"nofollow\">ParaConc</a> - This seems to be a user-friendly and often-used (at least, cited in articles) tool</li>\n<li><a href=\"http://wanthalf.saga.cz/intertext\" rel=\"nofollow\">InterText</a> - This one looks interesting, very recent (and apparently not yet well-known)</li>\n</ul>\n", "Id":"1285", "LastEditorUserId":"444", "FavoriteCount":"3", "AcceptedAnswerId":"2397", "Title":"How to work on annotating AND sentence-aligning parallel texts?", "CreationDate":"2012-01-16T00:52:43.320", "OwnerUserId":"444", "PostTypeId":"1", "Tags":"<corpora><software><interlinear-gloss><tools>", "AnswerCount":"3", "comments":[], "LastEditDate":"2012-01-17T11:01:24.520", "LastEditedUser":{"UpVotes":"127", "WebsiteUrl":"", "Location":"Netherlands", "Id":"444", "DownVotes":"2", "AccountId":"902812", "Views":"19", "Reputation":"934", "CreationDate":"2011-10-23T14:14:27.380", "DisplayName":"arjan", "LastAccessDate":"2014-01-14T14:07:55.473", "AboutMe":""}, "ViewCount":"666", "LastActivityDate":"2013-10-12T11:51:55.797", "Score":"7", "OwnerUser":{"UpVotes":"127", "WebsiteUrl":"", "Location":"Netherlands", "Id":"444", "DownVotes":"2", "AccountId":"902812", "Views":"19", "Reputation":"934", "CreationDate":"2011-10-23T14:14:27.380", "DisplayName":"arjan", "LastAccessDate":"2014-01-14T14:07:55.473", "AboutMe":""}}