{"Body":"<p>With regard to morphology a common example of a lexeme is <em>[dog, dogs]</em> where <em>dogs</em> is the plural inflexion of the lemma <em>dog</em> modified by the <em>-s</em> suffix, marking plurality.</p>\n\n<p>Although I can accept that <em>dog</em> and <em>dogs</em> are, morphologically speaking, the same word i.e. the same lexeme, it still bothers me because each has a different meaning.  </p>\n\n<p>Semantically speaking, can we say <em>dog</em> and <em>dogs</em> are the same words? How does plurality relates to <em>dog</em> semantically: </p>\n\n<ol>\n<li>does <em>dogs</em> means multiple instances of a class <em>dog</em>?</li>\n<li>or does it mean the multiplicity of a same instance? </li>\n</ol>\n\n<p>To illustrate the different possibilities here above:</p>\n\n<blockquote>\n  <ol>\n  <li><p>\"Suddenly several dogs, not one, were surrounding me.\" </p></li>\n  <li><p>\"Suddenly several Benjamins, not one, were surrounding me.\"</p></li>\n  </ol>\n</blockquote>\n\n<p>In the second example, I used a proper name to emphasize the individuality of the instance, which is multiplied.</p>\n\n<p>In the former case, if <em>dog</em> is understood as a class, then <em>dogs</em> could refer to multiple instances of that class as well as to multiple sub-classes of that same class. By the same logic, <em>dog</em> (singular) could mean a class or an instance of that class.</p>\n\n<blockquote>\n  <p>\"The dog will always be man's best companion.\" (class)<br>\n  \"The dog entered my yard this morning.\" (instance)</p>\n</blockquote>\n\n<p>Is the semantic distinction between class and instance here a shortcoming of the English language? Could a hypothetical language have distinct words for <em>dog-class</em>, <em>dog-class-single-instance</em>, <em>dog-class-multiple-instances</em>, etc.?\nAnother example which may suggest the distinction in English would be <em>fish</em>:</p>\n\n<blockquote>\n  <p>\"One fish\",<br>\n  \"Two fish\",<br>\n  \"Tuna's a large fish\",<br>\n  \"I breed several fishes\"</p>\n</blockquote>\n\n<p>What does plurality mean semantically and how does it reconcile with plurality in morphology? </p>\n\n<ul>\n<li>Could one say <em>forest</em> is the semantical plural of <em>tree</em>?</li>\n<li>How about words which have a plural that is morphologically entirely different from their singular (e.g. <em>person</em>, <em>people</em>)?</li>\n<li>How about words which take a different meaning with a plural inflexion (e.g. F. <em>vacance [vacancy]</em>, <em>vacances [holidays]</em>)?</li>\n</ul>\n\n<p>Please provide examples in your answer.</p>\n", "Id":"1296", "LastEditorUserId":"51", "FavoriteCount":"1", "AcceptedAnswerId":"1301", "Title":"Is there a difference between plurality in semantics and in morphology?", "CreationDate":"2012-01-17T23:56:38.077", "OwnerUserId":"682", "PostTypeId":"1", "Tags":"<morphology><semantics><grammatical-number><plurality>", "AnswerCount":"3", "comments":[], "LastEditDate":"2012-01-18T18:18:35.647", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"657", "LastActivityDate":"2012-01-28T00:28:54.733", "Score":"7", "CommentCount":"5", "OwnerUser":{"UpVotes":"11", "WebsiteUrl":"http://stackoverflow.com/users/717441/benjamin", "Id":"682", "AccountId":"369843", "CreationDate":"2012-01-17T21:01:13.080", "AboutMe":"<p>As a student in South Asian languages, culture and history, specialising in comparative cultures and cognitive science, I take special interest in the influence of cultural paradigms in the perception and interaction with the world in terms of development.\nI am also a polyglot with a strong passion for learning languages, including programming languages such as Python. Also I am firm supporter of unix and free software.</p>\n", "Age":"33", "Location":"Earth", "DownVotes":"1", "Views":"3", "Reputation":"273", "DisplayName":"Benjamin", "LastAccessDate":"2012-10-11T07:58:22.963"}}