{"Body":"<p>\"What\" is defined grammatically as an interrogative pronoun </p>\n\n<blockquote>\n  <p>... used interrogatively in asking for the specification of an identity, quantity, quality, etc. (Wiktionary)</p>\n</blockquote>\n\n<p>In dictionaries, however, <em>what</em> is never defined semantically. </p>\n\n<p>If I meditate on a word like <em>car</em>, I inevitably associate images, feelings and experience with the word. Even if I think of <em>nothingness</em> I somehow associate sensations and a mental image of emptiness (even if it may be wrong). When I contemplate the word <em>who</em>, I associate the word with a \"person whose identity is unknown\". When I think of <em>what</em> however, in terms of pragmatics, it seems to suggest a request for more information to the interlocutor, but semantically, I cannot find any meaning to it. </p>\n\n<p>Hence this odd question: </p>\n\n<p>What is the semantic meaning of <em>what</em> (or its equivalent in any language)? Could the meaning of <em>what</em> be defined as \"a thing unknown to me\"?</p>\n", "Id":"1297", "LastEditorUserId":"51", "Title":"The meaning of \"what\"?", "CreationDate":"2012-01-18T01:27:16.517", "OwnerUserId":"682", "PostTypeId":"1", "Tags":"<semantics><pronoun><pragmatics><interrogatives>", "AnswerCount":"2", "comments":[], "LastEditDate":"2012-01-18T18:16:57.457", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"181", "LastActivityDate":"2012-01-18T18:16:57.457", "Score":"4", "CommentCount":"10", "OwnerUser":{"UpVotes":"11", "WebsiteUrl":"http://stackoverflow.com/users/717441/benjamin", "Id":"682", "AccountId":"369843", "CreationDate":"2012-01-17T21:01:13.080", "AboutMe":"<p>As a student in South Asian languages, culture and history, specialising in comparative cultures and cognitive science, I take special interest in the influence of cultural paradigms in the perception and interaction with the world in terms of development.\nI am also a polyglot with a strong passion for learning languages, including programming languages such as Python. Also I am firm supporter of unix and free software.</p>\n", "Age":"33", "Location":"Earth", "DownVotes":"1", "Views":"3", "Reputation":"273", "DisplayName":"Benjamin", "LastAccessDate":"2012-10-11T07:58:22.963"}}