{"Body":"<p>Over on ELU the question <a href=\"http://english.stackexchange.com/questions/57402/is-betternt-an-ok-word-to-use#comment108760_57402\">Is “bettern't” an OK word to use?</a> drew me into debate about how significant \"childish errors\" are in the development of mainstream language. Hence, the question:</p>\n\n<p><strong>Are \"childish errors\" significant forces of language change?</strong></p>\n\n<p>I'll put my cards on the table and say straight off that my inclination is to think the answer is <em>\"not very\"</em>. Two reasons immediately come to mind...</p>\n\n<ul>\n<li><p>As an avid fan of Steven Pinker, I'm a great believer in the idea that children are to a considerable extent \"pre-programmed\" to emulate what they hear, rather than coin neologisms. And by implication, they're strongly motivated to quickly discard \"apparently logical\" forms when adults correct them (<em>\"Mummy! I be'ed wee-wee on the floor!\"</em> must have been said many times, but soon dropped).</p></li>\n<li><p>The ability to produce \"correct\" speech strongly correlates with social status, so parents have considerable motivation to ensure their children do this as early and well as possible.</p></li>\n</ul>\n\n<p>When I think about things like <a href=\"http://en.wikipedia.org/wiki/Orange_%28fruit%29#Etymology\" rel=\"nofollow\">the etymology of \"orange\"</a>, I don't really see this as relating to faulty language acquisition by children, but I freely admit I'm an armchair philologist in such matters.</p>\n", "Id":"1392", "LastEditorUserId":"33", "AcceptedAnswerId":"1404", "Title":"Significance of \"childish errors\" in mainstream language change", "CreationDate":"2012-02-08T16:27:33.123", "OwnerUserId":"282", "PostTypeId":"1", "Tags":"<language-change><language-acquisition>", "AnswerCount":"3", "comments":[], "LastEditDate":"2012-02-08T16:43:13.850", "LastEditedUser":{"UpVotes":"125", "WebsiteUrl":"http://www.cs.mcgill.ca/~akazna/", "Id":"33", "AccountId":"459207", "CreationDate":"2011-09-13T20:58:42.087", "AboutMe":"<p>From the School of Computer Science and Department of Psychology at McGill University, I marvel at the world through algorithmic lenses. My specific interests are in quantum computing, evolutionary game theory, modern evolutionary synthesis, and theoretical cognitive science. Previously I was at the Institute for Quantum Computing and Department of Combinatorics &amp; Optimization at the University of Waterloo and a visitor to the Centre for Quantum Technologies at the National University of Singapore.</p>\n\n<ul>\n<li><a href=\"http://egtheory.wordpress.com/\" rel=\"nofollow\">Theory, Evolution, and Games Group Blog</a></li>\n<li><a href=\"http://cstheory.blogoverflow.com/author/artemkaznatcheev/\">Theoretical Computer Science Blogoveflow</a></li>\n<li><a href=\"https://plus.google.com/u/0/101780559173703781847/\" rel=\"nofollow\">G+ profile</a></li>\n</ul>\n", "Age":"25", "Location":"Montreal, Canada", "DownVotes":"18", "Views":"25", "Reputation":"876", "DisplayName":"Artem Kaznatcheev", "LastAccessDate":"2014-01-11T00:59:33.567"}, "ViewCount":"265", "LastActivityDate":"2012-02-10T19:59:00.010", "Score":"4", "CommentCount":"7", "OwnerUser":{"UpVotes":"21", "WebsiteUrl":"", "Id":"282", "AccountId":"234202", "CreationDate":"2011-09-24T14:53:50.813", "AboutMe":"<p>The handle isn't randomly-chosen. I still type with two fingers after over 30 years as a solo custom software supplier, and I still mis-hit the keys!</p>\n\n<p>Actually, I've been in (involuntary) retirement for a year or so - giving me too much time on my hands, much of which I spend on Language.se gaining rep I probably don't deserve. But I do have a keen interest in all aspects of English for my own edification, plus I get a buzz out of the way EL&amp;U enables me to actively participate in fostering that same interest in others.</p>\n", "Age":"60", "Location":"United Kingdom", "DownVotes":"3", "Views":"11", "Reputation":"377", "DisplayName":"FumbleFingers", "LastAccessDate":"2013-11-10T21:17:40.387"}}