{"Body":"<p>Arising from discussion against <a href=\"http://english.stackexchange.com/questions/58199/against-traffic-or-against-the-traffic#comment110564_58199\">“Against traffic” or “Against the traffic”</a> on ELU, I wonder if anyone can give an authoritative opinion and/or supporting evidence for the proposition that Americans tend to interpret ambiguous embedded clauses within \"compound verb phrases\" differently to Brits.</p>\n\n<p>The specific example under consideration in that question had </p>\n\n<ul>\n<li><strong>...[a vehicle] driving against the traffic towards London...</strong></li>\n</ul>\n\n<p>i.e. - <em>driving against {the traffic towards London}</em> <strong>or</strong> <em>driving {against the traffic} {towards London}</em></p>\n\n<p>I assume that if you know already which direction the vehicle itself is heading, the \"correct\" interpretation will be transparently inferred on either side of the Atlantic without the ambiguity even being particularly noticed. But my question is whether there's any evidence to suggest a UK/US difference in interpretation <em>in the absence of disambiguating information</em>, and/or a tendency to avoid using the ambiguous construction at all.</p>\n\n<p>Apologies to anyone who thinks this should have been asked on ELU. I think it belongs here - but it's not really my call, so please just migrate it if I'm out of order.</p>\n", "Id":"1436", "AcceptedAnswerId":"1437", "Title":"Is there a US/UK difference in interpretation/usage of \"compound verb phrases\" split by an embedded clause", "CreationDate":"2012-02-16T15:33:53.980", "AnswerCount":"3", "Tags":"<cross-linguistic><american-english>", "PostTypeId":"1", "OwnerUserId":"282", "comments":[], "ViewCount":"106", "LastActivityDate":"2012-02-17T22:30:03.163", "Score":"2", "CommentCount":"1", "OwnerUser":{"UpVotes":"21", "WebsiteUrl":"", "Id":"282", "AccountId":"234202", "CreationDate":"2011-09-24T14:53:50.813", "AboutMe":"<p>The handle isn't randomly-chosen. I still type with two fingers after over 30 years as a solo custom software supplier, and I still mis-hit the keys!</p>\n\n<p>Actually, I've been in (involuntary) retirement for a year or so - giving me too much time on my hands, much of which I spend on Language.se gaining rep I probably don't deserve. But I do have a keen interest in all aspects of English for my own edification, plus I get a buzz out of the way EL&amp;U enables me to actively participate in fostering that same interest in others.</p>\n", "Age":"60", "Location":"United Kingdom", "DownVotes":"3", "Views":"11", "Reputation":"377", "DisplayName":"FumbleFingers", "LastAccessDate":"2013-11-10T21:17:40.387"}}