{"Body":"<p>When you ask most people the difference between common nouns and proper nouns they mostly can only tell you that proper nouns start with a capital letter.</p>\n\n<p>But this has problems:</p>\n\n<ul>\n<li>Capital letters and writing systems as a whole are recent inventions added on to language, which is ancient and naturally ocurring.</li>\n<li>Many if not most writing systems do not have a distinction between upper and lower case.</li>\n<li>Even among languages which use a dual case writing system, not all capitalize words the same way:\n<ul>\n<li>German capitalizes all nouns.</li>\n<li>Most romance languages at least do not capitalize the names of days of the week or months or the year whereas English does.</li>\n</ul></li>\n</ul>\n\n<p><strong>So is there a solid cross-linguistic concept of \"proper nouns\" within the discipline of linguistics, and if so how is it defined? Ie what criteria would an actual linguist use to decide whether a noun is common or proper?</strong></p>\n", "Id":"1529", "FavoriteCount":"2", "Title":"How are proper nouns distinguished from other nouns in linguistics (not in orthography)?", "CreationDate":"2012-03-01T12:44:58.050", "AnswerCount":"4", "PostTypeId":"1", "OwnerUserId":"51", "Tags":"<nouns><terminology><proper-nouns>", "comments":[], "ViewCount":"487", "LastActivityDate":"2013-01-24T15:21:42.057", "Score":"10", "CommentCount":"7", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}