{"Body":"<p>I edited this question in response to Karlsson's paper, \"Constraints on Multiple Center-Embedding of Clauses\" (Journal of Linguistics 43 (2), 2007, 365-392), linked here: <a href=\"http://www.ling.helsinki.fi/~fkarlsso/ceb5.pdf\" rel=\"nofollow\">http://www.ling.helsinki.fi/~fkarlsso/ceb5.pdf</a> .</p>\n\n<h3>Context</h3>\n\n<p>Given that Piraha (and Warlpiri) do not allow embedded clauses, and Piraha does not allow recursion at all, clause embedding is not universal to all languages. As Karlsson persuasively argues, full blown recursion developed in the historical period. I will assume this here, and I will not repeat Karlsson's arguments.</p>\n\n<p>In the Hebrew bible, there is no more than one embedded clause in any given sentence, consistent with Karlsson's bound for pre-literate societies, and there are grammar errors which suggest that the authors had a problem with complex sentences. As Karlsson explains, Greek and Latin writers developed full blown center-recursion explicitly somewhere around the 1st and 2nd centuries BC, and there is no evidence that recursion existed before then in any form</p>\n\n<h3>Hypothesis</h3>\n\n<p>As recursive embedding becomes common, it is possible that speakers prefer constructions which allow embedded clauses to take on different roles with no internal modifications. If you say</p>\n\n<ul>\n<li>I walked home-ward quickly</li>\n</ul>\n\n<p>and you try to modify home to the embedded noun-phrase \"the wide-open field where John slaughtered the goat\", you say</p>\n\n<ul>\n<li>I walked <em>wide-open field-ward where John slaughtered the goat</em></li>\n</ul>\n\n<p>this requires inserting a syllable in the <em>middle</em> of the noun-phrase \"wide-open field where John slaughtered the goat\". If you want to move the noun-phrase to the subject position of a different sentence, you need to scan the interior of the noun-phrase to remove the case-modifier:</p>\n\n<ul>\n<li><em>The wide-open field where John slaughtered the goat</em> is pretty.</li>\n</ul>\n\n<p>If you have a stand-alone preposition, no scan is required</p>\n\n<ul>\n<li>I walked to <em>the wide open field where John slaughtered the goat</em></li>\n</ul>\n\n<p>the words past \"to\" are exactly the same as when the noun-phrase is in the subject role. If the preposition can appear at the beginning of the phrase, it gives a clear \"push\" indicator for a mechanical parser, and it allows for trivial transformation of phrases to different roles.</p>\n\n<p>compare the cased:</p>\n\n<ul>\n<li>I walked store-from-ly <em>the wide open sheep grazing field-ward where John slaughtered the goat</em>.</li>\n</ul>\n\n<p>Store from-ly means \"from the store\" in a case approximation in English.</p>\n\n<ul>\n<li>I walked <em>the wide open sheep grazing field-from-ly where John slaughtered the goat</em> store-ward.</li>\n</ul>\n\n<p>to the uncased:</p>\n\n<ul>\n<li><p>I walked from the store to the wide open sheep grazing field where John slaughtered the goat.</p></li>\n<li><p>I walked to the store from the wide open sheep grazing field where John slaughtered the goat.</p></li>\n</ul>\n\n<p>There is no internal scan of the noun-phrases required in order to change their function. the words stay the same as the noun-phrase takes on different roles, only the preposition changes.</p>\n\n<p>The case-introducing/case-removing noun-phrase scan is really annoying. It is computationally taxing, and I believe that it creates a linguistic pressure to remove cases from a language, and replace these with prepositions. When there are no cases, you have effortless noun-phrase embedding--- you just change the preposition, which always appears at the beginning.</p>\n\n<p>I personally witnessed case-shedding events, in modern Hebrew. In the Bible, you would always say \"Halachti le-beyto\", \"I went to-his-house\" to mean \"I went to his house\", using a possessive marker on the word \"bayit\" (house). But modern Hebrew speaker will always say \"Halachti la-bayit shelo\", \"I went to the house of him\", precisely because the word \"shel\" can be used to embed, as in \"Halachti la-bayit shel ha-ach hagadol sheli\" \"I went to the house of my big brother\".</p>\n\n<p>In addition to a possessive marker, which was shed, Biblical Hebrew also has a \"to\" case, so that it says \"I walked Schem-ward\" (\"Halachti Schem-a\"). Modern Hebrew, despite prescriptivist admonitions, also dropped this case entirely, so that all modern speakers use the recursion friendly: \"I walked to shchem\" (\"Halachti le-Schem\").</p>\n\n<p>From my own native speaker intuition, I know that this is a consequence of the ubiquitous embedding in modern Hebrew. You don't say \"I walked city-ward by the sea\" in modern Hebrew, it is ungrammatical. you say \"I walked to the city by the sea\", with the exact same form as in English.</p>\n\n<p>The Bible doesn't embed very much, and if it wanted to do this, it would say it in a pre-literate way that suggests recursion is completely alien to the author: \"Halachti Schema, zu ha-'ir le-yad ha-yam\"/\"I walked city-ward, this is the city by the sea.\"</p>\n\n<p>So the hypothesis is that recursive languages shed their cases as soon as most speakers begin to produce and transform multiply embedded sentences on a regular basis. This happens at different times for different languages.</p>\n\n<h3>Predictions/Questions</h3>\n\n<p>This hypothesis makes the following predictions, and these are the questions I have:</p>\n\n<ul>\n<li>Cases should be most diverse and pronounced in non-embedding languages, like Piraha. This is true of Piraha. Is it true of other non-embedding languages?</li>\n<li>The most cased languages today should have a recent writing system, and the least cased languages should have an ancient writing system. For Russian and English, this works. Are there counterexamples?</li>\n<li>Are there opposite events where the case system was strengthened? Do these correspond to a loss of literacy?</li>\n</ul>\n", "Id":"1548", "LastEditorUserId":"810", "FavoriteCount":"3", "Title":"Did case systems dissappear to make embedding easier?", "CreationDate":"2012-03-03T06:12:32.840", "OwnerUserId":"810", "PostTypeId":"1", "Tags":"<cross-linguistic><linguistic-universals><word-order>", "AnswerCount":"4", "comments":[], "LastEditDate":"2012-03-08T04:17:04.543", "LastEditedUser":{"UpVotes":"39", "WebsiteUrl":"", "Id":"810", "AccountId":"528458", "CreationDate":"2012-03-03T03:39:07.707", "AboutMe":"<p>Everett is right. Chomsky was wrong. I want to know how recursion spread from Greece through the old world, and it seems we will find out. I am also curious about simpler examples of recursion, like list making.</p>\n\n<p>I mostly blindly follow Gell-Mann and agree with Joseph Greenberg about superfamilies and mass-comparison. I don't see any reason that the mass-comparison method cannot be made rigorous with good statistics.</p>\n\n<p>I like formal grammars, and I don't believe I understand something unless I can program a computer to understand it the same as me. My linguistic goal today is to write a good English parser. I think I can do at least marginally better than current parsers, which seem to be weighed down with theoretical cruft. Maybe it'll read a newspaper, maybe not. I hope to find out soon enough.</p>\n", "Age":"41", "Location":"New York City", "DownVotes":"0", "Views":"92", "Reputation":"481", "DisplayName":"Ron Maimon", "LastAccessDate":"2014-01-02T00:11:46.293"}, "ViewCount":"533", "LastActivityDate":"2012-07-19T21:51:33.130", "Score":"-2", "CommentCount":"24", "OwnerUser":{"UpVotes":"39", "WebsiteUrl":"", "Id":"810", "AccountId":"528458", "CreationDate":"2012-03-03T03:39:07.707", "AboutMe":"<p>Everett is right. Chomsky was wrong. I want to know how recursion spread from Greece through the old world, and it seems we will find out. I am also curious about simpler examples of recursion, like list making.</p>\n\n<p>I mostly blindly follow Gell-Mann and agree with Joseph Greenberg about superfamilies and mass-comparison. I don't see any reason that the mass-comparison method cannot be made rigorous with good statistics.</p>\n\n<p>I like formal grammars, and I don't believe I understand something unless I can program a computer to understand it the same as me. My linguistic goal today is to write a good English parser. I think I can do at least marginally better than current parsers, which seem to be weighed down with theoretical cruft. Maybe it'll read a newspaper, maybe not. I hope to find out soon enough.</p>\n", "Age":"41", "Location":"New York City", "DownVotes":"0", "Views":"92", "Reputation":"481", "DisplayName":"Ron Maimon", "LastAccessDate":"2014-01-02T00:11:46.293"}}