{"Body":"<p>Whilst it's by no means a \"fixed rule\", it seems to me the normal sequence for multiple adjectives applied to a single noun/verb in English does indeed tend to correspond to the top answer given in the ELU question <a href=\"http://english.stackexchange.com/questions/1155/what-is-the-rule-for-adjective-order\">What is the rule for adjective order?</a></p>\n\n<p>Comments in <a href=\"http://english.stackexchange.com/questions/60520/the-time-before-place-mantra/60522#comment115663_60522\">this question</a> (subsequently closed as a duplicate of the above) seem to suggest no such principle applies to Dutch. I'm not sufficiently multilingual to have direct personal knowledge of the situation with any language apart from English, but intuitively it seems unlikely only English has this characteristic.</p>\n\n<p>Quite possibly all languages have words roughly corresponding to adjective/adverb - but even if some don't, presumably <em>many/most</em> do. So my questions are</p>\n\n<ul>\n<li><p>Do most languages tend to have a preferred adjective sequence?</p></li>\n<li><p>If so, do any particular subsections of those sequences tend to occur in many different languages?</p></li>\n</ul>\n", "Id":"1607", "FavoriteCount":"1", "AcceptedAnswerId":"1609", "Title":"Are there any \"universal\" aspects to \"adjective sequence\"", "CreationDate":"2012-03-09T15:48:02.680", "AnswerCount":"2", "Tags":"<cross-linguistic><linguistic-typology><linguistic-universals>", "PostTypeId":"1", "OwnerUserId":"282", "comments":[], "ViewCount":"315", "LastActivityDate":"2012-03-09T16:36:48.750", "Score":"6", "OwnerUser":{"UpVotes":"21", "WebsiteUrl":"", "Id":"282", "AccountId":"234202", "CreationDate":"2011-09-24T14:53:50.813", "AboutMe":"<p>The handle isn't randomly-chosen. I still type with two fingers after over 30 years as a solo custom software supplier, and I still mis-hit the keys!</p>\n\n<p>Actually, I've been in (involuntary) retirement for a year or so - giving me too much time on my hands, much of which I spend on Language.se gaining rep I probably don't deserve. But I do have a keen interest in all aspects of English for my own edification, plus I get a buzz out of the way EL&amp;U enables me to actively participate in fostering that same interest in others.</p>\n", "Age":"60", "Location":"United Kingdom", "DownVotes":"3", "Views":"11", "Reputation":"377", "DisplayName":"FumbleFingers", "LastAccessDate":"2013-11-10T21:17:40.387"}}