{"Body":"<p>I've been listening to radio broadcasts lately where a person will be speaking German or Pashtun or Russian or whatever and a translator will be supplying an English rendition, in a format which makes it possible to hear both the original and the translation. </p>\n\n<p>I noticed that in almost every case, where the interpreter says something like, \"The problem is,\" or, \"the difficulty is,\" the speaker in the (to me) foreign language will also say the word, \"problem,\" identical to English and in the correct place, but merely accented in that language.</p>\n\n<p>And it got me to wondering: Is \"problem\" a modern word or a very old indo-european word? What is its etymology and history? Does it represent a concept which was foreign to non-European cultures before the modern era, or is the speaker making word choices to accommodate an interpreter? </p>\n", "Id":"1636", "LastEditorUserId":"51", "Title":"Is the word, \"problem,\" new to non-English languages?", "CreationDate":"2012-03-14T18:14:06.360", "OwnerUserId":"840", "PostTypeId":"1", "Tags":"<language-families><borrowing>", "AnswerCount":"1", "comments":[], "LastEditDate":"2012-03-15T11:05:16.980", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"316", "LastActivityDate":"2012-03-16T01:05:13.900", "Score":"3", "CommentCount":"2", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://www.parasiticmeme.com", "Id":"840", "AccountId":"92171", "CreationDate":"2012-03-14T18:13:43.180", "AboutMe":"<p>I'm a software developer working for a very small company, which sells simulators to cast metal foundries. In my line of work, I maintain code in Fortran, C/C++, C#, Visual Basic (6 and later), with plenty of WinForms and WPF thrown in.  </p>\n", "Age":"45", "Location":"Vancouver, WA", "DownVotes":"0", "Views":"0", "Reputation":"121", "DisplayName":"Rob Perkins", "LastAccessDate":"2012-03-16T21:45:45.137"}}