{"Body":"<p>In reading a paper by Anand &amp; Hacquard, I've come across the term \"witness world,\" where a witness world can verify a proposition, p. I haven't been able to google an easily understandable definition of a \"witness world,\" (although this is probably due to poor detective work on my part). This leads to my question: What is a witness world (i.e., how is it defined), and how does it do this business of verifying propositions?</p>\n\n<p>The closest thing that comes to my mind are witness sets, which, as I understand them, are the characteristic sets of generalised quantifiers, except that unlike characteristic sets for a GQ like [Q NP], which may have non-NP entities as members, witness sets only contain NP-entities. Szabolcsi (2010)'s example is \"more than one robot,\" where a characteristic set includes non-robots (i.e., any set that has more than one robot), but a witness set is constrained so that it only contains robots. </p>\n\n<p>I figured I could construct a sort of parallel, where a world would be a set of  pairs, so a \"witness world\" would be a set of these pairs (for a modal, or attitude predicate), but these pairs are somehow restricted by the prejacent or embedded clause's  assignment. But I wasn't sure how to proceed here (or whether I even should, in case there is no parallel, or I was going about the parallel in the wrong way). Which is my second related question - is the notion of \"witness world\" related to the notion of a \"witness set,\" and if so, how?</p>\n", "Id":"1638", "LastEditorUserId":"22", "AcceptedAnswerId":"1646", "Title":"What is a \"witness world\"? Is this notion related to \"witness sets\"?", "CreationDate":"2012-03-14T18:35:50.483", "OwnerUserId":"177", "PostTypeId":"1", "Tags":"<terminology><semantics>", "AnswerCount":"1", "comments":[], "LastEditDate":"2012-03-14T18:41:58.973", "LastEditedUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "ViewCount":"100", "LastActivityDate":"2012-03-15T15:47:06.347", "Score":"1", "CommentCount":"5", "OwnerUser":{"UpVotes":"6", "WebsiteUrl":"", "ProfileImageUrl":"http://i.stack.imgur.com/tqgTp.png", "Id":"177", "AccountId":"896176", "CreationDate":"2011-09-19T16:30:42.833", "AboutMe":"<p>Linguistics grad student. Research interests lie in formal semantics, the morphosyntax-semantics interface.</p>\n", "Location":"Canada", "DownVotes":"0", "Views":"9", "Reputation":"396", "DisplayName":"user177", "LastAccessDate":"2014-01-09T01:15:39.280"}}