{"Body":"<p>While learning (a little) Cantonese, I was annoyed by the fact that every initial [n] was converted to [l], so that the word \"you\", written</p>\n\n<blockquote>\n  <p>néih hóu</p>\n</blockquote>\n\n<p>in guidebooks is universally pronounced</p>\n\n<blockquote>\n  <p><em>léih</em> hóu</p>\n</blockquote>\n\n<p>People would, if pressed, say that the pronunciation is \"néih hóu\", and that they were using \"lazy pronunciation\" (see <a href=\"http://en.wikipedia.org/wiki/Cantonese_phonology\">Cantonese phonology</a>). The sound-shift was common to words with initial [n]. It did not appear in the superficial list of cross-linguistically regularly observed sound changes that I saw on Wikipedia, which were b>p>f, d>t>th and g>c>ch. These sound changes are just voicing/unvoicing toggles and turning into a fricative, both of which are simple transformations. Initial n to l is just strange (and, possibly coincidentally, it relates the semitic and Indo-European words for \"no\").</p>\n\n<p>I was wondering if [n] -> [l] is a sound change which is common cross-linguistically, whether it is directional (is it observed going the other way), if it is confined to the initial position, and more generally which transformations are known with what direction and probability. </p>\n", "Id":"1642", "LastEditorUserId":"306", "FavoriteCount":"1", "AcceptedAnswerId":"1653", "Title":"What about the sound change initial n -> initial l?", "CreationDate":"2012-03-15T08:41:30.773", "OwnerUserId":"810", "PostTypeId":"1", "Tags":"<phonology><sound-change>", "AnswerCount":"4", "comments":[], "LastEditDate":"2012-03-15T21:24:32.660", "LastEditedUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}, "ViewCount":"418", "LastActivityDate":"2012-03-16T00:15:34.463", "Score":"7", "CommentCount":"11", "OwnerUser":{"UpVotes":"39", "WebsiteUrl":"", "Id":"810", "AccountId":"528458", "CreationDate":"2012-03-03T03:39:07.707", "AboutMe":"<p>Everett is right. Chomsky was wrong. I want to know how recursion spread from Greece through the old world, and it seems we will find out. I am also curious about simpler examples of recursion, like list making.</p>\n\n<p>I mostly blindly follow Gell-Mann and agree with Joseph Greenberg about superfamilies and mass-comparison. I don't see any reason that the mass-comparison method cannot be made rigorous with good statistics.</p>\n\n<p>I like formal grammars, and I don't believe I understand something unless I can program a computer to understand it the same as me. My linguistic goal today is to write a good English parser. I think I can do at least marginally better than current parsers, which seem to be weighed down with theoretical cruft. Maybe it'll read a newspaper, maybe not. I hope to find out soon enough.</p>\n", "Age":"41", "Location":"New York City", "DownVotes":"0", "Views":"92", "Reputation":"481", "DisplayName":"Ron Maimon", "LastAccessDate":"2014-01-02T00:11:46.293"}}