{"OwnerDisplayName":"user325", "Body":"<p>The Person-Case Constraint (PCC) is a constraint on which arguments can co-occur in a construction such as a causative/applicative/ditransitive. It might cause a combination of persons to be ungrammatical or to be unavailable for processes like cliticization/agreement. It is a restriction that one argument must be \"more local\" in personhood, where 1(>)2>3. In Hakha Lai, the language I am interested in, you cannot use (most) applicatives in cases where the applicative object is less local than the theme. This is possibly because the verb wants to agree with the more local argument in general in HL, but the applicative also is highly prioritized for agreement (and other processes which enhance topicality). In the causative construction, this problem does not arise because there is default agreement with the causee.</p>\n\n<p>So, you cannot have a third person applicative object if the theme (direct object) is first or second person, and there is a weaker violation if the applicative is second person and the theme is first person. So, here would be the HL pattern, with the theme in bold and the (benefactive) applicative in italics:</p>\n\n<blockquote>\n  <p>ok He followed <strong>him</strong> for <em>you</em>. <br>\n  ok He followed <strong>him</strong> for <em>me</em>. <br>\n  ok He followed <strong>you</strong> for <em>me</em>. <br>\n  ?? He followed <strong>me</strong> for <em>you</em>. <br>\n  * He followed <strong>me</strong> for <em>him</em>. <br>\n  * He followed <strong>you</strong> for <em>him</em>.<br></p>\n</blockquote>\n\n<p>I am wondering if any languages with more robust person distinctions, for example a an inclusive/exclusive distinction, have a PCC. I would be interested in knowing whether there are any unique effects, for example if inclusive is more local than exclusive, whether it patterns with 1st rather than 2nd, etc.</p>\n", "Id":"1714", "FavoriteCount":"1", "Title":"Are there languages with PCC effects and a more developed person system?", "CreationDate":"2012-03-28T07:07:57.907", "AnswerCount":"1", "PostTypeId":"1", "LastEditorDisplayName":"user325", "Tags":"<syntax><morphology><cases><agreement>", "comments":[], "LastEditDate":"2012-03-28T23:54:08.877", "ViewCount":"107", "LastActivityDate":"2012-04-28T00:12:35.350", "Score":"7", "CommentCount":"6"}