{"OwnerDisplayName":"user325", "Body":"<p>This question occurred to me when studying Optimality Theory phonology. For reduplication in OT, the base of the stem (/reduplicated part) is taken to be the input for the reduplicated morph. However, sometimes the base and reduplicant differ. For example, if I was reduplicating a word like \"ban\" /ban-REDUP/ in a language with homorganic nasals, the result might come out as /bamban/. In OT, this is unexpected (the nasals are not in correspondence between the base and the reduplicant), although of course with a rule ordering approach one could have nasal assimilation occur later. Apparently this is also attested for processes of syncope, where in the surface form the stem has lost a vowel which the reduplicant contains. (I will find the real examples from actual languages later.) I should note, for (most?) other processes, it seems like the reduplicant <em>is</em> based off the surface form of the base. So, if the base contains an environment that triggers nasal harmony, the reduplicant will also appear nasalized even if the nasalization trigger is not copied and there is no other trigger for nasalization that could be affecting the reduplicant. </p>\n\n<p><strong>So, my question is: are certain processes more likely to be surface true cross-linguistically? If so, why? My intuition is that in some cases these effects might be phonetic, or closer to phonetic than phonological. NC assimilation and syncope certainly seem to be more \"surface-y\" and production-oriented than things like vowel/nasal harmony, etc, although I am not sure of how to formalize that intuition.</strong></p>\n\n<p>PS I'm not sure whether \"reduplicant\" is the real/correct word for a reduplicated morph. Please fix if there is a better term. </p>\n\n<p>UPDATE Here are the real reduplication examples.</p>\n\n<p><em>Manam</em>: <br>\nmalaboŋ-RED --> malabom-boŋ 'species of flying fox' <br>\nzim-RED-i --> zin-zim-i 'it is black' <br></p>\n\n<p>Notice that the reduplicated suffix is more faithful to the input than the base, since the presumed base shows nasal assimilation.</p>\n\n<p><em>Klamath</em>:  <br>\nRED-poli:-ḱa --> po-pli:ḱa 'little policeman (DIST)' <br>\nRED-mbodý-dk --> mbo-mpditk 'wrinkled up (DIST)' <br>\nRED-pniw-abć-a --> pni-pno:pća 'blow out (DIST)' <br></p>\n\n<p>Notice that in the surface forms, syncope has occurred in the base but not the reduplicated morph. But the reduplicant must be able to copy the stem's vowel before syncope occurs... note that it cannot be the case that they are filled in with a default vowel.</p>\n\n<p>In contrast, here is the 'normal' state of affairs, in which the reduplicant seems to be copied from the surface representation of the stem (=the base).</p>\n\n<p><em>Javanese</em>: <br>\n/abur/ <br>\nRED-abʊr --> a.<strong>bʊ</strong>.r-a.bʊr <br>\nc.f. RED-abur-e --> a.bu.r-a.bu.re <br></p>\n\n<p>In this language, /i, u/ become lax /ɪ, ʊ/ in a closed syllable. Reduplicants show lax vowels (bolded in the above example) even when they end up not being in a closed syllable themselves.</p>\n\n<p>(All examples from a handout from Gene Buckley)</p>\n", "Id":"1717", "LastEditorUserId":"111", "FavoriteCount":"1", "Title":"Are certain phonological processes more likely to be surface true?", "CreationDate":"2012-03-28T15:44:52.193", "AnswerCount":"1", "PostTypeId":"1", "Tags":"<phonology><phonetics><cross-linguistic><optimality-theory><reduplication>", "comments":[], "LastEditDate":"2012-03-29T14:56:15.710", "LastEditedUser":{"UpVotes":"308", "DownVotes":"10", "Id":"111", "AccountId":"514008", "Views":"172", "Reputation":"5430", "CreationDate":"2011-09-14T09:33:29.710", "DisplayName":"Alenanno", "LastAccessDate":"2014-01-19T00:38:35.883", "AboutMe":"<p>I'm a student majoring in Languages (branch: Linguistics), currently working as a freelance translator. I've recently discovered <a href=\"http://db.tt/WpiKeReH\" rel=\"nofollow\">Dropbox</a> and I'm going to use it for my needs! :)</p>\n\n<p><em><strong>I love</em></strong><br>\nLanguages, Movies (Fantasy, Sci-Fi, Tarantino, etc.), Music, 3D Graphics, books and so on. </p>\n\n<p>Appointed ♦ Moderator Pro Tempore on <a href=\"http://area51.stackexchange.com/proposals/6673/linguistics?referrer=GlDGLdkDYNxMg1X13CJ1vg2\">Linguistics SE</a>, <a href=\"http://area51.stackexchange.com/proposals/6388/chinese-language-usage?referrer=XzTG1Nz01tc01sJEhak_6g2\">Chinese SE</a> and the <a href=\"http://area51.stackexchange.com/proposals/10848/russian-language-usage?referrer=J7IYS3ZUomUDvVVb-6SmDQ2\">Russian SE</a> site. If you're interested in other Stack Exchanges, try the <a href=\"http://area51.stackexchange.com/proposals/42949/italian-language-usage?referrer=ALVtGpK0tjLp1Lw15QCaUA2\">Italian SE</a> site.</p>\n\n<p>I like to lurk on other sites' Metas. <em>Meta is fun!</em> </p>\n\n<p><strong>My feature requests</strong>:</p>\n\n<ol>\n<li><a href=\"http://meta.stackoverflow.com/q/135786/176533\">Alert a moderator when an answer is improved after a post notice</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/138273/176533\">Automatically add chat event to the community bulletin (or make it easier)</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/121363/176533\">Give 10k users the ability to see the total count of flags they've handled</a></li>\n</ol>\n\n<p><strong>Moderator issues</strong>: If you have concerns or want to contact me about my moderation, you can find/ping me either in the <a href=\"http://chat.stackexchange.com/rooms/1336/linguistics\">Linguistics SE chat room</a> or <a href=\"http://chat.stackexchange.com/rooms/1984/chinese-language-and-usage\">CL&amp;U chat room</a>; if I'm not there or I'm \"idle\", just ping me! Please <em>avoid</em> using my personal email for such things. Use the chat rooms.</p>\n\n<hr>\n\n<p><strong>Languages List</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <sup>Languages with  * = learning on my own</sup></p>\n\n<p><strong>Mother Tongue:</strong> Italian, Sardinian;<br>\n<strong>Fluent:</strong> English, Spanish;<br>\n<strong>Less Fluent:</strong> French, German, Russian;<br>\n<strong>Learning:</strong> Japanese*, Chinese*, Swedish*, Greek*, Finnish*;<br>\n<strong>Willing to learn:</strong> Welsh, Korean, Dutch, Arabic, Hebrew, Hindi [to be continued]</p>\n\n<p>Me gusta el Español.<br>\nJ'aime le Français.<br>\nDeutsch gefällt mir.<br>\nМне нравится Русский язык.<br>\n私は日本語が好きです。<br>\n我爱中文。<br>\nJag älskar Svenska.</p>\n"}, "ViewCount":"223", "LastActivityDate":"2012-06-27T20:36:50.847", "Score":"5", "CommentCount":"3"}