{"Body":"<p>After reading <a href=\"http://linguistics.stackexchange.com/a/1735/51\">Joe Martin's enlightening answer to the question \"Are there counterparts to phones and phonetics for signed languages?\"</a> I immediately began to wonder how much further spoken and signed phones' similarities might go.</p>\n\n<p>For instance in all spoken languages the phones can be divided into vowels and consonants (plus the small category of semivowels).</p>\n\n<p>Further all spoken languages' vowels can be analysed various ways such as monophthong / diphthong / triphthong; high / low + front / back + rounded or not + some other features. Consonants are usually graphed with the major features of \"place of articulation\" on the X-axis and \"manner of articulation\" on the Y-axis, and other features being treated in various ways.</p>\n\n<p>So my question is <strong>Are there any generally accepted counterparts to these systems that are applied to all signed languages generally?</strong></p>\n\n<p>(And don't worry, I'm not asking whether sign languages have \"voiced\" and \"unvoiced\", or any other exact counterpart to any specific aspect of spoken languages, if signed languages are divided into one or five parts where spoken languages are broken into the two of vowel and consonant is just as interesting.)</p>\n", "Id":"1737", "FavoriteCount":"1", "AcceptedAnswerId":"1739", "Title":"Is there a cross-linguistic subdivision of phones in signed languages akin to how all spoken languages have vowel and consonant phones?", "CreationDate":"2012-04-02T11:32:08.443", "AnswerCount":"2", "Tags":"<phonetics><cross-linguistic><sign-languages><phones>", "PostTypeId":"1", "OwnerUserId":"51", "comments":[], "ViewCount":"140", "LastActivityDate":"2012-04-15T02:45:34.533", "Score":"5", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}