{"Body":"<p>It has seemed to me (though I might be wrong) that languages usually take either <em>prepositions</em> (English, German, Spanish) or <em>postpositions</em> (Japanese, Hungarian, Turkish). (Yes I know sometimes a different term is used as for Chinese but those come before the noun like in English).</p>\n\n<p>But I've noticed as I learn more about some languages that they have exceptions. For instance, English <em>ago</em> acts much more like a postposition than a preposition (though dictionaries traditionally call it an adverb). Georgian, which I'm currently learning, has most postpositions. But it also has <a href=\"http://en.wiktionary.org/wiki/%E1%83%92%E1%83%90%E1%83%A0%E1%83%94%E1%83%A8%E1%83%94\">გარეშე (gareshe)</a>, which can be used as both postposition and preposition. I've also read that it has some prepositions borrowed from Russian but I haven't learned any of those yet.</p>\n\n<p>So is this a case where \"there's an exception to every rule\" and most languages turn out to have a few instance of the opposite <a href=\"http://en.wikipedia.org/wiki/Preposition_and_postposition\">adposition</a> to how they are usually classified, or have I chanced to bump into some of the rare exceptions?</p>\n", "Id":"1762", "Title":"How usual is it for languages to have both prepositions and postpositions?", "CreationDate":"2012-04-06T10:47:29.010", "AnswerCount":"4", "PostTypeId":"1", "OwnerUserId":"51", "Tags":"<syntax><linguistic-typology><adpositions><prepositions>", "comments":[], "ViewCount":"341", "LastActivityDate":"2012-06-05T10:16:07.447", "Score":"7", "CommentCount":"6", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}