{"Body":"<p>The question is a bit more specific than title would suggest, but I was not creative enough to put it so specifically into compact form. Let me explain. <br>\nWhen I was a kid I was learning English in elementary school, but I've also watched lot of Cartoon Network which drastically expanded my vocabulary (at least, that's my impression), so in that case it definitively helped. But in that case, for one, I was a kid, second I already had some basic knowledge, which we constantly upgraded. <br>\nThe present situation is that I want to learn Norwegian. I did acquire some very basic knowledge, like saying \"I want something to eat\" or \"Where is Parliament street?\" by listening to Pimsleur Norwegian lectures. But when I watch a Norwegian movie or show I practically don't understand anything.<br>\nThe question is, should I expect this to change all \"by it self\", will I, if, for example I watch 1h per day of some Norwegian show, start to understand the language, acquire vocabulary, understand it completely?<br>\nI'm sure that listening to a language helps in situations where you have some basic understanding and you understand every third word and your brain then connects the dots and you acquire new words as the time passes. <br>\nBut does that happen, even if you don't understand a single word in most of the sentences (ok, I understand \"are\" , \"you\", \"yes\", \"I\"... a very basic set of words)? Is there some threshold of needed vocabulary so you can build on just by listening?<br>\n<br>\nHere is a <a href=\"http://linguistics.stackexchange.com/questions/119/language-acquisition-without-interactive-contact-with-fluent-speakers\">similar question</a>, but it was asked in context of kids.\n<br><br>\nEDIT:\nI would make a distinction of interaction and listening without interaction. For example, if you put me in some Chinese village, we couldn't understand each other a word, but by interacting with people, using hands etc, as time passes I could pick some words and as time passes I'd probably understand the language. This question is in context of passive listening/watching. </p>\n", "Id":"1792", "LastEditorUserId":"926", "AcceptedAnswerId":"1826", "Title":"Can I learn a new language just by listening or watching videos?", "CreationDate":"2012-04-15T17:01:09.613", "OwnerUserId":"926", "PostTypeId":"1", "Tags":"<language-acquisition><norwegian>", "AnswerCount":"3", "comments":[], "LastEditDate":"2012-04-15T17:11:53.437", "LastEditedUser":{"UpVotes":"2", "Location":"Croatia", "DownVotes":"0", "Id":"926", "AccountId":"397386", "Views":"1", "Reputation":"138", "CreationDate":"2012-04-15T00:20:44.987", "DisplayName":"enedene", "LastAccessDate":"2012-07-04T09:47:23.857", "Age":"32"}, "ViewCount":"895", "LastActivityDate":"2012-07-04T02:35:19.250", "Score":"7", "CommentCount":"6", "OwnerUser":{"UpVotes":"2", "Location":"Croatia", "DownVotes":"0", "Id":"926", "AccountId":"397386", "Views":"1", "Reputation":"138", "CreationDate":"2012-04-15T00:20:44.987", "DisplayName":"enedene", "LastAccessDate":"2012-07-04T09:47:23.857", "Age":"32"}}