{"Body":"<p>Given a large number of sets of historical documents that are each divided into two subsets: each subset advocating a position in a legal dispute (i.e. one set for a plaintiff and one for a defendant), and the outcome of the dispute is known: What are the linguistic qualities that one could use to identify an objective metric that correlates with successful outcomes (i.e. persuasiveness)?</p>\n\n<p>In other words, if you have lots of historical legal documents and know the outcome, what sort of metrics might one use to decide which has linguistic qualities that correlate with persuasion?</p>\n\n<p>For example, given two pieces advocating the same essential fact:</p>\n\n<blockquote>\n  <p>The plaintiff takes the position that on May 12, 2009 the defendant was responsible for the destruction of the vehicle.</p>\n</blockquote>\n\n<p>versus</p>\n\n<blockquote>\n  <p>John Doe destroyed the vehicle.</p>\n</blockquote>\n\n<p>In this example, the following things may (or may not) be relevant, but are probably worth comparing:</p>\n\n<ol>\n<li><p>Use of deferential phrases \"The plaintiff takes the position that ...\" versus absolute statements \"The defendant destroyed\"</p></li>\n<li><p>The use of an impersonal identifier (\"the defendant\") versus a personal name (\"John Doe\").</p></li>\n<li><p>Length of the words used, and length of the sentences.</p></li>\n<li><p>Inclusion of dates (May 12, 2009)</p></li>\n</ol>\n\n<p>What other metrics might be useful for drawing conclusions about the persuasiveness of language?</p>\n\n<p>Note, for clarity, this question is not asking what linguistic qualities are indicators of persuasiveness, but rather what qualities one might want to consider to develop useful (or at least interesting) barometers of persuasiveness.</p>\n", "Id":"1848", "FavoriteCount":"1", "Title":"Metrics of evaluating the successfulness of persuasive language", "CreationDate":"2012-04-27T19:30:48.137", "AnswerCount":"1", "PostTypeId":"1", "OwnerUserId":"962", "Tags":"<historical-linguistics><philosophy-of-language>", "comments":[], "ViewCount":"71", "LastActivityDate":"2012-04-28T04:18:10.723", "Score":"1", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://example.com", "Id":"962", "AccountId":"10223", "CreationDate":"2012-04-27T19:14:51.150", "AboutMe":"Happy user of Django, Python, Perl, C++, Tex, Javascript, PostgreSQL.", "Age":"36", "Location":"Canada", "DownVotes":"0", "Views":"0", "Reputation":"106", "DisplayName":"Brian M. Hunt", "LastAccessDate":"2012-04-27T19:30:16.530"}}