{"Body":"<p>In English, and no doubt in many other languages, instruments can be subjects.  We can speak not only of John (an agent) cutting the canvas, but also of the knife (an instrument) cutting the canvas.   As others have pointed out, though I can't find the exact reference, not every instrument can be a subject in English.  We can cut paper with scissors, and scissors can cut the paper.   On the other hand, we can eat soup with a spoon, but the spoon can't eat the soup.  Hence we have a distinction between a secondary agent (the scissors, which do something caused or controlled by the agent) and a tool (the spoon, which helps the agent do something).  </p>\n\n<p>My question is, are there languages in which instruments can't be subjects?   For example, do languages with semantic alignment permit instrumental subjects?   On a hierarchy of animacy, for example, \"scissors\" are much lower than first person, second person, and active beings like people and animals.   So how could a word meaning \"scissors\" be a subject in such a language in sentences with active declarative meanings where nothing is marked with an inverse morpheme?     </p>\n", "Id":"1850", "LastEditorUserId":"51", "FavoriteCount":"1", "AcceptedAnswerId":"2639", "Title":"Are there any languages that don't permit instrumental subjects?", "CreationDate":"2012-04-28T03:35:49.187", "OwnerUserId":"790", "PostTypeId":"1", "Tags":"<syntax>", "AnswerCount":"1", "comments":[], "LastEditDate":"2012-04-28T11:17:15.200", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"212", "LastActivityDate":"2012-10-02T06:23:02.050", "Score":"16", "CommentCount":"11", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}