{"Body":"<p>At omniglot.com, we find scripts whose characters more-or-less stand for consonant phonemes, or all phonemes, or syllables, or words.  But I've never heard of a language whose written form consists entirely of phonemic symbols plus separate symbols for grammatical morphemes whether free (like adpositions or conjunctions) or bound (like case or tense affixes).   </p>\n\n<p>Has any of the readers heard of such a script?</p>\n\n<p>In English writing, we have a limited number of grammatical morpheme characters on our keyboards, such as \"&amp;\" and \"@,\" but we don't use them in formal prose.  But I'm talking about a writing system with a bigger repertoire of grammatical morpheme characters. </p>\n", "Id":"1851", "LastEditorUserId":"62", "FavoriteCount":"1", "AcceptedAnswerId":"1888", "Title":"For natural languages, are there writing systems that consist entirely of signs for phonemes on one hand and grammatical morphemes on the other?", "CreationDate":"2012-04-28T03:47:15.333", "OwnerUserId":"790", "PostTypeId":"1", "Tags":"<morphology><phonemes><orthography>", "AnswerCount":"1", "comments":[], "LastEditDate":"2012-05-05T20:37:26.873", "LastEditedUser":{"UpVotes":"33", "WebsiteUrl":"http://www.tdhsmith.com", "Id":"62", "AccountId":"558608", "CreationDate":"2011-09-13T21:40:09.490", "AboutMe":"<p>I'm a graduate in mathematics currently pursuing linguistics; I am primarily interested in syntax, semantics, and language documentation, especially in regard to special registers and/or signed languages, but I enjoy just about anything language-related.  In my spare time I enjoy travelling, computer programming, geocaching, bad puns, obscure board game variants, urban farming, and all kinds of food.</p>\n", "Age":"25", "Location":"United States", "DownVotes":"2", "Views":"6", "Reputation":"470", "DisplayName":"tdhsmith", "LastAccessDate":"2012-09-04T04:59:08.823"}, "ViewCount":"131", "LastActivityDate":"2012-05-06T16:23:38.403", "Score":"4", "CommentCount":"2", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}