{"Body":"<p>I've never heard of a natural language that has ergative-absolutive marking alone.   From what I've read, languages with said marking also have nominative-accusative marking, with the choice or \"split\" between the two types of marking conditioned by some semantic or syntactic factor.  For example, in some languages we see the following:  Clauses whose subjects are most likely to be agents have nominative-accusative marking.   So we have \"I-nom.  ate the pork-acc..\"   But clauses whose subjects are less likely to be agents have ergative-absolutive marking.   So we have \"The rock-erg. hit the car-abs.\"  </p>\n\n<p>But from what I've read, said split can be conditioned by factors other than the agency, including aspect!   Though I know that aspect <em>does</em> condition such a split, but <em>why</em> does it do so?   What's the semantic or cognitive logic behind this? </p>\n", "Id":"1920", "LastEditorUserId":"51", "FavoriteCount":"1", "AcceptedAnswerId":"1928", "Title":"How does aspect condition an ergative split?", "CreationDate":"2012-05-13T06:04:26.957", "OwnerUserId":"790", "PostTypeId":"1", "Tags":"<syntax><aspect><ergativity>", "AnswerCount":"2", "comments":[], "LastEditDate":"2013-07-11T09:34:26.740", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"140", "LastActivityDate":"2013-07-11T09:34:26.740", "Score":"5", "CommentCount":"4", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}