{"Body":"<p>(Edited to provide context and clarify what I'm interested in)</p>\n\n<p>Context: I am reading a paper that involves comparing German, Dutch, and English. German is the outlier for the phenomena and measures discussed in the paper; I believe this is partially explainable by the difference in the degree of synthesis (as approximated by average morphemes/word ratio). As well, I think that repeating the procedures described in this paper on a language more synthetic than German would show a trend. Another paper relevant to the first has some measures related to Russian, so I am curious about Russian in particular - how synthetic is it, relative to any of the other languages involved (especially the two outliers of the three used in the first study)? I am interested in a morphemes/word ratio in particular as a simple cross-linguistic and <em>quantitative</em> point-measurement that also allows for <em>easy relative comparisons</em>.</p>\n\n<p>Accordingly, if there's some general typology survey out there that gives average morpheme/word ratios for a bunch of languages (including enough of the ones I might find useful or generally interesting) - that would suffice.\nAlternatively, if someone only knows of papers surveying the specific languages I've mentioned - that's fine, too.</p>\n\n<p>Searches for \"morpheme per word\" (with an optional search term of a specific language) don't seem to yield anything with actual numbers, although I'm certain I've seen numbers for English and German before.</p>\n", "Id":"1936", "LastEditorUserId":"1011", "Title":"Citations for morpheme/word counts?", "CreationDate":"2012-05-15T09:06:07.857", "OwnerUserId":"1011", "PostTypeId":"1", "Tags":"<morphology><linguistic-typology><reference-request><morphological-typology>", "AnswerCount":"1", "comments":[], "LastEditDate":"2012-05-16T00:51:47.747", "LastEditedUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1011", "AccountId":"1115479", "Views":"2", "Reputation":"11", "CreationDate":"2012-05-15T08:55:54.937", "DisplayName":"EM23", "LastAccessDate":"2013-12-18T06:52:00.370"}, "ViewCount":"126", "LastActivityDate":"2012-05-16T00:51:47.747", "Score":"2", "CommentCount":"1", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1011", "AccountId":"1115479", "Views":"2", "Reputation":"11", "CreationDate":"2012-05-15T08:55:54.937", "DisplayName":"EM23", "LastAccessDate":"2013-12-18T06:52:00.370"}}