{"Body":"<p>The other day I was filling out a form where I had to state my native language and I simply couldn't seem to find an answer to that question. I guess it had never come across me, but I simply had never thought about what my native language was. You see, my first language, or rather the one that my parents taught me, was Portuguese but at a very early age (of around seven or so) I moved to the US where I learned and began using English. </p>\n\n<p>Today, English is the language I'm most comfortable with as well as the one I speak best. Although I no longer live in the US, whenever I have to read something, I do it in English and I understand it far better than if I read it in Portuguese. Not that I don't speak Portuguese, I do, I just make an unusual amount mistakes and have some trouble understanding more complex texts (such as classical novel that an average student would, for example). What further complicates the problem, is that I feel I have a bit accent in both languages, albeit not a very noticeable one. People generally say I only have an accent in Portuguese but I don't know, I still feel as if I also had a bit of a Brazilian accent in English. </p>\n\n<p>So which one do you think is my native language? English or Portuguese?</p>\n", "Id":"1994", "LastEditorUserId":"3020", "FavoriteCount":"1", "Title":"Determining my native language", "CreationDate":"2012-05-27T05:13:34.737", "OwnerUserId":"1051", "PostTypeId":"1", "Tags":"<native-language><multilingualism><bilingualism>", "AnswerCount":"4", "comments":[], "LastEditDate":"2014-01-15T16:50:34.093", "LastEditedUser":{"UpVotes":"3", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/Pc82Y.jpg?s=128&g=1", "Id":"3020", "AccountId":"2596734", "Views":"1", "Reputation":"167", "CreationDate":"2014-01-13T16:08:59.447", "DisplayName":"Marjeta", "LastAccessDate":"2014-01-17T20:16:21.790"}, "ViewCount":"324", "LastActivityDate":"2014-01-15T16:50:34.093", "Score":"4", "CommentCount":"3", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"", "DownVotes":"0", "Id":"1051", "AccountId":"439699", "Views":"0", "Reputation":"21", "CreationDate":"2012-05-27T04:32:16.300", "DisplayName":"Walker", "LastAccessDate":"2012-06-03T19:19:28.683", "AboutMe":""}}