{"Body":"<p><em>(This question has been almost entirely revised in presentation, though it still seeks the same answer. Apologies for any comments or answers that might be rendered less relevant because of the changes. Also, apologies for the length. It's a tough concept to express accurately)</em></p>\n\n<p>My question essentially starts with the premise that I think it's reasonable to propose that it is much more difficult to physically build a keyboard for a language that has 2000 written characters than a language that has 20. Note that I didn't say \"impossible\", just <em>more difficult</em>. If your language has 20 characters, it's a no brainer to make each character one key, and you're done. If you have to make it the interface for 2000 characters, the one key per character model is unfeasible, and so you necessarily have to create some kind of intermediary step. Thus, \"more difficult.\"</p>\n\n<p>I write in Japanese, and live in Japan, and (almost) every keyboard I have ever seen for writing Japanese characters uses the English alphabet. Japanese words are written more or less phonetically in English, and then an <a href=\"http://en.wikipedia.org/wiki/Input_method\" rel=\"nofollow\">IME</a> converts them to the Japanese syllabary, and that is once again converted to the appropriate kanji by making selections from a menu of options.</p>\n\n<p>This keyboard technology was developed in the west where representing written characters was not a problem, and then adopted by use of intermediary steps to facilitate writing Japanese.</p>\n\n<p>The question now starts to take shape, which is, did it have to go this way, or, at least, was it <em>more likely</em> to go this way? Does English lend itself to input into computers more easily earlier in technological advancement? Or is that just the way it happened to have played out and it could have gone any way?</p>\n\n<p>Lest we focus too much on keyboards, let me clear that to me it's just potentially symptomatic of a broader concept. Around the 1950s and 1960s, computing resources were precious. Entering, storing, and transmitting data was so costly, that even seemingly insignificantly small English words were deemed too long to be used as commands. In Unix, one types <code>ls</code> to get the list of contents in a directory, instead of the word <code>list</code>.</p>\n\n<p>What I am asking, then, comes down to a concept of a technological bottleneck, or even wall along the path of computational technology development. At the start when you have something like a Babbage machine that works almost entirely in numbers, it doesn't matter what your languages writing system is because it's all hard wired mathematical operators and numbers. Later in computational development, you can create all manner of IME and enter in any writing system you want.</p>\n\n<p>But in the middle, might it not be the case that, pragmatically, it would be too challenging to get a massive character set to be represented under such constrictions? Wouldn't engineers necessarily create a short hand set of characters, the same way they made short hands versions of English words?</p>\n\n<p>If you had only Kanji, would you necessarily have to develop an intermediate, smaller character set (or leverage one like hiragana or katakana) for the purposes of computer commands and data entry? Is there another way around it?</p>\n\n<p>If computational technology had developed in a society that used hieroglyphics, how, if possible, would you go from Babbage to modern IMEs without sacrificing anything about the way you write by hand?</p>\n", "Id":"2090", "LastEditorUserId":"913", "FavoriteCount":"3", "Title":"Would an extended alphabet have been a hindrence to inventing computer technology?", "CreationDate":"2012-06-12T14:50:21.813", "OwnerUserId":"913", "PostTypeId":"1", "Tags":"<written-language>", "AnswerCount":"5", "comments":[], "LastEditDate":"2012-08-20T06:54:31.460", "LastEditedUser":{"UpVotes":"4", "WebsiteUrl":"", "DownVotes":"0", "Id":"913", "AccountId":"61851", "Views":"0", "Reputation":"154", "CreationDate":"2012-04-09T03:09:06.597", "DisplayName":"Dave M G", "LastAccessDate":"2013-03-12T12:22:23.810", "AboutMe":"<p>Just stopping by to ask a question or two.</p>\n"}, "ViewCount":"306", "LastActivityDate":"2013-03-15T12:34:27.053", "Score":"5", "CommentCount":"6", "OwnerUser":{"UpVotes":"4", "WebsiteUrl":"", "DownVotes":"0", "Id":"913", "AccountId":"61851", "Views":"0", "Reputation":"154", "CreationDate":"2012-04-09T03:09:06.597", "DisplayName":"Dave M G", "LastAccessDate":"2013-03-12T12:22:23.810", "AboutMe":"<p>Just stopping by to ask a question or two.</p>\n"}}