{"Body":"<p>I'm currently writing a term paper where I am comparing <code>if... then...</code>, <code>only if...</code>, and <code>if... only then...</code> statements.</p>\n\n<p>I've noticed that <code>only if p q</code> and <code>if p, only then q</code> have the same truth conditions (namely <code>q implies p</code>). Additionally, unlike <code>if... then...</code> statements, both show a preference for subject-verb inversion:</p>\n\n<blockquote>\n  <p>If Mary tells John (then) it will ruin the surprise.<br>\n  *If Mary tells John (then) will it ruin the surprise.</p>\n  \n  <p>Only if Mary tells John will it ruin the surprise.<br>\n  *Only if Mary tells John it will ruin the surprise.</p>\n  \n  <p>If Mary tells John, only then will it ruin the surprise.<br>\n  *If Mary tells John, only then it will ruin the surprise.</p>\n</blockquote>\n\n<p>However, there are differences. While <code>if... then...</code> seems to allow \"then\" to be elided at will, <code>only if...</code> seems to strictly ban \"then\" while <code>if... only then...</code> seems to strictly require it:</p>\n\n<blockquote>\n  <p>If Mary tells John (then) it will ruin the surprise.<br>\n  ?Only if Mary tells John then will it ruin the surprise.<br>\n  *If Mary tells John, only will it ruin the surprise.</p>\n</blockquote>\n\n<p>My intuition is that <code>only if...</code> and <code>if... only then...</code> share the same syntactic structure but undergo different overt raisings and that the differences in \"then\" insertion are due to those raisings.</p>\n\n<p><strong>UPDATE</strong> - According to the link in Alex B.'s comment, \"if\" is a complementizer and the related CP is simply adjuncted on to a VP. That VP is embedded in an IP (where \"then\" is an inflectional). Also, the CP headed by \"if\" has the potential to raise to SpecIP. So far so good.</p>\n\n<p><s>I am assuming that the \"only\" phrase must scope immediately over the \"if\" CP because if it scopes immediately over IP then we incorrectly predict the following struture is possible:</s><br>\nI am guessing that the \"only\" phrase must come immediately over the IP since it is the only way to explain the following structure:</p>\n\n<blockquote>\n  <p>only (?then) q if p<br>\n  (You should) only call the police if you see something suspicious<br>\n  If you see something suspicious, only then (should you) call the police  </p>\n</blockquote>\n\n<p>This still leaves me with the problem of what the \"only\" phrase is. It is modifying an IP, thus cannot be adjectival nor adverbial.</p>\n\n<p>Also, I still have the issue of \"then\" support. This isn't that big a deal. It seems analoguous to the problem of why C is null for non-embedded CP (in English).</p>\n\n<p><strong>NOTE</strong> - Although this is related to my term paper, this is not the topic of my term paper. Still, I understand if some people do not want to give overt answers.</p>\n", "Id":"2157", "LastEditorUserId":"1055", "Title":"Do \"only if...\" and \"if... only then...\" have the same LF representation?", "CreationDate":"2012-06-21T07:17:57.133", "OwnerUserId":"1055", "PostTypeId":"1", "Tags":"<syntax><semantics><syntax-trees>", "comments":[], "LastEditDate":"2012-06-22T04:25:12.310", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "ViewCount":"253", "LastActivityDate":"2012-06-22T04:25:12.310", "Score":"5", "CommentCount":"2", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}