{"Body":"<p>Recently I've begun to wonder how many possible forms can be made from a single Japanese verb.</p>\n\n<p><a href=\"http://japanese.stackexchange.com/questions/6308/how-many-forms-can-a-japanese-verb-take\">I asked a similar question first on the Japanese Language &amp; Usage site</a>, where I received some comments and answers that surprised me. So I'm expecting interest from a different angle by the linguist types here on this site.</p>\n\n<p>For comparison, typical English verbs have four or fives forms depending on whether they have a regular or irregular past participle but the copula <em>to be</em> has eight forms, not counting archaic forms such as <a href=\"http://en.wiktionary.org/wiki/art#Verb\" rel=\"nofollow\"><em>art</em></a>.</p>\n\n<p>I believe I have also seen the number of possible forms of Arabic verbs calculated before, and that's a language with very complex verb morphology.</p>\n\n<p>Japanese verbs are of an agglutinating type. They are built up by adding various endings onto an invariable root and onto each other. But they cannot be added arbitrarily and surely some combinations are prohibited on either grammatical or semantic grounds. It could be that two differently spelled forms have identical meaning (this happens in Spanish) in which case each counts. There are surely also obsolete and archaic forms or variants which are no longer used in Modern Japanese. These should not be counted.</p>\n\n<p>I'm happy with a number, a description of how to calculate the number, or references to papers or books which address this topic</p>\n", "Id":"2319", "Title":"What is the maximum number of forms a (modern) Japanese verb can take?", "CreationDate":"2012-07-30T09:21:25.977", "AnswerCount":"2", "PostTypeId":"1", "OwnerUserId":"51", "Tags":"<morphology><verbs><japanese><inflection><agglutination>", "comments":[], "ViewCount":"208", "LastActivityDate":"2012-08-03T14:39:40.900", "Score":"3", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}