{"Body":"<p>I know pretty much what constitutes a dialect for native speakers of a language, but I wonder if countries that don't speak it as a <em>primary</em> language, but have a large segment of the population that is required to speak it for one reason or another — can it be said of such countries that they speak a dialect of English? Swiss English, for example?</p>\n\n<p>How about Indian English? Even though English is pretty much universal in India, it is not the primary language that children grow up speaking. Indian speakers of English seem to use constructions they get from their true native language — saying \"today morning\" for \"this morning,\" for example. Would Indian English be a dialect of English, or a series of dialects? Or would it [they] be something else? </p>\n", "Id":"2388", "LastEditorUserId":"51", "AcceptedAnswerId":"2389", "Title":"Is it possible for a non-native version of a language to be classed as a dialect?", "CreationDate":"2012-08-07T16:12:22.677", "OwnerUserId":"171", "PostTypeId":"1", "Tags":"<dialects><terminology><varieties>", "AnswerCount":"2", "comments":[], "LastEditDate":"2012-08-10T07:03:20.157", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"136", "LastActivityDate":"2012-08-11T15:41:41.623", "Score":"12", "CommentCount":"5", "OwnerUser":{"UpVotes":"7", "Location":"United States", "DownVotes":"0", "Id":"171", "AccountId":"100982", "Views":"2", "Reputation":"322", "CreationDate":"2011-09-19T00:31:34.420", "DisplayName":"Robusto", "LastAccessDate":"2013-12-29T11:30:06.283", "AboutMe":"<p>I want patience and I want it <em>now</em>.</p>\n\n<p>Also, I find that nostalgia isn't what it used to be.</p>\n\n<p>Laziness is what gets me out of bed in the morning.</p>\n\n<p>正宗で大根を切る。</p>\n\n<p>言い出しっぺ。</p>\n\n<p><strong>Some of the smartest things people have ever said:</strong></p>\n\n<p><em>No language makes perfect sense.</em> — John McWhorter</p>\n\n<p><em>Neurosis is always a substitute for legitimate suffering.</em> — Carl Jung</p>\n\n<p><em>A child educated only at school is an uneducated child.</em> — George Santayana</p>\n\n<p><em>Tactics is knowing what to do when there is something to do. Strategy is knowing what to do when there is nothing to do.</em> — Savielly Tartakower</p>\n\n<p><em>One of the painful things about our time is that those who feel certainty are stupid, and those with any imagination and understanding are filled with doubt and indecision</em> — Bertrand Russell</p>\n\n<p><em>Every good thing that happens in your life is a gift.</em> — Yours Truly</p>\n"}}