{"Body":"<p>In the U.S. where I live it is possible to be right almost all of the time when guessing the sex of a person from his or her given name: Ronald, George (Sand and Elliot notwithstanding), William, Michael (Learned notwithstanding), Warren and Chuck are all men's names, while Emily, Christine, Jasmine, Nancy and Camille are obviously female. Some nicknames go both ways (Chris, Sandy, Sam, etc.) but the full names are generally obviously on one side or the other.</p>\n\n<p>In German, generally nobody thinks Karlheinz is female or Gisele is male. Cf. Spanish (Juan, Juanita, etc.), French (Michel, Michelle) and so on. Even in Latin, it was possible to tell Julia and Julius apart by letters alone.</p>\n\n<p>Some languages have markers to indicate gender (see <a href=\"http://linguistics.stackexchange.com/q/1634/171\">this Linguistics.SE question</a>. That question discusses PIE affixes, but the scope is even broader. For example, in Japanese, <em>-o</em> or <em>-ro</em> endings indicate male names, while <em>-ko</em> and <em>-e</em> indicate female names. Note that my question is <em>not</em> limited to the scope of that question.</p>\n\n<p>I don't know all the languages that have ever existed in the world, obviously, but all of the ones I have had contact with make a more-or-less clear gender distinction with given names. Are there or have there ever been languages that didn't make this distinction?</p>\n", "Id":"2415", "FavoriteCount":"1", "AcceptedAnswerId":"2419", "Title":"Are there any languages or cultures that have genderless given names?", "CreationDate":"2012-08-13T20:40:39.907", "AnswerCount":"4", "Tags":"<gender><names>", "PostTypeId":"1", "OwnerUserId":"171", "comments":[], "ViewCount":"618", "LastActivityDate":"2013-12-29T09:50:29.180", "Score":"17", "CommentCount":"6", "OwnerUser":{"UpVotes":"7", "Location":"United States", "DownVotes":"0", "Id":"171", "AccountId":"100982", "Views":"2", "Reputation":"322", "CreationDate":"2011-09-19T00:31:34.420", "DisplayName":"Robusto", "LastAccessDate":"2013-12-29T11:30:06.283", "AboutMe":"<p>I want patience and I want it <em>now</em>.</p>\n\n<p>Also, I find that nostalgia isn't what it used to be.</p>\n\n<p>Laziness is what gets me out of bed in the morning.</p>\n\n<p>正宗で大根を切る。</p>\n\n<p>言い出しっぺ。</p>\n\n<p><strong>Some of the smartest things people have ever said:</strong></p>\n\n<p><em>No language makes perfect sense.</em> — John McWhorter</p>\n\n<p><em>Neurosis is always a substitute for legitimate suffering.</em> — Carl Jung</p>\n\n<p><em>A child educated only at school is an uneducated child.</em> — George Santayana</p>\n\n<p><em>Tactics is knowing what to do when there is something to do. Strategy is knowing what to do when there is nothing to do.</em> — Savielly Tartakower</p>\n\n<p><em>One of the painful things about our time is that those who feel certainty are stupid, and those with any imagination and understanding are filled with doubt and indecision</em> — Bertrand Russell</p>\n\n<p><em>Every good thing that happens in your life is a gift.</em> — Yours Truly</p>\n"}}