{"Body":"<p>According to Wikipedia Proto-Indo-European had four tense-aspects, the first being stative and the latter three being eventive: stative aspect, perfective aspect, and past and present tense of imperfective aspect.</p>\n\n<p>Now, \"perfective\" and \"imperfective\" are linguistically vague terms. They have a definite meaning - perfective meaning the event is considered in its entirety, while imperfective means only a part or instant of the event is considered - but are often also used to refer to different aspectual splits. In particular, while English is often said to have a perfective/imperfective split, in fact it has a progressive/non-progressive split (and some other languages - though not any I know of in the IE family - have other splits, such as telic/atelic, inceptive/completive, etc.). Here, progressive refers to an action or state that is progressing dynamically, while non-progressive refers to a complete action or a non-progressing state. The key difference between the two is that, while perfective generally corresponds to non-progressive and imperfective to progressive, lexically stative verbs are usually imperfective but non-progressive.</p>\n\n<p>My question then is which of the two PIE was. A second intimately related question is whether true stative verbs usually used the stative aspect or whether the stative aspect was only used with states resulting from eventive verbs, in which case stative verbs probably used the imperfective/non-progressive aspect.</p>\n", "Id":"2437", "Title":"PIE Aspect: (Im)perfective or (Non-)progressive?", "CreationDate":"2012-08-18T20:55:48.750", "OwnerUserId":"1097", "PostTypeId":"1", "Tags":"<proto-indo-european><aspect>", "comments":[], "ViewCount":"168", "LastActivityDate":"2012-08-18T20:55:48.750", "Score":"4", "CommentCount":"1", "OwnerUser":{"UpVotes":"1", "WebsiteUrl":"https://twitter.com/#!/JustinOlbrantz", "DownVotes":"0", "Id":"1097", "AccountId":"1561933", "Views":"12", "Reputation":"470", "CreationDate":"2012-06-12T15:27:45.637", "DisplayName":"Justin Olbrantz", "LastAccessDate":"2014-01-19T02:48:30.797"}}