{"Body":"<p>What manner of theories are there on the origin of Indo-European case-like prepositions (usually; they were originally postpositions, and a handful of languages still have postpositions)? They seem like a rather unusual breed of word, linguistically, in that they can seemingly act as both particles and adverbs as far back as PIE. This duality is especially evident in the fact that as particles they are free-standing words in all IE languages I know of, while in PIE and some modern IE languages (English being a counter-example) the adverbial forms are bound morphemes of the verb.</p>\n\n<p>Thinking it over, I have two thoughts, though it's possible neither is correct (if the answer is known at all). First, they could have originally been free-standing verbs. This of course suggests that pre-PIE was a serial verb language, though I guess it's possible they could have been verbs of free-standing clauses (although that seems less probable).</p>\n\n<p>The more complicated (and I think interesting) idea is they were originally bound derivational morphemes (possibly free-standing adverbs prior to fusion with the verb), and the object of the preposition was in fact the object of the verb itself. This implies that you could at one point only have up to two parameters of a verb, rather than the ability of modern languages to have many connected to a single verb by different prepositions or cases. As such something like \"He brought it for her\" would require something like \"He brought it. [He] did-for her.\"</p>\n\n<p>Of course this idea itself requires answering another question: how bound morphemes became free; usually free-standing words fuse to become bound morphemes, not the other way around. My example above sort of suggests how this might have happened: the deletion of an essentially semantically empty (and therefore redundant) verb such as \"do\", leaving the derivational morpheme standing on its own, and a resulting fusion of the two clauses into one.</p>\n\n<p>Or I suppose a simpler possibility would be that the differentiation between adverb and particle occurred earlier than that, and at the time the adverb had not yet fused with the verb. Thus the free-standing adverb essentially split into two different words: the original adverb that subsequently fused with the verb to become a bound morpheme, and a particle that remained a distinct word.</p>\n\n<p>Of course it's possible that that idea, while interesting, is entirely off base. Has this question been explored in more detail by other linguists?</p>\n\n<p>Added 9/1: Actually, I can think of a third possibility just to throw out there. If we assume that pre-PIE was more hospitable to null anaphora than modern English, it's possible it had something like \"prepositions\" in Totonac. In Totonac, \"prepositions\" are actually bound morphemes of the verb (and there can be more than one such morpheme per verb), and the prepositional objects are themselves bare noun phrases. If the verb is intransitive, the (dipersonal) verb could agree with one of the prepositional objects based on a priority system, but otherwise prepositional objects were entirely unmarked and reference was left to the intuition. If such a system existed in pre-PIE it could have evolved into true particles by such morphemes coming to be bound to their objects rather than the verb, and evolved into adverbs by analysis of null anaphora as object-less.</p>\n", "Id":"2504", "LastEditorUserId":"1021", "Title":"Indo-European prepositions: whence did they come?", "CreationDate":"2012-09-01T06:47:22.960", "OwnerUserId":"1097", "PostTypeId":"1", "Tags":"<reference-request><indo-european><particles><adpositions>", "AnswerCount":"1", "comments":[], "LastEditDate":"2013-01-28T05:14:18.817", "LastEditedUser":{"UpVotes":"176", "WebsiteUrl":"https://launchpad.net/~replicator-snail", "ProfileImageUrl":"http://i.stack.imgur.com/KPUcH.png", "Id":"1021", "AccountId":"124682", "CreationDate":"2012-05-18T02:34:01.443", "AboutMe":"<p>. Native speaker of American English. Linux user. Familiar with several programming languages in the procedural, OO, and functional paradigms.</p>\n\n<ul>\n<li><strong><a href=\"http://codegolf.stackexchange.com/a/6855/2276\">Worst Code Golf ever</a></strong></li>\n<li><strong><a href=\"http://meta.stackoverflow.com/a/157374/146243\">New badge proposals!</a></strong></li>\n<li><strong><a href=\"https://bugs.launchpad.net/ubuntu/+source/fortune-mod/+bug/612986\" rel=\"nofollow\">Shakespeare bug in Ubuntu</a></strong></li>\n<li><strong><a href=\"http://meta.stackoverflow.com/questions/122120/the-great-question-deletion-audit-of-2012/122207#122207\">The Great Question Deletion Audit of 2012</a></strong></li>\n<li>Chat\n<ul>\n<li><strong><a href=\"http://chat.stackexchange.com/rooms/2495/terrifying-nightmare-monsters\">Horrible spiders</a></strong></li>\n<li><strong><a href=\"http://chat.stackexchange.com/rooms/2110/aww\">Adorable fluffy things</a></strong></li>\n<li><strong><a href=\"http://chat.stackexchange.com/rooms/1701/firearms\">LASERS!</a></strong></li>\n</ul></li>\n</ul>\n\n<p><a href=\"https://en.wikipedia.org/wiki/Link_rot\" rel=\"nofollow\">Link rot</a> is evil. <a href=\"http://archive.org/\" rel=\"nofollow\">Archive</a> <a href=\"http://www.archiveteam.org/\" rel=\"nofollow\">everything</a>. <a href=\"https://en.wikipedia.org/wiki/Keyboard_shortcut\" rel=\"nofollow\">The keyboard is king</a>. Correctness over performance. Canonicalize, normalize, deduplicate. <a href=\"https://en.wikipedia.org/wiki/Don%27t_repeat_yourself\" rel=\"nofollow\">Don't repeat yourself.</a> <a href=\"http://utf8everywhere.org/\" rel=\"nofollow\">UTF-8 > UTF-16.</a> Use <a href=\"https://en.wikipedia.org/wiki/Static_typing\" rel=\"nofollow\">static typing</a>: good for <a href=\"https://en.wikipedia.org/wiki/Autocomplete\" rel=\"nofollow\">tooling</a>. <a href=\"https://en.wikipedia.org/wiki/IKVM.NET\" rel=\"nofollow\">Re</a>-<a href=\"https://en.wikipedia.org/wiki/Open-source_software\" rel=\"nofollow\">use</a>; don't <a href=\"https://en.wikipedia.org/wiki/Not_invented_here\" rel=\"nofollow\">re</a>-<a href=\"https://en.wiktionary.org/wiki/reinvent_the_wheel\" rel=\"nofollow\">invent</a>. Correctness, then clarity, then concision and elegance. Play devil's advocate. First understand opponents' positions.</p>\n", "Location":"United States", "DownVotes":"7", "Views":"12", "Reputation":"1534", "DisplayName":"Mechanical snail", "LastAccessDate":"2013-06-02T04:51:14.103"}, "ViewCount":"255", "LastActivityDate":"2013-01-28T05:14:18.817", "Score":"4", "OwnerUser":{"UpVotes":"1", "WebsiteUrl":"https://twitter.com/#!/JustinOlbrantz", "DownVotes":"0", "Id":"1097", "AccountId":"1561933", "Views":"12", "Reputation":"470", "CreationDate":"2012-06-12T15:27:45.637", "DisplayName":"Justin Olbrantz", "LastAccessDate":"2014-01-19T02:48:30.797"}}