{"Body":"<p>To my understanding... Semantics is the raw meaning and connotations a word carries on it's own and pragmatics is the context-dependent meaning a word holds.</p>\n\n<p>Is this accurate? Can anyone explain it to me simply?</p>\n", "Id":"2571", "FavoriteCount":"1", "AcceptedAnswerId":"2572", "Title":"What divides semantics from pragmatics?", "CreationDate":"2012-09-18T23:31:02.517", "AnswerCount":"5", "Tags":"<syntax><semantics><pragmatics><terminology>", "PostTypeId":"1", "OwnerUserId":"1336", "comments":[], "ViewCount":"327", "LastActivityDate":"2013-03-04T08:40:15.757", "Score":"13", "CommentCount":"2", "OwnerUser":{"UpVotes":"5", "WebsiteUrl":"http://cincinnatid20.proboards.com/index.cgi", "Id":"1336", "AccountId":"1676430", "CreationDate":"2012-09-18T23:13:55.873", "AboutMe":"<p>Taught on 3.0, learned 3.5. DMed 3.5 for many years and love it still.</p>\n\n<p>Favorite variants: Spell points, prestigious character classes, sorceror metamagic specialist, racial paragon classes, cloistered cleric, paladin of freedom, complex skill checks, weapon groups, craft points and summon monster variants.</p>\n\n<p>Anyone playing in my game knows: Think outside the box, fear the rakshasa, demons are never your friend and a party that can't find traps will indeed die by them.</p>\n\n<p>Favorite DnD aspects: Roleplay and character personality development, long spanning adventures that convey useful things (tree of life, chakras... meaning), inventiveness and ingenuity.</p>\n\n<p><a href=\"http://quizfarm.com/quizzes/Fashion/ellydragon/laws-game-style/#\" rel=\"nofollow\"><strong>Method Actor</strong></a>\nYou think that gaming is a form of creative expression. You may view rules as, at best, a necessary evil, preferring sessions where the dice never come out of the bag. You enjoy situations that test or deepen your character's personality traits.</p>\n", "Age":"28", "Location":"Boonies.", "DownVotes":"0", "Views":"2", "Reputation":"168", "DisplayName":"LitheOhm", "LastAccessDate":"2013-12-04T23:35:03.823"}}