{"Body":"<p>When I speak or write I tend not to speak in absolutes. I generally use phrases like \"I think\" or \"I don't think\" a lot. Further, I usually qualify my statements with words like \"generally\" or \"usually\". Funny - I'm doing this even as I write this post.</p>\n\n<p>Is this simple habit, or are there studies that show this means something about my person (e.g., I'm insecure or sensitive to hurting others' feelings, etc.)? If it's a bad indicator, feel free to share anyway.</p>\n\n<hr>\n\n<p>I'm not a aloud to post an answer because of my lack of reputation points, so I'll put it here because this might be helpful to someone else:</p>\n\n<p>I shared this question with a friend of mine with a degree in psycholinguistics. She answered with the following:</p>\n\n<p>Technically, what you're doing is \"softening\" your speech and using what we call a \"feminine\" speech style, although the research shows that it's not gender-specific:</p>\n\n<p><a href=\"http://www.uiowa.edu/~grpproc/crisp/crisp.1.6.html\" rel=\"nofollow\">http://www.uiowa.edu/~grpproc/crisp/crisp.1.6.html</a></p>\n\n<p>It tends to happen when someone's trying not to be too dominant or to assert themselves over anyone else. People are most likely to use these hedges when they're with a peer or with someone who's in authority over them. You're less likely to use them when you're talking to your kids.</p>\n", "Id":"2601", "LastEditorUserId":"1343", "FavoriteCount":"1", "Title":"What does it mean if a person says, “I think” a lot", "CreationDate":"2012-09-23T02:39:25.290", "OwnerUserId":"1343", "PostTypeId":"1", "Tags":"<sociolinguistics><pragmatics>", "AnswerCount":"3", "comments":[], "LastEditDate":"2012-09-24T03:48:14.800", "LastEditedUser":{"UpVotes":"1", "DownVotes":"0", "Id":"1343", "AccountId":"314387", "Views":"0", "Reputation":"116", "CreationDate":"2012-09-23T02:36:41.567", "DisplayName":"firebush", "LastAccessDate":"2013-01-27T01:22:22.897"}, "ViewCount":"515", "LastActivityDate":"2012-10-13T21:30:48.433", "Score":"3", "CommentCount":"5", "OwnerUser":{"UpVotes":"1", "DownVotes":"0", "Id":"1343", "AccountId":"314387", "Views":"0", "Reputation":"116", "CreationDate":"2012-09-23T02:36:41.567", "DisplayName":"firebush", "LastAccessDate":"2013-01-27T01:22:22.897"}}