{"Body":"<p>We should presume that the phrases <em>\"fuck your mother\"</em>, <em>\"fuck your mother smelly cunt\"</em>, <em>\"mother-fucking bastard</em>\" existed in the Chinese alt-cultural vocabulary for centuries in various dialects, having a high frequency of usage when the need for profanity arises. May be, I need to verify with people who speak the language/dialects. It is accepted that the term <code>mother-fucker</code> in English originated in the United States around the 1970s and not earlier than the 1960s. And that it was popularised by African American gangsters.</p>\n\n<p>I am proposing that the English term <code>mother-fucker</code> came into existence due to the confluence of Chinese and African-American cultures. I am theorising that its existence is due to among other such confluences, the interaction and/or cooperation between Chinese Triads and African American gangs which started to occur in the 1970s.</p>\n\n<p>Imagine the scenario - a botched co-operation between an African-American and their Chinese counterpart - so the Chinese gangster yells at his African American partner \"Fuck your mother\". Or a racist Chinese grocery store owner, shooing away Blacks he feels are not in his shop to spend money. So, the African-American yells back, \"Fuck your mother, you mother-fucker.\" And the phrase took off.</p>\n\n<p>I am arriving at this scenario, because of my personally having witnessed a  verbal altercation between a Chinese. Malayalam and Sinhalese man in the far-east in the 1970s. where the Indian men each yelled back, \"Fuck your mother, you mother-fucking bastard\", in response to the Chinese man's yelling \"Fuck your mother\". I mean, these three men were actually friends but they somehow got into this amazing deprecation match. Which means, I personally witnessed the English term <code>mother-fucker</code> used in one instance in the early 1970s, not in the US, but in the far-east, by three English-speaking Asian compatriots of different ethnicity in a recreational verbal-bantering match.</p>\n\n<p>Certainly, my observation and theory would be disagreeable to many African-Americans who claim that the term is purely of African-American origin.</p>\n\n<p>So, what triggered the existence of the term in English? Did African-Americans use the term in the 19th century? Is the term purely of African-American origin?</p>\n", "Id":"2641", "LastEditorUserId":"483", "Title":"Influences of the origins of the phrase \"Mother-fucker\"", "CreationDate":"2012-10-02T09:47:36.130", "OwnerUserId":"1371", "PostTypeId":"1", "Tags":"<etymology>", "comments":[], "LastEditDate":"2012-10-02T23:11:16.173", "LastEditedUser":{"UpVotes":"180", "WebsiteUrl":"http://www.buffalo.edu/~lovegren", "Location":"Buffalo, NY", "Id":"483", "DownVotes":"5", "AccountId":"1021213", "Views":"70", "Reputation":"6503", "CreationDate":"2011-11-05T19:57:14.530", "DisplayName":"jlovegren", "LastAccessDate":"2014-01-16T02:42:41.207", "AboutMe":""}, "ViewCount":"355", "LastActivityDate":"2012-10-02T23:11:16.173", "Score":"0", "CommentCount":"7", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1371", "AccountId":"47518", "Views":"2", "Reputation":"104", "CreationDate":"2012-10-02T08:27:44.967", "DisplayName":"Blessed Geek", "LastAccessDate":"2012-10-14T06:53:49.820", "AboutMe":"<p>Come unto me, all ye who are weary of <i>heavy-laden clients</i> and I will give you <a href=\"http://en.wikipedia.org/wiki/REST\" rel=\"nofollow\">REST</a>.</p>\n\n<p><a href=\"http://en.wikipedia.org/wiki/Agile_software_development\" rel=\"nofollow\">Agile</a> is the substance of features planned for, the avoidance of milestones unseen.</p>\n"}}