{"Body":"<p>It seems to me (but I may be wrong), that languages tend to evolve towards simplification. Some examples I can think of: loss of declinations in Romance languages or in English, loss of 2nd person specific conjugation in Portuguese (plural in Portugal, singular and plural in Brasil).</p>\n\n<p>One could imagine that such processes continue until a language starts loosing its expressive power.\nBut it seems that languages are not yet all super-simplified. Some complexity is retained to some extent, depending on the language, and even created (for instance, the double negation in French: \"Je ne sais\" -> \"Je ne sais pas\" (which may actually be undergoing a simplification: -> \"Je sais pas\")).\nWhat causes languages to sometimes accept new complex features? Aren't the speakers prone to a natural laziness that should oppose to this?</p>\n\n<p>I suppose my question is highly dependent on what \"complexity\" means.</p>\n", "Id":"2645", "LastEditorUserId":"22", "AcceptedAnswerId":"2646", "Title":"Why do languages retain or re-create complexity?", "CreationDate":"2012-10-04T23:31:17.383", "OwnerUserId":"1379", "PostTypeId":"1", "Tags":"<evolution>", "AnswerCount":"1", "comments":[], "LastEditDate":"2012-10-04T23:47:43.400", "LastEditedUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "ViewCount":"154", "LastActivityDate":"2012-10-05T06:47:14.123", "Score":"6", "OwnerUser":{"UpVotes":"7", "WebsiteUrl":"", "DownVotes":"0", "Id":"1379", "AccountId":"1902248", "Views":"0", "Reputation":"143", "CreationDate":"2012-10-04T23:12:42.740", "DisplayName":"bli", "LastAccessDate":"2013-12-26T12:14:41.587", "AboutMe":"<p>I'm interested in languages and in their evolution.</p>\n"}}