{"Body":"<p>Mongols are a tribal society: they form numerous tribes and clans. During feudalistic periods, there were political categorizations. During Qing rule, tribal units were used to define political units in some Mongol areas. There is of course a sophisticated interrelations scheme between these tribes and their origins. There are also differences between dialects spoken by the tribes.</p>\n\n<p>In Mongolia, some of the tribes are Khalkha, Dorbet, Bayid, Khotgoid, Darkhad, Torghut, Khoton and many others. The population in Mongolia is highly homogenized. Khalkha is the most populous tribe and some other tribes like Darkhad, Khotgoid, Dariganga and Sartuul are Khalkha-ized. Other tribes like Torghut and Zakhchin maybe Khalkha-ized as well. The point is that the traditional tribal system and dialectic differences don't hold anymore.</p>\n\n<p>What is the situation in Inner Mongolia and other Mongol regions like Khukh Nuur and Ili? I know there are as well many tribes in Inner Mongolia like Sunid, Urad, Kharchin, Khorchin, Chakhar, Ordos and many more. Does the tribal and dialectic differences still hold or is the Mongol population in Inner Mongolia becoming more homogenized? For example, can we consider Uzemchin, Khuuchid, Abga, Abganar, Sunid as a newer Mongol subgroup called Shiliingol linguistically?</p>\n\n<p>Are there any study or publication that studied interrelations and modern taxonomy of Mongol tribes and the dialects they speak?</p>\n", "Id":"2666", "LastEditorUserId":"51", "Title":"Is the taxonomy of Mongol dialects in Inner Mongolia changing?", "CreationDate":"2012-10-07T06:27:57.877", "OwnerUserId":"425", "PostTypeId":"1", "Tags":"<dialects>", "comments":[], "LastEditDate":"2012-10-15T19:11:16.147", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"57", "LastActivityDate":"2012-10-15T19:11:16.147", "Score":"3", "OwnerUser":{"UpVotes":"2", "WebsiteUrl":"http://dagvadorj.blogspot.com", "DownVotes":"0", "Id":"425", "AccountId":"72399", "Views":"0", "Reputation":"128", "CreationDate":"2011-10-15T17:35:46.773", "DisplayName":"Dagvadorj", "LastAccessDate":"2013-12-17T10:03:22.937"}}