{"Body":"<p>I'm not a field linguist but my hobby overlaps with it, particularly the descriptive part.</p>\n\n<p>At the far ends, with remnant langauges (Virginian Algonquin) and well studied mega-lingua francas like English or French the answer is clear. Given limited time and resources, what constitutes enough dictionary, corpus and other descriptive material to say a language is documented?</p>\n\n<p>One book by a field linguist I read said about six pages of well meticulously glossed text covered most of a languages details. Are there any other rules of thumb for deciding when one has hit the point of diminishing marginal returns for documenting a language?</p>\n\n<p>(I'm not really looking for the answer \"the job is never done!\", since it isn't really useful)</p>\n", "Id":"2679", "LastEditorUserId":"22", "Title":"What sort of criteria are used to deem a language description complete?", "CreationDate":"2012-10-11T14:54:22.170", "OwnerUserId":"20", "PostTypeId":"1", "Tags":"<constructed-language><field-linguistics><descriptive-linguistics>", "AnswerCount":"1", "comments":[], "LastEditDate":"2012-10-13T23:47:55.407", "LastEditedUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "ViewCount":"52", "LastActivityDate":"2012-10-14T04:16:57.117", "Score":"3", "OwnerUser":{"UpVotes":"72", "WebsiteUrl":"http://suburbandestiny.com/conlang", "Id":"20", "AccountId":"15651", "CreationDate":"2011-09-13T20:53:42.550", "AboutMe":"<p>I'm a programmer by day and an amateur linguist by night.</p>\n\n<p>I organize the Arlington Linguistics Book Club, where we read a wide variety of books that make the science of linguistic accessible to a popular audience.</p>\n", "Age":"41", "Location":"United States", "DownVotes":"6", "Views":"39", "Reputation":"1657", "DisplayName":"MatthewMartin", "LastAccessDate":"2014-01-08T19:46:09.130"}}