{"Body":"<p>Sorry for the confusing title, but I'm not aware of any common linguistic terms for the concepts at hand, so I'm kinda making them up as I go. So I'll start by explaining the question.</p>\n\n<p>There are a few different ways that languages can achieve the function of adjectives:</p>\n\n<ul>\n<li>English is a handy example of a language which predominantly uses adnominal adjectives: a distinct lexical class whose primary function is to describe nouns adnominally.</li>\n<li>Japanese uses two types of adjectivals commonly. First, stative verbs, which may then be used adnominally through the formation of relative clauses. E.g. \"aoi [be blue] hana [flower]\"</li>\n<li>Japanese also commonly uses abstract genitive phrases, where abstract nouns are used in genitive phrases conveying an attributive relation with the head noun. E.g. \"kirei [beauty] na [genitive marker] tori [bird]\"</li>\n</ul>\n\n<p>My question here is what are some languages (I'm not familiar with any) that predominantly use the fourth type: concrete nouns that are used adjectivally by the formation of genitive phrases where the genitive relation conveys equality with the head noun. I suppose German, Japanese, and some other agglutinative languages could be taken as examples of languages which make use of such constructions (if you count agglutination as a genitive structure), but in both cases I'm inclined to think other adjectival strategies are more common.</p>\n", "Id":"2792", "LastEditorUserId":"1097", "FavoriteCount":"1", "Title":"Examples of Equative Genitive Adjectival Languages", "CreationDate":"2012-11-04T01:14:52.847", "OwnerUserId":"1097", "PostTypeId":"1", "Tags":"<reference-request><adjectives>", "AnswerCount":"2", "comments":[], "LastEditDate":"2012-11-04T02:42:31.947", "LastEditedUser":{"UpVotes":"1", "WebsiteUrl":"https://twitter.com/#!/JustinOlbrantz", "DownVotes":"0", "Id":"1097", "AccountId":"1561933", "Views":"12", "Reputation":"470", "CreationDate":"2012-06-12T15:27:45.637", "DisplayName":"Justin Olbrantz", "LastAccessDate":"2014-01-19T02:48:30.797"}, "ViewCount":"228", "LastActivityDate":"2013-04-09T09:03:45.833", "Score":"2", "CommentCount":"8", "OwnerUser":{"UpVotes":"1", "WebsiteUrl":"https://twitter.com/#!/JustinOlbrantz", "DownVotes":"0", "Id":"1097", "AccountId":"1561933", "Views":"12", "Reputation":"470", "CreationDate":"2012-06-12T15:27:45.637", "DisplayName":"Justin Olbrantz", "LastAccessDate":"2014-01-19T02:48:30.797"}}