{"Body":"<p>A \"creole\" language is formed by the merging of two parent languages, usually through an earlier rudimentary mixture of the two. Does this make Yiddish a creole language? Was English itself a creole language in the century or so after the Norman Conquest?</p>\n\n<p>My question is really about what constitutes a creole language: what are its hallmarks and most distinguishing features, and do creole languages ever evolve to become \"proper\" languages (whatever that may mean) in their own right?</p>\n\n<p>Note: This question was asked originally on English.SE, but was closed because it was considered off-topic. It was suggested I ask it here, but \"here\" didn't exist at the time.</p>\n", "Id":"281", "LastEditorUserId":"51", "AcceptedAnswerId":"287", "Title":"Is Yiddish a creole language? And if not, what is it?", "CreationDate":"2011-09-19T00:35:14.027", "OwnerUserId":"171", "PostTypeId":"1", "Tags":"<english><creoles>", "AnswerCount":"2", "comments":[], "LastEditDate":"2011-09-20T19:51:55.350", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"584", "LastActivityDate":"2011-09-20T19:51:55.350", "Score":"11", "CommentCount":"4", "OwnerUser":{"UpVotes":"7", "Location":"United States", "DownVotes":"0", "Id":"171", "AccountId":"100982", "Views":"2", "Reputation":"322", "CreationDate":"2011-09-19T00:31:34.420", "DisplayName":"Robusto", "LastAccessDate":"2013-12-29T11:30:06.283", "AboutMe":"<p>I want patience and I want it <em>now</em>.</p>\n\n<p>Also, I find that nostalgia isn't what it used to be.</p>\n\n<p>Laziness is what gets me out of bed in the morning.</p>\n\n<p>正宗で大根を切る。</p>\n\n<p>言い出しっぺ。</p>\n\n<p><strong>Some of the smartest things people have ever said:</strong></p>\n\n<p><em>No language makes perfect sense.</em> — John McWhorter</p>\n\n<p><em>Neurosis is always a substitute for legitimate suffering.</em> — Carl Jung</p>\n\n<p><em>A child educated only at school is an uneducated child.</em> — George Santayana</p>\n\n<p><em>Tactics is knowing what to do when there is something to do. Strategy is knowing what to do when there is nothing to do.</em> — Savielly Tartakower</p>\n\n<p><em>One of the painful things about our time is that those who feel certainty are stupid, and those with any imagination and understanding are filled with doubt and indecision</em> — Bertrand Russell</p>\n\n<p><em>Every good thing that happens in your life is a gift.</em> — Yours Truly</p>\n"}}