{"Body":"<p>It seems to me that IPA is badly designed and not suitable well for many languages other than English.</p>\n\n<p>Some problems are:</p>\n\n<ul>\n<li><p>It uses different characters to denote the same sounds. For example, [ʍ] and [w̥], or [ʃʲ] and [ɕ].</p></li>\n<li><p>It does not have characters for even widespread sounds that are used in different languages. For example, the sound, conducted by English \"ch\" exists in English, Czech, Italian, Russian and many other languages. Yet IPA uses two symbols for it: [tʃ]. The Russian [ч] needs three IPA symbols: [t͡ɕ]</p></li>\n<li><p>It uses the same symbols for different sounds. For example the above-mentioned transcription [tʃ] is used both for Belarusian phoneme which is denoted by the letter ч and for the combination of two phonemes [тш]. Similarly, Russian отселить \"to resettle away\" has [тс] while оцелить \"to give aim\" has [ц], the both again will be [ts] in IPA.</p></li>\n<li><p>It uses different methods to indicate the same features in different sounds. For example, palatal variant of [ɣ] is denoted [ʝ], palatal variant of [tʃ] is denoted [t͡ɕ] while in other cases a superscript [xʲ] is used to indicate palatalization.</p></li>\n<li><p>It uses completely different symbols for voiced and voiceless, or palatal and plain variants of the same sound, which does not reflect the sound proximity.</p></li>\n</ul>\n\n<p>Reading professional literature on comparative linguistics I never encounter use of IPA. The authors usually use ad-hoc transliterations for even languages which have no written form, and transliteration systems of different branches may grossly differ making comparison difficult. </p>\n\n<p>That said I wonder whether IPA really obsolete and whether there is recognized need for a better alphabet which could be used in comparative studies?</p>\n", "Id":"2841", "LastEditorUserId":"624", "FavoriteCount":"2", "Title":"Is IPA obsolete?", "CreationDate":"2012-11-14T05:44:52.007", "OwnerUserId":"624", "PostTypeId":"1", "Tags":"<phonology><phonetics><ipa>", "AnswerCount":"2", "comments":[], "LastEditDate":"2012-11-15T01:11:20.047", "LastEditedUser":{"UpVotes":"81", "DownVotes":"60", "Id":"624", "AccountId":"407237", "Views":"34", "Reputation":"1743", "CreationDate":"2011-12-28T07:24:31.420", "DisplayName":"Anixx", "LastAccessDate":"2014-01-18T10:33:34.597"}, "ViewCount":"445", "LastActivityDate":"2012-11-21T04:30:11.917", "Score":"3", "CommentCount":"24", "OwnerUser":{"UpVotes":"81", "DownVotes":"60", "Id":"624", "AccountId":"407237", "Views":"34", "Reputation":"1743", "CreationDate":"2011-12-28T07:24:31.420", "DisplayName":"Anixx", "LastAccessDate":"2014-01-18T10:33:34.597"}}