{"Body":"<p>This is a sensitive question, but there should be enough evidence of the correlation, if any, between the language spoken in different regions and their average IQ.</p>\n\n<p><strong>Update:</strong></p>\n\n<p>If there is a correlation between intelligence and one native language. There would suffice to proof that it exists with at least one kind of intelligence.</p>\n\n<p>As the IQ is the indicator with more available data, it would suffice.</p>\n\n<p>Now, as a personal observation.</p>\n\n<p>Our brain has a limited capacity, regarding any skill. For instance, people with Savant syndrome, are exceptionally good on very specific tasks, but in general lack of the more general skills as socialization and communication.</p>\n\n<p>Also, text and speech recognition are among the more expensive tasks to be done by any computer, requiring huge data bases and very fast processors. So that I suspect that our brains could face similar requirements regarding written language and speech.</p>\n\n<p>Another thing to take into account, is that while there are very compact languages, also there are languages with very complex rules and irregularities, with huge alphabets, phonemes, and so on. And here, I have to be very careful, as I don't want to make any affirmation regarding any particular language.</p>\n\n<p>So, if the price that our brain must pay to be able to master our native language, is to diminish other skills, it should have enough data to demonstrate either that there is a correlation between intelligence and one's native language, or the opposite, that they are not related at all.</p>\n", "Id":"2889", "LastEditorUserId":"1009", "AcceptedAnswerId":"2890", "Title":"Does native language influence intelligence quotient?", "CreationDate":"2012-11-24T05:41:43.233", "OwnerUserId":"1522", "PostTypeId":"1", "Tags":"<native-language><sapir-whorf-hypothesis>", "AnswerCount":"3", "comments":[], "LastEditDate":"2013-02-25T17:48:04.207", "LastEditedUser":{"UpVotes":"512", "WebsiteUrl":"http://weew-waaw.com", "Id":"1009", "AccountId":"947951", "CreationDate":"2012-05-15T02:50:16.013", "AboutMe":"<p><img src=\"http://i.stack.imgur.com/VxMqM.jpg\" alt=\"Weew-Waaw, Thai to English, Thai to Russian transcription\"><br>\nI'm working on a project of rule-based Thai transcription: (the link is temporarily unavailable)<br>\nTechnically, it is written in F# with a C# front-end.<br>\nI would be happy to get acquainted with those who are experienced with NLP (Natural Language Processing), just ping me in the SE chat. :-)</p>\n", "Age":"42", "Location":"Bangkok, Thailand", "DownVotes":"50", "Views":"36", "Reputation":"1656", "DisplayName":"bytebuster", "LastAccessDate":"2014-01-19T00:53:20.473"}, "ViewCount":"585", "LastActivityDate":"2013-02-25T17:48:04.207", "Score":"2", "CommentCount":"5", "OwnerUser":{"UpVotes":"1", "DownVotes":"0", "Id":"1522", "AccountId":"1541936", "Views":"1", "Reputation":"121", "CreationDate":"2012-11-24T05:40:35.230", "DisplayName":"rraallvv", "LastAccessDate":"2013-12-04T20:52:05.717"}}