{"Body":"<p>(I know that the title of this question is quite opaque, but I'm having a hard time explaining what I'm looking for. Perhaps someone can help with that.)</p>\n\n<p>I need a tool which can take a collection of syllables (preferably phonetically transcribed), look at all possible combinations, and return any combination that creates a real English word. This is to help me create auditory stimuli for a phonetics experiment.</p>\n\n<p>Let me describe the problem I am facing. I have a small collection of recordings of sentences that look something like this: </p>\n\n<blockquote>\n  <p>Yes, Jess mistyped it, I think.</p>\n</blockquote>\n\n<p>I need to find a way to splice and recombine bits of this sound file to create words that were not originally there. This is because I just don't have enough usable words that I can just extract from the sound file, and for various reasons I can't go out and record my own.</p>\n\n<p>I've been staring at these sentences for a while, trying to figure out what could be spliced together to form something close to actual English words, but I'm not getting anywhere fast. Can anyone think of a way of approaching this problem that doesn't require my own imagination? Is there a searchable dictionary with phonetic transcriptions and regular expressions, or something similar that I could use? Extra points for being able to specify the resulting stress pattern.</p>\n", "Id":"2910", "Title":"Tool for finding recombinations of syllables that yield words", "CreationDate":"2012-11-29T21:23:42.800", "OwnerUserId":"166", "PostTypeId":"1", "Tags":"<phonetics><dictionary><tools>", "comments":[], "ViewCount":"68", "LastActivityDate":"2012-11-29T21:23:42.800", "Score":"1", "CommentCount":"4", "OwnerUser":{"UpVotes":"33", "WebsiteUrl":"", "DownVotes":"2", "Id":"166", "AccountId":"895830", "Views":"2", "Reputation":"380", "CreationDate":"2011-09-18T16:47:03.823", "DisplayName":"lapropriu", "LastAccessDate":"2013-10-23T21:21:01.247", "AboutMe":"<p>I'm a grad student in Linguistics. I'm currently working on clitics and the prosodic hierarchy, but my interests are much broader than my expertise, unfortunately :).</p>\n"}}