{"Body":"<p>In the Germanic languages, a generic construction using the definite article with mass nouns is unacceptable. In contrast, Romance languages require the definite article to make the generic construction grammatical. </p>\n\n<blockquote>\n  <p>a.) <em>The water is a liquid.</em> (Unacceptable) </p>\n  \n  <p>b.) <em>The tiger is an animal.</em> (acceptable) </p>\n  \n  <p>c.) <em>L'eau est un liquide.</em> (acceptable)</p>\n</blockquote>\n\n<p>The reason it is not acceptable in Germanic languages is that the definite article in Germanic languages requires the noun to have individuality. The noun must have a separate existence (boundedness) in order to make a definite generic sentence with it. Take the sentence above for example, \"the tiger is an animal.\" refers to the ideal tiger that has every feature to be \"tiger-ish\", which we could call the \"representative of  all tigers\". The fact that <em>tiger</em> is a countable noun contributes to the generic construction. There is no such thing as the \"representative of water\" to refer to, as water is homogeneous. </p>\n\n<p>Now, what I would like to know is, what is different about the definite article in Romance languages compared to that of Germanic languages from a cognitive point of view? What is it that allows (or rather it is necessary to have) the definite article to make a definite generic sentence with mass nouns in Romance languages? </p>\n\n<p>Does the definite article in Romance languages not require individuality/boundedness? Or maybe Romance language speakers see mass nouns like water as separated substances?</p>\n\n<p>When making a definite generic sentence, what does it refer to? In Germanic languages, it refers to the \"representative individual\" of the noun. When saying \"L'eau est un liquide.\", what water does the sentence refer to?</p>\n", "Id":"3013", "LastEditorUserId":"1618", "FavoriteCount":"1", "Title":"Usage of definite articles in Germanic and Romance languages", "CreationDate":"2012-12-29T06:16:23.950", "OwnerUserId":"1618", "PostTypeId":"1", "Tags":"<philosophy-of-language><articles><cognitive-linguistics><definiteness>", "AnswerCount":"1", "comments":[], "LastEditDate":"2012-12-29T16:48:43.393", "LastEditedUser":{"UpVotes":"2", "DownVotes":"0", "Id":"1618", "AccountId":"2129089", "Views":"0", "Reputation":"143", "CreationDate":"2012-12-29T05:18:39.320", "DisplayName":"Sindry", "LastAccessDate":"2013-12-25T12:20:29.587"}, "ViewCount":"159", "LastActivityDate":"2013-09-26T08:13:38.087", "Score":"6", "CommentCount":"5", "OwnerUser":{"UpVotes":"2", "DownVotes":"0", "Id":"1618", "AccountId":"2129089", "Views":"0", "Reputation":"143", "CreationDate":"2012-12-29T05:18:39.320", "DisplayName":"Sindry", "LastAccessDate":"2013-12-25T12:20:29.587"}}