{"Body":"<p>This isn't about sound change in general, but the changes that took place in the pronunciation of individual words. Does such a compilation exist? It would be interesting to know how divergent pronunciations developed, and how people pronounced certain words in earlier ages.</p>\n\n<p>MORE DETAILS: What I'm seeking is something similar to the documentation on changes in orthography and semantics that exist in etymological dictionaries for pronunciation. This by its nature is more difficult, of course; but since linguists have been able to piece out the pronunciation of the words of languages long dead, it might not be impossible.</p>\n\n<p>EVEN MORE DETAILS: Of course, changes in pronunciation might occur more frequently than changes in spelling, which would only add to the difficulty of the problem.</p>\n\n<p>Why I ask is that certain words in English appear to have very peculiar pronunciations - ones that strike one as not being optimal in terms of how easy it is to say them. Semi-non-native speakers (such as for instance educated people in India, where I lived for a few years) pronounce words like <strong>distribute</strong> with the emphasis on the first syllable instead of the second, which to me seems an easier way to say the word. I've even heard some native speakers, unless they speak with great care, place greater stress on the first syllable than native speakers normally do. Was it always pronounced like this? I would think that far more variation might have existed in pronunciation, as it did in spelling, before communication and writing were sufficiently developed to make something of a standard variety possible.</p>\n\n<p>Also English words tend to lack consistency in terms of pronunciation. \"Finite\" is pronounced differently when it's in the word \"infinite\". \"Demoniac\" is \"dee-MOH-nee-ac\" but \"demoniacal\" is \"dee-mo-NAY-uh-cal\". Words that are very similar in terms of spelling and language of origin are nonetheless pronounced differently. The schwa is far more common in syllables without primary stress than it was earlier.</p>\n\n<p>I think I might find suitable answers to these questions if such a guide to historical pronunciation as I seek existed.</p>\n", "Id":"3079", "LastEditorUserId":"1654", "FavoriteCount":"0", "Title":"Historical pronunciation of words in English", "CreationDate":"2013-01-15T20:13:30.573", "OwnerUserId":"1654", "PostTypeId":"1", "Tags":"<phonetics><pronunciation>", "comments":[], "LastEditDate":"2013-01-15T20:29:06.043", "LastEditedUser":{"UpVotes":"6", "Location":"United States", "DownVotes":"0", "Id":"1654", "AccountId":"1156249", "Views":"0", "Reputation":"154", "CreationDate":"2013-01-08T04:00:29.513", "DisplayName":"Kaiser Octavius", "LastAccessDate":"2013-10-08T01:08:36.333", "AboutMe":"<p>please delete me</p>\n"}, "ViewCount":"152", "LastActivityDate":"2013-01-15T20:29:06.043", "Score":"1", "CommentCount":"6", "OwnerUser":{"UpVotes":"6", "Location":"United States", "DownVotes":"0", "Id":"1654", "AccountId":"1156249", "Views":"0", "Reputation":"154", "CreationDate":"2013-01-08T04:00:29.513", "DisplayName":"Kaiser Octavius", "LastAccessDate":"2013-10-08T01:08:36.333", "AboutMe":"<p>please delete me</p>\n"}}