{"Body":"<p>I was reading an article about typology of Russian language by Gasparov, B. M. (“Structure of Russian language from typological point of view (Intro to sociogrammatics). Article 2. Morphology of the noun”. <em>Scholarly notes of Tartu University</em>, issue 486. Tartu, 1979. Pp. 23—44.) and in the section about grammatical number there is passage where I am not sure how to translate certain terminology in English. I am native Russian speaker, I just do not know the proper linguistic terms.</p>\n\n<p>Below is the passage from page 32 <sup>(<a href=\"https://dspace.utlib.ee/dspace/bitstream/handle/10062/25795/acta_486_problemy_1979.pdf?sequence=1#page=33\" rel=\"nofollow\">Rus</a>)</sup> where he talks about the general development of dual and then its extinction in Russian language, translated to the best of my ability (terms in question are emboldened, author’s own emphasis of one of the words is converted to italics by me):</p>\n\n<blockquote>\n  <p>Most ancient stratum of the functioning of this form, apparently, constitute the so-called <strong>independent dual</strong> — the form used with a noun outside of combination with the numeral “two”, that is, not supported by lexical definition of quantity. Independent dual was used originally for designation of <em>paired</em> objects (“eyes”, “arms” and the like). Subsequently develops the usage of <strong>connected dual</strong> [related? bounded?] that combines the noun with the numeral “two”. As a result, the usage of the form of dual grammatical number broadens, and this form becomes universal quantitative determinant that can be imparted to any noun.</p>\n</blockquote>\n\n<p>To elaborate more on “connected dual” author examples (p. 33) how relics of dual forms now differ in meaning according to whether or not they are used with a qualifier, such as numeral “two” or pronouns “these”, “such”, “mine”, “some” <em>etc.</em> If someone says “<em>на столе лежат книги</em>” (there are books laying on the table), listener would assume a “larger multitude” of “more than two” (>2), whereas “<em>эти книги лежат на столе</em>” (these books are laying on the table) means that there could be any number of books, including two (>1). That is, author argues that if there were, in fact, two books on the table, the speaker is expected to note that directly, or qualify that he is talking about specific objects (again, akin the definite article).</p>\n\n<p>For me, as a native speaker, it is not readily intuitive, but I do agree that author is onto something.</p>\n\n<h2>Old Russian dual and its relics in modern Russian</h2>\n\n<p>To shed more light on what the author talked about, below are several examples of Old Russian dual and its relics that remained after its extinction:</p>\n\n<p>The modern word <em>рука</em> (NOM SG F) meaning “arm” is the same in Old Russian save for the digraph <a href=\"http://en.wikipedia.org/wiki/Uk_%28Cyrillic%29\" rel=\"nofollow\"><em>ѹ</em></a> in place of <em>у</em> (both have similar or identical sound). NOM PL is the <em>рѹкы</em> (modern <em>руки</em>), and NOM-ACC-VOC DU is <em>рѹцѣ</em> which has no modern counterpart (although the numeral “two” follows the same paradigm for the F: modern <em>две</em> was <em>дъвѣ</em>). If that points to anything, this form is the same for DAT SG and LOC SG.</p>\n\n<p>Now, in modern Russian there is no dual, but there is, we could say, paucal form for plural of 1.5, 2, 3, and 4. In case of <em>рука</em> and several other words it is formed with the same word as uncounted plural, but with the stress shift. “Two hands” is <em>две руки́</em>, but uncountable “hands” is <em>ру́ки</em>. From 5 to 20 GEN PL form is used: <em>13 рук</em>. After that combined numerals begin.</p>\n\n<h2>Question</h2>\n\n<p>From the article it is unclear to me what author means exactly by “connected dual”. As he writes “connected dual that combines the noun with the numeral ‘two’”, does it not defeat the whole idea of dual? Although examples of Old Russian dual <sup>(<a href=\"http://ru.wikipedia.org/wiki/%D0%94%D0%B2%D0%BE%D0%B9%D1%81%D1%82%D0%B2%D0%B5%D0%BD%D0%BD%D0%BE%D0%B5_%D1%87%D0%B8%D1%81%D0%BB%D0%BE#.D0.9F.D1.80.D0.B8.D0.BC.D0.B5.D1.80.D1.8B_.D1.83.D0.BF.D0.BE.D1.82.D1.80.D0.B5.D0.B1.D0.BB.D0.B5.D0.BD.D0.B8.D1.8F_.D0.B4.D0.B2.D0.BE.D0.B9.D1.81.D1.82.D0.B2.D0.B5.D0.BD.D0.BD.D0.BE.D0.B3.D0.BE_.D1.87.D0.B8.D1.81.D0.BB.D0.B0\" rel=\"nofollow\">Rus</a>, Wikipedia)</sup> show that it could have been used both with or without numeral “two”. Gasparov also notes that after usage of dual had broadened, dual for paired objects took on function similar to that of definite article in English: <em>рѹцѣ</em> [dual, the arms, both arms, arms of one person] vs. <em>рѹкы</em> [plural, arms].</p>\n\n<p>What are the correct linguistic terms for these particular types? Did I translate correctly? Please, link authoritative source or glossary, and bear in mind that I am not a linguist, so nothing excessively recondite.</p>\n", "Id":"3091", "LastEditorUserId":"3020", "FavoriteCount":"3", "Title":"Proper terminology for the types of dual", "CreationDate":"2013-01-19T05:36:53.520", "OwnerUserId":"1670", "PostTypeId":"1", "Tags":"<terminology><grammatical-number><paucal>", "AnswerCount":"1", "comments":[], "LastEditDate":"2014-01-15T15:39:25.480", "LastEditedUser":{"UpVotes":"3", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/Pc82Y.jpg?s=128&g=1", "Id":"3020", "AccountId":"2596734", "Views":"1", "Reputation":"167", "CreationDate":"2014-01-13T16:08:59.447", "DisplayName":"Marjeta", "LastAccessDate":"2014-01-17T20:16:21.790"}, "ViewCount":"206", "LastActivityDate":"2014-01-15T15:39:25.480", "Score":"8", "CommentCount":"15", "OwnerUser":{"UpVotes":"2", "WebsiteUrl":"http://theug.pp.ru/en/", "Id":"1670", "AccountId":"1203926", "CreationDate":"2013-01-14T17:23:49.183", "AboutMe":"<p>Support <a href=\"http://area51.stackexchange.com/proposals/42696/motorcycles-mopeds-and-scooters?referrer=w4vp1kULjeIffAcp4bmV0w2\">Motorcycles, Mopeds and Scooters</a> and <a href=\"http://area51.stackexchange.com/proposals/38237/recreational-boating?referrer=v3c6L41K4ZsfIpjxF7wb8w2\">Recreational Boating</a> proposals on SE Area 51.</p>\n", "Age":"33", "Location":"Boise, ID", "DownVotes":"0", "Views":"0", "Reputation":"144", "DisplayName":"theUg", "LastAccessDate":"2014-01-17T06:41:02.790"}}