{"Body":"<p>My question is a little bit tricky (for me) to put in a title. I will try to describe:</p>\n\n<p>There are different types of writing systems, such as logographic, true alphabets and segmental scripts. Not sure if this is the cause of it, but my issue is that I noted that certain alphabet types, such as the \"featural linear alphabet\" used by e.g. Korean leads to words/characters being reused extensively with different meanings. Take for example 치다 which has <a href=\"http://dic.daum.net/word/view.do?wordid=kew000073484&amp;q=%EC%B9%98%EB%8B%A4&amp;page=1\" rel=\"nofollow\">the meaning of \"strike, hit, beat\", but also many many other meanings</a>. It is one of the most frequent used words (at position 366 of circa 6000). On the other hand, those words in English (a Latin alphabet language) are often very distinct, but they were counted to be only at <a href=\"http://en.wikipedia.org/wiki/Word_lists_by_frequency#English\" rel=\"nofollow\">30,000 (?) words</a>. At the same time, there are ~200.000 words though in Korean?</p>\n\n<p>I assume these effects may be similarly present in Chinese and Japanese, although my knowledge of those languages is limited. My question is now:</p>\n\n<p>How is the effect called in the Linguistics, in which a word has either (as in English) only a few (usually one) meanings vs. routinely having multiple meanings (as in Korean)?</p>\n", "Id":"3150", "AcceptedAnswerId":"3152", "Title":"How is the differing reuse of words depending on language called in Linguistics?", "CreationDate":"2013-01-30T20:22:31.790", "AnswerCount":"1", "Tags":"<vocabulary><word-sense-disambiguation>", "PostTypeId":"1", "OwnerUserId":"1363", "comments":[], "ViewCount":"69", "LastActivityDate":"2013-01-31T10:59:15.640", "Score":"3", "OwnerUser":{"UpVotes":"4", "DownVotes":"0", "Id":"1363", "AccountId":"352096", "Views":"0", "Reputation":"118", "CreationDate":"2012-09-28T14:40:03.403", "DisplayName":"grunwald2.0", "LastAccessDate":"2013-01-31T14:42:05.447", "Age":"28"}}