{"Body":"<p>First off, I was about asking this question on <a href=\"http://german.stackexchange.com/\">German Language &amp; Usage</a> since this is a feature specific to the German language. Possibly, this feature exists in other languages as well but as far as I know not in English. Anyway, since this question is about linguistics I think this is the right place.</p>\n\n<p>From what I know, transitivity, in linguistics, means whether or not a verb is followed by a direct object (called accusative in German). <em>To thank</em>, for example, is a transitive verb.  </p>\n\n<blockquote>\n  <p>*I thank.</p>\n  \n  <p>I thank you.</p>\n</blockquote>\n\n<p>In contrast, an intransitive verb must not take a direct object. <em>To die</em> is such a verb.</p>\n\n<blockquote>\n  <p>*He died something.</p>\n  \n  <p>He died.</p>\n</blockquote>\n\n<p><sub>(In addition, respective to comments: <em><a href=\"http://www.merriam-webster.com/dictionary/die\" rel=\"nofollow\">To die</a></em> is defined as intransitive by Merriam-Webster dictionaries but it seems to be ambitransitive, too, because <em>to die a death</em> is valid transitive use of <em>to die</em>.)</sub></p>\n\n<p>Some verbs can be followed by a direct object but this object is not necessary. These verbs are called ambitransitive. As example, consider the verb <em>to eat</em>.</p>\n\n<blockquote>\n  <p>I am eating.</p>\n  \n  <p>I ate an apple.</p>\n</blockquote>\n\n<p>And some transitive verbs additionally have a second object, the indirect object (dative in German). The appropriate term is ditransitive.</p>\n\n<blockquote>\n  <p>*I give.</p>\n  \n  <p>*I give you.</p>\n  \n  <p>I'll give you a chance.</p>\n  \n  <p>I'll explain it to you. </p>\n</blockquote>\n\n<p>Since the indirect object is the recipient of the direct object the indirect object can't be defined independently from an direct object, at least in English.</p>\n\n<blockquote>\n  <p>*I give to you.</p>\n</blockquote>\n\n<p>In German, however, you can put a dative object behind some intransitive verbs. <em>Danken</em> (English <em>to thank</em>) is one of those verbs.</p>\n\n<blockquote>\n  <p>Ich danke dir.</p>\n</blockquote>\n\n<p>In comparison to <em>I thank you</em>, <em>dir</em> is not an accusative in German and consequently not a direct object. I'd claim that in German it is possible to use an indirect object without a direct object.</p>\n\n<p>To cut a long story short: what is the appropriate term for intransitive verbs which take an indirect object or dative, respectively, though?</p>\n\n<hr>\n\n<p>Regarding comments:<br>\nI don't understand the discussion about the definition of transitivity. In the German sentence <em>Ich danke dir</em> the verb <em>danken</em> is intransitive. I think Dixon's definition is not relevant to this question. Of course, if it were <em>the definition par excellence</em> then <em>danken</em> would be transitive but before posting this question my research gave no inkling that I had to doubt whether <em>danken</em> is <em>intransitive</em> since it has no accusative object and that's the <em>most accepted</em> definition.<br>\n(Perhaps some linguistics will disagree. I'm not very familiar with linguistics but there's one rule I follow in general: If even experts don't agree then I stay with the most accepted definition until someone gives a persuasive counterargument.)<br>\nThat said, sources that handles the German language only, and therefore using the terms accusative and dative object rather than direct and indirect object, mentions that a verb in its transitive form has to be followed by an accusative object.</p>\n\n<p>That said, in the sentence above <em>danken</em> is intransitive. @jlawler confirms this when saying \"Transitivity is not a property of verbs per se, but of verbs in a particular sentence -- or perhaps, better, only of sentences\" although I think he actually wanted to say the opposite.</p>\n\n<p>So, these discussion might be interesting but are unrelated to my question:  what are verbs called that are intransitive and followed by an dative object as <em>danken</em> in <em>Ich danke dir.</em></p>\n", "Id":"3151", "LastEditorUserId":"51", "Title":"What are intransitive verbs with dative complement called?", "CreationDate":"2013-01-30T20:49:35.770", "OwnerUserId":"1719", "PostTypeId":"1", "Tags":"<terminology><verbs><grammatical-object>", "AnswerCount":"1", "comments":[], "LastEditDate":"2013-02-24T02:26:00.240", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"286", "LastActivityDate":"2013-02-24T02:26:00.240", "Score":"3", "CommentCount":"13", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://n/a", "Id":"1719", "AccountId":"408616", "CreationDate":"2013-01-30T19:39:46.013", "AboutMe":"<p>I am a software engineer who is interested in improving his languages skills :)</p>\n", "Age":"29", "Location":"Germany", "DownVotes":"0", "Views":"2", "Reputation":"123", "DisplayName":"Em1", "LastAccessDate":"2013-11-08T12:47:23.997"}}