{"Body":"<p>I came across culture-specific meanings of concept 'blue' (that is, of a colour hue between green and violet) in various languages. We know its idiomatic meanings in Standard or American Englishes, but in Russian 'blue' (or, actually, light blue) /голубой/ has an idiomatic meaning 'gay' (referring to sexuality). </p>\n\n<p>In other languages, the word has some other idiomatic meanings, e.g. surprised/drunk in French, or 'police person' (in Latin American Spanish).</p>\n\n<p>Which other languages have specific idiomatic meaning for the colour? Not just in idiomatic sayings (e.g. like 'blue collar', or 'out of the blue'), but rather like a standalone word? </p>\n\n<p>Was such an idiomatic meaning in any ancient languages ever?</p>\n", "Id":"3182", "ClosedDate":"2013-02-23T14:31:54.717", "Title":"Which other languages have idiotmatic meaning for words meaning 'blue'?", "CreationDate":"2013-02-10T18:22:37.830", "AnswerCount":"2", "PostTypeId":"1", "OwnerUserId":"1686", "Tags":"<lexical-semantics><idiomaticity>", "comments":[], "ViewCount":"148", "LastActivityDate":"2013-02-23T14:28:19.157", "Score":"0", "CommentCount":"12", "OwnerUser":{"UpVotes":"145", "DownVotes":"36", "ProfileImageUrl":"http://i.stack.imgur.com/rZ1Oc.jpg", "Id":"1686", "AccountId":"2130467", "Views":"63", "Reputation":"1112", "CreationDate":"2013-01-19T17:49:32.827", "DisplayName":"Manjusri", "LastAccessDate":"2014-01-18T20:17:27.900", "AboutMe":"<p>I have no native language. I am more or less getting by in some tongues, and I can read and/or swear in douzens of other languages, but this doesn't mean I am an expert in them. By January 2013 I am 34 and wish to see the latter number growing. </p>\n\n<p>I study [cognitive] psychology and am planning to obtain some certificates in computer languages and programming.</p>\n\n<p>I enjoy horse riding, travelling, good cuisine, green Japanese tea, Russian and Spanish literatures and friendly company.</p>\n\n<p><strong>Fluent In:</strong> Dutch, English, Finnish, French, Russian, Spanish and Swedish.</p>\n\n<p><strong>Less Fluent:</strong> Danish, Estonian, Polish and Bulgarian, </p>\n\n<p><strong>Learning:</strong> Arabic, Chinese, Innuit, Japanese, Komi, Sanskrit, Tibetan and Yoruba.</p>\n\n<p><strong>Planning to Learn:</strong> Tangut, C, C++ &amp; Pascal</p>\n"}}