{"Body":"<p>How does languages with imperfect aspects typically convey distinctions between habitual, iterative, and progressive aspects?  </p>\n\n<p>In English, which does not mark its verbs for imperfect aspect, we have progressing \"-ing,\" we have adverbial to convey habitual aspect (\"always,\" \"usually,\" \"regulary\") and even an auxiliary, \"keep,\" that can convey iterative aspect.   </p>\n\n<p>In languages that do have imperfect aspect but no verb inflections or auxiliaries that mark distinct habitual, progressive, or iterative aspects, how are the concepts that answer to the latter three names conveyed? For example, is the use of adverbials to make these distinctions the most common strategy? </p>\n", "Id":"3295", "LastEditorUserId":"22", "AcceptedAnswerId":"3302", "Title":"How do languages with imperfect aspect typically convey distinctions between habitual, iterative, and progressive aspects?", "CreationDate":"2013-03-01T03:11:08.957", "OwnerUserId":"790", "PostTypeId":"1", "Tags":"<syntax><morphology><semantics><aspect>", "AnswerCount":"1", "comments":[], "LastEditDate":"2013-03-02T11:40:15.160", "LastEditedUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "ViewCount":"150", "LastActivityDate":"2013-03-02T20:39:51.990", "Score":"5", "CommentCount":"4", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}