{"Body":"<p>I am interested in learning a second language. To do this I have created a list of the 1000 most common words and phrases for a given language. I've also established sentences which contains each of these words. Acknowledging the challenge of making a truly comprehensive list of this type, I'm doing my best to include as much relevant information as I can.</p>\n\n<p>I want to know what the average vocabulary size is for someone capable of engaging in everyday casual discussions. Approximately how many words and phrases must one know to have a reasonably fluent conversation in a language? From this answer I plan to expand my vocabulary list.</p>\n\n<p>Examples of words and phrases that I think might well be in this list for English: apple, banana, gay, orange, apartment, sunny, leg, sex, word, sentence, pink, second, holidays, carry, finally, potato, onion, sometimes, rice, shower, whatever, pasta, since, plastic, always, fish, really, last, french, beef, pork, water, sea, fall, love, river, penis, chicken, knife, hit, fork, stolen, spoon, cup, brilliant, probably, cool, breast, dollar, box, foot, circle, fix, journey, help, always, between, ass, remember, sit, clock, run, buy, either, want, normal, fart, hairy, straight, time, internet, on the other hand, after all, kind of, hurry up, shut up, as well, not for long, lie down, oh my god, america, shampoo, pair, around, okay, under, table, money, milk, toilet paper, come on, pick it up, put it down, never, remember, business.</p>\n\n<p>Examples of words and phrases that might not find it onto the list: grumpy, lemon, adore, lawn, infant, hero, witnessed, miracle, punch, gorilla, tip, heel, knuckles, approximately, fluent, author, return, truly, salmon, moon, purple, pineapple, elbow, napkin, accordingly, assumption, as a matter of urgency, have a blast, go to town, get real, don't get me started, lighten up, get down</p>\n", "Id":"3333", "LastEditorUserId":"1835", "Title":"How many \"words\" do I need to learn?", "CreationDate":"2013-03-08T16:02:01.860", "OwnerUserId":"1835", "PostTypeId":"1", "Tags":"<vocabulary><frequency><second-lang-acquisition>", "AnswerCount":"4", "comments":[], "LastEditDate":"2013-03-09T22:28:43.837", "LastEditedUser":{"UpVotes":"18", "WebsiteUrl":"", "DownVotes":"1", "Id":"1835", "ProfileImageUrl":"http://i.stack.imgur.com/EErPs.jpg", "AccountId":"300614", "Views":"9", "Reputation":"81", "CreationDate":"2013-03-08T16:01:23.670", "DisplayName":"Baz", "LastAccessDate":"2014-01-18T10:13:07.010", "AboutMe":""}, "ViewCount":"1593", "LastActivityDate":"2013-11-05T13:05:27.817", "Score":"5", "CommentCount":"7", "OwnerUser":{"UpVotes":"18", "WebsiteUrl":"", "DownVotes":"1", "Id":"1835", "ProfileImageUrl":"http://i.stack.imgur.com/EErPs.jpg", "AccountId":"300614", "Views":"9", "Reputation":"81", "CreationDate":"2013-03-08T16:01:23.670", "DisplayName":"Baz", "LastAccessDate":"2014-01-18T10:13:07.010", "AboutMe":""}}