{"Body":"<p><a href=\"http://en.wikipedia.org/wiki/Abjad\" rel=\"nofollow\">\"Abjad\"</a> is a technical term for a kind of writing system which is used when contrasting them with other writing system types such as alphabets, abugidas, and syllabaries.</p>\n\n<p>There is also an Arabic word <a href=\"http://ar.wikipedia.org/wiki/%D8%A3%D8%A8%D8%AC%D8%AF\" rel=\"nofollow\">\"أبجد\"</a>.</p>\n\n<p>In reading various sources on the Internet some say the term was coined by <a href=\"http://en.wikipedia.org/wiki/Peter_T._Daniels\" rel=\"nofollow\">Peter T. Daniels</a>, which would imply that it's originally an English word which was borrowed into English.</p>\n\n<p>Other sources merely say that it's an Arabic word formed by the first four letters of the traditional Arabic alphabetical (abjadical?) order. This would imply that Daniels didn't coin it but was merely was responsible for borrowing it into English.</p>\n\n<p>Of course even the stories about Daniels coining the term give the reason for his invention being the traditional Arabic order of the letters.</p>\n\n<p>So is it a word used in Arabic since before Daniels started using it in English or has Arabic only used the word after he coined it as an English word?</p>\n", "Id":"3365", "AcceptedAnswerId":"3368", "Title":"Is the word \"abjad\" borrowed from Arabic or was it coined in English then borrowed by Arabic?", "CreationDate":"2013-03-12T06:49:35.823", "AnswerCount":"1", "Tags":"<terminology><etymology><english><history><arabic>", "PostTypeId":"1", "OwnerUserId":"51", "comments":[], "ViewCount":"124", "LastActivityDate":"2013-03-17T16:02:51.250", "Score":"1", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}