{"Body":"<p>I have recently started learning Esperanto because I thought it would be an interesting exercise to compare and contrast it with the natural languages I speak. Anyone who has done even light research on Esperanto know its two main selling points are its claim that <a href=\"http://www.esperanto-usa.org/node/77\">it's easy to learn</a> and its claim that <a href=\"http://en.wikipedia.org/wiki/Propaedeutic_value_of_Esperanto\">learning Esperanto first makes learning other languages easier</a>. For now I'm most interested about that second claim.</p>\n\n<p>Pretty much every website discussing Esperanto in some way references that second claim, usually by saying something to the effect of <a href=\"http://www.esperanto.net/veb/faq-2.html\">\"one may become more fluent in French by first studying Esperanto for 6 months and then studying French for a year and a half, rather than studying French for two continuous years.\"</a> This seems like a rather counter-intuitive notion and made me rather curious. None of these websites seems to offer any citations in support of this claim. In fact, a cursory Google Scholar search also turned up nothing.</p>\n\n<p>Furthermore, these websites offer conflicting accounts of why learning Esperanto is supposed to make learning other languages easier. Some claim that <a href=\"http://en.wikipedia.org/wiki/Propaedeutic_value_of_Esperanto#Language_teaching_introductory_effect\">Esperanto helps learners become aware of the essential characteristics of language</a> which allows them to focus on their target language more clearly. Others claim that Esperanto's ease and quickness of learning <a href=\"http://www.fluentin3months.com/2-weeks-of-esperanto/\">allows learners to gain confidence speaking in a foreign language</a> which they can then take with them to their target language.</p>\n\n<p>Does anyone on this board know of any academic sources which address this claim (either supporting or refuting)? I'd be particularly interested to see any experiments which explicitly tested this notion that 6 months Esperanto + 18 months of another language is better than 24 months of that same language.</p>\n", "Id":"3397", "LastEditorUserId":"1055", "FavoriteCount":"1", "AcceptedAnswerId":"3399", "Title":"What research has been done on the effects of learning Esperanto on acquiring other languages?", "CreationDate":"2013-03-18T13:32:06.897", "OwnerUserId":"1055", "PostTypeId":"1", "Tags":"<reference-request><second-lang-acquisition><esperanto>", "AnswerCount":"1", "comments":[], "LastEditDate":"2013-03-18T15:17:09.363", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "ViewCount":"188", "LastActivityDate":"2013-03-19T03:06:40.217", "Score":"8", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}