{"Body":"<p>By \"loanword,\" I'm referring to words borrowed into language X from other languages and altered only as the phonology of language X requires.   Examples would include \"le weekend\" in French, \"das Internet\" in German.</p>\n\n<p>What, if any, aspects of linguistic typology affect the percentage of loanwords that a given language has in its lexicon?   </p>\n\n<p>Obviously, many other factors affect the percentage of loanwords in a language's lexicon.   I can think of a few off the top of my head.    How much contact do the speakers of language X have with the speakers of other languages?  Are the speakers of language X a minority culture in the area where language X is spoken?   How often to the speakers of a language calque foreign terms instead of just adapting foreign words to language X phonology?    </p>\n\n<p>My question is, are there any instances in which language typology influences the percentage of loanwords in a given language?   For example, all other things being equal, would a language with a lexicon dominated by bound morphemes have fewer loanwords than a language with a lexicon dominated by free morphemes?   </p>\n", "Id":"3455", "AcceptedAnswerId":"4134", "Title":"What, if any, aspects of linguistic typology affect the percentage of loanwords that a language has in its lexicon?", "CreationDate":"2013-03-29T02:50:33.330", "AnswerCount":"1", "Tags":"<morphology><lexicon>", "PostTypeId":"1", "OwnerUserId":"790", "comments":[], "ViewCount":"99", "LastActivityDate":"2013-08-08T02:14:38.090", "Score":"2", "CommentCount":"3", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}