{"Body":"<p>I have been told that the best way to learn a new language is through immersion, i.e. placing oneself in an environment in which only the target language is spoken and making constant use of the target language.   I do not know what would supplement this exposure for an adult learner.   </p>\n\n<p>But my question concerns people who learn languages that have no living native speakers, as well as people who need to learn to speak and read in a language but cannot live in a place where the language is spoken by almost everyone.   </p>\n\n<p>Apparently, some people can learn languages through book-study alone;  some scholars can fluently speak Sumerian and Ancient Egyptian, for example.  And I have heard that living languages can be learned in this way.  </p>\n\n<p>But what are the specific disadvantages of book-learning a language over learning the same language through immersion? </p>\n", "Id":"3458", "LastEditorUserId":"1055", "AcceptedAnswerId":"3462", "Title":"What are some of the disadvantages of learning a language through book-study as opposed to immersion?", "CreationDate":"2013-03-29T03:58:46.603", "OwnerUserId":"790", "PostTypeId":"1", "Tags":"<second-lang-acquisition>", "AnswerCount":"2", "comments":[], "LastEditDate":"2013-03-29T05:41:18.773", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "ViewCount":"895", "LastActivityDate":"2013-03-30T15:19:38.967", "Score":"3", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}