{"Body":"<p>Most of the isolating languages I am familiar with have context-bound semantics either in division into parts of speech (e.g. Chinese) or word meaning (Yoruba), or both (Chinese, again). E.g., in Chinese, the meaning of 来 in 来世 'future life' or in 来来! 'come on, move!' is different, the former having an approximate meaning of adjective, the latter roughly corresponding to an imperative form. Or the actual meaning of Yoruba ní 'on, at, in' and sí ‘onto, towards’ are to be defined by context.</p>\n\n<p>Can anyone provide more examples from other isolating languages to shed some more light on this theory?</p>\n", "Id":"3498", "Title":"Is there a correspondence between contextual semantics and the type of language?", "CreationDate":"2013-04-06T20:59:04.720", "OwnerUserId":"1686", "PostTypeId":"1", "Tags":"<linguistic-typology><comparative-linguistics>", "comments":[], "ViewCount":"43", "LastActivityDate":"2013-04-06T20:59:04.720", "Score":"0", "CommentCount":"7", "OwnerUser":{"UpVotes":"145", "DownVotes":"36", "ProfileImageUrl":"http://i.stack.imgur.com/rZ1Oc.jpg", "Id":"1686", "AccountId":"2130467", "Views":"63", "Reputation":"1112", "CreationDate":"2013-01-19T17:49:32.827", "DisplayName":"Manjusri", "LastAccessDate":"2014-01-18T20:17:27.900", "AboutMe":"<p>I have no native language. I am more or less getting by in some tongues, and I can read and/or swear in douzens of other languages, but this doesn't mean I am an expert in them. By January 2013 I am 34 and wish to see the latter number growing. </p>\n\n<p>I study [cognitive] psychology and am planning to obtain some certificates in computer languages and programming.</p>\n\n<p>I enjoy horse riding, travelling, good cuisine, green Japanese tea, Russian and Spanish literatures and friendly company.</p>\n\n<p><strong>Fluent In:</strong> Dutch, English, Finnish, French, Russian, Spanish and Swedish.</p>\n\n<p><strong>Less Fluent:</strong> Danish, Estonian, Polish and Bulgarian, </p>\n\n<p><strong>Learning:</strong> Arabic, Chinese, Innuit, Japanese, Komi, Sanskrit, Tibetan and Yoruba.</p>\n\n<p><strong>Planning to Learn:</strong> Tangut, C, C++ &amp; Pascal</p>\n"}}