{"Body":"<p>My friend/coworker and I got into a pretty heated discussion about a label for a graph I had made and the units I was using.  We work in internet advertising where there is a type of unit (I consider it a unit anyway) called a \"CPM\" (Cost Per Million, in dollars usually).  To give some visualization to some data we're collecting, I made a line graph to see CPM over Time (seconds).  I used CPM because the amount of money per second was too small to do in normal dollars.  </p>\n\n<p>My friend then saw the label for the graph, something like \"CPM/Second\", and the argument ensued.  His claim was it could only be used as a rate and nothing else.  Where he is getting confused (again, I think), is saying you are paying per million when you are only paying for one unit is sort of weird to think about.  While knowing that it is often used as a rate, I also know it has been used as a unit and I don't see why that wouldn't make sense anyway.  </p>\n\n<p>My question is do humans interpret rates (Cost Per Milli, X Per Y, etc...) differently from absolute units? Are their any languages where this might be the case?</p>\n", "Id":"3519", "LastEditorUserId":"1055", "Title":"Rates and Units: The difference?", "CreationDate":"2013-04-11T02:29:42.120", "OwnerUserId":"1948", "PostTypeId":"1", "Tags":"<semantics>", "comments":[], "LastEditDate":"2013-04-11T02:51:44.290", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "ViewCount":"53", "LastActivityDate":"2013-04-11T02:51:44.290", "Score":"0", "CommentCount":"4", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"1948", "AccountId":"435268", "Views":"0", "Reputation":"101", "CreationDate":"2013-04-11T02:27:55.220", "DisplayName":"tonyl7126", "LastAccessDate":"2013-04-11T17:20:07.607"}}