{"Body":"<p>Chinese dialects, Korean, and Japanese all use Chinese characters in their writing systems, at least in some capacity. Chinese trivially so, Japanese through Kanji, and Korean through Hanja. As to be expected, each language has developed their own logographic simplifications as well as they differ in their pronunciation of various characters.</p>\n\n<p>I cannot speak for Japanese, but Korean's pronunciations <a href=\"http://en.wikipedia.org/wiki/Hanja#Pronunciation\" rel=\"nofollow\">seem to be related to the Chinese pronunciations of some older form of Chinese</a> but both languages have undergone sound changes meaning the differences are sometimes non-trivial.</p>\n\n<p>I have noticed (and previously described <a href=\"http://linguistics.stackexchange.com/questions/3027/why-do-we-call-some-countries-a-different-name-than-the-people-of-that-country/3028#3028\">here</a>) that some Korean words, mostly proper nouns, can only be explained if they are translated literally from their written form, like some special form of a calque.</p>\n\n<p>For example, the Korean word for \"USA\", <code>미국</code> (<em>mikuk</em>), is <a href=\"http://krdic.naver.com/detail.nhn?docid=14684900\" rel=\"nofollow\">derived from the Hanja <code>美國</code></a>. These are the same characters Mandarin uses for \"USA\". <a href=\"http://en.wiktionary.org/wiki/%E7%BE%8E%E5%9C%8B#Etymology\" rel=\"nofollow\">This etymology for the Mandarin <code>美國</code></a> (<em>měiguó</em>) shows that it must have originated in Mandarin (or some form of Chinese) before being adopted into Korean:</p>\n\n<blockquote>\n  <p>America -> 亞美利加 (<em>yàměilìjiā</em>) -> 美國 (<em>měiguó</em>)</p>\n</blockquote>\n\n<p>(I've heard arguments that <code>미국</code> is actually derived from Chinese by way of Japanese, but this would not affect the phenomenon I am describing)</p>\n\n<p>If Koreans had adopted <code>美國</code> through a phonological process alone, one would expect something like <code>메궈</code> (<em>mekweo</em>). The Korean transliteration for \"America\" is <code>아메리카</code> (<em>amelikha</em>). As such, it's hard to explain the presence of <code>미</code> (<em>mi</em>) through any type of phonological adoption alone.</p>\n\n<p>However, we can easily predict the appearance of <code>미</code> (<em>mi</em>) from the character <code>美</code> (literally meaning \"beauty\") which is consistently pronounced as <code>미</code> (<em>mi</em>) even in situations not referring to the USA. For example, <code>미용실</code> (<code>美容室</code>, <em>miyongsil</em>, a beauty parlour). Similarly, <code>國</code> is consistently pronounced <code>국</code> (<em>kuk</em>) even in situations not referring to the USA. For example, <code>국회</code> (<code>國會</code>, <em>kukhoy</em>, the National Assembly). This is why I feel that the Korean pronunciation <code>미국</code> (<em>mikuk</em>) had to be adopted from the Chinese written form, not spoken.</p>\n\n<p>However, there are alternatives. There is evidence that <a href=\"http://en.wikipedia.org/wiki/Hanja#Pronunciation\" rel=\"nofollow\">Korean sound change was more conservative</a> when it came to the pronunciation of Sino-Korean vocabulary than some Chinese dialects. It is entirely possible that the original pronunciation of <code>美國</code> was closer to <em>mikuk</em> even in Chinese before sound change resulted in modern Mandarin's <em>meiguo</em>. Unfortunately I cannot rule this out as I do not know when <code>美國</code> entered the Chinese vocabulary but subjectively the <em>mei</em> in <em>meiguo</em> is a closer transliteration than the <em>mi</em> in <em>mikuk</em> and the difference in pronunciation can easily be explained by Hanja pronunciation rules (I am aware the subjective judgements are not evidence).</p>\n\n<p>A clearer example is the Korean word for \"Germany\", <code>독일</code> (<em>dokil</em>). This <a href=\"http://en.wiktionary.org/wiki/%EB%8F%85%EC%9D%BC#Etymology\" rel=\"nofollow\">was derived from the Japanese transliteration of \"Deutsche\"</a> (as in \"Deutschland\"), <code>ドイツ</code> (<em>doitsu</em>). If Koreans had transliterated it themselves we would expect to see <code>도이치</code> (<em>doichi</em>). Similarly, if Korean had adopted it from the Japanese through phonological methods alone we would expect either <code>도이치</code> again or possibly <code>도이즈</code> (<em>doiceu</em>), again making it hard to explain the Korean pronunciation through phonological means. However, like before we can easily explain the Korean pronunciation using Hanja character pronunciations:</p>\n\n<blockquote>\n  <p>Deutsche ->  ドイツ (<em>doitsu</em>, Katakana) -> 独逸 (Kanji) -> 獨逸 (Kyūjitai/Hanja) -> 독일 (<em>dokil</em>)  </p>\n</blockquote>\n\n<p>Note that the Katakana, Kanji, and Kyūjitai forms are pronounced identically and I am not implying they are discrete steps in the derivation just that I include them as evidence for the relationship between <code>ドイツ</code> and <code>독일</code>. Also note that the Mandarin word for \"Germany\" uses unrelated characters and shows a different etymology.</p>\n\n<p>This phenomenon even applies to names of people:</p>\n\n<blockquote>\n  <p><a href=\"http://en.wikipedia.org/wiki/Jet_Li\" rel=\"nofollow\">李连杰</a> (<em>lǐ liánjié</em>, Simplified Chinese) -> 李連杰 (Traditional Chinese/Hanja) -> <a href=\"http://ko.wikipedia.org/wiki/%EC%9D%B4%EC%97%B0%EA%B1%B8\" rel=\"nofollow\">이연걸</a> (<em>iyeonkeol</em>)</p>\n</blockquote>\n\n<p>In summary, Korean has an internally consistent system for pronouncing Chinese characters (called Hanja in Korean). All Sino-Korean words have a written form using Hanja characters which can be found in any Korean dictionary (although non Sino-Korean words do not have Hanja forms). In some cases it is almost impossible to explain the Korean pronunciation of a borrowing though phonological processes alone but trivial if one considers the borrowing's Hanja written form. This means that it's the written form that affects the word's pronunciation instead of the expected opposite.</p>\n\n<p>Is there a name for this type of phenomenon, specifically with respect to borrowings? Does this phenomenon occur in any language other than Korean? (I suspect it occurs in all languages which relied heavily on Chinese script at any point in their history, but I do not have any examples) Is this phenomenon unique to Chinese script due to its ideographic nature and other geopolitical factors?</p>\n\n<p>Is there any special term for a word's written form causing its spoken form to be reevaluated (even language-internally)? I would appreciate any examples of such.</p>\n", "Id":"3597", "LastEditorUserId":"1055", "Title":"Are there any other examples of words being borrowed via their written forms only (or written forms causing reevaluations of spoken forms)?", "CreationDate":"2013-04-22T07:03:25.883", "OwnerUserId":"1055", "PostTypeId":"1", "Tags":"<historical-linguistics><written-language>", "AnswerCount":"1", "comments":[], "LastEditDate":"2013-04-22T11:16:40.423", "LastEditedUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}, "ViewCount":"156", "LastActivityDate":"2013-04-22T11:56:05.883", "Score":"1", "CommentCount":"9", "OwnerUser":{"UpVotes":"102", "WebsiteUrl":"", "Location":"Seoul, South Korea", "Id":"1055", "DownVotes":"9", "AccountId":"1453460", "Views":"21", "Reputation":"1947", "CreationDate":"2012-05-29T05:50:57.073", "DisplayName":"acattle", "LastAccessDate":"2014-01-17T00:59:41.983", "AboutMe":"<p>I am currently studying for an MA in Computational Linguistics even though my background is not in linguistics. I discovered Computational Linguistics while receiving my B.A.Sc in Software Engineering when I built a basic bigram parser for an AI assignment. This caused me to become interested in linguistics and to take a few introductory level courses. I currently have completed my first year of my masters and am currently looking for a thesis topic.</p>\n"}}