{"Body":"<p>I know Chinese is related to some quite different languages like Tibetan and Burmese, the latter of which is native outside the territories which might be thought of as \"Chinese language territories\".</p>\n\n<p>I know there are a good few languages within China which belong to unrelated families, such as Uyghur and Zhuang.</p>\n\n<p>I know there are languages in nearby countries which superficially share features such as tonality, lack of inflection, and tendency to prefer single-syllable words.</p>\n\n<p>But then I began to wonder if there are any members of the Sinitic family itself which are native to anywhere beyond the borders of these \"Chinese language countries\".</p>\n\n<p>For the purposes of this question I'm not asking about the obviously vast diaspora of speakers of Chinese languages all over the world. A language solely outside these lands would be the most interesting but languages that span both sides of any border are also worth knowing about. I wasn't really thinking of any pidgins or creoles but I suppose those might be within the scope of my question...</p>\n", "Id":"3635", "Title":"Is any member of the Sinitic family native outside the borders of China / Taiwan / Hong Kong / Macau?", "CreationDate":"2013-05-03T14:35:01.393", "OwnerUserId":"51", "PostTypeId":"1", "Tags":"<languages-of-china><sino-tibetan>", "comments":[], "ViewCount":"40", "LastActivityDate":"2013-05-03T14:35:01.393", "Score":"0", "CommentCount":"2", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}