{"Body":"<p>I would like to make a hierarchy of verbal accidents that would have the \nfollowing features.</p>\n\n<ol>\n<li><p>For any two accidents in the hierarchy, if a language marks only one\nof them  by lexical suppletion, it is significantly likelier to be\nthe one earlier in the  hierarchy.</p></li>\n<li><p>For any two accidents in the hierarchy, if a language marks only one of them  by an auxiliary word, it is significantly likelier to be the one later in the  hierarchy.  </p></li>\n<li><p>For any three accidents in the hierarchy, if a language marks both the  earliest one and the latest one by morphology, it is significantly likely to also  mark the intermediate one by morphology.  </p></li>\n<li><p>For any two accidents in the hierarchy which a language marks both of by  morphology,  </p>\n\n<ul>\n<li>if only one of them is by stem-alteration it is probably the earlier one in the  hierarchy;  </li>\n<li>if only one of them is by affixation it is probably the later one in the  hierarchy.  </li>\n</ul></li>\n<li><p>For any two accidents in the hierarchy which a language marks both of by  affixes, if both affixes are on the same side of the root, then it is significantly  likely that the one earlier in the hierarchy is marked closer to the root.  </p></li>\n</ol>\n\n<p>I am aware that it might not be possible to fully satisfy all of these desiderata with just one hierarchy; and that perhaps the \"hierarchy\" would be only partially-ordered rather than \"linearly\" ordered.\nThat's OK; I just want to get as close as I can.</p>\n\n<p>To start with I'm going to consider just the following accidents:</p>\n\n<ol>\n<li>Aspect  </li>\n<li>Modality, mode, and/or mood</li>\n<li>Polarity  </li>\n<li>Tense  </li>\n<li>Voice</li>\n</ol>\n\n<p>Pluractionality, evidentiality, mirativity, validationality, etc., I might work in \nlater.\nAlso, \"modality/mode/mood\" might be two (or more?) accidents instead of one; so might voice.\nAnd possibly not every language would have every accident; for that matter maybe some languages don't have a \"verbs\" \"part-of-speech\", though I gather most have something close enough.</p>\n\n<p>My original hypothesis, which might be complete hogwash, or might be only partially \ntrue, is that the hierarchy is more-or-less the following:</p>\n\n<p>Aspect > Voice > Tense > Polarity > Modality/mode/mood</p>\n\n<p>And here's why;</p>\n\n<p>Of those five accidents, the one that has the most influence on the actual \nmeaning of the verb is Aspect.</p>\n\n<p>Of those five accidents, modality/mode/mood tends to be about what the speaker expects \nthe addressee to do with the clause, or how the clause fits into the discourse, \nor how the speaker feels about the clause, etc.; and tends to apply to the \nwhole clause rather than just the verb.  It doesn't really change the meaning \nof the verb itself.</p>\n\n<p>And tense is intermediate between aspect and m/m/m.</p>\n\n<p>Up 'til that, I'm pretty sure my reasons are opinions shared by most \nprofessional linguists; the thing I'm not sure of is that it has any significant \ninfluence on most languages' morphology.</p>\n\n<p>As for the rest of the hierarchy;\nI guess that Voice is between Aspect and Tense.<br>\nI guess that Polarity is between Tense and Modality/Mode/Mood.  </p>\n\n<hr>\n\n<p>Does anyone here know of anyone who actually knows anything about these \nquestions?\nCan anyone here point me toward a resource (preferably a URL) that answers \nsome of them?\nWould anyone here care to speculate about any of it that no resource (as far as \nyou know) definitively answers?</p>\n\n<p>Thanks.</p>\n", "Id":"365", "LastEditorUserId":"51", "FavoriteCount":"3", "Title":"Hierarchy of morphology, auxiliaries, and suppletion of verbal accidents?", "CreationDate":"2011-09-21T18:15:07.983", "OwnerUserId":"236", "PostTypeId":"1", "Tags":"<morphology><linguistic-universals><cross-linguistic><verbs><suppletion>", "AnswerCount":"4", "comments":[], "LastEditDate":"2011-09-23T13:21:17.900", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"314", "LastActivityDate":"2012-03-05T15:10:44.390", "Score":"9", "CommentCount":"5", "OwnerUser":{"UpVotes":"3", "DownVotes":"0", "Id":"236", "AccountId":"927009", "Views":"2", "Reputation":"76", "CreationDate":"2011-09-21T18:15:08.000", "DisplayName":"eldin raigmore", "LastAccessDate":"2011-09-23T20:06:51.117"}}