{"Body":"<p><em>I originally posted this question on the Philosophy.stackexchange site</em></p>\n\n<p>This question was prompted by this newspaper article saying:</p>\n\n<p>Languages spoken by billions of people across Europe and Asia are descended from an ancient tongue uttered in southern Europe at the end of the last ice age, according to research...by scientists in Britain, [and] points to a common origin for vocabularies as varied as English and Urdu, Japanese and Itelmen, a language spoken along the north-eastern edge of Russia.\nLinguistics conventionally divide human languages into families. For example the Indo-European family which contains Latin, Sanskrit and Greek amongst others.</p>\n\n<p>However it seems to me that all languages must be related in the same way that all life on Earth is related even though there are marked similarities between certain species.</p>\n\n<p>I cannot see how, even taking into account Chomskys idea of a universal grammar intrinsic to the human mind, how a language can spontaneously develop in total absence of another human being simply because a human babies and infants are utterly helpless and dependent. (Is there any evidence of this ever occurring)?</p>\n\n<p>That is there is always spoken linguistic continuity; and languages should be considered in a continuum.</p>\n\n<p>Is this correct? Or am I missing something? Or is it a trite truth?</p>\n\n<p>The point of the question, is that if Chomskys Universal Grammar hypothesis is correct, and I suspect it is; then language contrary to the above hypothesis orginated where Man originated - in the African continent and marched out of it when he did too.</p>\n", "Id":"3655", "ClosedDate":"2013-05-07T15:35:31.147", "Title":"Are all languages related?", "CreationDate":"2013-05-07T15:16:43.590", "AnswerCount":"1", "PostTypeId":"1", "OwnerUserId":"2029", "Tags":"<language-families>", "comments":[], "ViewCount":"158", "LastActivityDate":"2013-05-07T15:24:05.430", "Score":"1", "CommentCount":"0", "OwnerUser":{"UpVotes":"2", "ProfileImageUrl":"http://i.stack.imgur.com/sw7YK.jpg", "Id":"2029", "AccountId":"961274", "CreationDate":"2013-05-07T15:13:13.843", "AboutMe":"<p>Education: Mathematics BA, Theoretical Physics Msc.\nInterested in Philosophy, Poetry, Theology and Art</p>\n\n<p>Do you friend, know what it's all about?\nThe sun, a picture of health\nhangs still as a citrus fruit on a calm day.\nFlinty reflections in glass staring back at you,\nimitating each mellow or awkward move -\nNarcissus would not have known.</p>\n\n<p>Do you friend, know what its all about?\nConversation hiding open-eyed deceit.\nMustard oil for hasher-dim fried.\nLaughter with knives and smiles \n - for the coup-de-grace.\nPersophone in spring may know.</p>\n\n<p>And will we know what its all about? \nForever losing the living situation, \nOur inorganic sense drags us under,\nas our organic sense makes us hunger.</p>\n\n<ul>\n<li>Mozibur Ullah, Mar 2013</li>\n</ul>\n", "Age":"45", "Location":"London, United Kingdom", "DownVotes":"0", "Views":"1", "Reputation":"116", "DisplayName":"Mozibur Ullah", "LastAccessDate":"2013-07-04T19:15:07.927"}}