{"Body":"<p>I'm not very updated on random theories regarding the Altaic theory (which I personally am agnostic about; though I slant towards not believing in it due to the extreme lack of any regular sound change patterns from \"Proto-Altaic\") and the classification of Korean and Japanese, and English Wikipedia generally regards the consensus being that Japonic and Korean are isolates. However, the Chinese Wikipedia gives many, many theories, and the Japonic language family is also regarded as controversial (!) in many articles in CW. However, the Chinese Wikipedia is quite famous for not citing things properly and containing boatloads of \"weasel words\" in part due to common Chinese style abusing the word 据说 (it is said; according to some) a lot. This huge block from Chinese Wikipedia has very little footnotes, so I'd like some help on distinguishing viable theories from fringe or probable Wikipedia editor pet theories.</p>\n\n<p>Here's a translation of the relevant parts from <a href=\"https://zh.wikipedia.org/wiki\">https://zh.wikipedia.org/wiki</a>/阿尔泰语系 , with the original.</p>\n\n<blockquote>\n  <p>朝鲜语、日本语（包括琉球语）的系属一直都是学术界争论的焦点、基本上可以有五类的观点</p>\n</blockquote>\n\n<p>The classsification of Korean and Japanese (including Ryukyuan) has always been a focus for academic debate. There are generally speaking five camps:</p>\n\n<blockquote>\n  <p>第一类观点认为朝鲜语、日本语即使属于该语系，也只能在阿尔泰超语系假说（Macro-Altaic theory）上成立，因为朝鲜语、日本语有着一些阿尔泰语系的语言特征。</p>\n  \n  <ol>\n  <li><p>流音不会出现在本土词汇（固有词）的首个音节上</p></li>\n  <li><p>元音和谐律（或称元音调和）</p></li>\n  <li><p>黏着语的特征</p></li>\n  <li><p>但缺少人称后缀</p></li>\n  </ol>\n  \n  <p>如通古斯语(赫哲) Mini bithe-i 我的书 Bi mini bithe-we-i hvla-i.我读我的书。 bithe-we-i中的we是受格后缀，而i是第一人称领属后缀。hvla-i中的i为动词第一人称后缀。 [...]</p>\n  \n  <p>日本语的这三个语言特征为该观点提供了相当有力的支持。由于日本语跟阿尔泰语系的其他语言之间的同源词汇非常少，所以反对该观点的学者一般都以此作为反驳的力证。</p>\n</blockquote>\n\n<p>The first camp believes that Korean and Japanese do belong to this [Altaic] family, which could only be true if the Macro-Altaic theory is true, because Korean and Japanese have some Altaic characteristics. (<em>note</em>: this sentence is equally awkward in the original)</p>\n\n<ol>\n<li><p>Liquids do not appear in the first syllable of native words</p></li>\n<li><p>Vowel harmony</p></li>\n<li><p>Agglutination</p></li>\n<li><p>Conjugation for person (however, J/K does not have this one)</p></li>\n</ol>\n\n<p>[A typical Altaic languages] such as Tungusic (Nanai) <em>Mini bithe-i</em> \"My book\" <em>Bi mini bithe-we-i hvla-i</em> \"I'm reading my book\". (<em>note</em>: incomplete sentence in original) bithe-we-i's \"we\" is a patientive suffix, while \"i\" is a ferst person genitive (?) suffix. hvla-i's \"i\" is a first person conjugation for the verb.</p>\n\n<p>The remaining three characteristics do belong to Japanese, giving this theory significant support. However, Japanese shares very little vocabulary with other Altaic languages, so scholars against this viewpoint take this as strong evidence against this view.</p>\n\n<blockquote>\n  <p>[...]\n  [...]</p>\n  \n  <p>第二类观点认为日本语跟朝鲜语共属于一个新的语系。持该观点的学者认为日本语的文法与朝鲜语的文法有惊人的相似度，都是使用主宾谓序列，且两者历史上又共同受过古汉语的强烈影响。因此有学者认为日本语跟朝鲜语是阿尔泰语系和汉藏语系混合的新语系。但是日本语跟朝鲜语之间缺乏同源词也成了异议的学者们反驳该观点的力证。</p>\n</blockquote>\n\n<p>The second camp believes Japanese and Korean belong to a new [i.e. separate] language family. Scholars believing in this theory think that Japanese grammar is shockingly similar to that of Korean - both use SOV - and both have had strong influence from Old Chinese. Thus, some people believe that Japanese and Korean is a mixed language family arising from the creolization of Sino-Tibetan and Altaic. However, the lack of common vocabulary between Japanese and Korean also becomes a arguing point for dissenters.</p>\n\n<blockquote>\n  <p>第三类观点认为日本语跟琉球语共属于一个新的语系，即日本语系。由于日本语跟琉球语之间确有不少相似性，故此观点得到了一些学者的支持，但仍然并没有被广泛认同。</p>\n</blockquote>\n\n<p>The third camp believes Japanese and Ryūkyūan belongs to a new family, the Japonic family. Since Japanese and Ryūkyūan do have many similarities, this theory receives the support of some scholars, but remains controversial.</p>\n\n<blockquote>\n  <p>第四类观点认为日本语跟朝鲜语一样，都是孤立语言，而它们跟目前世界上已知的语系都没有关联。持该观点的学者们以“同源词问题”支持该观点。</p>\n</blockquote>\n\n<p>The fourth camp believes that Japanese and Korean are both isolates, unrelated to other languages of the world. Scholars believing in this view support it with the \"lexical similarity problem\".</p>\n\n<blockquote>\n  <p>第五类观点认为日本语应当归属汉藏语系藏缅语族，主要以西田龙雄为代表的一些日本学者，认为日本语的语序与缅甸语相同，而且也有与缅甸语及中国南方方言近似的词汇，甚至在音韵上也有好些类似之处，因而主张日本语应归属藏缅语族[1]。但是持反对意见的人认为，日本与藏缅语民族地区之间路途遥远，中间还隔着南岛语系和满-通古斯语族的民族地区，故此观点大多未加以重视。然而，有些学者提出应当以民族迁徙历史来看待此说，他们说:虽然今天的民族分布看起来日本和藏缅语族相隔甚远，但是在商周时期，一些藏缅语族、南支古亚洲族(鸟田)和南岛语族混合，并且在汉藏(周)民族强大的压力下以其航海技术沿岸北上或南下透过朝鲜半岛南部进入九州岛定居。当时，通古斯族尚在蒙古高原东北部与北支古亚洲族(今楚科奇和朝鲜族之北方族源)竞争，故此说法极有可能。</p>\n</blockquote>\n\n<p>The fifth camp believes that Japanese should belong in the Sino-Tibetan family under Tibeto-Burman. This theory is supported by a camp of Japanese scholars led by Nishida, who holds that Japanese word order is similar to that of Burmese, and also has vocabulary similar to those of Burmese and southern Chinese dialects; even the pitch accent has similarities with the tonal systems of these languages. However, other people believe that since Japan is very far from both Tibet and Burma and separated by Austronesian and Tungusic language areas, this theory should be ignored. However, yet others think that according to race migration history, around the Shang and Zhou dynasties of China, some dialects of Tibeto-Burman and Austronesian mixed, and [their speakers] used their advanced seafaring skills to migrate to Korea and Kyūshū under the pressure of the Sino-Tibetan speakers (Zhou dynasty). At that time, the Tungusics have yet to set up home in the eastern Mongolian plateau, so this theory is extremely probable.</p>\n\n<blockquote>\n  <p>除了上述五类观点以外、还有学者认为日语应当属于南岛语系。</p>\n</blockquote>\n\n<p>Except the five above camps, some others believe Japnaese belong to Austronesian.</p>\n", "Id":"3667", "FavoriteCount":"2", "AcceptedAnswerId":"3688", "Title":"Is it accurate - Chinese Wikipedia on Japanese/Korean classification", "CreationDate":"2013-05-09T01:40:38.540", "AnswerCount":"1", "Tags":"<history><japanese><korean>", "PostTypeId":"1", "OwnerUserId":"2028", "comments":[], "ViewCount":"218", "LastActivityDate":"2013-05-11T09:33:31.080", "Score":"7", "CommentCount":"2", "OwnerUser":{"UpVotes":"27", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/y49By.png", "Id":"2028", "AccountId":"2107308", "Views":"6", "Reputation":"102", "CreationDate":"2013-05-06T22:04:41.097", "DisplayName":"user54609", "LastAccessDate":"2014-01-14T13:32:50.887", "AboutMe":"<p>Katie in raining icebergs save unknown ricocheting Finns, master Immelmann ran an instinct dotca, kiss rat sap four.</p>\n"}}