{"Body":"<p>[As per comments below, I have edited this question for greater clarity.]  </p>\n\n<p>I want to know whether a language without recursion, which would generate only a finite number of well-formed sentences, could still generate a potentially infinite amount of discourse.   </p>\n\n<p>As I understand it, the term \"recursive\" describes formal operations (including a grammar's generation of well-formed sentences and constituents) that can apply to their own output.   For example, the rules for forming relative clauses amount to a recursive operation, since relative clauses can be added to a noun phrase within some matrix relative clause.  Thanks to recursion, we have noun phrases such as the cat that ate the rat,\" \"the cat that ate the rat that ate the cheese,\" \"the cat that ate the rat that ate the cheese that attracted the roaches,\" and so on, <em>ad infinitum</em>.     </p>\n\n<p>When I say that recursion allows a grammar to generate a \"potentially infinite\" number of sentences, I mean that a formal description of the language's syntax would entail that the number of well-formed sentences in the language is infinite in principle.    </p>\n\n<p>When I say that a language without recursion is finite, I mean that such a language's syntax would entail that the number of well-formed sentences in the language would be finite.   This does NOT imply that a finite language couldn't generate enough sentences for its speakers to express themselves across contexts.   Neither does it mean that a finite language would necessarily be a simple one.   Dan Everett, a linguist who joined the Piraha-speaking community in South America to learn and study their language, has  claimed that Piraha is finite and has also described Piraha's verb formation as extremely complex.      </p>\n\n<p>Now so far, we've been talking only about sentences.  But we all know that people don't communicate in one-sentence telegrams.   We talk at length for various purposes.  In other words, we exhibit <em>discourse</em>.   AFAIK, a lot of human discourse is \"potentially infinite.\"   In other words, in many types of discourse, an instance of such a type of discourse could continue indefinitely in principle.   Hence expressions like \"That conversation will go on forever.\"   </p>\n\n<p>All this information prompted me to ask whether a language without recursion, which would have a finite number of sentences, could in principle allow discourse (such as conversations) that could in principle continue indefinitely.   I suspect that speakers of any language, finite or not, could go on talking forever in principle.  But I want to know if this is more than my suspicion.   </p>\n", "Id":"3673", "LastEditorUserId":"790", "AcceptedAnswerId":"3676", "Title":"Wouldn't a language without recursion still be non-finite at the level of discourse?", "CreationDate":"2013-05-09T04:01:36.687", "OwnerUserId":"790", "PostTypeId":"1", "Tags":"<theoretical-linguistics><recursion>", "AnswerCount":"3", "comments":[], "LastEditDate":"2013-08-02T07:46:12.057", "LastEditedUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}, "ViewCount":"206", "LastActivityDate":"2013-08-03T04:37:17.837", "Score":"4", "CommentCount":"7", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}