{"Body":"<p>A friend recently asked me this simple and fascinating question.</p>\n\n<blockquote>\n  <p>At what point in history were there the largest number of human\n  languages?</p>\n</blockquote>\n\n<p>Although a really precise answer needs a clear definition of a \"language\", I still find the question very interesting.</p>\n\n<p><strong>Notes.</strong>  Using a definition of a language which would today rate the number on Earth as being roughly that quoted by Ethnologue (6809) seems a useful place to start.   <a href=\"http://www.danielburke.com/files/howmany.pdf\">This paper</a> claims the number is currently decreasing.</p>\n\n<p>It is generally not a good idea to get too hung up on definitions (as Wittgenstein showed clearly when discussing the word <a href=\"http://en.wikipedia.org/wiki/Game#Ludwig_Wittgenstein\">\"game\"</a>). However Ethnologue has a nice page discussing the <a href=\"http://www.ethnologue.com/about/problem-language-identification\">problem of language identification</a> and how it relates to their method for counting languages.  The most relevant part is quoted here for completeness.</p>\n\n<blockquote>\n  <p>The ISO 639-3 standard\n  applies the following basic criteria for defining a language in\n  relation to varieties which may be considered dialects: Two related\n  varieties are normally considered varieties of the same language if\n  speakers of each variety have inherent understanding of the other\n  variety at a functional level (that is, can understand based on\n  knowledge of their own variety without needing to learn the other\n  variety). Where spoken intelligibility between varieties is marginal,\n  the existence of a common literature or of a common ethnolinguistic\n  identity with a central variety that both understand can be a strong\n  indicator that they should nevertheless be considered varieties of the\n  same language. Where there is enough intelligibility between varieties\n  to enable communication, the existence of well-established distinct\n  ethnolinguistic identities can be a strong indicator that they should\n  nevertheless be considered to be different languages. These criteria\n  make it clear that the identification of “a language” is not based on\n  linguistic criteria alone. The language entries in Ethnologue include\n  a listing of dialect names. In most cases, those listings are not\n  based on rigorous dialectology. Rather, these lists include all names\n  reported to us which may, at one time or another, have been used in\n  reference to a local variety of a language. Names listed may be\n  alternate names for the same linguistic variety.</p>\n</blockquote>\n", "Id":"3706", "LastEditorUserId":"2059", "Title":"When were there the most languages?", "CreationDate":"2013-05-13T20:44:22.367", "OwnerUserId":"2059", "PostTypeId":"1", "Tags":"<historical-linguistics>", "AnswerCount":"3", "comments":[], "LastEditDate":"2013-05-14T09:06:48.570", "LastEditedUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2059", "AccountId":"2494110", "Views":"1", "Reputation":"156", "CreationDate":"2013-05-13T20:42:03.933", "DisplayName":"felix", "LastAccessDate":"2014-01-11T08:29:28.120"}, "ViewCount":"298", "LastActivityDate":"2013-12-20T23:46:17.747", "Score":"11", "CommentCount":"1", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2059", "AccountId":"2494110", "Views":"1", "Reputation":"156", "CreationDate":"2013-05-13T20:42:03.933", "DisplayName":"felix", "LastAccessDate":"2014-01-11T08:29:28.120"}}