{"Body":"<p>Most if not all national or widely spoken languages with an inflecting or agglutinating typology do all of their inflecting at the end of the word. These are called \"suffixing languages\".</p>\n\n<p>This is true for nouns and verbs in all the European and East Asian languages I know much about.</p>\n\n<p>But there is another possibility where inflectional information is in the form of prefixes attached to the beginning of the word. These are known as \"prefixing languages\".</p>\n\n<p>Since I can't name any such languages off the top of my head, I'm wondering which language that has this property is the most widely spoken or has the most speakers. Is any a national language, co-official language, or local lingua franca?</p>\n\n<p>(Yes, combinations of both suffixing and prefixing are also possible, as is internal changes like in Semitic languages. Also I'm only asking about inflecting morphology, not derivational morphology, we know European languages use lots of derivation prefixes.)</p>\n", "Id":"3713", "Title":"Which prefixing language has the most speakers?", "CreationDate":"2013-05-15T02:48:59.523", "OwnerUserId":"51", "PostTypeId":"1", "Tags":"<linguistic-typology><inflection><agglutination><morphological-typology><affixes>", "comments":[], "ViewCount":"80", "LastActivityDate":"2013-05-15T02:48:59.523", "Score":"2", "CommentCount":"9", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}