{"Body":"<p>I'm wondering if there are any general morphological properties of proper names. If a word is used as a name, it will be constrained by whatever syntactic constraints that language uses from proper names, but are there any kind of cross-linguistic rules regarding any kind of morphological changes that take place.</p>\n\n<p>For example, if a new town was founded, and its name is derived from the word \"cheese\", and we added, say, \"ton\" or one of the many other morphemes common to place names in English, would we need to make any morphological changes to \"cheese\" to produce a name, or would you end with Cheeseton? Are there any cases were changes would need to be made? What about when combining more than one root word - can we say anything about the formation of town names back when morphemes like \"ton\" and \"chester\" still had a separate lexical meaning, and thus would have been treated differently? And for any such rules that might exist, are they any different from the rules governing the morphology of any other noun? And what about the names of people, languages, cultures - are there any general rules for where they come from? How does this extend cross-linguistically?</p>\n\n<p>I'm aware this a huge topic, so if there is published material on the topic, approaching it from a linguistic perspective, I'd be appreciative to be pointed in that direction even if no-one has any answers themselves.</p>\n", "Id":"3718", "LastEditorUserId":"783", "FavoriteCount":"2", "Title":"Morphology of proper names", "CreationDate":"2013-05-15T16:12:57.327", "OwnerUserId":"2070", "PostTypeId":"1", "Tags":"<morphology><cross-linguistic><names><onomastics><toponomastics>", "AnswerCount":"1", "comments":[], "LastEditDate":"2013-05-16T09:37:55.220", "LastEditedUser":{"UpVotes":"133", "WebsiteUrl":"http://None", "Id":"783", "AccountId":"1263184", "CreationDate":"2012-02-20T12:40:45.587", "AboutMe":"<p>English Language graduate.</p>\n", "Age":"24", "Location":"Wales", "DownVotes":"2", "Views":"16", "Reputation":"1036", "DisplayName":"Danger Fourpence", "LastAccessDate":"2014-01-16T19:41:06.517"}, "ViewCount":"275", "LastActivityDate":"2013-12-24T21:31:44.357", "Score":"5", "CommentCount":"2", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"", "DownVotes":"0", "Id":"2070", "AccountId":"2772279", "Views":"1", "Reputation":"26", "CreationDate":"2013-05-15T15:52:32.247", "DisplayName":"Niedfaru", "LastAccessDate":"2013-05-23T22:06:10.573", "AboutMe":""}}