{"Body":"<p>It's known that Literary Chinese (or Classical; <em>wényán</em> ), the language of historical Chinese texts, differs completely from modern Mandarin as well as from other spoken Chinese languages, not only in vocabulary but even syntax, grammatical particles, etc.</p>\n\n<p>One difference is that Literary has many single-syllable words, while Mandarin has a lot more polysyllables (especially disyllables).  The usual theory is that the spoken language, too, used to have the same short words as Literary, only with more phonemes available to distinguish syllables; as it lost phonemes, the ambiguity was compensated by adding more syllables.  This process (the theory goes) ended up creating a gulf between Literary and the vernacular (spoken).</p>\n\n<p>However, <a href=\"http://www.jstor.org/stable/1397604\">Henry Rosemont argues</a> that written Literary Chinese might have been a special, artificial register from the start—that the gulf was always there.  In the same vein, the linguist <a href=\"http://www.jstor.org/stable/2059728\">Victor Mair has found</a>  evidence of longer words (like <em>taolu</em> \"path, way\") being very archaic (at least 463 BCE in this case), and proposes that the short Literary words (like <em>tao</em> \"path, way\") would be truncations of the spoken language, not their predecessors.  According to this theory, Literary would be like a telegraphic notation abbreviated from the spoken Old Chinese, and never was anyone's mother tongue.</p>\n\n<p>I find this idea very intriguing, but not knowing Chinese, I'm having trouble finding more resources for or against it.  Could anyone suggest research or essays on this subject?</p>\n", "Id":"3724", "LastEditorUserId":"200", "FavoriteCount":"2", "Title":"On the idea that Classical Chinese may *not* be direct ancestor of modern Chinese languages", "CreationDate":"2013-05-16T16:41:53.977", "OwnerUserId":"200", "PostTypeId":"1", "Tags":"<historical-linguistics><reference-request><chinese><writing>", "AnswerCount":"2", "comments":[], "LastEditDate":"2013-05-17T18:16:51.760", "LastEditedUser":{"UpVotes":"15", "WebsiteUrl":"http://namakajiri.net/nikki", "Location":"Brazil", "Id":"200", "DownVotes":"0", "AccountId":"531597", "Views":"8", "Reputation":"421", "CreationDate":"2011-09-20T20:19:46.470", "DisplayName":"leoboiko", "LastAccessDate":"2013-09-16T22:57:14.117", "AboutMe":"<p>Japanese Studies grad student.  Major interests: writing systems, historical linguistics, literary theory, cultural studies.</p>\n"}, "ViewCount":"212", "LastActivityDate":"2013-08-12T15:48:29.350", "Score":"13", "CommentCount":"5", "OwnerUser":{"UpVotes":"15", "WebsiteUrl":"http://namakajiri.net/nikki", "Location":"Brazil", "Id":"200", "DownVotes":"0", "AccountId":"531597", "Views":"8", "Reputation":"421", "CreationDate":"2011-09-20T20:19:46.470", "DisplayName":"leoboiko", "LastAccessDate":"2013-09-16T22:57:14.117", "AboutMe":"<p>Japanese Studies grad student.  Major interests: writing systems, historical linguistics, literary theory, cultural studies.</p>\n"}}