{"Body":"<p>Kartvelian languages such Georgian have a very complex agglutinative verb structure.</p>\n\n<p>Georgian is very well studied but there's not a lot of self-study books or online sites that go really in depth. I do have several self-study books but they don't seem to cover everything, or some things are particularly hard to find.</p>\n\n<p>I came across a verb \"ატარებს\" (atarebs) / \"ტარება\" (tareba), \"to carry\" which has an initial \"a\" in one of the citation forms (third person singular present indicative) but not in the other citation form (verbal noun).</p>\n\n<p>But the form I encountered, \"ეტარებინა\" (etarebina) has an initial \"ე\".</p>\n\n<p>There are several kinds of prefixes that I am aware of but I can't figure out what this is. It's not a preverb since that is a closed class. Georgian has a complex relationship between a concept called <a href=\"http://linguistics.stackexchange.com/questions/2011/do-languages-besides-the-kartvelian-family-have-a-property-of-verbs-called-vers\">\"version\"</a> and another of \"polypersonal verbs\". I understand that these are single vowel prefixes and I've seen \"ე\" mentioned but not thoroughly treated.</p>\n\n<p>But Georgian is also famous for having many irregular verbs and lots of suppletion, and there could well be some other categories of the verb that I haven't even become aware of yet.</p>\n\n<p>In my quest I discovered on Wiktionary that <a href=\"http://en.wiktionary.org/wiki/%E1%83%90%E1%83%A2%E1%83%90%E1%83%A0%E1%83%94%E1%83%91%E1%83%A1#Conjugation\" rel=\"nofollow\">\"ეტარებინა\" is the third person singular pluperfect</a>, but this doesn't help me to understand at all the process that led to the initial vowel changing!</p>\n\n<p>Can anybody explain what is happening in this verb form?</p>\n", "Id":"3785", "Title":"Which features of Georgian verbs can cause an initial \"ა\" (a) to become an \"ე\" (e)?", "CreationDate":"2013-05-31T06:58:18.417", "AnswerCount":"2", "PostTypeId":"1", "OwnerUserId":"51", "Tags":"<morphology><verbs><georgian><morphological-analysis>", "comments":[], "ViewCount":"65", "LastActivityDate":"2013-06-08T14:42:35.023", "Score":"1", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}