{"Body":"<p>And is Tuscan regarded as a dialect or as a language by modern Italian linguists?</p>\n\n<p>I am interested mostly in <a href=\"http://en.wikipedia.org/wiki/Tuscan_dialect\" rel=\"nofollow\">its</a> lexical peculiarities, but some interesting features of syntax would be of a great value, too. </p>\n\n<p>The main thing is that the features should make this dialect different from other varieties of Italian and/or other Romance dialects/languages. </p>\n\n<p>Please notice that the phenomenon of <a href=\"http://en.wikipedia.org/wiki/Tuscan_gorgia\" rel=\"nofollow\">Tuscan gorgia</a> is already known to me. </p>\n\n<p>Have there ever been literature written in this dialect (and not in the Italian <em>per se</em>, which, to the best of my knowledge, is also based on Tuscan)? Are there any documents to attest its development on time?</p>\n", "Id":"3903", "Title":"What are the most specific features of Tuscan dialect of Italian?", "CreationDate":"2013-06-24T06:57:15.597", "AnswerCount":"1", "PostTypeId":"1", "OwnerUserId":"1686", "Tags":"<dialects><italian>", "comments":[], "ViewCount":"204", "LastActivityDate":"2013-11-24T20:53:14.963", "Score":"3", "CommentCount":"5", "OwnerUser":{"UpVotes":"145", "DownVotes":"36", "ProfileImageUrl":"http://i.stack.imgur.com/rZ1Oc.jpg", "Id":"1686", "AccountId":"2130467", "Views":"63", "Reputation":"1112", "CreationDate":"2013-01-19T17:49:32.827", "DisplayName":"Manjusri", "LastAccessDate":"2014-01-18T20:17:27.900", "AboutMe":"<p>I have no native language. I am more or less getting by in some tongues, and I can read and/or swear in douzens of other languages, but this doesn't mean I am an expert in them. By January 2013 I am 34 and wish to see the latter number growing. </p>\n\n<p>I study [cognitive] psychology and am planning to obtain some certificates in computer languages and programming.</p>\n\n<p>I enjoy horse riding, travelling, good cuisine, green Japanese tea, Russian and Spanish literatures and friendly company.</p>\n\n<p><strong>Fluent In:</strong> Dutch, English, Finnish, French, Russian, Spanish and Swedish.</p>\n\n<p><strong>Less Fluent:</strong> Danish, Estonian, Polish and Bulgarian, </p>\n\n<p><strong>Learning:</strong> Arabic, Chinese, Innuit, Japanese, Komi, Sanskrit, Tibetan and Yoruba.</p>\n\n<p><strong>Planning to Learn:</strong> Tangut, C, C++ &amp; Pascal</p>\n"}}