{"Body":"<p>Given that there are some languages that treat /r/ and /l/ as a vowel, such as Czech and Hindi, I am wondering how come the same isn't true in some varieties of English.</p>\n\n<p>As a native English speaker of the American West, I have noticed that we pronounce many of our /ə/ +  /ɹ/ and/or /ɫ/ using just those liquid sounds. </p>\n\n<p>The best example is how every Arabic speaker I have met has trouble with the pronunciation of the word \"world\", and usually realizes it as something like <strong>[ˈwɔr-lɛd]</strong>. I only noticed that when I try to explain to them how <strong>I</strong> pronounce it, I have to omit all 'vowels'; <strong>[ˈwɹ-ɫd]</strong>.</p>\n\n<p>In the pronunciation around Los Angeles, it seems many of us follow this pattern with a whole category of words including:</p>\n\n<p>pattern - <strong>[ˈpʰæ-ɾɹn]</strong> or <strong>[ˈpʰæɾ-ɹn]</strong></p>\n\n<p>stirred - <strong>[stɹd]</strong></p>\n\n<p>measure - <strong>[ˈmɛ-ʒɹ]</strong></p>\n\n<p>It doesn't seem to be accepted practice to consider these liquids as vowels at least by dictionaries or Wikipedia, but when I try to pronounce these words the way the authorities presume, it sounds like I am speaking with a different accent. </p>\n\n<p><em><strong>As a caveat</strong>, I will state that I've heard virtually only exceptions to this from speakers anywhere east of Denver, Cheyenne or El Paso.</em></p>\n", "Id":"3912", "Title":"Do some dialects of English have a liquid vowels, such as /ɹ/ and /ɫ/?", "CreationDate":"2013-06-25T15:11:41.590", "AnswerCount":"2", "PostTypeId":"1", "OwnerUserId":"740", "Tags":"<english><vowels><rhoticity>", "comments":[], "ViewCount":"112", "LastActivityDate":"2013-06-27T17:45:34.683", "Score":"5", "OwnerUser":{"UpVotes":"25", "WebsiteUrl":"", "Id":"740", "AccountId":"367785", "CreationDate":"2012-02-05T20:21:08.563", "AboutMe":"", "Age":"29", "Location":"Los Angeles, CA", "DownVotes":"13", "Views":"7", "Reputation":"291", "DisplayName":"Cayetano Gonçalves", "LastAccessDate":"2014-01-18T02:41:09.117"}}