{"Body":"<p>Language change and the evolution of languages can be seen as an evolutionary process. Human brains form the environment that constrains language. Language acquisition provides the replication, recombination, and mutation for language. Thus, the whole process is a social transmission or evolution, but with specific constraints from the biology of the brain. Thus, it shares much in common with biological evolution, but also a lot in common with standard meme-theoretic social evolution.</p>\n\n<p>What theories of the change and evolution of language has been studied? How complete and well understood is the \"phylogenetic tree\" of languages?</p>\n\n<hr>\n\n<h3>Notes</h3>\n\n<p>I am not targeting this question at the evolution of language (note the singular). I.e. I am not interested in how language faculties first appeared in ancestors of humans. I am interested in the change of languages since then.</p>\n\n<p>I am also not that interested in the sort of micro-evolution of small changes in a specific language except in how it applies as a mechanism of mutation, recombination, or other form of novelty-provision within the longer-period of evolution of languages.</p>\n\n<p>Specific references to the literature are preferred, but general summaries of trends that I can then use Google Scholar to follow are also fine.</p>\n\n<p>One of the goals of this question is to look at both sides. On the one hand, understanding what models most resemble evolution of languages can give us insight into linguistics. On the other hand, insights from linguistics can provide us with a model with which to gain more insight about evolutionary processes (not all evolutionary process need be biological evolution).</p>\n", "Id":"392", "LastEditorUserId":"92", "FavoriteCount":"3", "AcceptedAnswerId":"422", "Title":"What evolution framework best describes the change between languages over time?", "CreationDate":"2011-09-22T06:05:58.737", "OwnerUserId":"33", "PostTypeId":"1", "Tags":"<theoretical-linguistics><evolution><reference-request>", "AnswerCount":"5", "comments":[], "LastEditDate":"2011-11-06T06:13:22.087", "LastEditedUser":{"UpVotes":"488", "WebsiteUrl":"http://claimid.com/louisr", "Id":"92", "AccountId":"163323", "CreationDate":"2011-09-14T02:07:23.613", "AboutMe":"<p>trying to learn and help others learn :)</p>\n", "Age":"34", "Location":"Your computer", "DownVotes":"39", "Views":"97", "Reputation":"3271", "DisplayName":"Louis Rhys", "LastAccessDate":"2014-01-18T16:45:57.423"}, "ViewCount":"279", "LastActivityDate":"2012-03-05T15:10:06.357", "Score":"6", "CommentCount":"4", "OwnerUser":{"UpVotes":"125", "WebsiteUrl":"http://www.cs.mcgill.ca/~akazna/", "Id":"33", "AccountId":"459207", "CreationDate":"2011-09-13T20:58:42.087", "AboutMe":"<p>From the School of Computer Science and Department of Psychology at McGill University, I marvel at the world through algorithmic lenses. My specific interests are in quantum computing, evolutionary game theory, modern evolutionary synthesis, and theoretical cognitive science. Previously I was at the Institute for Quantum Computing and Department of Combinatorics &amp; Optimization at the University of Waterloo and a visitor to the Centre for Quantum Technologies at the National University of Singapore.</p>\n\n<ul>\n<li><a href=\"http://egtheory.wordpress.com/\" rel=\"nofollow\">Theory, Evolution, and Games Group Blog</a></li>\n<li><a href=\"http://cstheory.blogoverflow.com/author/artemkaznatcheev/\">Theoretical Computer Science Blogoveflow</a></li>\n<li><a href=\"https://plus.google.com/u/0/101780559173703781847/\" rel=\"nofollow\">G+ profile</a></li>\n</ul>\n", "Age":"25", "Location":"Montreal, Canada", "DownVotes":"18", "Views":"25", "Reputation":"876", "DisplayName":"Artem Kaznatcheev", "LastAccessDate":"2014-01-11T00:59:33.567"}}