{"Body":"<p>It seems to me that despite the fact that Middle English long vowels have long since shifted dramatically, their descendants still pattern like long vowels in modern English. Since there's really very few cases where some kind of diagnostic alternation might be triggered, I only have two points of potentially helpful data:</p>\n\n<ul>\n<li><p>Former long vowels can never be unstressed, even in loanwords - they always have to take at least secondary stress (eg. [ˌbɛj.ˈʤiŋ], rather than *[bɛj.ˈʤiŋ]). It also seems like you could pronounce Liberia either as [lɪ.ˈbi.ɹi.ə], with no stress on the first syllable, or as [ˌlaj.ˈbi.ɹi.ə] with secondary stress on the first syllable, but never *[ˌlɪ.ˈbi.ɹi.ə] (wrong because that's supposed to be a long vowel) or *[laj.ˈbi.ɹi.ə] (wrong because long vowels have to be stressed).</p></li>\n<li><p>Long vowels occasionally appear in somewhat archaic playful renderings of words where they normally appear as short (eg. California as [ˌkæ.lɪ.ˈfoɹ.ˈnaj.ˈɛj], though maybe that's an isolated example).</p></li>\n</ul>\n\n<p>I'm trying to rationalise (General American) English vowel pronunciations as a system with seven-or-so underlying vowels, varying in realisation due to length/stress (unstressed, short stressed or long stressed) and environment (e.g. being deleted before /ɹ/, and so on). I haven't come up against any counterexamples yet, but they may well be out there; and I'm not wholly sure that my methodology makes sense (where the underlying phonemes are so very far removed from any of their realisations - e.g. /aː/ typically realised as [ɛj]).</p>\n\n<p>I suppose my question is this - is the fact that you can fairly well analyse Modern English vowels as having length just an artifact of history, or are length distinctions still part of Modern English's active phonology?</p>\n", "Id":"3921", "LastEditorUserId":"51", "FavoriteCount":"1", "AcceptedAnswerId":"3971", "Title":"Is the concept of 'long vowel' still relevant in modern English phonology?", "CreationDate":"2013-06-26T05:34:59.913", "OwnerUserId":"2132", "PostTypeId":"1", "Tags":"<phonology><english><vowels><vowel-length>", "AnswerCount":"1", "comments":[], "LastEditDate":"2013-06-26T06:24:54.890", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"382", "LastActivityDate":"2013-07-06T00:39:45.423", "Score":"6", "CommentCount":"9", "OwnerUser":{"UpVotes":"13", "WebsiteUrl":"", "DownVotes":"1", "Id":"2132", "AccountId":"2572199", "Views":"6", "Reputation":"701", "CreationDate":"2013-06-04T23:59:57.060", "DisplayName":"Sjiveru", "LastAccessDate":"2014-01-18T21:42:32.287", "AboutMe":"<p>Still in training, but hopefully somewhat knowledgeable. Historical linguistics is awesome.</p>\n"}}