{"Body":"<p>By 'complex system' I mean a system of interrogative pronouns which includes more than just 'animate/inanimate' classes of prounouns, like these of 'who' and 'what' in English (e.g. a special interrogatiuve pronoun for each one of Bantu-like classes - if there is such a thing; or gender-specific interrogative pronouns (like <em>'which one?'</em> having a feminine/masculine/neuter genders in Russian, or French <em>quel(le)?</em> with a close meaning).</p>\n\n<p>Another sub-question is: are person-specific interrogative pronouns possible at all? </p>\n\n<p>Like <em>who+you?</em> / <em>what+we?</em> / <em>when-(s)he</em>, etc. This could be a fairly economical way of a language strategy, but I am not quite sure if that is possible at all in any language. At least, none of the languages I am familiar with has such a feature.</p>\n", "Id":"3926", "Title":"Are there more languages with complex system of interrogative pronouns?", "CreationDate":"2013-06-27T12:14:43.330", "OwnerUserId":"1686", "PostTypeId":"1", "Tags":"<theoretical-linguistics><pronoun><optimality-theory><minimalism>", "comments":[], "ViewCount":"73", "LastActivityDate":"2013-06-27T12:14:43.330", "Score":"0", "CommentCount":"10", "OwnerUser":{"UpVotes":"145", "DownVotes":"36", "ProfileImageUrl":"http://i.stack.imgur.com/rZ1Oc.jpg", "Id":"1686", "AccountId":"2130467", "Views":"63", "Reputation":"1112", "CreationDate":"2013-01-19T17:49:32.827", "DisplayName":"Manjusri", "LastAccessDate":"2014-01-18T20:17:27.900", "AboutMe":"<p>I have no native language. I am more or less getting by in some tongues, and I can read and/or swear in douzens of other languages, but this doesn't mean I am an expert in them. By January 2013 I am 34 and wish to see the latter number growing. </p>\n\n<p>I study [cognitive] psychology and am planning to obtain some certificates in computer languages and programming.</p>\n\n<p>I enjoy horse riding, travelling, good cuisine, green Japanese tea, Russian and Spanish literatures and friendly company.</p>\n\n<p><strong>Fluent In:</strong> Dutch, English, Finnish, French, Russian, Spanish and Swedish.</p>\n\n<p><strong>Less Fluent:</strong> Danish, Estonian, Polish and Bulgarian, </p>\n\n<p><strong>Learning:</strong> Arabic, Chinese, Innuit, Japanese, Komi, Sanskrit, Tibetan and Yoruba.</p>\n\n<p><strong>Planning to Learn:</strong> Tangut, C, C++ &amp; Pascal</p>\n"}}