{"Body":"<p>I'm an absolute rookie with this stuff, but I'm building a <a href=\"http://www.lingojam.com\" rel=\"nofollow\">translation program</a>, which will hopefully enable people to create their own translators to share with the world. I'm particularly excited for its use by conlang enthusiasts, but I want to make sure it's got the features that would be needed. At the moment it can swap phrases, words, 'intrawords' (I don't know correct name) along with prefixes and suffixes.</p>\n\n<p>So my question is: What features would be fundamental to a program like this? I think it would depend on the complexity of the language, and how close it is to English communication, but I'm sure there are some fundamentals that I'm missing - it just feels a little bit primitive at the moment.</p>\n\n<p>Thanks for you time in helping me with this!</p>\n", "Id":"3927", "LastEditorUserId":"22", "Title":"Fundamental features for program that helps you build a translator?", "CreationDate":"2013-06-27T14:19:08.420", "OwnerUserId":"2198", "PostTypeId":"1", "Tags":"<computational-linguistics><translation><constructed-language>", "comments":[], "LastEditDate":"2013-06-27T15:26:58.260", "LastEditedUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "ViewCount":"106", "LastActivityDate":"2013-06-27T15:26:58.260", "Score":"1", "CommentCount":"5", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2198", "AccountId":"971121", "Views":"0", "Reputation":"106", "CreationDate":"2013-06-27T14:18:46.497", "DisplayName":"JoeRocc", "LastAccessDate":"2013-07-12T14:30:52.247"}}