{"Body":"<p>The grammar descriptions of some languages seem to treat words like <em>all</em> and <em>no</em>, as in '<em>all giraffes are yellow</em>' and '<em>no pigs have wings</em>' simply as adjectives, because the words they determine are the nouns.</p>\n\n<p>However, there most certainly is a difference between saying\n'<em>no pigs have wings</em>' and '<em>green pigs have wings</em>'.</p>\n\n<p>This becomes obvious when turning the adjectives into equivalent relative clauses. This works: '<em>pigs which are green have wings</em>'. This does not: '<em>pigs which are</em> *no <em>have wings</em>'.</p>\n\n<p>The way I understand these adjectives is they are somewhat like articles or quantifiers in that they help to fix the scope of the noun they determine. A 'mathematical' explanation would be that saying <em>some pigs</em> makes it clear you are talking about a subset of the set of all pigs and the subset is small. And saying <em>the pigs</em> implies that you are referencing a subset you defined earlier or will define in the near future. It doesn't say anything about the pigs in the subset (such as their being green), but gives you some context information. [In prepositional logic, this would be a function of quantifiers, such as ∀ or ∃.]</p>\n\n<p>Most descriptions of grammars I've read (English and non-English) stick to the traditional parts of speech. So, does it make sense to consider words like <em>no</em>, <em>some</em> or <em>all</em> as a separate part of speech in its own right and is there any linguistic theory out there sharing this view?</p>\n", "Id":"3932", "AcceptedAnswerId":"3934", "Title":"The word 'all' as an article, rather than an adjective?", "CreationDate":"2013-06-29T12:24:27.963", "AnswerCount":"1", "Tags":"<parts-of-speech><articles>", "PostTypeId":"1", "OwnerUserId":"2201", "comments":[], "ViewCount":"74", "LastActivityDate":"2013-06-30T03:30:22.723", "Score":"1", "CommentCount":"4", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2201", "AccountId":"2847134", "Views":"0", "Reputation":"13", "CreationDate":"2013-06-29T11:49:03.017", "DisplayName":"theSkinEffect", "LastAccessDate":"2013-07-07T12:31:03.217"}}