{"Body":"<p><em>I originally asked this question on philosophy.stackexchange, but the consensus was that this was better asked here</em></p>\n\n<p>Deleuze &amp; Guattari introduce the idea of the rhizome in their text A thousand Plateaus as a metaphor closer to the reality than aboroscent (tree-like) descriptions can.</p>\n\n<p>The question then becomes how does one theorise rhizomatically? Is the evolution of language a good example to theorise with - after all it is traditionally described by a tree? Can one, for example, suggest the existence of a tap-root was actually forced onto linguists by their chosen mode of description - a tree - whereas a rhizomatic description does away with a point-like origin.</p>\n\n<p>We also have a picture of say the Indo-European language family starting of at some distant tap-root and slowly diversifying and splitting into many languages, with each branch then developing in perpetual isolation. In this picture, one cannot visualise creolisation where two languages at one time far apart is put into sudden contact and either one perishes, or a new hybrid (creole) develops. Or two languages that were in close contact and actually mutually intelligible, by some force are closed off from each other, and so developing independently eventually become mutually unintelligible.</p>\n\n<p>Can one say then that the Rhizome is arguably closer ontologically to the reality of language than the 'traditional linguistic' image - the tree?</p>\n\n<p>Has this formulation been used in the philosophy of language/evolutionary linguistics at all? If it has, by whom - and what has been the reception?</p>\n", "Id":"3965", "Title":"Is the evolution & development of language better described by Deleuze concept of the rhizome than the traditional tree?", "CreationDate":"2013-07-04T14:31:17.870", "AnswerCount":"2", "PostTypeId":"1", "OwnerUserId":"2029", "Tags":"<evolution><philosophy-of-language><evolutionary-linguistics>", "comments":[], "ViewCount":"93", "LastActivityDate":"2013-07-05T01:32:06.627", "Score":"2", "OwnerUser":{"UpVotes":"2", "ProfileImageUrl":"http://i.stack.imgur.com/sw7YK.jpg", "Id":"2029", "AccountId":"961274", "CreationDate":"2013-05-07T15:13:13.843", "AboutMe":"<p>Education: Mathematics BA, Theoretical Physics Msc.\nInterested in Philosophy, Poetry, Theology and Art</p>\n\n<p>Do you friend, know what it's all about?\nThe sun, a picture of health\nhangs still as a citrus fruit on a calm day.\nFlinty reflections in glass staring back at you,\nimitating each mellow or awkward move -\nNarcissus would not have known.</p>\n\n<p>Do you friend, know what its all about?\nConversation hiding open-eyed deceit.\nMustard oil for hasher-dim fried.\nLaughter with knives and smiles \n - for the coup-de-grace.\nPersophone in spring may know.</p>\n\n<p>And will we know what its all about? \nForever losing the living situation, \nOur inorganic sense drags us under,\nas our organic sense makes us hunger.</p>\n\n<ul>\n<li>Mozibur Ullah, Mar 2013</li>\n</ul>\n", "Age":"45", "Location":"London, United Kingdom", "DownVotes":"0", "Views":"1", "Reputation":"116", "DisplayName":"Mozibur Ullah", "LastAccessDate":"2013-07-04T19:15:07.927"}}