{"Body":"<p>For example, does any natural language have 2nd person pronouns or verb conjugations that vary according to whether ...</p>\n\n<p>a)   All of the people for whom the speaker's remarks are intended are present.<br>\nb)   Some of the people for whom the speaker's remarks are intended are present and others are absent. \nc)   None of the people for whom the speaker's or writer's remarks are intended are present at the delivery of the message?   </p>\n\n<p>Condition a) would apply, for example, when a speaker is sharing a secret intended only for those present in the room with her, or when a speaker is addressing all and only the members of a present crowd, such as a graduating class.   </p>\n\n<p>Condition b) would apply, for example, when the speaker's remarks are intended for all members of an organization, both those who are listening to the speaker and those who are absent.   For example, a CEO might give a speech whose message applies to all company employees both present and absent from the setting of the speech.   </p>\n\n<p>Condition c) would apply when the speaker or writer recorded or wrote his message alone, for example, in a last will and testament or in a recording sent to relatives on disc.  Some might use such a form to talk to dead relatives.   </p>\n\n<p>Is there anything <em>like</em> this in natural languages?</p>\n", "Id":"4008", "LastEditorUserId":"3020", "Title":"Do any natural languages vary the form of the 2nd person markers according to whether the intended audience is present or absent?", "CreationDate":"2013-07-15T01:09:15.243", "OwnerUserId":"790", "PostTypeId":"1", "Tags":"<morphology><person>", "comments":[], "LastEditDate":"2014-01-15T16:13:33.120", "LastEditedUser":{"UpVotes":"3", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/Pc82Y.jpg?s=128&g=1", "Id":"3020", "AccountId":"2596734", "Views":"1", "Reputation":"167", "CreationDate":"2014-01-13T16:08:59.447", "DisplayName":"Marjeta", "LastAccessDate":"2014-01-17T20:16:21.790"}, "ViewCount":"76", "LastActivityDate":"2014-01-15T16:13:33.120", "Score":"5", "CommentCount":"1", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}