{"Body":"<p>The opinion that young people nowadays can't properly write any more seems to have (had) currency across many cultures and times. For example, <a href=\"http://www.google.de/url?sa=t&amp;rct=j&amp;q=&amp;esrc=s&amp;source=web&amp;cd=1&amp;cad=rja&amp;ved=0CC8QtwIwAA&amp;url=http://www.ted.com/talks/john_mcwhorter_txtng_is_killing_language_jk.html&amp;ei=ryvxUcP-BITWtQbcgYHoBA&amp;usg=AFQjCNGVpMKeiaqJpmOUeHcum4mxhQOcxg&amp;sig2=VGBQt9pdCQJw1S_rqRU88A&amp;bvm=bv.49784469,d.Yms\" rel=\"nofollow\">C. H. Ward</a>, a 1917 Conneticut school teacher, is reported as saying that</p>\n\n<blockquote>\n  <p>From every college in the country goes up the cry, \"Our freshmen can't spell, can't punctuate.\" Every high school is in disrepair because its pupils are so ignorant of the merest rudiments.</p>\n</blockquote>\n\n<p><strong>Q: I was wondering whether there is any evidence of developments in (written) language proficiency</strong> of, say, 18 year-olds, in post-WW2 industrial societies.</p>\n\n<p>Before WW2 and in pre-industrial societies I assume public education was still expanding and following from that there was an increase in literacy. So in the general population I suppose there will also have been an increase in language proficiency and writing skills. I chose 18 years as a baseline because I assume that is the general school-leaving age for upper secondary education, but it's just an approximation.</p>\n\n<p>I would be particularly interested in data on different languages (English, French, German, ...) and the general population, but college freshmen would also do. I suppose any or most available data will be on proficiency in (written) standard language, not non-standard dialects.</p>\n\n<p><strong>Possible sources</strong> include standardised school-leaving exams like the US-American SAT. These can and are sometimes said to be subject to grade inflation - General improvement in scores might be due to more lenient grading or easier tasks. Are there other sources not/less subject to this criticism?</p>\n\n<p><strong>Motivation for asking:</strong> In case this helps in answering the question, I am tired of listening to complaints about how children and young adults can't spell any more, our language is going to the dogs etc. The fact that such complaints are not new suggests that they are not based on facts. I would like to be able to point out that, in fact, language proficiency has remained stable or even improved for some time. If there is evidence to the contrary I'll do my best to hide... ehm I'll eat my words.</p>\n", "Id":"4058", "LastEditorUserId":"51", "Title":"Evidence of/against deterioration in language proficiency", "CreationDate":"2013-07-25T14:10:34.117", "OwnerUserId":"2278", "PostTypeId":"1", "Tags":"<language-change><applied-linguistics><literacy><proficiency>", "comments":[], "LastEditDate":"2013-07-26T01:26:43.887", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"177", "LastActivityDate":"2013-07-26T01:26:43.887", "Score":"3", "CommentCount":"5", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}