{"Body":"<p>I am trying to figure out what additional semantic information \"both\" carries when used in a sentence. Does it differ from \"and\"?</p>\n\n<p>Take the following sentences:</p>\n\n<blockquote>\n  <p>Alice and Bob both ate lunch.</p>\n</blockquote>\n\n<p>vs.</p>\n\n<blockquote>\n  <p>Alice and Bob ate lunch.</p>\n</blockquote>\n\n<p>What extra is gained by the \"both\" in the first sentence? Do either of the sentences give a stronger or weaker implication that the activity was performed together or separately? I've been overthinking it, so I don't know what my intuition tells me anymore. My initial thought was perhaps that using \"both\" added a stronger implication that the activity was shared between the two rather than separate events. If the word \"together\" is added to the end of either sentence, I feel that it feels a bit superfluous on the first, with \"both\" (yet not a questionable or starred sentence), and much more natural with the second, as in \"Alice and Bob ate lunch together\".</p>\n\n<p>Looking at a dictionary entry, it would imply that \"both\" is used for emphasis, but gives the examples with \"both\" being in an initial position, which I feel automatically gives emphasis - \"Both Alice and Bob ate lunch\" seems to actually have a whole different feel to it, and to me would be used more to correct an incorrect assumption. \"I thought only Bob was there...\" \"No, both Alice AND Bob ate lunch...\"</p>\n\n<p>Any thoughts?</p>\n", "Id":"4063", "LastEditorUserId":"2286", "AcceptedAnswerId":"4065", "Title":"Semantic logic of the word \"both\" in English - different from \"and\"?", "CreationDate":"2013-07-26T02:47:04.327", "OwnerUserId":"2286", "PostTypeId":"1", "Tags":"<english><semantics><lexicon><lexical-semantics>", "AnswerCount":"1", "comments":[], "LastEditDate":"2013-07-26T04:16:20.590", "LastEditedUser":{"UpVotes":"0", "WebsiteUrl":"", "DownVotes":"0", "Id":"2286", "AccountId":"46219", "Views":"2", "Reputation":"121", "CreationDate":"2013-07-26T02:29:38.223", "DisplayName":"V_H", "LastAccessDate":"2014-01-09T21:47:16.523", "AboutMe":""}, "ViewCount":"109", "LastActivityDate":"2013-07-26T19:02:28.507", "Score":"2", "CommentCount":"10", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"", "DownVotes":"0", "Id":"2286", "AccountId":"46219", "Views":"2", "Reputation":"121", "CreationDate":"2013-07-26T02:29:38.223", "DisplayName":"V_H", "LastAccessDate":"2014-01-09T21:47:16.523", "AboutMe":""}}