{"Body":"<p>How does vowel harmony typically arise in a language?   </p>\n\n<p>Here's a definition of vowel harmony from the WALS chapter on Vowel Quality Inventories:  <a href=\"http://wals.info/chapter/2\">http://wals.info/chapter/2</a>.  </p>\n\n<p>\"When a language is said to have vowel harmony this generally means that within a word, including any affixes, it is only possible to combine the members of certain subsets of the vowels together.\" </p>\n\n<p>Here's an example of vowel harmony from Wikipedia's/Free Net Encyclopedia's article on vowel harmony:   <a href=\"http://www.netipedia.com/index.php/Vowel_harmony#Features_of_vowel_harmony\">http://www.netipedia.com/index.php/Vowel_harmony#Features_of_vowel_harmony</a></p>\n\n<p>\"The vowel that causes the vowel assimilation is frequently termed the trigger while the vowels that assimilate (or harmonize) are termed targets. In most languages, the vowel triggers lie within the root of a word while the affixes added to the roots contain the targets. This may be seen in the Hungarian dative suffix:</p>\n\n<pre><code>Root    Dative  Gloss\nváros   város-nak   \"city\"\nöröm    öröm-nek    \"joy\" \n</code></pre>\n\n<p>The dative suffix has two different forms -nak/-nek. The -nak form appears after the root with back vowels (a and o are both back vowels). The -nek form appears after the root with front vowels (ö and e are front vowels).\" </p>\n\n<p>The article at Free Net Encyclopedia covers a lot of ground, but leaves me curious about how vowel harmony typically arises.   Does it arise in languages with big vowel quality inventories, or do big vowel quality inventories arise in response to it?   Does the consonant inventory play any role in its development?   Does prosody play a role?   </p>\n", "Id":"4139", "LastEditorUserId":"51", "AcceptedAnswerId":"4174", "Title":"How does vowel harmony typically arise in a language?", "CreationDate":"2013-08-08T19:50:32.957", "OwnerUserId":"790", "PostTypeId":"1", "Tags":"<phonology><vowels><assimilation><vowel-harmony>", "AnswerCount":"1", "comments":[], "LastEditDate":"2013-08-09T03:38:39.180", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"181", "LastActivityDate":"2013-08-12T17:27:59.720", "Score":"10", "CommentCount":"2", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}