{"Body":"<p>First let me warn you I have no academic formation in Linguistics, I can't define that area well, so if this sounds off-topic, it probably is.</p>\n\n<p>\"I know what you know\" is an ambiguous sentence, carrying two distinct meanings: that \"I\" am in knowledge of, at least, the very same things \"you\" are; or that \"I\" have information of <strong>which</strong> subjects \"you\" know (without this meaning \"I\" know anything <strong>about</strong> subjects \"you\" knows).</p>\n\n<p>I have several related questions associated to the sentence: is there any way to separate the two meanings without a full explanation (kind of what I did)? What about other languages? In Portuguese, the same thing happens. Esperanto often seems to have a way to carry just the needed precision, yet I can't think of any way to distinguish those meanings right now. With what types of verbs does this work? For instance, it doesn't work with \"think\" (a proposition is required in at least in one of the cases) and most certainly not with \"eat\".</p>\n", "Id":"4142", "LastEditorUserId":"2328", "FavoriteCount":"1", "Title":"Are the meanings of «I know what you know» distinguishable?", "CreationDate":"2013-08-09T22:10:51.753", "OwnerUserId":"2334", "PostTypeId":"1", "Tags":"<semantics><ambiguity>", "AnswerCount":"2", "comments":[], "LastEditDate":"2013-08-10T09:37:33.437", "LastEditedUser":{"UpVotes":"123", "WebsiteUrl":"https://sites.google.com/site/patrickdelliott/", "ProfileImageUrl":"http://i.stack.imgur.com/HGYBE.jpg", "Id":"2328", "AccountId":"3146009", "CreationDate":"2013-08-07T11:16:59.797", "AboutMe":"<p>I'm a PhD student in Linguistics at University College London. My primary area of interest is generative linguistics, and specifically syntactic and semantic theory. More narrowly still, i'm interested in ellipsis, comparatives, and binding theory. <a href=\"https://twitter.com/patrickdelliott\" rel=\"nofollow\">Follow me on twitter!</a></p>\n", "Location":"London, United Kingdom", "DownVotes":"43", "Views":"43", "Reputation":"970", "DisplayName":"P Elliott", "LastAccessDate":"2014-01-19T02:32:31.120"}, "ViewCount":"209", "LastActivityDate":"2013-08-25T23:50:03.310", "Score":"5", "CommentCount":"16", "OwnerUser":{"UpVotes":"28", "WebsiteUrl":"https://pt.wikipedia.org/wiki/Usu%C3%A1rio:JMCF125", "Id":"2334", "AccountId":"2441446", "CreationDate":"2013-08-09T21:02:30.707", "AboutMe":"<p>Hello passers-by.</p>\n\n<p>I'm a Portuguese socialist idealist, and a hobbyist in diverse areas, such as Programming, Mathematics, Linguistics, Politics, Philosophy, etc. I can also be found with this very name as an editor of Wikipedia.</p>\n\n<p>The flag you see is from an SVG I wrote, and I use it instead of the Portuguese flag for two reasons: first, the <a href=\"https://www.google.pt/search?safe=off&amp;hl=pt-PT&amp;site=imghp&amp;tbm=isch&amp;source=hp&amp;biw=1301&amp;bih=656&amp;q=bandeira+de+portugal\" rel=\"nofollow\">Portuguese flag</a> is hard to write in SVG; the second reason is that I am not only Portuguese, but an Esperantist and a left-wing citizen of the world. Besides, this one didn't exist in the internet yet. <strong>:D</strong></p>\n\n<p>In my opinion, the Stack Exchange Network has a lot of information, as Wikipedia does; but unlike Wikipedia, has a more low-context culture, which I dislike (although Portugal's culture is sadly heading that way - thank social networks). </p>\n\n<p>I use the Arch (Linux) distribution of GNU/Linux, as <a href=\"http://www.vanwensveen.nl/rants/microsoft/IhateMS.html\" rel=\"nofollow\">Windows sucks</a> and I hate Apple and their products (that yet somehow (!) are extremely expensive) made by underpaid starving Chinese children.</p>\n\n<p>You can contact me through jmcf|25@hotmail.com or jmcf|25@gmail.com (NOTE: the \"|\" represents a \"1\", this just avoids some spam).</p>\n", "Age":"16", "Location":"Funchal, Portugal", "DownVotes":"0", "Views":"11", "Reputation":"166", "DisplayName":"JMCF125", "LastAccessDate":"2013-12-30T15:58:00.133"}}