{"Body":"<ol>\n<li>What theories explain the transfer of phonetic and phonological features from the first language to a second or foreign language? </li>\n<li>How do these theories differ from each other? </li>\n<li>Such theories should refer to both transfer of <a href=\"http://en.wikipedia.org/wiki/Segment_%28linguistics%29\" rel=\"nofollow\">segmental</a> features (phonemes) and suprasegmental features (<a href=\"http://en.wikipedia.org/wiki/Prosody_%28linguistics%29\" rel=\"nofollow\">prosody</a>) and be grounded in empirical research.</li>\n</ol>\n\n<p>I'm referring to phenomena such as the following:</p>\n\n<ul>\n<li><p>English has two th-phonemes, a voiceless and a voiced <strong>dental fricative</strong> (/<strong>ฮธ</strong>/ and /<strong>รฐ</strong>/). Learners with a first language (L1) that lacks these phonemes, such as French or German, tend to replace them with phonemes that are relatively similar, such as alveolar fricatives /s/ and /z/ - manner of articulation is the same and place of articulation is as close as you can get to dental (labiodental /f/ and /v/ are arguably even closer and are also sometimes used).</p></li>\n<li><p>French has nasal vowels that contrast with oral vowels. Learners with an L1 that lacks phonemic nasality (but may have nasalised vowels adjacent to nasal consonants), such as English or German, tend to have problems acquiring this phonemic distinction.</p></li>\n</ul>\n", "Id":"4157", "Title":"Theories on L1 transfer/interference in L2 pronunciation/phonetics/phonology", "CreationDate":"2013-08-10T17:06:12.853", "OwnerUserId":"2278", "PostTypeId":"1", "Tags":"<phonology><phonetics><second-lang-acquisition>", "comments":[], "ViewCount":"269", "LastActivityDate":"2013-08-10T17:06:12.853", "Score":"2", "CommentCount":"1", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}