{"Body":"<p>Transfer of some phonetic/phonological features from the first language to a second language is common in second language acquisition. For example, <a href=\"https://en.wikipedia.org/wiki/Aspirated_consonant\">aspiration</a> is not phonemic in English. Voiceless plosives (/p,t,k/) in simple onsets are aspirated (as in <em>top</em> /tʰɒp/), but in complex onsets they are unaspirated (as in <em>stop</em> /stɒp/). Although English speakers have the ability to pronounce voiceless plosives with or without aspiration when required by English phonology, they often find it difficult to consciously use this ability when learning languages that have phonemic aspiration, such as <a href=\"https://en.wikipedia.org/wiki/Hindi_phonology\">Hindi</a>.</p>\n\n<p>I have the impression that these segmental pronunciation problems receive lots of attention in second language acquisition research. However, prosody (for example intonation) can also be rather difficult for learners and seems to receive less attention (although there is some research on this topic).</p>\n\n<p><strong>Q: Is there any research on whether <a href=\"http://en.wikipedia.org/wiki/Segment_%28linguistics%29\">segmental</a> differences (such as aspiration) or <a href=\"http://en.wikipedia.org/wiki/Prosody_%28linguistics%29\">suprasegmental</a> differences (such as in intonation) are more difficult for learners to overcome?</strong> (Controlling for the fact that when comparing languages some have more segmental differences and some more differences in intonation).</p>\n", "Id":"4165", "FavoriteCount":"2", "Title":"Common problems in second language pronunciation", "CreationDate":"2013-08-11T12:44:14.787", "OwnerUserId":"2278", "PostTypeId":"1", "Tags":"<phonology><phonetics><second-lang-acquisition>", "comments":[], "ViewCount":"228", "LastActivityDate":"2013-08-11T12:44:14.787", "Score":"7", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}