{"Body":"<p>What is the difference between \"or\" and \"either...or?  </p>\n\n<p>Obviously, one comprises one phonological word and the other comprises two.  I have yet to find an analysis of \"either...or\" in which \"either\" is considered to be an adverb.   The Summer Institute of Linguistics glossary of linguistic terms indicates that \"either...or\" is a correlative conjunction, which the SIL defines as \"either of a pair of coordinating conjunctions used in ordered fashion.\"  (See <a href=\"http://www-01.sil.org/linguistics/GlossaryOflinguisticTerms/WhatIsACorrelativeConjunction.htm\" rel=\"nofollow\">http://www-01.sil.org/linguistics/GlossaryOflinguisticTerms/WhatIsACorrelativeConjunction.htm</a> )  I'm not sure that this definition makes sense for English, because \"either\" is not a coordinator by itself AFAIK.   This definition may apply to other languages.  But I've been having a hard time finding examples on the Internet.     </p>\n\n<p>Anyway, my chief interest is in the semantic difference between \"or\" and \"either...or\".   Although I'm asking about two English coordinators, I believe that this question is appropriate for this list because other languages also have a similar contrast.   </p>\n\n<p>Because I'm a monolingual English speaker, examples of sentences in which \"or\" would be acceptable but \"either...or\" would not be--and vice versa--would be helpful.   </p>\n", "Id":"4216", "FavoriteCount":"1", "AcceptedAnswerId":"4218", "Title":"What is the difference between \"or\" and \"either...or\"?", "CreationDate":"2013-08-18T03:19:17.617", "AnswerCount":"3", "Tags":"<syntax><semantics><morphologty>", "PostTypeId":"1", "OwnerUserId":"790", "comments":[], "ViewCount":"175", "LastActivityDate":"2013-08-24T17:13:47.557", "Score":"2", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}