{"Body":"<p>What are the most common reasons for (synchronic) word-order changes in isolating languages?    From what I’ve read, word order in isolating languages can be changed even when the constituents in the resulting sentences have the same semantic roles as they do in the original sentences.    </p>\n\n<p>By “semantic roles,” I mean relationships between agents, patients, etc., with respect to what the verb denotes.   I’m trying to follow the SIL’s definition here:    <a href=\"http://www-01.sil.org/linguistics/GlossaryOfLinguisticTerms/WhatIsASemanticRole.htm\" rel=\"nofollow\">http://www-01.sil.org/linguistics/GlossaryOfLinguisticTerms/WhatIsASemanticRole.htm</a> </p>\n\n<p>For example, “The king helped the people,” and “The people were helped by the king” don’t have exactly the same meaning, but the constituents have the same semantic roles.   In both sentences, the king is the agent, helping is the action, and people are patients.    </p>\n\n<p>I suspect that there are a number of reasons for varying word order in an isolating language.   </p>\n\n<p>In Chinese, for example, word order can vary in order to specify whether a given argument is definite.    For instance, in Chinese “Lái rén le,” (come person perfect) means “Some person or people have come.”   But “Rén lái le,” (person come perfect) means “The people (presumeably the expected people) have come.”    </p>\n\n<p>The general rule, if I understand it correctly, is that clause-initial nouns tend to be definite, while non-clause initial nouns tend to be indefinite.     See a little more about this Chinese grammar rule here:   <a href=\"http://www.chineselanguage.com/chinese-lessons/id/373/grammar--chinese-word-order.aspx\" rel=\"nofollow\">http://www.chineselanguage.com/chinese-lessons/id/373/grammar--chinese-word-order.aspx</a></p>\n\n<p>English, my sole and native tongue, is pretty isolating compared to German, but the former has some grammatical constructions that allow for fronting constituents that normally occur after the verb.    </p>\n\n<p>To put a focus closer to the front of a sentence, English speakers can do things like this:   </p>\n\n<p>We saw Hector in the garden.<br>\na)  It was Hector whom we saw in the garden.<br>\nb)  Seeing Hector in the garden is what we did.   </p>\n\n<p>To topicalize non-subjects, we can front them like this:</p>\n\n<p>Rose drove a car.<br>\na)  The car, Rose drove. </p>\n\n<p>b)  As for the car, Rose drove it.          </p>\n\n<p>Unfortunately, the examples I’ve shown here don’t tell me which kinds of word-order changes are the most common across isolating languages.  What are the common trends?   </p>\n", "Id":"4219", "AcceptedAnswerId":"4236", "Title":"What are the most common reasons for (synchronic) word-order changes in isolating languages?", "CreationDate":"2013-08-19T02:57:19.513", "AnswerCount":"2", "Tags":"<syntax><linguistic-typology><word-order>", "PostTypeId":"1", "OwnerUserId":"790", "comments":[], "ViewCount":"104", "LastActivityDate":"2013-08-22T16:11:58.907", "Score":"2", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}