{"Body":"<p>Marked phonemes are those that require more effort during articulation or are \"harder\" to articulate. For example, the interdental fricatives <a href=\"https://en.wikipedia.org/wiki/Pronunciation_of_English_%E2%9F%A8th%E2%9F%A9#Acquisition_problems\" rel=\"nofollow\">/θ/ and /ð/ are considered to be marked</a>. Marked phonemes are</p>\n\n<ul>\n<li>Acquired later than unmarked phonemes in native acquisition.</li>\n<li>Tend to pose more problems during Second Language Learning/Acquisition.</li>\n<li>Are less frequent cross-linguistically.</li>\n</ul>\n\n<p>English-speaking children <a href=\"https://en.wikipedia.org/wiki/Pronunciation_of_English_%E2%9F%A8th%E2%9F%A9#Acquisition_problems\" rel=\"nofollow\">frequently do not acquire /θ/ and /ð/</a> until age 5 or later.</p>\n\n<p><strong>Q:</strong> Are there marked or \"hard\" phonemes that are acquired even later in First Language Acquisition?</p>\n\n<p><strong>Q:</strong> Also, are there any phonemes that (are so marked that they) are not acquired at all by a substantial part of the population (say more than 5 %)? </p>\n\n<hr>\n\n<p>EDIT: So far, most comments and one answer focus exclusively on the concept of the \"marked phoneme\". Let me make it clear that (1) I think this is a relatively well established concept - If you don't believe me google <a href=\"https://www.google.de/search?q=%22marked%20phoneme%22&amp;ie=utf-8&amp;oe=utf-8&amp;rls=org.mozilla%3aen-US%3aofficial&amp;client=firefox-a&amp;gws_rd=cr&amp;ei=gKZdUtjIOZKThgf-sICIAQ#q=%22phonological%20markedness%22&amp;rls=org.mozilla%3aen-US%3aofficial&amp;safe=off\" rel=\"nofollow\">\"markedness in phonology\"</a> and <a href=\"https://www.google.de/search?q=%22marked%20phoneme%22&amp;ie=utf-8&amp;oe=utf-8&amp;rls=org.mozilla%3aen-US%3aofficial&amp;client=firefox-a&amp;gws_rd=cr&amp;ei=gKZdUtjIOZKThgf-sICIAQ#q=%22marked%20phoneme%22&amp;rls=org.mozilla%3aen-US%3aofficial&amp;safe=off&amp;start=0\" rel=\"nofollow\">\"marked phoneme\"</a>. If you doubt the usefulness of this concept you're not the only one, but please let us move one from \"I don't believe you\" and \"It's wrong\", and please provide at least one academic reference why you think it's wrong or useless.</p>\n\n<p>(2) More importantly, I couched my question in terms of markedness because I think it's a relatively uncontroversial concept, but it's really not central to my question. I'm asking whether there are phonemes that are acquired very late or never by a substantial number of speakers, whether you want to call them marked or articulatorily complex or challenging or hard. Answers should if possible be empirically sound such as quantitative claims from surveys, personal experience from teaching, child-rearing etc., with references where appropriate.</p>\n\n<hr>\n\n<p>Note that I don't mean cases where there are differences between vernaculars and the standard languages and some speakers acquire the standard imperfectly (such as <a href=\"https://en.wikipedia.org/wiki/Th-stopping\" rel=\"nofollow\">th-stopping</a> in some English dialects, or the pharyngealised consonants present in Modern Standard Arabic but not in many Arabic dialects).</p>\n\n<p>I have found literature on <a href=\"http://osdir.com/ml/science.linguistics.linguist-list/2003-10/msg00307.html\" rel=\"nofollow\">marked phonemes in a rage of languages</a>, but not much on the age of acquisition of marked phonemes in different languages. Also, I have heard that the trilled /r/ present in Spanish and other languages is acquired very late and that some teachers think children often need help to properly acquire this sound - but this seemed rather unlikely to me if only for the reason that trilled /r/ appears to occur in a good number of languages and claims that children need \"help\" in acquiring their first language sound more like a difference between dialect and standard and teachers' desire to make their students use standard language.</p>\n", "Id":"4253", "LastEditorUserId":"2278", "Title":"Are there marked/\"hard\" phonemes that are acquired very late or never by a substantial number of speakers?", "CreationDate":"2013-08-25T18:44:07.337", "OwnerUserId":"2278", "PostTypeId":"1", "Tags":"<phonology><phonetics><language-acquisition><second-lang-acquisition><markedness>", "AnswerCount":"2", "comments":[], "LastEditDate":"2013-10-15T21:07:41.547", "LastEditedUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}, "ViewCount":"213", "LastActivityDate":"2013-10-15T21:07:41.547", "Score":"3", "CommentCount":"4", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}