{"Body":"<p>I mean obligatorily marking a word for number, gender, animacy, direction etc, I don't actually know what I'm asking about.</p>\n\n<p>For example, in English, we have that awkward situation where we don't know if the cat in the box is dead or alive, and might not know if it is a she or he, so is it an it, he or she (or singular they)?  I'm sure style guides have rules for this, or maybe not.</p>\n\n<p>I tried to ask a similar question about Russian which has a puacal number (single, a few, many) marked on nouns.  On that site, the native speakers didn't understand the question and only repeated the style guideline rule. For example, \"Tell me about your problems\" -- Would a speaker have to get into a big circumlocution to avoid implying that a person has exactly 1, 2-5, or more than 5? (Tell me about your problem or your 2 to 5 problems or your list of problems greater than five)</p>\n\n<p>Guugu Yimithirr is famous for requiring a north/south/east/west orientation just to utter certain words. I wondered how they would discuss things on a erratically spinning asteroid, in the fictional book Flatland, or if they just didn't know.</p>\n\n<p>Also, in Icelandic, I've asked people how they deal with inanimate collections of mixed or unknown genders-- since there are 3 ways to say \"they\" (a collection of bus alone, cars alone is different from a mixed collection of buses and cars)</p>\n\n<p>Are there any recognized patterns on this topic?</p>\n", "Id":"4433", "LastEditorUserId":"51", "Title":"What are the various rules to deal with \"markedness\" if the speaker doesn't know?", "CreationDate":"2013-09-12T16:22:51.260", "OwnerUserId":"20", "PostTypeId":"1", "Tags":"<grammar><markedness>", "AnswerCount":"2", "comments":[], "LastEditDate":"2013-10-15T21:30:42.867", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"93", "LastActivityDate":"2013-10-15T21:30:42.867", "Score":"2", "CommentCount":"7", "OwnerUser":{"UpVotes":"72", "WebsiteUrl":"http://suburbandestiny.com/conlang", "Id":"20", "AccountId":"15651", "CreationDate":"2011-09-13T20:53:42.550", "AboutMe":"<p>I'm a programmer by day and an amateur linguist by night.</p>\n\n<p>I organize the Arlington Linguistics Book Club, where we read a wide variety of books that make the science of linguistic accessible to a popular audience.</p>\n", "Age":"41", "Location":"United States", "DownVotes":"6", "Views":"39", "Reputation":"1657", "DisplayName":"MatthewMartin", "LastAccessDate":"2014-01-08T19:46:09.130"}}