{"Body":"<p>German has for more than 1000 years been in contact with West Slavic languages, notably Polish and Czech. This is highly likely to have led to borrowing or interference between these languages, in both directions. It seems that discussion of this is usually restricted to influence from German on Polish and Czech. For example, the Polish <a href=\"http://en.wikipedia.org/wiki/Polish_language\" rel=\"nofollow\">dialect spoken in the Poznań region</a> is reported to be heavily influenced by German. There is also a great number of German loanwords in Polish, such as <em>malować</em> from G. <em>malen</em> (both <em>to paint</em>).</p>\n\n<p>I'm interested in influence in the opposite direction, from Polish and/or Czech to German (standard or other dialects), particularly on pronunciation. There is a <a href=\"http://ec.europa.eu/languages/euromosaic/pol2_en.htm\" rel=\"nofollow\">Euromosaic</a> study alluding to some influence of Polish on Silesian and East Prussian dialects, but it doesn't give any details or sources.</p>\n\n<h2>Possible influence</h2>\n\n<p>The rounded vowels /y/ and /ø/ are realised as /i/ and /e/ in the Saxon dialect and used to be pronounced this way in Silesian and East Prussian dialects of German:</p>\n\n<ul>\n<li>'Kühe' as 'Kihe', 'Süden' as 'Siden'</li>\n<li>'Höhle' as 'Hehle'</li>\n</ul>\n\n<p>This is, incidentally, also the way many learners of German with Polish as first language pronounce these vowels. These rounded vowels do not exist in Polish.</p>\n\n<p>The Slavic influence on some German dialects might have occurred as early as the 10th c. as this is the time German eastward expansion into (not only) Slavic territory started. The relevant <a href=\"https://en.wikipedia.org/wiki/Ostsiedlung#Rural_development\" rel=\"nofollow\">Wikipedia article</a> states that old and new population frequently mixed, so there were many opportunities for contact between people.</p>\n\n<p>The following <a href=\"https://upload.wikimedia.org/wikipedia/commons/b/bd/Deutsche_Ostsiedlung.png\" rel=\"nofollow\">Wikipedia map</a> shows the time frame for different regions:\n<img src=\"http://i.stack.imgur.com/OpFia.png\" alt=\"Wikipedia map on time frame of German eastward expansion\"></p>\n\n<p><strong>Q: Can anybody confirm Polish influence on (East) German dialects, in general and in particular for these vowels?</strong></p>\n\n<p>Influence of Polish on varieties of German spoken in the Ruhr region has been documented, but this influence was more restricted in time. There was Polish migration to the Ruhr region in western Germany in the 19th c., and influence also seems to be restricted to some lexical items.</p>\n", "Id":"4477", "LastEditorUserId":"2278", "FavoriteCount":"1", "Title":"Influence of Polish and Czech on the phonology of German dialects", "CreationDate":"2013-09-13T13:00:33.603", "OwnerUserId":"2278", "PostTypeId":"1", "Tags":"<phonology><language-contact><german><polish><czech>", "AnswerCount":"1", "comments":[], "LastEditDate":"2013-09-13T22:27:05.533", "LastEditedUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}, "ViewCount":"173", "LastActivityDate":"2014-01-11T23:40:46.110", "Score":"5", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}