{"Body":"<p>The OP in this <a href=\"http://english.stackexchange.com/q/41710/3306\">EL&amp;U question</a> says:</p>\n\n<blockquote>\n  <p><em>?I declined your report.</em></p>\n</blockquote>\n\n<p>There is some mutually-understood portion that was dropped from the sentence. In my <a href=\"http://english.stackexchange.com/questions/41710/when-to-use-decline-for-polite-refusal-and-when-not-to/41715#41715\">answer</a> (comment section), I contrasted </p>\n\n<blockquote>\n  <p>Visa declined to permit the credit card transaction.</p>\n</blockquote>\n\n<p>with </p>\n\n<blockquote>\n  <p>Visa declined the credit card transaction.</p>\n</blockquote>\n\n<p>I think that \"to permit\" is mutually understood. </p>\n\n<p>What is the linguistic operation that allows the drop of the mutually understood portion? I know that if it were a pronoun, the operation would be called a <em>Pro drop</em>. (For example, in Italian, one may drop the pronoun \"He\" in \"He speaks\" and simply say <em>parla</em>, because Italian verbs are inflected with person and gender.)</p>\n\n<p>If the operation were <em>raising</em>, I would expect that a complete sentence would be raised, as in</p>\n\n<blockquote>\n  <p>Visa permitted the transaction.</p>\n</blockquote>\n\n<p>being raised to</p>\n\n<blockquote>\n  <p>It seems Visa permitted the transaction.</p>\n</blockquote>\n\n<p>But the entire sentence cannot be raised, as in</p>\n\n<blockquote>\n  <p>*Visa declined Visa permitted the transaction.</p>\n</blockquote>\n\n<p>What is the linguistic operation that allows a mutually-understood deletion from \"Visa declined to permit the credit card transaction\" to \"Visa declined the credit card transaction\"? </p>\n\n<p>Bonus: something in that operation would also have to explain why \"I declined your report\" is less grammatical than \"I declined to read/to accept/to indorse your report.\"</p>\n\n<hr>\n\n<p>Edit: Adding examples of a deleted infinitival.</p>\n\n<ol>\n<li>Clenching his chubby, little fists, Bill declined (to eat) the pasta.</li>\n<li>Wary about unsealed barrel, Bill declined (to accept) the pasta shipment.</li>\n<li>Since the waiter had his thumb in the entrée, Bill declined (to receive) the pasta.</li>\n<li>? Since it had been on the shelf for a year, Bill declined (to ship) the pasta.</li>\n<li>? Liking it extra crunchy, Bill declined (to boil) the pasta.</li>\n</ol>\n\n<p>Something about the pragmatics of \"decline\" seem to force the deleted infinitival to be near \"accept\" or \"permit.\" In 1, Bill's mommy has a yummy spoon of pasta coming his way, but he will not accept. In 3, Bill is not permitting a plate of cooked pasta to be set on his restaurant table. In 4 and 5, the sentences may be grammatical with the parenthetical statements but are ungrammatical without. That is to say, \"Bill declined to ship the pasta,\" but \"? Bill declined the pasta,\" even though 1 and 3 are \"Bill declined the pasta.\"</p>\n", "Id":"454", "LastEditorUserId":"225", "AcceptedAnswerId":"473", "Title":"What linguistic operation is used in \"I declined your report\"", "CreationDate":"2011-09-23T14:27:17.860", "OwnerUserId":"225", "PostTypeId":"1", "Tags":"<terminology>", "AnswerCount":"1", "comments":[], "LastEditDate":"2011-09-23T19:10:33.160", "LastEditedUser":{"UpVotes":"8", "Location":"Charlotte, NC", "DownVotes":"0", "Id":"225", "AccountId":"239923", "Views":"6", "Reputation":"385", "CreationDate":"2011-09-21T13:52:43.483", "DisplayName":"rajah9", "LastAccessDate":"2014-01-07T16:34:51.110", "AboutMe":"<p>Contract financial developer at a large bank in Charlotte, NC.</p>\n", "Age":"55"}, "ViewCount":"171", "LastActivityDate":"2011-09-23T20:32:28.173", "Score":"3", "CommentCount":"10", "OwnerUser":{"UpVotes":"8", "Location":"Charlotte, NC", "DownVotes":"0", "Id":"225", "AccountId":"239923", "Views":"6", "Reputation":"385", "CreationDate":"2011-09-21T13:52:43.483", "DisplayName":"rajah9", "LastAccessDate":"2014-01-07T16:34:51.110", "AboutMe":"<p>Contract financial developer at a large bank in Charlotte, NC.</p>\n", "Age":"55"}}