{"Body":"<p>\"First-person inclusive\" forms are ones that refer to both the first and second person. In that case, why call them \"first-person\" anything? Wouldn't it be equally logical to call them \"second-person inclusive\"? It isn't that there's a division <em>within the first person</em> into inclusive and exclusive forms -- that wouldn't mean anything. Is this just a historical convention, due to the fact that when speakers of a language without such an opposition encounter a language with one, they perceive its inclusive forms to correspond to their own \"first-person plural\"?</p>\n\n<p>Or is it common for inclusive forms to somehow pattern more like first-person than like second-person forms, and if so how?</p>\n\n<p>(I realize that you could ask similar questions about the term \"first-person plural\", since this usually doesn't refer to multiple speakers but to a speaker plus others, and about \"second-person plural\" when this refers not to multiple listeners but to a listener plus others. But those forms at least <em>can</em> refer to plural speakers or to plural listeners, while an inclusive form can never refer to the first person alone.)</p>\n", "Id":"4631", "LastEditorUserId":"51", "Title":"Why are \"first-person inclusive\" forms called \"first-person\"?", "CreationDate":"2013-10-07T04:15:05.970", "OwnerUserId":"2411", "PostTypeId":"1", "Tags":"<terminology><inclusive>", "AnswerCount":"3", "comments":[], "LastEditDate":"2013-10-07T07:19:04.093", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"114", "LastActivityDate":"2013-10-09T07:42:17.143", "Score":"4", "CommentCount":"4", "OwnerUser":{"UpVotes":"80", "WebsiteUrl":"", "DownVotes":"24", "Id":"2411", "ProfileImageUrl":"https://www.gravatar.com/avatar/5e5b9f5cfa370b99b7b7fdaa27454de1?s=128&d=identicon&r=PG&f=1", "AccountId":"3231657", "Views":"10", "Reputation":"1342", "CreationDate":"2013-08-28T19:22:30.673", "DisplayName":"TKR", "LastAccessDate":"2014-01-19T02:45:52.557", "AboutMe":""}}