{"Body":"<p>In <a href=\"http://books.google.de/books?id=UJQwf05yzqYC&amp;redir_esc=y\" rel=\"nofollow\">Accents of English (1982)</a>, John C. Wells came up with a <a href=\"http://en.wikipedia.org/wiki/Lexical_set\" rel=\"nofollow\">useful notation</a> for English vowels that allows easy comparison of the pronunciation of English vowels in varieties of this language. This notation has been widely adopted, and it is now common to talk about the STRUT vowel to refer to the vowels in <em>cub, rub, hum</em>. In standard British and American English this vowel is pronounced as [ʌ], but in Northern England as [ʊ]. What makes this notation extremely useful is that mergers of two vowels can be easily referred to by shorthand, such as the <a href=\"http://en.wikipedia.org/wiki/English-language_vowel_changes_before_historic_/r/\" rel=\"nofollow\">NEAR - SQUARE merger</a>.</p>\n\n<p><strong>Q:</strong> Has anyone suggested an equivalent notation for <strong>consonants</strong>? Such as the TOOTH consonant when referring to what in British and American English is a voiceless interdental fricative? I couldn't find anything online or in the literature. I get why the lexical set notation was first devised for vowels since English spelling is particularly inconsistent when it comes to vowels. But I feel it's still inconsistent enough for consonants to make a lexical set notation in this area useful.</p>\n\n<p><strong>Q</strong>: If not, what would be criteria by which to choose keywords to represent lexical sets for consonants?</p>\n", "Id":"4696", "Title":"What is the consonant equivalent of Well's lexical sets for English vowels?", "CreationDate":"2013-10-10T19:27:26.090", "OwnerUserId":"2278", "PostTypeId":"1", "Tags":"<phonology><phonetics><english><consonants>", "comments":[], "ViewCount":"64", "LastActivityDate":"2013-10-10T19:27:26.090", "Score":"0", "CommentCount":"5", "OwnerUser":{"UpVotes":"604", "WebsiteUrl":"", "DownVotes":"27", "Id":"2278", "AccountId":"1711803", "Views":"29", "Reputation":"1797", "CreationDate":"2013-07-22T17:11:57.903", "DisplayName":"robert", "LastAccessDate":"2014-01-19T00:31:56.677", "AboutMe":""}}