{"Body":"<p><b>Is there a name for the phenomenon described below, whereby even after centuries of development into erudite thinking, people feel that words that come from formerly more civilized foreigners are more civilized, literate, dignified, or formal than native words?  What other instances of it exist than English and Korean?</b></p>\n\n<p>\"Nativity\" is a fancy word for \"birth\", and what makes it \"fancy\" seems to be that it's derived from Latin.  English-speaking people tend to regard words obviously derived from Latin or Greek as more hifalutin than words of Germanic origin.  \"Substance\" is more dignified than \"stuff\"; \"decay\" more formal than \"rotting\"; \"predict\" more scientific than \"foretell\".  When Arthur C. Clarke wanted to make the names of two characters in a story set in the very distant future seem futuristic, he called them Eriston and Etania, which seem like ancient Greek names (Or do they?  I now find something on the web saying \"Eriston\" is of English origin and means \"son of Eric\", but I am doubtful).</p>\n\n<p>It seems at least somewhat plausible to explain this by saying that people who spoke Latin and were familiar with books in Greek (maybe especially the New Testament?) brought civilization and literacy to British barbarians.</p>\n\n<p>I have heard that something similar happens in Korea.  Korean names of numbers bigger than 1000 are Chinese words.</p>\n\n<p>I know enough about Swahili to know that it's pretty easy to tell which words in that language are derived from Arabic, and among those are all words that would be known only to literate people and unknown only in non-literate communities.  The word \"kitabu\", meaning \"book\" is obviously of Arabic origin, although its way of being used in Swahili is completely adapted to that Bantu language, as seen in the fact that its plural is \"vitabu\" (it is one of a class of nouns in Swahili whose singular (in most instances) begins with \"ki-\" and whose plural begins with \"vi-\").  I don't know whether Swahili-speaking people feel the same way about Arabic-versus-Bantu as English-speaking people do about Latin/Greek-versus-Germanic-or-otherwise-barbarian.</p>\n", "Id":"4739", "FavoriteCount":"2", "Title":"Feelings about formerly more civilized foreigners' words", "CreationDate":"2013-10-16T03:12:27.393", "OwnerUserId":"2602", "PostTypeId":"1", "Tags":"<english><latin><greek>", "comments":[], "ViewCount":"101", "LastActivityDate":"2013-10-16T03:12:27.393", "Score":"2", "CommentCount":"7", "OwnerUser":{"UpVotes":"2", "Location":"Minneapolis", "DownVotes":"0", "Id":"2602", "AccountId":"510067", "Views":"2", "Reputation":"151", "CreationDate":"2013-10-15T23:18:35.360", "DisplayName":"Michael Hardy", "LastAccessDate":"2014-01-02T22:23:33.417", "AboutMe":"After doing nearly all the coursework for a Ph.D. in math, I then did all the coursework for a Ph.D. in statistics and completed that degree."}}