{"Body":"<p>Syntactic theories in the generative tradition involve transformations, i.e. movement of constituents, between deep structure and surface structure. What is actually meant by this? Is it intended as a model of the linguistic mind, a metaphor, or something else?</p>\n\n<p>For example, take the statement \"English passive clauses are derived from underlying active clauses by a set of transformations\". I can think of two things this might mean:</p>\n\n<ol>\n<li><p>It might be intended as an actual model of the linguistic mind. That is, the claim would be that when you form a passive clause, your brain first puts together the corresponding active clause, then applies the transformations to produce a passive clause out of it. </p></li>\n<li><p>It might not be intended as a model of the linguistic mind, but simply as a formal system, i.e. a set of algorithms that can produce linguistic forms that correspond to those that actual speakers produce, but without necessarily going through similar processes.</p></li>\n</ol>\n\n<p>If 1 is intended, what evidence is there that it's true? </p>\n\n<p>If 2 is intended, what is the point of such a set of algorithms, when what we really want is to understand the actual workings of the linguistic mind?</p>\n", "Id":"4750", "LastEditorUserId":"22", "FavoriteCount":"1", "AcceptedAnswerId":"4775", "Title":"Ontological status of syntactic transformations", "CreationDate":"2013-10-19T02:09:04.003", "OwnerUserId":"2411", "PostTypeId":"1", "Tags":"<syntax><philosophy-of-language><transformations><movement>", "AnswerCount":"2", "comments":[], "LastEditDate":"2013-10-19T11:49:58.270", "LastEditedUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "ViewCount":"230", "LastActivityDate":"2013-12-03T01:29:30.823", "Score":"7", "CommentCount":"14", "OwnerUser":{"UpVotes":"80", "WebsiteUrl":"", "DownVotes":"24", "Id":"2411", "ProfileImageUrl":"https://www.gravatar.com/avatar/5e5b9f5cfa370b99b7b7fdaa27454de1?s=128&d=identicon&r=PG&f=1", "AccountId":"3231657", "Views":"10", "Reputation":"1342", "CreationDate":"2013-08-28T19:22:30.673", "DisplayName":"TKR", "LastAccessDate":"2014-01-19T02:45:52.557", "AboutMe":""}}