{"Body":"<p>I have a set of sentences from which I want to extract all the subjective phrases. </p>\n\n<p>For eg., from <strong>I am pleased to learn that the president has been reelected.</strong>, I want to extract <strong>am pleased</strong>. What is the way to do that?</p>\n\n<p><strong>Edit:</strong> So each sentence can be divided into subjective and objective phrases. For example in the sentence:</p>\n\n<pre><code>Barack Obama is the President of the USA but I don't think he's doing a good job.\n</code></pre>\n\n<p>Here, the first part, <code>Barack Obama is the President of the USA</code> is the objective part of the phrase as it states the fact but <code>I don't think he's doing a good job</code> is the subjective part of the phrase which gives the sentiment. I want to extract all such subjective phrases from a bunch of sentences. What I have access to is a bunch of documents which have sentences with corresponding documents already containing the subjective phrases present in these documents. I need to find a method which I can use to understand how these subjective phrases are constructed so that I can extract subjective phrases from a new set of sentences/documents. If anyone is aware of some papers or any other sources dealing with this, it would be of great help.</p>\n", "Id":"4785", "LastEditorUserId":"2629", "Title":"Extracting subjective phrases from sentences", "CreationDate":"2013-10-24T18:53:34.010", "OwnerUserId":"2629", "PostTypeId":"1", "Tags":"<nlp><sentiment-analysis>", "comments":[], "LastEditDate":"2013-11-03T18:20:04.723", "LastEditedUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2629", "AccountId":"1226087", "Views":"3", "Reputation":"104", "CreationDate":"2013-10-24T18:52:32.583", "DisplayName":"Expressions_Galore", "LastAccessDate":"2013-11-03T18:19:51.380"}, "ViewCount":"110", "LastActivityDate":"2013-11-03T18:20:04.723", "Score":"0", "CommentCount":"6", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "Id":"2629", "AccountId":"1226087", "Views":"3", "Reputation":"104", "CreationDate":"2013-10-24T18:52:32.583", "DisplayName":"Expressions_Galore", "LastAccessDate":"2013-11-03T18:19:51.380"}}