{"Body":"<p>For those who came in late, a \"sentence adverb\" is a word that modifies an entire sentence rather than just the verb or predicate.   A sentence adverb communicates speaker attitudes about the proposition that the sentence denotes, or discourse information.   So \"fortunately\" is a sentence adverb in the sentence \"Fortunately, we found a source of fresh water on the island.\"  Also note \"however,\" the sentence adverb for discourse.    </p>\n\n<p>I couldn't find much information on the Internet about sentence adverbs.   Here are the three most helpful links I found:   </p>\n\n<p><a href=\"http://www-01.sil.org/linguistics/GlossaryOfLinguisticTerms/WhatIsASentenceAdverb.htm\" rel=\"nofollow\">http://www-01.sil.org/linguistics/GlossaryOfLinguisticTerms/WhatIsASentenceAdverb.htm</a>\n<a href=\"http://grammar.about.com/od/grammarfaq/f/sentadvqa.htm\" rel=\"nofollow\">http://grammar.about.com/od/grammarfaq/f/sentadvqa.htm</a>\n<a href=\"http://www.oxforddictionaries.com/definition/english/sentence-adverb\" rel=\"nofollow\">http://www.oxforddictionaries.com/definition/english/sentence-adverb</a></p>\n\n<p>All of the links define sentence adverbs as sentence modifiers.  But is this always true?   Note the following:    </p>\n\n<p>a) The man fell from the tenth story, fortunately onto a pile of pillows. </p>\n\n<p>b) Fortunately, the man fell from the tenth story onto a pile of pillows.  </p>\n\n<p>In sentence a), \"fortunately\" clearly conveys speaker attitude and has the same meaning as it does in sentence b).   However, the sentences don't necessarily have synonymous readings.   </p>\n\n<p>It can be unfortunate that the man fell from the tenth story onto a pile of pillows, and at the same time fortunate that he landed on a pile of pillows (rather than the hard pavement, for example).   </p>\n\n<p>So, if \"fortunately\" in sentence a) can convey speaker attitude about the state of affairs denoted by the prepositional phrase \"onto a pile of pillows,\" what should we call \"fortunately\" in this context if not a sentence adverb?</p>\n\n<p>I am assuming that other languages have sentence adverbs, and that this question is therefore not off-topic.  </p>\n", "Id":"4805", "FavoriteCount":"1", "AcceptedAnswerId":"4811", "Title":"Are sentences the only constituents that \"sentence adverbs\" modify?", "CreationDate":"2013-10-29T03:55:47.070", "AnswerCount":"2", "Tags":"<syntax><word-classes><discourse>", "PostTypeId":"1", "OwnerUserId":"790", "comments":[], "ViewCount":"168", "LastActivityDate":"2013-10-30T10:00:28.900", "Score":"2", "CommentCount":"1", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}