{"Body":"<p>I can't decide whether Ancient Greek had \"geminate\" or \"long\" consonants. In other words did γλῶττα stand for [glˈɔːt̪.t̪a] or for [glˈɔː.t̪ːa] ? The difference between geminate and long consonants is clearly expressed by John Laver, Principles of phonetics, chapter 14 : geminate=repetition of a same sound, unlike a long consonant.</p>\n\n<p><strong>geminate :</strong>\nI read in Michel Lejeune (Phonétique historique du mycénien et du grec ancien), page 70 (my translation) : \"Geminate occlusives are the (phonemes) whose tense (=French 'tenue') is sufficient to be heard by ears and whose implosion and explosion, both audible, belong to two different syllables\".\nFrom Lejeune's book I understand two ideas : Ancient Greek had geminate occlusives and these geminate became later long consonants (but I can't find the passage relative to this last idea).</p>\n\n<p><strong>long</strong> :\nI read in Sidney Allen (Vox Graeca, page 12) : \"wherever the normal spelling writes a double consonant, it stands for a correspondingly lengthened consonant.\"</p>\n\n<p>What do you think about ? Any help would be appreciated !</p>\n\n<p><em><strong>ADDENDUM :</em></strong> I have to apologize : the difference between gemination(=repetition) and gemination (lengthened consonant) isn't in John Laver, Principles of phonetics, chapter 14. \nThis distinction appears in Lejeune's book (Phonétique historique du mycénien et du grec ancien, page 71, note 59-1) but Lejeune only cites another book (Maurice Grammont, Traité de phonétique, 52-57) where the definition between \"geminated consonants, opposed to long consonants\" (my translation of Lejeune's note) is given. I don't have Grammont's book so I can't go further. Is this distinction outdated ?</p>\n", "Id":"4847", "LastEditorUserId":"51", "FavoriteCount":"1", "Title":"geminate or long consonants in Ancient Greek?", "CreationDate":"2013-11-04T20:45:00.597", "OwnerUserId":"2678", "PostTypeId":"1", "Tags":"<consonants><greek><gemination>", "comments":[], "LastEditDate":"2013-11-08T00:11:51.630", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"111", "LastActivityDate":"2013-11-08T00:11:51.630", "Score":"4", "CommentCount":"7", "OwnerUser":{"UpVotes":"3", "WebsiteUrl":"http://94.23.197.37", "Location":"France", "Id":"2678", "DownVotes":"0", "AccountId":"538304", "Views":"2", "Reputation":"55", "CreationDate":"2013-11-04T20:17:44.390", "DisplayName":"suizokukan", "LastAccessDate":"2014-01-16T17:48:58.037", "Age":"37"}}