{"Body":"<p>This thread (related <a href=\"http://linguistics.stackexchange.com/questions/4847/geminate-or-long-consonants-in-ancient-greek\">to this problem</a>) can be split into two questions, the first one being restricted to Ancient Greek, the second one being more general.</p>\n\n<p><strong>(1)</strong> Let's be, by example, two syllables, the first one having an onset and a nucleus, the second one beginning with a lengthened consonant <strong>due to syllabication</strong>. By example, Ancient Greek has γλῶττα, standing for [ glˈɔː . t̪ːa ] (from Sidney Allen, Vox Graeca, page 12 : \"wherever the normal spelling writes a double consonant, it stands for a correspondingly lengthened consonant.\")</p>\n\n<p>My first question : is the first syllable a closed one ? I read in John Laver, Principles of Phonetics, p. 32 : \"When a syllable ends in a vowel, with no final consonant, it is said to be an open syllable\". So the question becomes : does the first syllable has a coda or not ?</p>\n\n<p>Now, from Michel Lejeune (<em>Phonétique historique du mycénien et du grec ancien</em>), I read, page 70 (my translation) : \"Geminate occlusives are the (phonemes) whose duration (=French 'tenue') is sufficient to be heard by ears and whose implosion and explosion, both audible, belong to two different syllables\". Same statement in Laver's book (page 437) about another language (Nubian) having \"consonants being geminated (being made long, across a syllable boundary)\".</p>\n\n<p>From Lejeune's statement it seems clear that [ glˈɔː . t̪ːa ] can be analysed as if the first syllable had [t̪] in its coda, the second syllable beginning with another [t̪], the first syllable being consequently a closed one.</p>\n\n<p><strong>(2)</strong> But I know that other languages have <strong>natural</strong> lengthened consonants <em>at the beginning of a syllable</em>. By example, (in Laver, p. 437) Pattani Malay has [lːabɔ], [sːiku], ... For these languages, if a syllable without a coda is followed by a syllable beginning with a lenghtened consonant (e.g. [pa . lːabɔ], an example I forged for the occasion), is the first syllable [pa] a short or a long one ? The word [lːabɔ] beginning with a long consonant, can this word somehow \"share\" its consonantal lenghth with the preceding word or is the syllabic boundary \"impassable\" ?</p>\n", "Id":"4864", "LastEditorUserId":"51", "AcceptedAnswerId":"4866", "Title":"Can a syllable be open before a lenghtened consonant?", "CreationDate":"2013-11-07T12:59:47.693", "OwnerUserId":"2678", "PostTypeId":"1", "Tags":"<consonants><greek><syllables><phonotactics><gemination>", "AnswerCount":"1", "comments":[], "LastEditDate":"2013-11-08T00:11:41.693", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"79", "LastActivityDate":"2013-11-08T00:11:41.693", "Score":"3", "CommentCount":"2", "OwnerUser":{"UpVotes":"3", "WebsiteUrl":"http://94.23.197.37", "Location":"France", "Id":"2678", "DownVotes":"0", "AccountId":"538304", "Views":"2", "Reputation":"55", "CreationDate":"2013-11-04T20:17:44.390", "DisplayName":"suizokukan", "LastAccessDate":"2014-01-16T17:48:58.037", "Age":"37"}}