{"Body":"<p>I love constructed languages, especially in fiction where I get a taste of constructed culture to go with it. One interesting idea that has popped up a few times in what I've been reading is the idea of a spoken language that has some kind of body language to accompany it. Every language, as a cultural phenomenon, does, but what is interesting about these languages is that the visual/physical cues are <em>essential</em>, not optional.</p>\n\n<p>Take a look at <a href=\"http://linguistics.stackexchange.com/q/543/42\">this recent question</a> about simultaneous articulation of sounds, and <a href=\"http://scifi.stackexchange.com/q/3446\">this question</a> at the Science Fiction &amp; Fantasy SE, which I'm basically pulling over into the Linguistics SE with some clarification. (The one at SciFi SE is talking about body language and language in general; this is a little more specific. Also, there's a different group of people answering it :)</p>\n\n<p>Here are two examples: </p>\n\n<blockquote>\n  <p>\"Tempi,\" I asked. \"Is all of this?\" I made a gesture to my face, then smiled, frowned, rolled my eyes. \"Does all this happen with hands in Ademic?\"</p>\n</blockquote>\n\n<ul>\n<li><p>In <em><a href=\"http://www.barnesandnoble.com/w/wise-mans-fear-patrick-rothfuss/1100211108\" rel=\"nofollow\">The Wise Man's Fear</a></em> (Book 2 of the <em>Kingkiller Chronicles</em>) by Patrick Rothfuss, the Adem people have a spoken language and a kind of signing with the left hand. The Adem people are seen by outsiders as fidgety, silent people because the signed language can be used alone for brief exchanges, but it is also used while speaking. It adds nuance to meaning, intention, intensity and emotion. There is a man in the town that lost three of his fingers as a mercenary, and he is basically seen as being mute. The Ademic spoken language is said to be more \"open\" (a small lexicon of broadly defined words?) than other languages, and one can only be understood clearly when pairing the hand language with it.</p></li>\n<li><p>In <em><a href=\"http://www.barnesandnoble.com/w/amber-spyglass-philip-pullman/1100014503\" rel=\"nofollow\">The Amber Spyglass</a></em> (Book 3 in <em>His Dark Materials</em>) by Philip Pullman, there is another world populated by animals called <a href=\"http://en.wikipedia.org/wiki/Races_and_creatures_in_His_Dark_Materials#Mulefa\" rel=\"nofollow\">mulefa</a> (pl; sg: zalif) which have prehensile trunks like elephants. Their language is a combination of sounds and a swinging movement of their trunks in a particular direction, ie the same sound can mean something different if the trunk flicks a different direction. I always drew the parallel to tonal languages. The human who visits this world has to swing her arm to mimic their trunks because the movement is essential to the language. </p></li>\n</ul>\n\n<p>There are, of course, many instances where body language plays a role in communication, but I think the idea of it being part of the language is unique. Besides sign languages, I don't think that there are real languages that operate like this, but I've been trying to think of examples where <strong>signs or physical cues inject new (non-redundant, ha), concrete information into a conversation</strong>. Here's what I've come up with: </p>\n\n<ul>\n<li>Nodding or shaking one's head (without language to accompany it)</li>\n<li>Pointing (without deictic phrases like \"over there\")</li>\n<li>The \"shh\" finger without the \"shh\"</li>\n<li>Greeting and parting gestures like waving, offering a handshake, bowing, etc (Usually would not occur without some language, but could?)</li>\n<li>Making \"typing hands\" while saying something like \"So then I said...\" automatically puts the conversation being referred to on a computer</li>\n</ul>\n\n<p>This last one, although kind of a silly example, is more what I'm thinking of. The other examples here are all part of the mechanics of a conversation: things that are really common or culturally part of the routine of talking. But \"typing hands\" adds <strong>entirely new content to the conversation</strong>: where and how they conversation took place. Neat!</p>\n\n<p>I'm steering away from \"body language\" type cues like eye rolling, shrugging, or crossed arms which will more often reference the conversation itself, not what the conversation is about. </p>\n\n<p>Anything come to mind?</p>\n", "Id":"590", "LastEditorUserId":"111", "AcceptedAnswerId":"602", "Title":"Examples of physical signs adding content to conversation?", "CreationDate":"2011-09-28T19:38:48.377", "OwnerUserId":"42", "PostTypeId":"1", "Tags":"<theoretical-linguistics><sign-languages>", "AnswerCount":"2", "comments":[], "LastEditDate":"2012-03-23T13:08:22.780", "LastEditedUser":{"UpVotes":"308", "DownVotes":"10", "Id":"111", "AccountId":"514008", "Views":"172", "Reputation":"5430", "CreationDate":"2011-09-14T09:33:29.710", "DisplayName":"Alenanno", "LastAccessDate":"2014-01-19T00:38:35.883", "AboutMe":"<p>I'm a student majoring in Languages (branch: Linguistics), currently working as a freelance translator. I've recently discovered <a href=\"http://db.tt/WpiKeReH\" rel=\"nofollow\">Dropbox</a> and I'm going to use it for my needs! :)</p>\n\n<p><em><strong>I love</em></strong><br>\nLanguages, Movies (Fantasy, Sci-Fi, Tarantino, etc.), Music, 3D Graphics, books and so on. </p>\n\n<p>Appointed ♦ Moderator Pro Tempore on <a href=\"http://area51.stackexchange.com/proposals/6673/linguistics?referrer=GlDGLdkDYNxMg1X13CJ1vg2\">Linguistics SE</a>, <a href=\"http://area51.stackexchange.com/proposals/6388/chinese-language-usage?referrer=XzTG1Nz01tc01sJEhak_6g2\">Chinese SE</a> and the <a href=\"http://area51.stackexchange.com/proposals/10848/russian-language-usage?referrer=J7IYS3ZUomUDvVVb-6SmDQ2\">Russian SE</a> site. If you're interested in other Stack Exchanges, try the <a href=\"http://area51.stackexchange.com/proposals/42949/italian-language-usage?referrer=ALVtGpK0tjLp1Lw15QCaUA2\">Italian SE</a> site.</p>\n\n<p>I like to lurk on other sites' Metas. <em>Meta is fun!</em> </p>\n\n<p><strong>My feature requests</strong>:</p>\n\n<ol>\n<li><a href=\"http://meta.stackoverflow.com/q/135786/176533\">Alert a moderator when an answer is improved after a post notice</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/138273/176533\">Automatically add chat event to the community bulletin (or make it easier)</a></li>\n<li><a href=\"http://meta.stackoverflow.com/q/121363/176533\">Give 10k users the ability to see the total count of flags they've handled</a></li>\n</ol>\n\n<p><strong>Moderator issues</strong>: If you have concerns or want to contact me about my moderation, you can find/ping me either in the <a href=\"http://chat.stackexchange.com/rooms/1336/linguistics\">Linguistics SE chat room</a> or <a href=\"http://chat.stackexchange.com/rooms/1984/chinese-language-and-usage\">CL&amp;U chat room</a>; if I'm not there or I'm \"idle\", just ping me! Please <em>avoid</em> using my personal email for such things. Use the chat rooms.</p>\n\n<hr>\n\n<p><strong>Languages List</strong> &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <sup>Languages with  * = learning on my own</sup></p>\n\n<p><strong>Mother Tongue:</strong> Italian, Sardinian;<br>\n<strong>Fluent:</strong> English, Spanish;<br>\n<strong>Less Fluent:</strong> French, German, Russian;<br>\n<strong>Learning:</strong> Japanese*, Chinese*, Swedish*, Greek*, Finnish*;<br>\n<strong>Willing to learn:</strong> Welsh, Korean, Dutch, Arabic, Hebrew, Hindi [to be continued]</p>\n\n<p>Me gusta el Español.<br>\nJ'aime le Français.<br>\nDeutsch gefällt mir.<br>\nМне нравится Русский язык.<br>\n私は日本語が好きです。<br>\n我爱中文。<br>\nJag älskar Svenska.</p>\n"}, "ViewCount":"261", "LastActivityDate":"2012-03-23T13:08:22.780", "Score":"3", "CommentCount":"3", "OwnerUser":{"UpVotes":"108", "WebsiteUrl":"http://twitter.com/mollyocr", "Id":"42", "AccountId":"896571", "CreationDate":"2011-09-13T21:04:13.347", "AboutMe":"<p>BA in Linguistics. Currently working as a localization &amp; QA specialist at a translation company in Minneapolis. Studied: Latin, Spanish, French, Arabic, Polish, Mandarin. Conlanger. Sci fi &amp; fantasy nerd, experimental cook, songwriter, artist and craftist. Also, I have a dog.</p>\n", "Age":"28", "Location":"Minneapolis, MN", "DownVotes":"8", "Views":"24", "Reputation":"933", "DisplayName":"mollyocr", "LastAccessDate":"2012-09-13T19:49:49.973"}}