{"Body":"<p>In English, and many other languages, subordination is often marked in the subordinate clause.  </p>\n\n<ol>\n<li>So complement clauses can, for example, begin with a complementizer such as English \"that.\"</li>\n</ol>\n\n<p>e.g.   \"I know <em>that Howard must have eaten here.</em></p>\n\n<p>But do any natural languages mark the verb in the matrix clause as taking a complement clause, leaving the complement clause itself with the same from that an independent clause has, like so...</p>\n\n<p>e.g.   \"I know-[infix that indicates that \"know\" takes a complement clause] Howard must have eaten here. </p>\n\n<ol>\n<li>Relative clauses can, for example, contain special relative pronouns or have a special word order.  </li>\n</ol>\n\n<p>e.g.   \"The man <em>whom we confined</em> has escaped. </p>\n\n<p>But do any natural languages mark the noun as being modified by a clause subsequent to the one in which the noun occurs and having the form of an independent clause, like so...</p>\n\n<p>e.g.   The man(suffix indicates that the next clause modifies this noun) has escaped;  we had confined him.   </p>\n\n<ol>\n<li>Adverbial clauses can, for example, be marked by subordinators.   </li>\n</ol>\n\n<p>e.g.    We were relieved when the man returned.     </p>\n\n<p>But do any natural languages mark the verb as being modified by a clause subsequent to the one in which said verb occurs--a clause with the same form that an independent clause has?    </p>\n\n<p>e.g.    We were relieved (infix means \"at the same time as\" and also conveys that the following clause is adverbial to the one in which the infix occurs) the man returned.    </p>\n", "Id":"5919", "LastEditorUserId":"790", "Title":"Are there any natural languages in the subordination of a clause is marked only in the matrix clause?", "CreationDate":"2013-11-17T03:08:46.633", "OwnerUserId":"790", "PostTypeId":"1", "Tags":"<syntax><embedding>", "comments":[], "LastEditDate":"2013-11-17T20:56:33.437", "LastEditedUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}, "ViewCount":"73", "LastActivityDate":"2013-11-17T20:56:33.437", "Score":"3", "CommentCount":"6", "OwnerUser":{"UpVotes":"468", "WebsiteUrl":"", "DownVotes":"5", "Id":"790", "AccountId":"1271332", "Views":"40", "Reputation":"2834", "CreationDate":"2012-02-23T05:08:22.933", "DisplayName":"James Grossmann", "LastAccessDate":"2014-01-18T00:13:57.030", "AboutMe":"<p>I'm a conlanger who needs reliable information about real languages.   By profession, I'm a speech/language therapist, so some of my questions may be work-related as well. </p>\n", "Age":"57"}}