{"Body":"<p>I am not sure if this is the right place to post or if I should be posting CompSci so please feel free to redirect me to the most appropriate StackExchange.</p>\n\n<p>I would like to  <strong>determine interests or hobbies that people have given two sources of data from their Twitter data</strong>. Those two pieces of information are their <em>Bio</em>, which is a user supplied description of themselves and their tweets (both a maximum of 140 characters).</p>\n\n<p>I don't have background in NLP but intuitively I have been thinking of three contexts for determining interests given here with decreasing confidence:</p>\n\n<ol>\n<li>Using <strong>explicit word phrases that express interest</strong>: interested in, passionate about, etc.</li>\n<li>A <strong>positive sentiment</strong> expressed about the subject. </li>\n<li><strong>Neutral or even negative sentiment</strong> for a topic (for example, somebody may be interested in their football team but dislike their current manager).</li>\n</ol>\n\n<p>The result I am trying to achieve is to automatically label a user with a collection of interests such as:</p>\n\n<ul>\n<li>Finance </li>\n<li>Programming</li>\n</ul>\n\n<p>And/or more specific examples like:</p>\n\n<ul>\n<li>FOREX Trading</li>\n<li>Android Development </li>\n</ul>\n\n<p><strong>I have tried using LDA, specifically the <em>topicsmodels</em> package in R, using an individuals tweets as the corpus but I am not so sure about the applicability of the results</strong>. LDA gives a collection of terms associated with the topics it found. This requires some manual interpretation to distinguish what the interest is.</p>\n\n<p>For example you might get some results from LDA like the following:</p>\n\n<ul>\n<li>[Twitter, Java, time, work, day]</li>\n<li>[code, IPhone, mobile, look, job]</li>\n<li>[football, fantasy, team, pick, score]</li>\n</ul>\n\n<p>I can generally pick out the topics people are interested in here but its just the key word or topic identifier I am interested not the other contextual terms like team, pick or score in the last example.</p>\n\n<p>Perhaps part of speech tagging would be useful, maybe I should filter by noun, proper noun, proper name to get the core interest?</p>\n\n<p>Also I would need to handle ambiguous topics such as Java, which could be a programming language, coffee variety or the island itself.</p>\n\n<p><strong>Any suggestions, references, links or pointers would be appreciated</strong>. I am comfortable with R, Java and Python if there are libraries which could help achieve this. </p>\n", "Id":"5963", "LastEditorUserId":"51", "FavoriteCount":"1", "Title":"Determining interests from Twitter text", "CreationDate":"2013-11-22T14:28:55.663", "OwnerUserId":"2758", "PostTypeId":"1", "Tags":"<computational-linguistics><nlp><sentiment-analysis>", "comments":[], "LastEditDate":"2013-11-23T15:41:35.797", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"30", "LastActivityDate":"2013-11-23T15:41:35.797", "Score":"0", "CommentCount":"3", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "ProfileImageUrl":"https://www.gravatar.com/avatar/c10dc0d3ed11b2c3deb22e5b9f77bc98?s=128&d=identicon&r=PG", "Id":"2758", "AccountId":"1384876", "Views":"0", "Reputation":"1", "CreationDate":"2013-11-22T13:24:17.353", "DisplayName":"dsimmie", "LastAccessDate":"2013-11-22T17:39:40.120", "AboutMe":"<p>C# and Java Engineer with a steadily increasing interest in Scala.</p>\n"}}