{"Body":"<p>Chinese (I've only had experience with Mandarin so far) has at least one or two equivalents to English <em>to be</em>, such as \"在\" (zài) and \"是\" (shì).</p>\n\n<p>Now I know that Chinese adjectives are actually verbs so are often described as having <em>to be</em> \"built in\".</p>\n\n<p>Yet I am told that sentences such as \"我好\" (Wǒ hǎo) are not right and instead we should say something like \"我很好\" (Wǒ hěn hǎo) where \"很\" (hěn) means literally \"very\" but in these constructions it loses that meaning and the sentence means only \"I am good\" rather than the literal \"I am very good\".</p>\n\n<p>I'm assuming that \"很\" (hěn) is not the only word that can be used in a similar way. Is this construction usually analysed as some kind of copula? And does it imply that copula is more of an open category in Mandarin than in English? Is this common in other language families?</p>\n\n<hr>\n\n<p>Meaning of <strong><em>copula</em></strong> / <strong><em>copular</em></strong>.</p>\n\n<p>It seems that as an untrained \"armchair\" linguist my concept of \"copula\" might not accord with that held generally. Let me sketch out my current notion of \"copula\":</p>\n\n<p>\"Copula\" and \"copular\" are abstract terms to refer to ways of linking mainly nominals. In theory they could refer to words or terms but perhaps also to syntactic structures involving particles or just word order. In practice in Western European languages and in languages with traditional analyses influenced by Western European linguistics they may usually pattern with verbs.</p>\n\n<p>I specifically ceased to think of copula as necessarily a type of verb but as an independent concept. I thought this was in line with current linguistics, but perhaps I've abstracted my concept of copula more than is usual among real linguists?</p>\n", "Id":"5977", "LastEditorUserId":"51", "Title":"Could certain adjectives or adverbs be analysed to function as a type of copula in Mandarin Chinese?", "CreationDate":"2013-11-23T15:56:48.680", "OwnerUserId":"51", "PostTypeId":"1", "Tags":"<syntax><chinese><copula><mandarin><adverbs>", "AnswerCount":"1", "comments":[], "LastEditDate":"2013-11-24T02:27:13.007", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"73", "LastActivityDate":"2013-11-26T03:04:12.557", "Score":"2", "CommentCount":"11", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}