{"Body":"<p>I'm confused as to how I'm to pronounce Sanskrit's \"v\" letter. My teacher mostly pronounces it as a \"w\" in words such as \"deva\", \"svara\" or \"dvipa\" but invariably utters a \"v\" in syllables \"vra\" or \"vya\".</p>\n\n<p>The definition my teacher once quoted, from an old Indian grammarian, was that \"semivowels arise when the other vowels approach vowel 'a' \" which clearly suggest the intimate relationship between \"w\" and \"u\" (as in good), as well as between \"y\" and \"i\" (as in deep).</p>\n\n<p>Since they were so thorough in their classification of sounds, I'm sure the ancient Indian grammarians would've noticed the \"v\" as a labio-dental consonant, different from semi-vocalic \"w\", and given it its own name and place in the alphabet - so I believe that letter was supposed to have just one sound.</p>\n\n<p>I try really hard to always pronounce \"v\" as \"w\", but my \"vya\" sounds more like a rapid \"wiya\", and \"vra\" sounds really like \"ura\". But then, trying it the other way around (always as \"v\") yields \"dvipa\" or \"hva\" to become almost impossible to be said.</p>\n\n<p>Any thoughts?</p>\n", "Id":"6039", "AcceptedAnswerId":"6041", "Title":"How is Sanskrit \"va\" supposed to be pronounced?", "CreationDate":"2013-11-30T19:59:47.840", "AnswerCount":"1", "Tags":"<pronunciation><sanskrit><semivowels>", "PostTypeId":"1", "OwnerUserId":"2785", "comments":[], "ViewCount":"74", "LastActivityDate":"2013-12-01T17:31:14.060", "Score":"4", "CommentCount":"4", "OwnerUser":{"UpVotes":"79", "WebsiteUrl":"http://stackoverflow.com/users/21258/joe-pineda", "ProfileImageUrl":"https://www.gravatar.com/avatar/3829797d6709334d9a07fe18dfcb553f?s=128&d=identicon&r=PG", "Id":"2785", "AccountId":"11104", "CreationDate":"2013-11-26T03:56:44.347", "AboutMe":"<p>Developing professionally since 11 years ago. VB6 and SQL Server, mostly.\nUse Linux, C++ and Perl at home.</p>\n", "Age":"35", "Location":"Mexico City, Mexico", "DownVotes":"5", "Views":"3", "Reputation":"395", "DisplayName":"Joe Pineda", "LastAccessDate":"2014-01-19T02:51:24.697"}}