{"Body":"<p>I can't come up with a better title so let me just say that I'm sorry for misleading you if this question isn't even close to what you expected.</p>\n\n<p>First of all my <strong>observation</strong>:</p>\n\n<p>In the three languages that I know (swedish, english and spanish), a construction similar to <code>some + one</code> is used to signify one person. </p>\n\n<ul>\n<li>someone = some + one</li>\n<li>någon = några/något + en</li>\n<li>alguien = algo + uno (? I'm not really sure if this actually applies to spanish) </li>\n</ul>\n\n<p>I talked to a friend who is Polish and he told me that in the polish language they have a separate word for <code>someone</code>.</p>\n\n<p>Now to my question, which is a twoparter:</p>\n\n<p><strong>1:</strong>\nCould this construction be viewed as strange? With this I mean is it common to go from many (some) to one to construct a word, instead of using lets say something like <code>many+one</code>. I realize that this is a very weird question and I'm sorry but I really am having problems formulating this question. I'll happilly try to respond to any comments or requests for clarification.</p>\n\n<p><strong>2:</strong></p>\n\n<p>Is this a construct unique for latin/germano/european languages (I know very very little about linguistics so feel free to explain it to me like I'm five)?</p>\n", "Id":"6126", "Title":"Why do we use \"someone\" to signify one person?", "CreationDate":"2013-12-12T20:23:24.437", "AnswerCount":"1", "PostTypeId":"1", "OwnerUserId":"2865", "Tags":"<etymology><language-families><philosophy-of-language><word-formation>", "comments":[], "ViewCount":"79", "LastActivityDate":"2013-12-13T03:00:21.893", "Score":"1", "CommentCount":"5", "OwnerUser":{"UpVotes":"0", "WebsiteUrl":"http://yodaconditional.blogspot.com/", "ProfileImageUrl":"http://i.stack.imgur.com/I5Npd.jpg?s=128&g=1", "Id":"2865", "AccountId":"246495", "CreationDate":"2013-12-12T20:02:57.623", "AboutMe":"<p>Few futurists agree that the best way to contact an alien species is to vandalize some crops or stack some rocks, then, leave.</p>\n", "Age":"30", "Location":"Stockholm, Sweden", "DownVotes":"0", "Views":"0", "Reputation":"106", "DisplayName":"Daniel Figueroa", "LastAccessDate":"2013-12-29T09:08:21.387"}}