{"Body":"<p>I recently had a discussion with a friend about whether a \"cave man-style\" language was likely to have ever existed.  You know, the stereotypical \"Fire bad!  Need hunt, go tree-place now!\" sort of thing.  I guess for this purpose we can define it as a language with very few (if any) structural rules, verb conjugations, prefixes/suffixes, variable word forms, complex sentence structures, or grammatical rules.  A language where each word has a single form, and you communicate thoughts just by putting words next to each other without structure or organization.  \"Need food.  Rabbit run fast.  Hungry.\"</p>\n\n<p>On the one hand, it seems natural that the first phase of language development would be very simple, even awkward, before linguistic rules were solidified.  (This was my friend's argument.)  The idea is that without any education or enforced consistency the new language would remain merely functional, complex only to the point necessary for communicating information, and would only grow beyond that with the advent of \"linguistics\" as a field of study, which might not happen for thousands of years.</p>\n\n<p>On the other hand, (this was my argument), I'd imagine that as soon as language begins to develop and you start making up words for actions, objects and places, it probably wouldn't be very long before \"tree-place\" becomes \"the local forest,\" and \"lion bad\" becomes \"lions are bad\" or even \"when you see a lion it is bad.\"  I tend to think sentence structure arises naturally from the organization of the speaker's thoughts, and while nitty-gritty grammar rules (like \"who\" vs \"whom\") might not develop for a long time, things like verb tenses, possessive nouns, and prepositions would develop quite quickly.  (Btw, I know some languages still don't use some of these things, but the overarching idea of sentence structure and grammatical complexity is more what I'm talking about, rather than verb tenses specifically, etc.)</p>\n\n<p><strong>So my question is this:</strong> do we have any evidence of the very, very first phases of linguistic invention?  Maybe some feral group of children who developed their own language, or a remote population uninfluenced by local tongues?  Is there any way to know how quickly complex sentence structure developed?  Or have those first few steps been lost to history?</p>\n", "Id":"6181", "LastEditorUserId":"2328", "FavoriteCount":"1", "AcceptedAnswerId":"6186", "Title":"Did a \"cave man-style\" language ever exist?", "CreationDate":"2013-12-17T21:02:36.783", "OwnerUserId":"2830", "PostTypeId":"1", "Tags":"<historical-linguistics><evolution><philosophy-of-language><evolutionary-linguistics>", "AnswerCount":"4", "comments":[], "LastEditDate":"2013-12-20T18:17:31.610", "LastEditedUser":{"UpVotes":"123", "WebsiteUrl":"https://sites.google.com/site/patrickdelliott/", "ProfileImageUrl":"http://i.stack.imgur.com/HGYBE.jpg", "Id":"2328", "AccountId":"3146009", "CreationDate":"2013-08-07T11:16:59.797", "AboutMe":"<p>I'm a PhD student in Linguistics at University College London. My primary area of interest is generative linguistics, and specifically syntactic and semantic theory. More narrowly still, i'm interested in ellipsis, comparatives, and binding theory. <a href=\"https://twitter.com/patrickdelliott\" rel=\"nofollow\">Follow me on twitter!</a></p>\n", "Location":"London, United Kingdom", "DownVotes":"43", "Views":"43", "Reputation":"970", "DisplayName":"P Elliott", "LastAccessDate":"2014-01-19T02:32:31.120"}, "ViewCount":"181", "LastActivityDate":"2013-12-20T18:17:31.610", "Score":"6", "CommentCount":"4", "OwnerUser":{"UpVotes":"3", "WebsiteUrl":"http://www.AlexanderWinn.com", "ProfileImageUrl":"http://i.stack.imgur.com/FHwhr.jpg?s=128&g=1", "Id":"2830", "AccountId":"1518241", "CreationDate":"2013-12-05T23:01:48.460", "Age":"28", "Location":"Los Angeles, CA", "DownVotes":"0", "Views":"1", "Reputation":"136", "DisplayName":"Alexander Winn", "LastAccessDate":"2013-12-20T18:17:17.423"}}