{"Body":"<p>English does not allow an imperative to be used in a subordinate clause:</p>\n\n<ol>\n<li>Eat that pizza!</li>\n<li>*There's a pizza on the table, which eat! (=\"which I order you to eat\")</li>\n<li>*I told you eat that pizza!</li>\n</ol>\n\n<p>(A superficially similar variant of 3 is grammatical: \"I told you, eat that pizza!\" - but here the imperative clause is not subordinate.)</p>\n\n<p>But there's no obvious reason why this should be so. Pragmatically, an imperative is usually paraphrasable by a declarative, e.g. \"I order you to Verb\" or \"You must Verb\", and such declaratives are subordinatable like any others. Indeed, Ancient Greek allows subordinate imperatives to a limited extent (examples from Smyth's Greek Grammar, p. 411):</p>\n\n<ol>\n<li><em>kratêrés eisin ... hôn krât' érepson</em> \"There are mixing bowls ... the rims of which fill!\" (=\"the rims of which you must fill\")</li>\n<li><em>oîsth' hò drâson?</em> \"Do you know what do (impv.)?\" (=\"Do you know what you are to do / what I'm telling you to do?\")</li>\n</ol>\n\n<p>So: which other languages allow subordinate imperatives? (By \"imperative\" here I mean a morphological form whose main or sole function is to express a directive speech act. There are languages where \"subjunctive\" forms of various kinds can be used to express commands in both main and subordinate clauses, but I'm not asking about those.) Are subordinate imperatives cross-linguistically rare, or do they only happen to be rare in modern European languages? And if they are rare, why should this be? (Presumably the answer should have to do with the differing pragmatic status of the content of main and subordinate clauses: e.g. in declarative sentences, the content of a subordinate clause often cannot be directly affirmed or denied, which seems relevant somehow.)</p>\n", "Id":"6182", "FavoriteCount":"1", "AcceptedAnswerId":"6185", "Title":"Languages with subordinate imperatives?", "CreationDate":"2013-12-17T21:41:41.773", "AnswerCount":"1", "Tags":"<syntax><morphology><linguistic-typology><imperatives><subordination>", "PostTypeId":"1", "OwnerUserId":"2411", "comments":[], "ViewCount":"103", "LastActivityDate":"2013-12-19T09:27:47.473", "Score":"5", "CommentCount":"3", "OwnerUser":{"UpVotes":"80", "WebsiteUrl":"", "DownVotes":"24", "Id":"2411", "ProfileImageUrl":"https://www.gravatar.com/avatar/5e5b9f5cfa370b99b7b7fdaa27454de1?s=128&d=identicon&r=PG&f=1", "AccountId":"3231657", "Views":"10", "Reputation":"1342", "CreationDate":"2013-08-28T19:22:30.673", "DisplayName":"TKR", "LastAccessDate":"2014-01-19T02:45:52.557", "AboutMe":""}}