{"Body":"<p>In Russian, like in Basque, Finnish or Estonian, verbs can have two types of object: the Genitive or the Accusative modes. The Genitive case in such structures is actually a partitive (which is rendered in English by partitive marker 'some', like 'I have some friends' or 'do you need some water?'; hence, the partitive-governed verbs.</p>\n\n<p>Verbs of the first type can have an object in both cases: <em>взять деньги</em> (Acc.) or <strong><em>взять денег</em></strong> (Part.), both are grammatical meaning 'to take some/the money.</p>\n\n<p>Verbs of the second type can have the verbs with Accusative objects (which is more or less similar to the most European languages where an object is distinguished by a case ending): <em>выбрать деньги</em> (to choose the money) is grammatical, while * <em>выбирать денег</em> (to choose some money) is not. It does not have anything to do with the perfective/imperfective types of the verb we can say <em>понабрать(ся) слов</em> ('to take/to borrow (for oneself and by oneself) some words), which is grammatical, while * <strong><em>понабираться слова</em></strong> (pl. object) is not.</p>\n\n<p>My question concerns the Russian verbs of the third type. The verbs of this group either have a special prefix, which determines the event structure as described by a verb, as in <em>понабрать(ся)</em>, or they don't have such a prefix. </p>\n\n<p>In the latter case, the verbs have no prefix, yet the grammatical structures require a partitive object only: <em>коснуться травы</em> (to touch [some] grass) is grammatical, while * <strong><em>консуться траву</em></strong> is not. It is not exactly a partitive, either, because an action taken upon a smaller object with a smaller surface follows the same pattern: to touch the key (on a keyboard) shall be <em>коснуться кнопки</em> (sg. object), and not * <strong><em>коснуться кнопку</em></strong>.</p>\n\n<p>This is not a distinction by perfective/non-perfective types, because <em>касаться травы</em> VS <em>коснуться травы</em>  (to touch [some] grass) are equally grammatical. However, we cannot say * <strong><em>коснуться траву</em></strong>. It does not have anything to do with animate/inanimate nouns, either, because the only grammatical option is to <strong><em>коснуться медведицы</em></strong> (to touch a she-bear), not * <strong><em>коснуться медведицу</em></strong>.</p>\n\n<p>It is not related to the transitivity-intransitivity, since not all reflexive intransitional verbs take a partititve ending, e.g. like in <em>вернуться в дом</em> (to return [oneself] in the house) with accusative argument.</p>\n\n<p>It is not related to the reflexivity/non-reflexivity, either, because in Russian the only grammaical argument for <em>ждать</em> (to wait) is partitive, although the verb is not reflexive.</p>\n\n<p>The question shall be, is there a general rule for choosing a partitive object, and what are the other verbs of this type in Russian? Is the third group a Russian peculiarity only, or is there in other Slavic languages a similar pattern for verbs taking partitive objects only? </p>\n", "Id":"6197", "LastEditorUserId":"1686", "Title":"Russian verbs demanding partitive arguments only: main rule/semantic range?", "CreationDate":"2013-12-19T15:56:46.000", "OwnerUserId":"1686", "PostTypeId":"1", "Tags":"<cases><slavic-languages><partitive-case><cognitive-grammar><event-structures>", "comments":[], "LastEditDate":"2013-12-20T11:56:32.230", "LastEditedUser":{"UpVotes":"145", "DownVotes":"36", "ProfileImageUrl":"http://i.stack.imgur.com/rZ1Oc.jpg", "Id":"1686", "AccountId":"2130467", "Views":"63", "Reputation":"1112", "CreationDate":"2013-01-19T17:49:32.827", "DisplayName":"Manjusri", "LastAccessDate":"2014-01-18T20:17:27.900", "AboutMe":"<p>I have no native language. I am more or less getting by in some tongues, and I can read and/or swear in douzens of other languages, but this doesn't mean I am an expert in them. By January 2013 I am 34 and wish to see the latter number growing. </p>\n\n<p>I study [cognitive] psychology and am planning to obtain some certificates in computer languages and programming.</p>\n\n<p>I enjoy horse riding, travelling, good cuisine, green Japanese tea, Russian and Spanish literatures and friendly company.</p>\n\n<p><strong>Fluent In:</strong> Dutch, English, Finnish, French, Russian, Spanish and Swedish.</p>\n\n<p><strong>Less Fluent:</strong> Danish, Estonian, Polish and Bulgarian, </p>\n\n<p><strong>Learning:</strong> Arabic, Chinese, Innuit, Japanese, Komi, Sanskrit, Tibetan and Yoruba.</p>\n\n<p><strong>Planning to Learn:</strong> Tangut, C, C++ &amp; Pascal</p>\n"}, "ViewCount":"81", "LastActivityDate":"2013-12-20T11:56:32.230", "Score":"-1", "CommentCount":"13", "OwnerUser":{"UpVotes":"145", "DownVotes":"36", "ProfileImageUrl":"http://i.stack.imgur.com/rZ1Oc.jpg", "Id":"1686", "AccountId":"2130467", "Views":"63", "Reputation":"1112", "CreationDate":"2013-01-19T17:49:32.827", "DisplayName":"Manjusri", "LastAccessDate":"2014-01-18T20:17:27.900", "AboutMe":"<p>I have no native language. I am more or less getting by in some tongues, and I can read and/or swear in douzens of other languages, but this doesn't mean I am an expert in them. By January 2013 I am 34 and wish to see the latter number growing. </p>\n\n<p>I study [cognitive] psychology and am planning to obtain some certificates in computer languages and programming.</p>\n\n<p>I enjoy horse riding, travelling, good cuisine, green Japanese tea, Russian and Spanish literatures and friendly company.</p>\n\n<p><strong>Fluent In:</strong> Dutch, English, Finnish, French, Russian, Spanish and Swedish.</p>\n\n<p><strong>Less Fluent:</strong> Danish, Estonian, Polish and Bulgarian, </p>\n\n<p><strong>Learning:</strong> Arabic, Chinese, Innuit, Japanese, Komi, Sanskrit, Tibetan and Yoruba.</p>\n\n<p><strong>Planning to Learn:</strong> Tangut, C, C++ &amp; Pascal</p>\n"}}