{"Body":"<p>This is something that bugged me before I studied linguists, and it still does - why is the word \"orange\" so often used for both the colour and the fruit cross-linguistically? Every language I've learned has these items as the same word, or at least very similar origins. English (<em>orange</em>), Polish (<em>pomarańczowy</em>), Italian (<em>arancione/arancia</em>) and Nepali (<em>suntala</em>). Granted, these are all Indo-European languages but they do cover quite a spread, and my sister tells me that Mandarin has the same feature with <em>chéng</em> referring to both the fruit and the colour. I'm assuming that languages have borrowed the work for the colour on the basis of the fruit, and not the other way around but I may be wrong.</p>\n\n<p>I know that oranges are a relatively recently introduced fruit to many places, but is this phenomenon as cross-linguistically common as it appears from my limited experience. And if so, why?  </p>\n", "Id":"620", "LastEditorUserId":"22", "AcceptedAnswerId":"625", "Title":"The relationship between \"orange\" the colour and \"orange\" the fruit", "CreationDate":"2011-09-30T00:10:18.087", "OwnerUserId":"64", "PostTypeId":"1", "Tags":"<etymology><cross-linguistic><semantics>", "AnswerCount":"6", "comments":[], "LastEditDate":"2011-12-02T00:37:07.920", "LastEditedUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "ViewCount":"1438", "LastActivityDate":"2012-02-08T16:36:55.303", "Score":"11", "CommentCount":"8", "OwnerUser":{"UpVotes":"126", "WebsiteUrl":"http://www.superlinguo.com", "Id":"64", "AccountId":"900445", "CreationDate":"2011-09-13T21:45:12.903", "AboutMe":"<p>I have a PhD in linguistics. My areas of interest include language documentation, Tibeto-Burman linguistics, gesture, language play, LOLspeak, evidentiality and making bad puns. I blog about language and linguistics at www.superlinguo.com</p>\n", "Age":"29", "Location":"Australia", "DownVotes":"6", "Views":"40", "Reputation":"2016", "DisplayName":"LaurenG", "LastAccessDate":"2013-10-26T00:28:12.653"}}