{"Body":"<p>In (spoken) English, the object pronouns \"me/you/her/him/us/them\" are, in some sense, the \"unmarked\" pronouns. (I only claim native knowledge of English as it is spoken in parts of the US). By this I mean that, in novel contexts, native speakers seem to prefer these to the subject pronouns \"I/you/she/he/we/they.\" (Prescriptively, the subject pronoun is often preferred). For instance,</p>\n\n<ol>\n<li><p>The \"one-word\" answer to a question is the object pronoun. (Who went to the store? Us (natural language). We did (fine). *We.)</p></li>\n<li><p>Object pronouns show up in complex subjects, although this is prescriptively discouraged: \"Me and John went to the party,\" \"Us four are going to the store, are yall?\"</p></li>\n<li><p>Object pronouns are usually used as replacements for names in non-sentence contexts, e.g. when making a scorepad or a diagram, one writes \"us\" and \"them.\" (Note that in bridge one uses \"we\" and \"they,\" and also that this sounds strange.)</p></li>\n</ol>\n\n<p>In short, in spontaneous speech, I think of myself as \"me,\" not as \"I.\"</p>\n\n<p>In French, it is the emphatic pronouns (moi/toi...) that play all of the above roles. (Interestingly, it is prescriptively correct in French to use the emphatic pronoun in a complex subject, rather than the subject pronoun).</p>\n\n<p>It is interesting that both languages have what seems to be a default set of pronouns for novel circumstances. I can guess a few reasons for this:</p>\n\n<ul>\n<li><p>This is a coincidence.</p></li>\n<li><p>This is a borrowing from French to English.</p></li>\n<li><p>This is left over from the proto-Indo-European pronoun structure.</p></li>\n<li><p>there is a linguistic universal for \"default pronouns.\" In other words, a language learner learns one set of pronouns as fundamental \"names\" for people; then, the other pronouns are learned only in specific grammatical contexts. </p></li>\n</ul>\n\n<p>What I like about this last theory is that it explains why children tend to start out using the \"John and me went\" construction in spite of the heavy prescriptive norm against it, and also why adults who learn the prescriptive rule tend to overgeneralize it to \"with John and I.\" </p>\n\n<p>Is there good cross-linguistic evidence for a \"default\" set of personal pronouns within a language, or is this phenomenon in English and French better explained by one of the simpler explanations?</p>\n", "Id":"6256", "LastEditorUserId":"3020", "Title":"universals and emphatic pronouns", "CreationDate":"2013-12-26T22:04:12.920", "OwnerUserId":"2898", "PostTypeId":"1", "Tags":"<english><linguistic-universals><pronoun><french>", "comments":[], "LastEditDate":"2014-01-15T16:14:39.973", "LastEditedUser":{"UpVotes":"3", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/Pc82Y.jpg?s=128&g=1", "Id":"3020", "AccountId":"2596734", "Views":"1", "Reputation":"167", "CreationDate":"2014-01-13T16:08:59.447", "DisplayName":"Marjeta", "LastAccessDate":"2014-01-17T20:16:21.790"}, "ViewCount":"75", "LastActivityDate":"2014-01-15T16:14:39.973", "Score":"6", "CommentCount":"6", "OwnerUser":{"UpVotes":"10", "DownVotes":"1", "ProfileImageUrl":"https://www.gravatar.com/avatar/ba0643dd539ae1d9fe5298cffa195ef5?s=128&d=identicon&r=PG&f=1", "Id":"2898", "AccountId":"3570237", "Views":"1", "Reputation":"141", "CreationDate":"2013-12-18T12:40:42.537", "DisplayName":"hunter", "LastAccessDate":"2014-01-16T08:32:39.647"}}