{"Body":"<p>We are gearing up for the new semester at the Thai university where I teach English.  One course I’ll be helping out with is on English pronunciation.  In the unit on sentence stress, the course textbook introduces the idea of stress-timed vs. syllable-timed languages:  in the former type, sentence rhythm is determined by units each based around one stressed syllable, while in the latter, each syllable receives an equal beat in ‘machine-gun’ fashion.  In stress-timed languages, vowels in unstressed syllables are often reduced (as with the schwa in ‘the’, English being stress-timed.)  Presumably vowel reduction happens less if at all in syllable-timed languages.  The contrast in sentence rhythm is illustrated by two pictures: a row of people of different heights walking in groups of two or three for stress-timed, and a row of soldiers of equal height marching in formation for syllable-timed.</p>\n\n<p>The book presents English as a stress-timed language, and students learn to differentiate content words (which receive stress) from function words (which are generally unstressed.)  It mentions in passing that Thai, by contrast, has syllable-timed rhythm.  Is this correct?</p>\n\n<p>The Wikipedia entry on ‘isochrony’ lists Thai with the stress-timed languages.  It cites a study by Dauer (1983).  However, the findings of this study (I don’t have access to the full text) seem to be that there is no empirical phonetic basis for grouping languages according to syllable/stress/mora-based rhythm in this way.</p>\n\n<p>Two 2008 entries on the blog ‘Language Log’ by Mark Liberman also question the reality of stress vs syllable rhythm.  Liberman measures the speech rhythms of a Spanish/English bilingual and finds that while his Spanish speech is more rhythmically regular than his English speech, this is due mainly to Spanish having fewer consonant clusters and thus more uniformity in duration of articulating each syllable.  In Liberman’s view there are other motivations for a more uniform rhythm, it’s not a general feature for any given language.</p>\n\n<p>Consulting the bibliography of Thai linguistics in the Routledge Tai-Kadai volume doesn’t turn up anything that directly addresses the question of whether Thai is stress- or syllable-timed.</p>\n\n<p>I’m an English native speaker who speaks both Thai and Mandarin pretty well.  Mandarin is supposed syllable-timed.  If we look at the rhythm at the level of individual sentences, it’s not hard to find an example that contradicts the general characterization.  The sentence ‘His car broke down’ can translate as follows into each language:</p>\n\n<p>Mandarin:  他的車子壞了.  Tāde chēzi huài le.</p>\n\n<p>The rhythm here seems to be trochaic (stressed-unstressed).</p>\n\n<p>Thai:  รถยนต์ของเขาเสีย    Rót yōn khŏng kháo sĭa.</p>\n\n<p>Each syllable receives more or less equal stress.  (I’m using ĭ and ŏ to represent rising tones here.)</p>\n\n<p>So in this small example, Mandarin seems stress-timed, Thai syllable-timed, not the other way around.</p>\n\n<p>I have two questions here.</p>\n\n<ol>\n<li><p>Is there a scholarly consensus about the status of Thai – is it stress-timed, syllable-timed, or something else?  What should we tell our students, who are native speakers of Thai, in this regard?</p></li>\n<li><p>Could I try to measure this myself using Praat or some other easily accessible tool?  How would I go about doing this?  (I am not a linguist, and although I’ve downloaded Praat, I have never used it for anything serious.)</p></li>\n</ol>\n", "Id":"6257", "LastEditorUserId":"51", "FavoriteCount":"1", "Title":"Is Thai a stress- or syllable-timed language, and does it matter?", "CreationDate":"2013-12-27T01:45:18.760", "OwnerUserId":"2619", "PostTypeId":"1", "Tags":"<linguistic-typology><thai><syllable-timing>", "AnswerCount":"1", "comments":[], "LastEditDate":"2013-12-27T15:20:31.323", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"101", "LastActivityDate":"2013-12-29T13:14:24.397", "Score":"4", "CommentCount":"11", "OwnerUser":{"UpVotes":"42", "DownVotes":"0", "ProfileImageUrl":"http://i.stack.imgur.com/WDpU9.jpg", "Id":"2619", "AccountId":"3471110", "Views":"9", "Reputation":"176", "CreationDate":"2013-10-22T02:54:37.193", "DisplayName":"user2619", "LastAccessDate":"2014-01-16T18:07:58.383"}}