{"Body":"<p>When building models of the <a href=\"http://linguistics.stackexchange.com/q/392/33\">evolution of languages</a> or similar phenomena where many different languages are involved and change over time, how do computational linguists abstractly model a language?</p>\n\n<p>It seems like the canonical computer science approach of just considering a subset S of all strings on 0 and 1 will ignore too much of the structure that linguists care about. Thus, if building a computer simulation, or trying to do mathematical/theoretical linguistics, is there a canonical way for researchers to represent languages?</p>\n\n<p>The primary interest is in an abstract approach that is easy to work with computationally or mathematically but that captures some (or all) of the features of a language one might typically care about.</p>\n", "Id":"626", "FavoriteCount":"3", "AcceptedAnswerId":"630", "Title":"How do computational linguists abstractly represent a language?", "CreationDate":"2011-09-30T10:14:10.813", "AnswerCount":"2", "Tags":"<language-change><theoretical-linguistics><computational-linguistics><evolution>", "PostTypeId":"1", "OwnerUserId":"33", "comments":[], "ViewCount":"285", "LastActivityDate":"2012-02-16T19:47:42.497", "Score":"10", "CommentCount":"1", "OwnerUser":{"UpVotes":"125", "WebsiteUrl":"http://www.cs.mcgill.ca/~akazna/", "Id":"33", "AccountId":"459207", "CreationDate":"2011-09-13T20:58:42.087", "AboutMe":"<p>From the School of Computer Science and Department of Psychology at McGill University, I marvel at the world through algorithmic lenses. My specific interests are in quantum computing, evolutionary game theory, modern evolutionary synthesis, and theoretical cognitive science. Previously I was at the Institute for Quantum Computing and Department of Combinatorics &amp; Optimization at the University of Waterloo and a visitor to the Centre for Quantum Technologies at the National University of Singapore.</p>\n\n<ul>\n<li><a href=\"http://egtheory.wordpress.com/\" rel=\"nofollow\">Theory, Evolution, and Games Group Blog</a></li>\n<li><a href=\"http://cstheory.blogoverflow.com/author/artemkaznatcheev/\">Theoretical Computer Science Blogoveflow</a></li>\n<li><a href=\"https://plus.google.com/u/0/101780559173703781847/\" rel=\"nofollow\">G+ profile</a></li>\n</ul>\n", "Age":"25", "Location":"Montreal, Canada", "DownVotes":"18", "Views":"25", "Reputation":"876", "DisplayName":"Artem Kaznatcheev", "LastAccessDate":"2014-01-11T00:59:33.567"}}