{"Body":"<p>I am reading a book on Government and Binding theory [1] and just finished a chapter on big pro (PRO). At the end of the chapter there is an exercise. Different sentences are written with  faulty representations and the reader is asked to dispute them. One of them is this:</p>\n\n<blockquote>\n  <p>John opened the door and [<sub>IP</sub> PRO left].</p>\n</blockquote>\n\n<p>Unfortunately I was absent when the instructor covered the exercise in class. It's obvious that there couldn't be a PRO within the brackets, because the I (head of the IP) would govern it and that would violate the general rule that PROs should be ungoverned. I also understand that there couldn't be any small pros there either, because the English language is not a pro-drop language and subject pronouns can not be omitted (unless in imperative sentences)</p>\n\n<p>I get it up to here. But then the instructor has analyzed this sentence further. He has said that the sentence is an instance of across-the-board extraction and here two VPs (rather than two IPs) have been linked by coordination. He bases his syntactic representation on the VP-internal hypothesis (= The subject originates in SpecVP and usually then moves to SpecIP), saying that the Specs in the VPs are simultaneously moved.</p>\n\n<p>He goes on to say that the phenomenon is also seen in the objects. For example in the sentence </p>\n\n<blockquote>\n  <p>What does John buy and sell?</p>\n</blockquote>\n\n<p><code>What</code> is the object of both <code>buy</code> and <code>sell</code>. Generally speaking, he says, whenever we have two coordinated structures, if we extract something from one of them we have to do the same with the other.</p>\n\n<p>He has also drawn the tree diagram of the original sentence in question, based on X-bar theory, but unfortunately I only have access to the audio file of that session. That's why I don't think that I fully get what he is talking about, and I don't know how to draw the diagram and explain the process. </p>\n\n<p>Can anyone please, using the original sentence as the example, explain the process in terms of government and binding theory, saying exactly and step-by-step what constituents are moved and how I should represent the sentence syntactically?   </p>\n\n<p>[1]: Haegeman, 1994. Introduction to Government and Binding Theory, 2nd edition, page 288, Exercise 4, 9b</p>\n", "Id":"6270", "LastEditorUserId":"2879", "FavoriteCount":"1", "AcceptedAnswerId":"6286", "Title":"Syntactic representation of Across-the-board Extraction", "CreationDate":"2013-12-29T13:55:00.987", "OwnerUserId":"2879", "PostTypeId":"1", "Tags":"<syntax><syntax-trees><chomsky><coordination>", "AnswerCount":"2", "comments":[], "LastEditDate":"2013-12-29T20:07:14.100", "LastEditedUser":{"UpVotes":"1", "DownVotes":"0", "ProfileImageUrl":"https://www.gravatar.com/avatar/6c1f93bd607a97e4e6dc5303f7886e96?s=128&d=identicon&r=PG", "Id":"2879", "AccountId":"2426193", "Views":"5", "Reputation":"20", "CreationDate":"2013-12-15T04:30:00.237", "DisplayName":"novice66", "LastAccessDate":"2014-01-12T17:23:35.747"}, "ViewCount":"100", "LastActivityDate":"2013-12-31T16:17:14.707", "Score":"2", "CommentCount":"1", "OwnerUser":{"UpVotes":"1", "DownVotes":"0", "ProfileImageUrl":"https://www.gravatar.com/avatar/6c1f93bd607a97e4e6dc5303f7886e96?s=128&d=identicon&r=PG", "Id":"2879", "AccountId":"2426193", "Views":"5", "Reputation":"20", "CreationDate":"2013-12-15T04:30:00.237", "DisplayName":"novice66", "LastAccessDate":"2014-01-12T17:23:35.747"}}