{"Body":"<p><a href=\"http://en.wikipedia.org/wiki/Kalama_Sutta\" rel=\"nofollow\">In this text, acknowledged by both Theravada and Mahayana traditions as sacred</a>, Buddha gives his speech to Kalamas. According to the dictionaries, the primal Sanskrit meaning of the word कलम (kalama) is ' a thief', which, supposedly, is not the case, since by Kalams in the buddhist text they traditionally mean the inhabitants of <a href=\"http://en.wikipedia.org/wiki/Kesaputta\" rel=\"nofollow\">Kesaputta</a>.</p>\n\n<p>The original Sanskrit form is कालामसूत्र (Kālāmasūtra), with a long [a], but the vowel length is irrelevant to the purpose of the question, since a) the vowel length in Arabic is grammatical, not (primary) phonetic, as it is in Sanskrit, and b) in a case of cross-linguistic interaction (e.g. via a third language or more) the quality/quantity of vowels is a subject to change. </p>\n\n<p>My question is; can there be any linguistic parallels between Arabic <a href=\"http://en.wikipedia.org/wiki/Ilm_al-Kalam\" rel=\"nofollow\">كلام</a> (kalam) and the addressees of Buddha's word? The similarity between the two could be more than just a phonetic coincidence, since the two words are not just pronounced more or less alike, they also mean more or less similar concepts.</p>\n\n<p>The questions seems to be not so easy to answer considering some similarities in the description of the Kalam teaching in Islam (which was first mentioned as early as in 8th century) and the essence of the suttra, since both the sutra and the philosophical doctrine emphasise the importance of following rational reasoning and discourse rather than authorities or any other sources of disputable accuracy. Given the facts of existence of <a href=\"http://en.wikipedia.org/wiki/Barlaam_and_Josaphat\" rel=\"nofollow\">Pan-Eurasian fabulae of Barlaam &amp; Josaphat</a>, recorded from Japan to Ethiophia and further to Portugal, this question can be not so easy to answer at all.</p>\n", "Id":"6282", "LastEditorUserId":"51", "Title":"Is there any relation between Sanskrit 'kalam' of Kalamasutra and Arabic 'al-kalam'?", "CreationDate":"2013-12-30T10:55:08.357", "OwnerUserId":"1686", "PostTypeId":"1", "Tags":"<etymology><arabic><sanskrit><wonderwort>", "comments":[], "LastEditDate":"2013-12-30T23:22:51.953", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"156", "LastActivityDate":"2013-12-30T23:22:51.953", "Score":"0", "CommentCount":"22", "OwnerUser":{"UpVotes":"145", "DownVotes":"36", "ProfileImageUrl":"http://i.stack.imgur.com/rZ1Oc.jpg", "Id":"1686", "AccountId":"2130467", "Views":"63", "Reputation":"1112", "CreationDate":"2013-01-19T17:49:32.827", "DisplayName":"Manjusri", "LastAccessDate":"2014-01-18T20:17:27.900", "AboutMe":"<p>I have no native language. I am more or less getting by in some tongues, and I can read and/or swear in douzens of other languages, but this doesn't mean I am an expert in them. By January 2013 I am 34 and wish to see the latter number growing. </p>\n\n<p>I study [cognitive] psychology and am planning to obtain some certificates in computer languages and programming.</p>\n\n<p>I enjoy horse riding, travelling, good cuisine, green Japanese tea, Russian and Spanish literatures and friendly company.</p>\n\n<p><strong>Fluent In:</strong> Dutch, English, Finnish, French, Russian, Spanish and Swedish.</p>\n\n<p><strong>Less Fluent:</strong> Danish, Estonian, Polish and Bulgarian, </p>\n\n<p><strong>Learning:</strong> Arabic, Chinese, Innuit, Japanese, Komi, Sanskrit, Tibetan and Yoruba.</p>\n\n<p><strong>Planning to Learn:</strong> Tangut, C, C++ &amp; Pascal</p>\n"}}