{"Body":"<p>Dear fellow linguists,</p>\n\n<p>I am just an enthusiastic undergraduate student applying for a MA in Applied Linguistic. I have a couple of questions and I need some advice from those of you who are 'in the know' about what goes on in the academic world. The university I'm applying for has listed a bachelor thesis under the admission requirements, but the program I am currently studying in does not include a bachelor thesis. I was told I could submit \"an equivalent sample of written work\" or an independent research project as a replacement for the thesis.</p>\n\n<p>I decided to do a study of pragmatic competence of EFL learners of English at my university, so I designed a WDCT and administered the survey to 60 students, and found about 10 native speakers as a control group. It's not really a proper cross-sectional nor cross-cultural study because the student groups do not necessarily consist of students who have the same level of knowledge in English, and I didn't find enough native speakers to do some sorts of a statistical analysis. I assumed that because the study program implies progression of language skills from B1 to C1 over the two years, that students' pragmatic competence should also increase over the course of studies (of course, it hasn't). </p>\n\n<p>Here are my questions (I asked for formatting guidelines from the university, didn't get any specific requirements except for an 8,000 word count):</p>\n\n<ol>\n<li>What is the best way to treat and represent the data in this scenario? (raw, percentages?)</li>\n<li>What would be the best way to format the paper? I was thinking about APA, but it would be too much paper to send abroad (which is not cheap, as it is measured in grams, and making it double spaced would make it about 30 pages long or so)?</li>\n<li>How should I name my sections? APA says not to have an Introduction as the title of the introduction, but some (published) papers have clearly marked sections of the paper.</li>\n<li>Is it appropriate to acknowledge the professor who was kind of like my mentor during this research, and what is the best way to do it? </li>\n</ol>\n\n<p>Thanks to all of you who took the time to read this, I really appreciate all your help.</p>\n", "Id":"6292", "FavoriteCount":"1", "Title":"How to appropriately format a research paper in pragmatics for applying to a master's program?", "CreationDate":"2014-01-01T15:07:35.263", "AnswerCount":"1", "PostTypeId":"1", "OwnerUserId":"2956", "Tags":"<pragmatics><applied-linguistics><discourse-analysis>", "comments":[], "ViewCount":"54", "LastActivityDate":"2014-01-01T22:38:53.557", "Score":"1", "CommentCount":"3", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "ProfileImageUrl":"https://www.gravatar.com/avatar/9dc0de379b03eb152d9c54e7c3e1fc93?s=128&d=identicon&r=PG&f=1", "Id":"2956", "AccountId":"3796493", "Views":"4", "Reputation":"6", "CreationDate":"2014-01-01T15:07:35.263", "DisplayName":"Aleksandra", "LastAccessDate":"2014-01-02T07:39:15.507"}}