{"OwnerDisplayName":"John Smith Optional", "Body":"<p>I've come here in the hope that there may be some genius amongst you who could have a fair crack at identifying a potential country of origin through speech pattern.</p>\n\n<p>On the Movies&amp;TV stack, we're <a href=\"http://movies.stackexchange.com/questions/16404/where-was-director-tommy-wiseau-born-and-or-raised\">trying to narrow down</a> the origin of the mysterious 'Tommy Wiseau', a cult trash movie director who is notoriously evasive about his personal history, but is absolutely <a href=\"http://www.youtube.com/watch?v=if5eP3crl_4\">captivating to watch.</a></p>\n\n<p>According to a recently published journal/biography, we're aware that despite claiming to be from New Orleans and speaking French he is actually more likely to be from a former Soviet Bloc country, but nothing else is known.</p>\n\n<p>Is there a way of identifying what language he spoke by analyzing the syntax and grammatical construction of his sentences?\nCould accent (as bizarre as it is) be any indicator?</p>\n\n<p>We know this is a long shot, but at this point any clue either way is useful...</p>\n\n<p>Some resources:\nThe Room <a href=\"http://theroomsoundboard.com/#\">Soundboard</a>, and IMDB page has many of the <a href=\"http://www.imdb.com/title/tt0368226/quotes\">quotes</a>.</p>\n", "Id":"6329", "LastEditorUserId":"126", "Title":"Are there any linguists out there to help identify country of origin from syntax?", "CreationDate":"2014-01-06T16:37:37.817", "OwnerUserId":"2990", "PostTypeId":"1", "Tags":"<syntax><accent><stylometry>", "AnswerCount":"3", "comments":[], "LastEditDate":"2014-01-07T05:09:37.060", "LastEditedUser":{"UpVotes":"94", "DownVotes":"21", "Id":"126", "AccountId":"154977", "Views":"23", "Reputation":"1354", "CreationDate":"2011-09-14T15:07:55.557", "DisplayName":"prash", "LastAccessDate":"2014-01-18T18:45:53.780"}, "ViewCount":"149", "LastActivityDate":"2014-01-07T05:15:30.290", "Score":"8", "CommentCount":"7", "OwnerUser":{"UpVotes":"1", "WebsiteUrl":"http://movies.stackexchange.com/users/6306/john-smith-optional", "ProfileImageUrl":"http://i.stack.imgur.com/G0hAY.jpg", "Id":"2990", "AccountId":"3104981", "CreationDate":"2014-01-06T23:13:38.027", "AboutMe":"<p>Work for an Independent Cinema and Arts organization in one of Britain's biggest cities, our program specializes in World Cinema, Classic Cinema and Independent Film as well as some mainstream releases.</p>\n\n<p>First Class Film Studies Graduate with Honors, specializing in 'The New Hollywood', Film History and Reception Studies. </p>\n\n<p>Fluent in 'Movie-Nerd', 'Righteous Indignation' and 'Withering Sarcasm'.</p>\n\n<h2>Grand Inquisitor of the Pedant Crusade 2014</h2>\n\n<hr>\n\n<p>My biggest gripe is people defending pedantry and unnecessary dogmatism by comparing SE to 'a wiki' as through the comparison were <em>positive</em>.</p>\n\n<p>SE is so much more powerful thank any Wiki, because it allows users to communicate and seek answer from other users directly, on a one-on-one basis.</p>\n\n<p>As more of the web falls prey to the machinations of corporate entities, a site like this is a beacon of hope that it is possible for humans to communicate with each other without passing though the rubric of commercial interest.</p>\n\n<p>SE is free of skepticism (<a href=\"http://skeptics.stackexchange.com/\">almost!</a>) because there is no conflict of interest, or ulterior motives to its representation of communication, no matter how trivial the content.</p>\n\n<p>I'm (often <em>visibly</em>) frustrated by those who would seek to steer the site away from this humanist operation: and into a homogeneous Q+A clone that pursues standardization, the dogmatic application of formatting rules without discretion and total eradication of authorial voice and personality.</p>\n\n<p>People don't come here to speak to a database, <em>they come here to speak to people</em>.</p>\n\n<hr>\n", "Age":"27", "Location":"The North, where we do what we want.", "DownVotes":"0", "Views":"1", "Reputation":"141", "DisplayName":"John Smith Optional", "LastAccessDate":"2014-01-11T23:52:31.767"}}