{"Body":"<p>Following <a href=\"http://italian.stackexchange.com/questions/1528/italian-number-words-from-eleven-to-nineteen-history-of-a-bizarre-inconsisten\">Sklivvz's advice</a>, I propose here a question I made in Italian Language. Because I am not sure how I should do this, I will just copy/paste the whole lot.</p>\n\n<p>Let's count in Latin from one to twenty:</p>\n\n<blockquote>\n  <p>ūnus/ūna/ūnum, duo/duae/duo, trēs/tria, quattuor, quīnque, sex, septem, octō, novem, decem,</p>\n  \n  <p>ūndecim, duodecim, tredecim, quattuordecim, quīndecim, sēdecim, septendecim, duodēvīgintī, ūndēvīgintī, vīgintī</p>\n</blockquote>\n\n<p>As pointed out by <a href=\"http://italian.stackexchange.com/questions/1528/italian-number-words-from-eleven-to-nineteen-history-of-a-bizarre-inconsisten\">symbiotech</a>, \"octodecim\" and \"novemdecim\" were also used in Latin, but they didn't survive. On the other hand, as pointed out by <a href=\"http://italian.stackexchange.com/questions/1528/italian-number-words-from-eleven-to-nineteen-history-of-a-bizarre-inconsisten\">martina</a>, \"<a href=\"http://www.garzantilinguistica.it/ricerca/?q=diciassette\" rel=\"nofollow\">dĕcem (et) sĕptem</a>\" was also a common form for \"septemdĕcim\".</p>\n\n<p>In Attic Greek it was:</p>\n\n<blockquote>\n  <p>ΕΙΣ/ΜΙΑ/ΕΝ (heis/mia/en), ΔΥΟ (dúō), ΤΡΕΙΣ/ΤΡΙΑ (treis/tria), ΤΕΤΤΑΡΕΣ/ΤΕΤΤΑΡΑ (téttares/téttara), ΠΕΝΤΕ (pénte), ΕΞ (héx), ΕΠΤΑ (heptá), ΟΚΤΩ (oktṓ), ΕΝΝΕΑ (ennéa), ΔΕΚΑ (déka),</p>\n  \n  <p>ΕΝΔΕΚΑ (héndeka), ΔΩΔΕΚΑ (dódeka), ΤΡΕΙΣΚΑΙΔΕΚΑ (treiskaídeka), ΤΕΤΤΑΡΕΣ ΚΑΙ ΔΕΚΑ (téttares kaì déka), ΠΕΝΤΕΚΑΙΔΕΚΑ (pentekaídeka), ΕΚΚΑΙΔΕΚΑ (hekkaídeka), ΕΠΤΑΚΑΙΔΕΚΑ (heptakaídeka), ΟΚΤΩΚΑΙΔΕΚΑ (oktōkaídeka), ΕΝΝΕΑΚΑΙΔΕΚΑ (enneakaídeka), ΕΙΚΟΣΙ(Ν) (eíkosi(n))</p>\n</blockquote>\n\n<p>Now let's count in Italian</p>\n\n<blockquote>\n  <p>uno, due, tre, quattro, cinque, sei, sette, otto, nove, dieci,</p>\n  \n  <p>undici, dodici, tredici, quattordici, quindici, sedici, diciassette,\n  diciotto, diciannove, venti.</p>\n</blockquote>\n\n<p>But numbers from eleven to twenty could also have been, just hypothetically of course (adding accents for clarity's sake):</p>\n\n<blockquote>\n  <p>diciùno, diciaddùe, diciattré, diciacquàttro, diciaccìnque, diciassèi, diciassètte, diciòtto, diciannòve, venti</p>\n</blockquote>\n\n<p>or</p>\n\n<blockquote>\n  <p>undici, dodici, tredici, quattordici, quindici, sedici, settèndici, ottòdici, novèndici, venti.</p>\n</blockquote>\n\n<p>In Spanish it is:</p>\n\n<blockquote>\n  <p>uno, dos, tres, cuatro, cinco, seis, siete, ocho, nueve, diez,</p>\n  \n  <p>once, doce, trece, catorce, quince, dieciseis, diecisiete, dieciocho, diecinueve, veinte</p>\n</blockquote>\n\n<p>In Portuguese:</p>\n\n<blockquote>\n  <p>um, dois, três, quarto, cinco, seis, sete, oito, nove, dez,</p>\n  \n  <p>onze, doze, treze, catorze, quinze, dezasseis, dezessete, dezoito, dezenove, vinte</p>\n</blockquote>\n\n<p>In French:</p>\n\n<blockquote>\n  <p>un, deux,trois, quatre, cinq, six, sept, huit, neuf, dix,</p>\n  \n  <p>onze, douze, treize, quatorze, quinze, seize, dix-sept, dix-huit, dix-neuf, vingt</p>\n</blockquote>\n\n<p>Following <a href=\"http://italian.stackexchange.com/questions/1528/italian-number-words-from-eleven-to-nineteen-history-of-a-bizarre-inconsisten\">martina's hint</a> here are the number words from one to twenty in Romanian:</p>\n\n<blockquote>\n  <p>unu, doi, trei, patru, cinci, şase, şapte, opt, nouă, zece,</p>\n  \n  <p>unsprezece, doisprezece, treisprezece, paisprezece, cincisprezece, şaisprezece, şaptesprezece, optsprezece, nouăsprezece, douăzeci</p>\n</blockquote>\n\n<p>I find Latin, Italian, Spanish, Portuguese and French constructions for number words bizarre and inconsistent (whereas in Romanian it seems they are perfectly consistent as well as in Ancient Greek). Is there any academic work on the history of number words in Latin/Italian/Spanish/Portuguese/French where the origin of number words from eleven to nineteen is tracked down, documented, explained, discussed?</p>\n\n<p>Please note <a href=\"http://italian.stackexchange.com/questions/1528/italian-number-words-from-eleven-to-nineteen-history-of-a-bizarre-inconsisten\">the answer by symbiotech in the original post</a> - I am not able to check it, perhaps someone in here can?</p>\n", "Id":"6380", "LastEditorUserId":"22", "Title":"Latin, Italian, Spanish, Portuguese and French number words from eleven to nineteen - history of a bizarre, inconsistent construction", "CreationDate":"2014-01-12T04:50:26.783", "OwnerUserId":"3015", "PostTypeId":"1", "Tags":"<historical-linguistics><language-change><comparative-linguistics><numbers><numerals>", "comments":[], "LastEditDate":"2014-01-12T13:42:51.790", "LastEditedUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}, "ViewCount":"86", "LastActivityDate":"2014-01-12T13:42:51.790", "Score":"6", "CommentCount":"1", "OwnerUser":{"UpVotes":"0", "DownVotes":"0", "ProfileImageUrl":"https://www.gravatar.com/avatar/411e1df4665d37dcc5eea1f94b6e7b69?s=128&d=identicon&r=PG&f=1", "Id":"3015", "AccountId":"3431282", "Views":"1", "Reputation":"131", "CreationDate":"2014-01-12T04:35:08.063", "DisplayName":"randomatlabuser", "LastAccessDate":"2014-01-15T05:57:53.473"}}