{"Body":"<p>When I learned Swedish I noticed I went through two phases of learning with regard to understanding the language. First I had to learn the meaning of common words. For example, \"mening\" means both \"meaning\" and \"sentence\". Secondly I had to associate meanings with groups of consequtive words - idioms, phrasal verbs etc. </p>\n\n<p>So the difficulty for me involved a word or a small group of consequtive words. Once I knew them, I could understand the sentence. Is this the same with all languages? For example, if I learned the meanings associated with every word, idiom, phrasal verb etc, would I understand every sentence? Or can there be other complexities at play which effect the meaning of the sentence?</p>\n\n<p>Word order differs accross languages but when learning Swedish I still heard a command when I heard \"Nu skall vi gå!\" instead of a question \"Now shall we go?\". This is due to how we tone the words in the sentence. But maybe this toning is different or missing in certain languages. Anyway, my guess is that the word ordering is so fundamental to any language that you will learn it at the very beginning and that it will be consistent thereafter. </p>\n", "Id":"6403", "LastEditorUserId":"1835", "Title":"What makes a sentence difficult to understand?", "CreationDate":"2014-01-14T20:03:37.150", "OwnerUserId":"1835", "PostTypeId":"1", "Tags":"<semantics><word-sense-disambiguation><phrasal-verbs>", "comments":[], "LastEditDate":"2014-01-14T22:59:19.967", "LastEditedUser":{"UpVotes":"18", "WebsiteUrl":"", "DownVotes":"1", "Id":"1835", "ProfileImageUrl":"http://i.stack.imgur.com/EErPs.jpg", "AccountId":"300614", "Views":"9", "Reputation":"81", "CreationDate":"2013-03-08T16:01:23.670", "DisplayName":"Baz", "LastAccessDate":"2014-01-18T10:13:07.010", "AboutMe":""}, "ViewCount":"48", "LastActivityDate":"2014-01-14T22:59:19.967", "Score":"2", "CommentCount":"6", "OwnerUser":{"UpVotes":"18", "WebsiteUrl":"", "DownVotes":"1", "Id":"1835", "ProfileImageUrl":"http://i.stack.imgur.com/EErPs.jpg", "AccountId":"300614", "Views":"9", "Reputation":"81", "CreationDate":"2013-03-08T16:01:23.670", "DisplayName":"Baz", "LastAccessDate":"2014-01-18T10:13:07.010", "AboutMe":""}}