{"Body":"<p>I'm not a linguist but a language enthusiast and I read lots of stuff about all languages mostly on the internet in blogs but also in accessible books and sometimes attempt to read some things not aimed at a general audience.</p>\n\n<p>I'm sure I've read either grammatical analyses, opinions of linguists, or opinions of Chinese native speakers, that Chinese words can mostly be used as any part of speech.</p>\n\n<p>So despite Chinese dictionaries (at least bilingual ones aimed at foreigners) usually listing a part of speech for each entry, can it be that they way Chinese words function depends to a greater degree on how they are used in a sentence than any property they inherently posses (word class)?</p>\n\n<p>Is this a fairly accepted view amongst linguists or a known but unaccepted view (like Hebrew being a European language or Proto World etc) or is it a view held only by some native speakers of Chinese who lack enough linguistic knowledge to realize it's not right?</p>\n\n<p>(I realize Chinese covers many languages but this should cover them broadly)</p>\n", "Id":"661", "FavoriteCount":"1", "AcceptedAnswerId":"667", "Title":"Are there some analyses or linguists with the view that Chinese does not have lexical word class?", "CreationDate":"2011-10-02T21:55:43.323", "AnswerCount":"2", "Tags":"<syntax><parts-of-speech><linguistic-typology><chinese><word-classes>", "PostTypeId":"1", "OwnerUserId":"51", "comments":[], "ViewCount":"161", "LastActivityDate":"2011-10-03T13:30:12.647", "Score":"7", "OwnerUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}}