{"Body":"<p>Try to read this texts, start with the most difficult one, if you cant read, skip to the next easier one:</p>\n\n<p><strong>all letters mixed</strong></p>\n\n<blockquote>\n  <p>I onlucd't ieebvel ttah I udloc talyulac rsddetanun hwat I swa\n  radgeni. sngiU eth inrdebelic rweop fo hte nmauh imdn, dorcincga ot\n  arceehsr ta meaiCrgbd yvisUntier, it deson't ramtet in athw rored eth\n  erlttes ni a rwod rae, hte noyl atomirnpt nhgti si ttha hte tsfir and\n  last letert eb in het girth leacp. eTh sret anc be tolta ssem dna ouy\n  cna litsl eard it wohutti a elrpomb. ishT is secbaeu het mahun mnid\n  dose tno aerd verye leettr yb efsilt, btu hte orwd sa a leohw.\n  agzmnAi, huh? Yhea nda I awlyas utgtohh lgniespl aws optnrimta! eSe if\n  uoyr resfdin acn eadr siht oto.</p>\n</blockquote>\n\n<p><strong>inner + first letter mixed</strong></p>\n\n<blockquote>\n  <p>I dloucn't ebeilve taht I lcuod utllaacy tsnredanud awht I was\n  irdenag. sUnig hte eidbcrline poewr of the umhan nimd, ccrdiaong to\n  aecrersh at biCagmdre eivUnirsty, it esdon't eattmr in hawt droer the\n  teltres in a rwod are, the lnoy ropamintt nthig is that hte rfsit nad\n  alst eltetr be in the hgrit aclpe. The rest acn be ttoal mses and oyu\n  acn tilsl aerd it ouithwt a rebplom. hiTs is ecuasbe hte muahn mind\n  does ont ared every leettr by iletsf, but hte orwd as a hlwoe.\n  maiAzng, uhh? Yeah nad I lwyaas hugthot lisneplg was mprnotait! eSe if\n  oyur nridfes acn raed iths oto. </p>\n</blockquote>\n\n<p><strong>inner letters mixed</strong></p>\n\n<blockquote>\n  <p>I cnduo't bvleiee taht I culod aulaclty uesdtannrd waht I was rdnaieg.\n  Unisg the icndeblire pweor of the hmuan mnid, aocdcrnig to rseecrah at\n  Cmabrigde Uinervtisy, it dseno't mttaer in waht oderr the lterets in a\n  wrod are, the olny irpoamtnt tihng is taht the frsit and lsat ltteer\n  be in the rhgit pclae. The rset can be a taotl mses and you can sitll\n  raed it whoutit a pboerlm. Tihs is bucseae the huamn mnid deos not\n  raed ervey ltteer by istlef, but the wrod as a wlohe. Aaznmig, huh?\n  Yaeh and I awlyas tghhuot slelinpg was ipmorantt! See if yuor fdreins\n  can raed tihs too.</p>\n</blockquote>\n\n<p>Actually we learn reading by putting together letters, but with ongoing time this seems to change drastically. Do we perceive words and sentences as small pictures? Like mosaics build of morphemes? Is psycholinguistic research done on this topic?</p>\n\n<hr>\n\n<p><strong>on comments:</strong> im very interested in <a href=\"http://en.wikipedia.org/wiki/Psycholinguistic\" rel=\"nofollow\">Psycholinguistics or psychology of language</a>. Wether this belongs to linguistics.SE, i dont know, the FAQ is unclear, I just read <a href=\"http://linguistics.stackexchange.com/questions/612/why-does-speech-speed-seem-to-vary-between-different-languages\">this on-topic question about perception</a> and was reminded of this phenomenon, thougt some experts in linguistics can shed some light on this imho important &amp; interesting phenomenon and its implications as a method, topic for linguistic research. </p>\n\n<p>Maybe it is mainly explored in psychology faculties. But as a scientist myself, i dont see how you want explore origin and evolution of languages without analysing how we perceive (see/hear) language, how our ears and eyes are limited in perception,memorizing and remembering of frequencies and micro-shapes. Thats like saying, we can explore music by analysing all note-sheets ever written or understand PSE by studying chemical compounds instead of doing atom physics. This would be unscientific and missing the big picture, maybe missing the main factors. Of course you have to start with psychoacoustics, phonetics. Maybe you learn more about origin of human language by studying differences to other animals (singing whales, birds) than analysing the fine nuances of human spoken languages.</p>\n\n<p>So im a bit surprised that so many see this question as off-topic, despite how interesting (to me) the current answers and their links &amp; implications to different linguistic fields are. If a whole PHD-thesis covers this topic, how can it be off-topic? But i wasnt commited to this site and its definition, <a href=\"http://meta.linguistics.stackexchange.com/questions/158/psycholinguistics-or-psychology-of-language-on-or-off-topic\">i made a question in meta</a>, imho you should move discussion and comments there before i or somebody else wastes time writing a perception-tagged closed/non-voted questions yielding less effort.</p>\n", "Id":"691", "LastEditorUserId":"192", "AcceptedAnswerId":"695", "Title":"How do we perceive and read words and sentences? Does the order of the inner letters play no significant role?", "CreationDate":"2011-10-04T16:08:34.450", "OwnerUserId":"192", "PostTypeId":"1", "Tags":"<psycholinguistics><orthography><perception>", "AnswerCount":"2", "comments":[], "LastEditDate":"2011-10-04T21:19:54.780", "LastEditedUser":{"UpVotes":"59", "DownVotes":"4", "Id":"192", "AccountId":"466096", "Views":"18", "Reputation":"271", "CreationDate":"2011-09-20T19:40:27.870", "DisplayName":"Hauser", "LastAccessDate":"2014-01-03T21:20:57.023"}, "ViewCount":"669", "LastActivityDate":"2011-10-04T21:19:54.780", "Score":"3", "CommentCount":"13", "OwnerUser":{"UpVotes":"59", "DownVotes":"4", "Id":"192", "AccountId":"466096", "Views":"18", "Reputation":"271", "CreationDate":"2011-09-20T19:40:27.870", "DisplayName":"Hauser", "LastAccessDate":"2014-01-03T21:20:57.023"}}