{"Body":"<p>German is the only widely used language prescribing capitalization of nouns in the written language. I speak English and German fluently myself, but I can read German texts significantly faster than English ones. I also use sometimes speed reading techniques (depending on known/unknown topic, skimming a longer text) and it seems to me that especially here the capitalization of nouns works like syntax-highlighting, which obviously is highly useful. German philologists seem split on the question of whether capitalization has more advantages than disadvantages.</p>\n\n<p>One consideration for me is that we actually seem mainly to focus on the first letters of a word with our eyes to recognize and memorize it (<a href=\"http://linguistics.stackexchange.com/questions/691/how-do-we-perceive-and-read-words-and-sentences-does-the-order-of-the-inner-lett\">see this question</a>) or skim smaller words in fixed and frequently occurring word groups (e.g. \"at the beginning\").  Speed reading techniques say you should also focus on words when moving your focus from right to left and so double-scan the text.</p>\n\n<p>So are my assumptions backed by research results?  Are there plans to establish capitalization of nouns in any other languages?  Are there already languages with non-Roman alphabets using another type of syntax-highlighting?</p>\n\n<hr>\n\n<p><strong>Edit:</strong> As additional hint/proof i want to add that in german forums, you often see people not capitalizing every noun as they cannot tip with 10 fingers or are just used to it in chats. Especially in german Usenet you often see then posts from other users complaining about this style as it makes it significantly harder to read such posts in their opinion.</p>\n", "Id":"699", "LastEditorUserId":"192", "Title":"Does capitalization of nouns aid reading comprehension?", "CreationDate":"2011-10-04T21:27:45.733", "OwnerUserId":"192", "PostTypeId":"1", "Tags":"<psycholinguistics><orthography><perception>", "AnswerCount":"1", "comments":[], "LastEditDate":"2011-10-05T13:34:52.097", "LastEditedUser":{"UpVotes":"59", "DownVotes":"4", "Id":"192", "AccountId":"466096", "Views":"18", "Reputation":"271", "CreationDate":"2011-09-20T19:40:27.870", "DisplayName":"Hauser", "LastAccessDate":"2014-01-03T21:20:57.023"}, "ViewCount":"312", "LastActivityDate":"2011-10-05T14:48:57.657", "Score":"12", "CommentCount":"5", "OwnerUser":{"UpVotes":"59", "DownVotes":"4", "Id":"192", "AccountId":"466096", "Views":"18", "Reputation":"271", "CreationDate":"2011-09-20T19:40:27.870", "DisplayName":"Hauser", "LastAccessDate":"2014-01-03T21:20:57.023"}}