{"Body":"<p>I happen to have been struggling to learn a bit of Mandarin Chinese lately, and it's been my first attempt to really deal with tones to any significant extent. I find distinguishing tones quite difficult -- in fact, I find that trying to get tones right has assumed a considerable amount of the effort that I'm applying to studying this language.</p>\n\n<p>All this is just anecdotal background for a more theoretical, typological question which I now find myself thinking about. </p>\n\n<p>Why should it be the case that variegated tone systems should appear almost always appear in languages that have a) an isolating grammatical system and b) a relatively simple syllable structure?</p>\n\n<p>Firstly, are there any very clear exceptions to this correlation? There seem to be few, if any, examples of heavily agglutinating languages (along the lines of Turkish or Finnish, say) which also have a complex tone system.</p>\n\n<p>Why should this be the case? Have there been studies about nature (or existence) of this correlation?</p>\n", "Id":"702", "LastEditorUserId":"51", "FavoriteCount":"6", "Title":"Why do tone and simple syllable structure appear to be correlated?", "CreationDate":"2011-10-05T06:56:22.080", "OwnerUserId":"136", "PostTypeId":"1", "Tags":"<phonetics><linguistic-typology><syllables><tone>", "AnswerCount":"4", "comments":[], "LastEditDate":"2011-10-05T07:16:07.220", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"425", "LastActivityDate":"2011-12-03T11:30:48.947", "Score":"12", "CommentCount":"3", "OwnerUser":{"UpVotes":"44", "Location":"United States", "DownVotes":"2", "Id":"136", "AccountId":"9694", "Views":"5", "Reputation":"296", "CreationDate":"2011-09-15T00:29:20.830", "DisplayName":"pat", "LastAccessDate":"2013-12-16T02:10:37.907", "AboutMe":"<p>I'm a linguist, so all of the programming that I slog may way through has to do with language or linguistics in one way or another. </p>\n\n<p>I've been programming for a long time but I still feel like I've got a long way to go. But maybe that's how I <em>should</em> feel. :)</p>\n\n<p>I'm a big believer in the idea that just a little technical skill can be very useful for people in many fields. So I spend a fair amount of time trying to explain things like HTML and CSS and perhaps a little Python or something to other people. </p>\n\n<p>If anyone out there is interested in working on open source projects for linguistics, please get in touch.</p>\n\n<p>I have a Github account but it's a bewildering pile of crap right now, I'll try to get around to cleaning that up and then I'll post it here.</p>\n"}}