{"Body":"<p>One of the most controversial ideas put forth in linguistics is the idea of <em>linguistic determinism</em>. Also known as the Sapir-Whorf hypothesis, it states that people who speak different languages would also have different mental models of the world. The classical example is the Hopi language, which, <a href=\"http://books.google.com/books?id=W2d1Q4el00QC&amp;lpg=PP3&amp;dq=Language%20Thought%20and%20Reality%3A&amp;pg=PA57\" rel=\"nofollow\">according to Benjamin Whorf</a>, had “no words, grammatical forms, construction or expressions that refer directly to what we call ‘time’.” So, because of this feature of their language, they are presumably less concerned with past, present and future, and more concerned with a “cyclic” view of time. This idea has gained a lot of attention since its first publication, especially in popular science magazines.</p>\n\n<p>But despite its popular appeal, this hypothesis has not yet been proven. In <a href=\"http://books.google.com/books?id=vCDX54DlYBYC&amp;lpg=PP1&amp;dq=the%20stuff%20of%20thought&amp;pg=PT155\" rel=\"nofollow\">one experiment</a> &ndash; among many of the same kind &ndash; Tzeltal speakers, whose language does not have words for “right” or “left”, were blindfolded, spun in a chair and then asked to retrieve a coin that had been in one of two boxes. Their performance was the same both when boxes were placed on the floor (a geocentric reference) and when the boxes were placed on the end of a beam that was attached to the chair (an egocentric reference). In other words, the lack of right/left distinction in the language does not impair their ability to make that distinction in the world. This experiment was designed to refute an earlier one, which suggested the opposite, but had some methodological flaws.</p>\n\n<p>On the other hand, some studies show a deep influence of language on thought. One of them suggests that people <a href=\"http://www.cogsci.northwestern.edu/cogsci2004/papers/paper575.pdf\" rel=\"nofollow\">estimate time duration differently</a>, according to the spatio-temporal metaphors found in their respective languages. For example, English speakers, who normally conceive time as a distance (\"a long time ago\", \"a short interval\", etc), are better at estimating how much time a growing line projected on a computer screen takes to reach the other side. Conversely, Spanish speakers, who normally conceive time as a quantity (“mucho tiempo”, etc) score higher when estimating the time it takes for a “container of water” to fill up on the screen. The important thing here is that both stimuli and responses are non-linguistic.</p>\n\n<p>The influence on thought suggested by this last study is, of course, very small. But at least, it shows an example of influence of the “strong” type, that is, linguistic features affecting non-linguistic behavior. Is there further evidence in support of this type of strong determinism?</p>\n", "Id":"714", "LastEditorUserId":"92", "FavoriteCount":"3", "AcceptedAnswerId":"725", "Title":"What are some examples of recent studies investigating strong linguistic determinism?", "CreationDate":"2011-10-06T13:16:37.087", "OwnerUserId":"22", "PostTypeId":"1", "Tags":"<psycholinguistics><linguistic-determinism>", "AnswerCount":"5", "comments":[], "LastEditDate":"2011-10-29T12:37:40.730", "LastEditedUser":{"UpVotes":"488", "WebsiteUrl":"http://claimid.com/louisr", "Id":"92", "AccountId":"163323", "CreationDate":"2011-09-14T02:07:23.613", "AboutMe":"<p>trying to learn and help others learn :)</p>\n", "Age":"34", "Location":"Your computer", "DownVotes":"39", "Views":"97", "Reputation":"3271", "DisplayName":"Louis Rhys", "LastAccessDate":"2014-01-18T16:45:57.423"}, "ViewCount":"1173", "LastActivityDate":"2013-04-23T17:39:46.250", "Score":"11", "CommentCount":"11", "OwnerUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}}