{"Body":"<p>Thinking about <a href=\"http://meta.linguistics.stackexchange.com/questions/158/psycholinguistics-or-psychology-of-language-on-or-off-topic\">this discussion on meta</a> i was reasoning about simple <strong>self-experiments</strong> you can do in psycholinguistics, where you dont need great background knowledge in Cognitive Psychology or Neuroscience. But where you can investigate and find out different <strong>phenomenological factors and properties</strong>, how our mental lexicon is structured. (Neurolinguistics tries to explain this phenomenlogy structurally)</p>\n\n<p><strong>So i gave Hauser (myself) 1 min time and a tag-keyword to say as many words as fast/spontaneous as possible and recorded them</strong> (e.g. Windows Sound recorder on your Desktop). I started with <em>verbs</em>. 1 min time. This went pretty good, around 100 of verbs i recorded. Same with <em>nouns</em>. Also pretty good, not surprising. How about <em>adverbs</em>. Hmm, it gets tricky. My brain didnt seem to have a crystal clear tag here. Additionally it was hard to think just of single adverbs and not adjectives (to deduce the adverb) or verbs often used with a adverb. How about <em>locations</em>? Pretty easy, many cities i could tell or places i have been. Then i thought about terms like <em>Zeitgeist</em>. You cant really define a good clear tag-name for words of this category. PROBABLY, because it is a very abstract term with contextual meaning. A lot of scientific terms are abstract, so how about <em>quantities in natural sciences</em>. Went good, as i have some background here. Interestingly, on the \"verbs\" tag it seems common to list a lot of related verbs for maybe 10 seconds (<em>running, sking, climbing, walking...</em>) till you stop and then quickly switch to verbs related to e.g. the sub-tag \"cooking\" (<em>cook, eat, smack,...</em>). </p>\n\n<p>So what can <strong>I deduce</strong> from such results (?) There seem to be words pretty good structured and tagged in clouds and sub-clouds (like verbs, nouns), also abstract words of your personal experience (education, hobbies etc.). Even if you might not use them more than others (e.g. prepositions) ,they seem to be tagged, while <em>prepositions</em> you use in nearly every sentence, are hard to think of spontaneosly and better recognized in a distinct phrase they are often used in, there doesnt seem to exist a <em>preposition</em> tag in the mental lexicon (?). So visual things and activities (objects in real world and motor activities) seem to be much better tagged vs. abstract and not directly perceivable words. </p>\n\n<p>To me it was a nice little experiment I would like to continue, with some tips, how this can be done the most productive and objective way to gain further phenomenological hints, how words and phrases are stored in the mental lexicon and contribute to linguistic topics like sentence building or TOT.</p>\n\n<hr>\n\n<p>So what im asking for (which fits imho ONE question, because of link of theory - exp. method):</p>\n\n<ul>\n<li><p>What are current most investigated and favored models (technical termini) concerning the question \"How is our mental lexicon structured?\" that are similar to my self-invented experiment above recording a \"spatial\" map of tags/word-groups of my personal mental lexicon</p></li>\n<li><p>How do professional linguistic research experiments differ from my self-invented exp. described above? What are common phenomenological properties/quanities investigated in such experiments (e.g. semantic proximity), which exist on different human mental lexicons, in such tests? I would think, there have been done experiments recording really big mental lexicons of students and plotting them 2-dimensionally?</p></li>\n</ul>\n\n<p>Nathan's answer is spot on and exactly what im asking for. Maybe you or anybody else can add some further details (papers), which cover similar experiments (to get a foot in the door), esp. how diff. mental lexicons differ between single persons. I would like to know what the phenomenological similarieties and differences on those lexicons are and maybe map my own mental lexicon more systematically, build my own linguistic fingerprint.</p>\n", "Id":"756", "LastEditorUserId":"175", "FavoriteCount":"6", "Title":"Is our mental lexicon structured like a tag-cloud system or hierarchical?", "CreationDate":"2011-10-09T16:06:13.763", "OwnerUserId":"192", "PostTypeId":"1", "Tags":"<theoretical-linguistics><psycholinguistics><research><lexicography>", "AnswerCount":"2", "comments":[], "LastEditDate":"2013-12-29T20:58:53.020", "LastEditedUser":{"UpVotes":"14", "WebsiteUrl":"http://lego.cuusoo.com/ideas/view/39075", "Id":"175", "AccountId":"23448", "CreationDate":"2011-09-19T13:48:54.423", "AboutMe":"<p>Web developer since 1997. Other interests include embedded systems, static program analysis, and software visualization.</p>\n\n<p>Oh, and you can vote for my <a href=\"http://lego.cuusoo.com/ideas/view/39075\" rel=\"nofollow\">LEGO CUUSOO project!</a> My hats will soon be gone, but my gravatar could then be yours to keep!</p>\n", "Age":"35", "Location":"Europe, GMT+1", "DownVotes":"0", "Views":"3", "Reputation":"113", "DisplayName":"RegDwight", "LastAccessDate":"2014-01-01T22:57:44.440"}, "ViewCount":"335", "LastActivityDate":"2013-12-30T01:15:51.127", "Score":"3", "CommentCount":"5", "OwnerUser":{"UpVotes":"59", "DownVotes":"4", "Id":"192", "AccountId":"466096", "Views":"18", "Reputation":"271", "CreationDate":"2011-09-20T19:40:27.870", "DisplayName":"Hauser", "LastAccessDate":"2014-01-03T21:20:57.023"}}