{"OwnerDisplayName":"user325", "Body":"<p>This question came up while doing syntax homework. It seems to me that prepositional phrases with \"of\" can only ever be complements to nouns, not adjuncts. The basis for my conclusion was that, while you can reorder adjuncts freely (1, 2), albeit perhaps with issues of scope/ambiguity, you cannot have an adjunct intervene between a head and its complement (3,4), and I have yet to find an example in which \"of\" can be reordered felicitously.</p>\n\n<pre>\n(1)  The cat with stripes in the garden\n(2)  The cat in the garden with stripes \n     (=intended meaning same as 1)\n(3)  The book of poetry with a red cover\n(4) *The book with a red cover of poetry\n</pre>\n\n<p>Perhaps my judgments and conclusions are off -- if so, please explain a reliable way for telling adjuncts/complements apart.</p>\n\n<p>The second part to my question -- assuming \"of\" phrases cannot be complements -- is why this would be, whether there is some cross-linguistic generalization or whether it is just an historical quirk of English.</p>\n", "Id":"784", "LastEditorUserId":"46", "AcceptedAnswerId":"797", "Title":"Can prepositional phrases with \"of\" ever be adjuncts to nouns, or only complements in English? If they can't be adjuncts, why?", "CreationDate":"2011-10-12T17:31:34.793", "AnswerCount":"4", "PostTypeId":"1", "Tags":"<syntax><english><parts-of-speech>", "comments":[], "LastEditDate":"2011-10-13T16:24:42.957", "LastEditedUser":{"UpVotes":"57", "WebsiteUrl":"http://www.ling.upenn.edu/~ecay/", "Id":"46", "AccountId":"211379", "CreationDate":"2011-09-13T21:05:16.277", "AboutMe":"<p>I am a second-year PhD student in Linguistics at the University of Pennsylvania.  My research interests lie in diachronic syntax, language as an evolutionary system, and quantitative methods in linguistic research.</p>\n", "Age":"26", "Location":"Philadelphia, PA", "DownVotes":"1", "Views":"111", "Reputation":"3004", "DisplayName":"Aaron", "LastAccessDate":"2013-04-30T05:33:49.387"}, "ViewCount":"829", "LastActivityDate":"2011-11-03T22:51:24.840", "Score":"9", "CommentCount":"3"}