{"Body":"<p>I'm looking for good <em>recent</em> books or articles on experimental methodology in syntax or semantics.  Ideally they'd be geared towards working formal linguists who don't know much about psycholinguistics or experiment design.</p>\n\n<p>The biggest question I'd like to see addressed is \"What experimental methods are appropriate for answering X?\" where X might be a research question about word meaning or syntactic structure or whatever.  </p>\n\n<p>I'm familiar with Baayen's book on stats for linguists &mdash; and it's fantastic, but it's mostly focused on how to analyze the data that comes out of an experiment rather than on how to set up the experiment itself, so it's not quite what I'm looking for.</p>\n", "Id":"813", "LastEditorUserId":"126", "FavoriteCount":"1", "AcceptedAnswerId":"937", "Title":"What's the \"state of the art\" for methodology in syntactic/semantic experiments", "CreationDate":"2011-10-14T20:02:54.963", "OwnerUserId":"306", "PostTypeId":"1", "Tags":"<syntax><psycholinguistics><semantics>", "AnswerCount":"2", "comments":[], "LastEditDate":"2011-10-16T18:15:37.397", "LastEditedUser":{"UpVotes":"94", "DownVotes":"21", "Id":"126", "AccountId":"154977", "Views":"23", "Reputation":"1354", "CreationDate":"2011-09-14T15:07:55.557", "DisplayName":"prash", "LastAccessDate":"2014-01-18T18:45:53.780"}, "ViewCount":"173", "LastActivityDate":"2012-03-02T05:03:27.517", "Score":"5", "CommentCount":"3", "OwnerUser":{"UpVotes":"177", "WebsiteUrl":"http://comp.ling.utexas.edu/~dvelleman", "Id":"306", "AccountId":"936287", "CreationDate":"2011-09-26T13:37:21.977", "AboutMe":"<p>I'm a grad student in linguistics, interested in semantics, pragmatics and prosody and currently doing fieldwork on K'iche' (a very cool Mayan language spoken in Guatemala).  </p>\n\n<p>Off the clock, I'm also interested in figuring out <em>why the heck we teach this stuff</em> &mdash; or in other words, why do people care about linguistics who don't do it for a living, what their interests are, and what they want to learn or get out of our classes.  I figure if all goes well, I'll be teaching Intro to Linguistics once a year for the rest of my life, and I may as well get good at it.</p>\n", "Age":"33", "Location":"Austin, TX", "DownVotes":"7", "Views":"70", "Reputation":"2968", "DisplayName":"Dan Velleman", "LastAccessDate":"2013-11-24T15:27:53.380"}}