{"Body":"<p>I think I understand that as a field, linguistics tries to study how people actually use language, rather than say how people should. It seems to me, a layperson, that several linguists writing for general audiences have argued quite persuasively that many prescribed rules are baseless. But I have some difficulty with a couple of issues:</p>\n\n<ol>\n<li><p>Many people consistently say and write things that I think descriptivists and prescriptivists alike would call incorrect. And I don't believe these errors have anything to do with dialect. Just take the writing of the bottom of any typical high school English class, for example. Some errors like \"There is many ...\" I hear from people of all ages so frequently that I highly doubt such errors would qualify as \"just slips,\" even in the descriptivist sense: if asked, the speakers wouldn't find any problem with them (I imagine).</p></li>\n<li><p>Where's the line? Can we say that \"if 30% (15%? 5%?) of the population accepts this usage, then we'll add it to our grammar of the language\"? (Right about here I get the feeling in my stomach that someone will tell me that this is the wrong question.) And if the bar is sufficiently low, I think many rules I've seen categorized as prescriptivist nonsense will pass the test. Just a semester with a particular English teacher who insisted on such silly rules as \"<em>this</em> must always be followed by a noun phrase; never write <em>this is</em> or <em>this means</em>\" has made me extremely aware of violations of those rules. I have to pause for a moment whenever I hit upon a <em>this explains</em> in published news articles, and it's gotten really annoying. Surely generations of students of such indoctrination make up a sizeable readership? Sad as it is, this alone seems to be justification for the prescription.</p></li>\n</ol>\n", "Id":"876", "LastEditorUserId":"51", "Title":"What is exactly \"descriptivism\"?", "CreationDate":"2011-10-23T04:05:04.327", "OwnerUserId":"370", "PostTypeId":"1", "Tags":"<terminology><prescriptivism>", "AnswerCount":"2", "comments":[], "LastEditDate":"2011-10-23T16:37:33.367", "LastEditedUser":{"UpVotes":"1436", "WebsiteUrl":"http://en.wiktionary.org/wiki/User:Hippietrail", "ProfileImageUrl":"http://i.stack.imgur.com/ExcaS.jpg", "Id":"51", "AccountId":"250783", "CreationDate":"2011-09-13T21:15:02.967", "AboutMe":"<p>Travelling armchair linguist.</p>\n\n<p>Never studied in an institution but read books and web with probably more breadth than depth.</p>\n\n<p>Always on the road surviving in a strange foreign language, currently Mongolian and Mandarin Chinese.</p>\n\n<p>And I collect dictionaries.</p>\n", "Location":"Beijing, China", "DownVotes":"65", "Views":"221", "Reputation":"4918", "DisplayName":"hippietrail", "LastAccessDate":"2014-01-18T09:27:54.697"}, "ViewCount":"298", "LastActivityDate":"2011-10-25T00:36:20.333", "Score":"5", "CommentCount":"5", "OwnerUser":{"UpVotes":"12", "DownVotes":"0", "Id":"370", "AccountId":"468828", "Views":"5", "Reputation":"318", "CreationDate":"2011-10-02T23:43:14.110", "DisplayName":"JohnJamesSmith", "LastAccessDate":"2013-01-10T22:26:32.870"}}