{"Body":"<p>One of the hypotheses supported by Theo Vennemann and other linguists is that Proto-Germanic was influenced by some Semitic language. The evidence they present for their case includes:</p>\n\n<ul>\n<li>Loss of some grammatical cases from Proto-Indo-European. This would be an indication of language contact, with adults trying to learn a different language and simplifying it in the process. This phenomenon has not occured in other languages spoken at the time, such as Latin and Greek.</li>\n<li>One third of Germanic roots do not trace back to PIE, and some of these words seem to have common roots with Semitic languages. For example, Proto-Germanic <em>*furkhtaz</em>, Proto-Semitic <em>*prkh</em>, 'fright'; Proto-Germanic <em>*magaþ</em>, Early Semitic <em>makhat</em>, 'maiden'. </li>\n<li>Grimm’s law, that has introduced the fricative consonants *[f], *[h] and *[θ]. PIE was poor in fricatives, compared to Semitic languages.</li>\n<li>Some deity names also seem to have common origins, such as Old High German <em>Phol</em> and Semitic <em>Baal</em>. These names can also be derived independently through regular sound changes, such as the Grimm’s law.</li>\n<li>Verbs are inflected for tense only in the present and past (like Semitic languages). Other Indo-European languages have a much richer system of verb inflections for marking tense.</li>\n<li>The use of ablaut for marking the past of strong verbs.</li>\n</ul>\n\n<p>Are these observations strong enough to posit a Semitic substrate in Proto-Germanic?</p>\n", "Id":"911", "LastEditorUserId":"76", "FavoriteCount":"5", "AcceptedAnswerId":"919", "Title":"Was there a Semitic influence on Proto-Germanic?", "CreationDate":"2011-10-30T12:26:31.280", "OwnerUserId":"22", "PostTypeId":"1", "Tags":"<historical-linguistics><semitic-languages><language-contact><proto-germanic>", "AnswerCount":"2", "comments":[], "LastEditDate":"2011-10-31T11:52:42.377", "LastEditedUser":{"UpVotes":"35", "WebsiteUrl":"http://github.com/alekstorm", "Id":"76", "AccountId":"411223", "CreationDate":"2011-09-13T23:34:32.303", "AboutMe":"", "Age":"24", "Location":"Urbana, IL", "DownVotes":"17", "Views":"36", "Reputation":"1043", "DisplayName":"Alek Storm", "LastAccessDate":"2013-12-09T07:20:27.393"}, "ViewCount":"855", "LastActivityDate":"2013-12-06T18:50:24.650", "Score":"13", "CommentCount":"5", "OwnerUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}}