{"Body":"<p>As far as I know, language families originate from a process of divergent, tree-like evolution. All the languages within a family or subfamily can be traced back to the same proto-language, which was spoken several centuries ago. At some point, the various regions in which that proto-language was spoken started developing their own particular innovations. This process went on and on, to the point that, after some time, they were not mutually intelligible anymore and could thus be considered as “different languages”.</p>\n\n<p>But is there any case of the opposite trajectory, i.e., languages that started out very different from each other, then started to converge because of language contact and ended up very similar, much like actual language families?</p>\n\n<p>Now, I am aware of the existence of language areas (Sprachbunds), in which languages share several features by virtue of the high level of contact among them. But even in Sprachbunds, languages maintain their familial “identity”, so to speak. In the Balkans, for example, we can talk about Slavic languages, Romance languages, etc. There is no such thing as a “Balkanic familiy”.</p>\n", "Id":"989", "FavoriteCount":"1", "AcceptedAnswerId":"994", "Title":"Is there any case of a \"convergent language family\"?", "CreationDate":"2011-11-09T00:27:19.520", "AnswerCount":"2", "Tags":"<language-families><evolution><language-contact>", "PostTypeId":"1", "OwnerUserId":"22", "comments":[], "ViewCount":"205", "LastActivityDate":"2011-11-16T02:21:44.453", "Score":"9", "CommentCount":"5", "OwnerUser":{"UpVotes":"1855", "WebsiteUrl":"http://betareduction.wordpress.com", "Id":"22", "AccountId":"263496", "CreationDate":"2011-09-13T20:54:04.197", "AboutMe":"<p>I am a software developer, who also happens to have a great many other interests in life. One of them is linguistics (and languages in general). My native language is Portuguese and, at the moment, I'm commited to the <a href=\"http://area51.stackexchange.com/proposals/26339/portuguese-language-usage?referrer=E4RbYe4JA1r7Xdj2Jldccw2\">Portuguese Language &amp; Usage</a> proposal. If you love that language and admire its tradition as much as I do, please commit to it and be part of a great lusophone community!</p>\n", "Age":"32", "Location":"São Paulo, Brazil", "DownVotes":"33", "Views":"104", "Reputation":"3541", "DisplayName":"Otavio Macedo", "LastAccessDate":"2014-01-18T14:47:18.503"}}